{
  "chapter": "2.05",
  "book": 2,
  "events": [
    {
      "date": "1433-05-30",
      "end_date": null,
      "type": "council",
      "summary": "Juan II continues his evening meeting with Abbott Rodrigo in Basel, discussing the political factions at the Council of Basel. Abbott Rodrigo explains the division between papal loyalists and conciliarists led by Cardinal Louis Aleman, the constitutional crisis with Pope Eugenius IV who tried to dissolve the Council, and the moderate position Castile's delegation has maintained for eight months. A d100 roll (73) determines the Council's legislative progress: one substantive reform decree on benefice electoral procedures has passed with Castilian influence, but major reforms on simony, pluralism, and concubinage remain deadlocked in committee due to factional blocking and the authority crisis with the Pope.",
      "characters": [
        "juan_ii"
      ],
      "factions_affected": [],
      "location": "Basel",
      "tags": [
        "council",
        "briefing",
        "basel",
        "church_reform",
        "factions",
        "roll"
      ]
    },
    {
      "date": "1433-05-30",
      "end_date": null,
      "type": "religious",
      "summary": "Juan meets Fray Hernando for evening spiritual direction and presents his list of impulses recorded during Council observation. Juan expresses feeling helpless, recognizing he cannot control the Church as he would inspire troops before battle, and shares insight from his conversation with French Bishop Jean de Rochetaillee about fighting the problem rather than the enemy. D100 rolls for Hernando's reactions (57 = genuine recognition of growth; 18 = cautious approval) show Hernando encouraged but still testing whether Juan's humility is genuine or merely wounded pride. Hernando assigns a prayer meditation for the morning: 'What is the difference between offering service and offering myself?' and advises Juan to review letters to Castile after his meeting with Cardinal Cesarini.",
      "characters": [
        "juan_ii",
        "fray_hernando"
      ],
      "factions_affected": [],
      "location": "Basel",
      "tags": [
        "religious",
        "confession",
        "spiritual_direction",
        "humility",
        "roll"
      ]
    },
    {
      "date": "1433-05-31",
      "end_date": null,
      "type": "religious",
      "summary": "Juan prays at Basel Cathedral at dawn on May 31, meditating on Fray Hernando's question about offering service versus offering himself. He wrestles with the tension between constant soul-searching and decisive kingship, recognizing that Christ both washed feet and overturned tables. He concludes that excessive self-examination risks becoming paralysis and that there are things a king must do regardless. He leaves prayer determined that 'confession be damned, there are certain things I must do' and prepares for his meeting with Cardinal Cesarini.",
      "characters": [
        "juan_ii"
      ],
      "factions_affected": [],
      "location": "Basel",
      "tags": [
        "religious",
        "prayer",
        "internal_conflict",
        "humility",
        "kingship"
      ]
    },
    {
      "date": "1433-05-31",
      "end_date": null,
      "type": "diplomatic",
      "summary": "Juan meets Cardinal Giuliano Cesarini, President of the Council of Basel, at the ninth hour. Rather than presenting a prepared political speech, Juan honestly expresses his spiritual pain at seeing the Church divided and hands over his papal decree. A d100 roll (90 = genuine connection) yields a breakthrough: Cesarini is profoundly relieved by Juan's honesty after years of political posturing. They achieve a theological breakthrough when Juan articulates that 'the Church was not wrong, but those people espousing it were mistaken,' separating divine truth from human error. This distinction provides a potential face-saving mechanism for both Pope and Council. Juan proposes parallel legislation where both Pope and Council pass identical reforms using their own authority, plus a joint crusade for Constantinople. A d100 roll (72 = genuine interest) shows Cesarini excited about parallel legislation and the crusade but cautious about formally defining papal-conciliar roles. A d100 roll (41 = careful deflection) shows Cesarini wrestling with but unable to fully agree that the Church itself has sinned through institutional pride.",
      "characters": [
        "juan_ii",
        "fernan_alonso_de_robles"
      ],
      "factions_affected": [],
      "location": "Basel",
      "tags": [
        "diplomatic",
        "basel",
        "church_reform",
        "theology",
        "parallel_legislation",
        "crusade",
        "roll"
      ]
    },
    {
      "date": "1433-05-31",
      "end_date": null,
      "type": "diplomatic",
      "summary": "Juan and Cardinal Cesarini continue their strategic planning. They agree on concrete next steps: a formal meeting with the Byzantine delegation (Metropolitans Bessarion and Isidore) to declare Juan's commitment of 1,000 knights and 60,000 florins for Constantinople; a letter to Pope Eugenius proposing the parallel legislation approach; quiet coalition-building through the Castilian delegation. Juan reveals his timeline constraints: he must leave Basel to intercept Emperor Sigismund on the road from Rome, then sail to Toledo for Isabel's childbirth, then visit Pope Eugenius in person, then proceed to Constantinople. A d100 roll (71 = tested resolve) shows Cesarini genuinely committed to reforms despite personal cost, acknowledging his own complicity in the corrupt system. Juan suggests the congregation practice regular confession, which deeply moves Cesarini. They agree to hold the Byzantine meeting the next day.",
      "characters": [
        "juan_ii",
        "fernan_alonso_de_robles"
      ],
      "factions_affected": [],
      "location": "Basel",
      "tags": [
        "diplomatic",
        "strategy",
        "constantinople",
        "byzantine",
        "sigismund",
        "pope",
        "roll"
      ]
    },
    {
      "date": "1433-05-31",
      "end_date": null,
      "type": "religious",
      "summary": "Juan returns to Fray Hernando enthusiastically describing his plan to reform the Church with Cesarini. A d100 roll (18 = sharp rebuke) triggers Hernando's harshest correction yet: Juan's language of 'I have made a plan to reform the Church' and 'all seems achievable within my means' reveals exactly the presumption Hernando warned against. Juan pushes back, arguing he is a king with responsibilities, not a monk seeking purity, and questions the limits of a confessor's authority. A d100 roll (37 = pained rebuke) shows Hernando acknowledging the fair question but insisting Juan's pattern of rejecting correction through elaborate defense is itself a form of pride. Through difficult dialogue, they achieve a breakthrough about how confession should work: the distinction between 'explaining' (opening soul for examination) and 'defending' (closing soul to examination). Juan practices this immediately, catching himself drifting toward self-centered language about being 'the fulcrum' and genuinely examining the pattern with Hernando. Juan also sets boundaries about Hernando's commanding tone, and they agree on a collaborative model of spiritual direction.",
      "characters": [
        "juan_ii",
        "fray_hernando"
      ],
      "factions_affected": [],
      "location": "Basel",
      "tags": [
        "religious",
        "confession",
        "spiritual_direction",
        "presumption",
        "breakthrough",
        "roll"
      ]
    },
    {
      "date": "1433-05-31",
      "end_date": null,
      "type": "personal",
      "summary": "Juan reveals to Fray Hernando the deepest wound he has been carrying: the papal absolution he received in Rome after the crusade felt hollow and empty. He describes delivering 300,000 florins and sacred relics to Pope Eugenius, expecting a profound spiritual experience, but feeling nothing when the Pope raised his hands and spoke the formula of absolution over the crusaders. Juan confesses this made him doubt the Church and that he came to Basel specifically to find Hernando for true confession. A d100 roll (64 = pastoral understanding) shows Hernando finally recognizing the root cause of Juan's behavior: Juan has been spiritually starving, seeking genuine absolution since Rome, and his presumption and grand plans were symptoms of a soul that felt unforgiven trying to earn through works what should come through grace. Hernando acknowledges he has been 'critiquing table manners while refusing to feed' a spiritually hungry man, and asks Juan to name the specific sins weighing on his conscience for genuine confession.",
      "characters": [
        "juan_ii",
        "fray_hernando"
      ],
      "factions_affected": [],
      "location": "Basel",
      "tags": [
        "personal",
        "confession",
        "absolution",
        "rome",
        "spiritual_crisis",
        "breakthrough",
        "roll"
      ]
    }
  ],
  "new_characters": [],
  "character_updates": [],
  "new_locations": [],
  "rolls": [],
  "new_factions": [],
  "faction_updates": [],
  "law_references": []
}