{
  "chapter": "2.13",
  "title": "Morning After the Engagement - Family Breakfast",
  "date_range": "1433-11-11 / 1433-12-04",
  "encounters": [
    {
      "id": "evt_1433_00219",
      "type": "domestic_event",
      "date": "1433-11-11",
      "end_date": null,
      "location": "Toledo, Alcázar",
      "participants": [
        "juan_ii",
        "alvaro_de_luna"
      ],
      "exchanges": [
        {
          "speaker": "narrator",
          "text": "The Alcázar of Toledo awakens slowly, winter light filtering pale through the eastern windows of your private chambers. You slept deeply—more deeply than you have in months—and wake with a clarity that surprises you. The sapphire ring. The moonlit garden. \"Yes. Yes, I will be your wife.\" It happened. It truly happened."
        },
        {
          "speaker": "narrator",
          "text": "You rise and dress with the assistance of your body servants, choosing simple clothing—a dark woolen doublet, practical rather than ceremonial. There is much to be done today, but your mind keeps returning to those grey-green eyes, that sharp tongue, the way she placed the ring on her own finger rather than waiting for you to do it. \"I will NOT be a quiet wife.\" No. You suspect she will not be."
        },
        {
          "speaker": "narrator",
          "text": "As you break your fast in your private solar—bread, cheese, olives, weak wine—a knock comes at the door. Don Álvaro enters, looking as though he has been awake for hours already. Papers are tucked under his arm."
        },
        {
          "speaker": "alvaro_de_luna",
          "text": "Your Majesty slept well, I trust?"
        },
        {
          "speaker": "narrator",
          "text": "A hint of knowing in his voice. The entire Alcázar will have noticed you did not return from Lucia's apartments until well after midnight. Nothing improper occurred—the chaperones saw to that, and you would not dishonor your betrothed before the wedding—but tongues will wag regardless. Álvaro sets down his papers and meets your eyes."
        },
        {
          "speaker": "alvaro_de_luna",
          "text": "Congratulations are in order, I understand. The lady accepted?"
        },
        {
          "speaker": "alvaro_de_luna",
          "text": "The formal betrothal announcement must be made soon, Your Majesty. The Italian delegation, the court, the foreign ambassadors—they will all expect ceremony. But the lady's unusual request for a private meeting first means we have... flexibility. The question is timing."
        },
        {
          "speaker": "narrator",
          "text": "He glances at his papers."
        },
        {
          "speaker": "alvaro_de_luna",
          "text": "Several matters require your attention today. But perhaps the most pressing is: when do you wish to see the Lady Lucia again? She is awake—her maid sent word she rose with the dawn and is taking breakfast in her apartments. Apparently she asked whether you are an early riser, or whether kings sleep until noon."
        },
        {
          "speaker": "narrator",
          "text": "A hint of amusement crosses Álvaro's weathered face."
        },
        {
          "speaker": "alvaro_de_luna",
          "text": "She also asked whether Castilian breakfasts are always so 'aggressively plain,' or whether this was a test of Italian resolve."
        },
        {
          "speaker": "narrator",
          "text": "The autumn sun climbs higher over Toledo. Your betrothed is awake, your constable awaits your orders, and somewhere in this fortress your children are stirring."
        },
        {
          "speaker": "juan_ii",
          "text": "Well, you know what they say: The work of a king is never done. Better get the marriage underway as soon as possible. How soon can we arrange?"
        }
      ],
      "roll": null,
      "recap": "The morning after his successful proposal to Lucia d'Este, Juan reflects on the previous evening while breaking his fast. Don Álvaro arrives to discuss the formal betrothal announcement and reports that Lucia is already awake and making witty observations about Castilian customs. Juan decides to move forward with wedding preparations as quickly as possible."
    },
    {
      "id": "evt_1433_00220",
      "type": "decision",
      "date": "1433-11-11",
      "end_date": null,
      "location": "Toledo, Alcázar",
      "participants": [
        "juan_ii",
        "alvaro_de_luna"
      ],
      "exchanges": [
        {
          "speaker": "alvaro_de_luna",
          "text": "The formal betrothal announcement must be made soon, Your Majesty. The Italian delegation, the court, the foreign ambassadors—they will all expect ceremony. But the lady's unusual request for a private meeting first means we have... flexibility. The question is timing."
        },
        {
          "speaker": "alvaro_de_luna",
          "text": "Several matters require your attention today. But perhaps the most pressing is: when do you wish to see the Lady Lucia again? She is awake—her maid sent word she rose with the dawn and is taking breakfast in her apartments. Apparently she asked whether you are an early riser, or whether kings sleep until noon."
        },
        {
          "speaker": "alvaro_de_luna",
          "text": "She also asked whether Castilian breakfasts are always so 'aggressively plain,' or whether this was a test of Italian resolve."
        },
        {
          "speaker": "narrator",
          "text": "The autumn sun climbs higher over Toledo. Your betrothed is awake, your constable awaits your orders, and somewhere in this fortress your children are stirring."
        },
        {
          "speaker": "juan_ii",
          "text": "Well, you know what they say: The work of a king is never done. Better get the marriage underway as soon as possible. How soon can we arrange?"
        },
        {
          "speaker": "alvaro_de_luna",
          "text": "As soon as possible? The Church requires the reading of banns on three successive Sundays before a valid marriage—that is canon law, and not even a king may dispense with it without papal intervention. Today is Friday, the eleventh of November. If we announce the betrothal publicly this Sunday and begin the banns immediately... First reading: Sunday, November 13th. Second: November 20th. Third: November 27th. The earliest canonically valid wedding date would be Monday, November 28th. Though a wedding on a Monday is unusual. Most would expect Saturday, December 3rd, or Sunday, December 4th."
        },
        {
          "speaker": "alvaro_de_luna",
          "text": "However, Your Majesty, there are... considerations beyond canon law. First: The Lady Lucia arrived only yesterday. A betrothal announcement tomorrow would set tongues wagging across Europe. Some will say the King of Castile is unseemly eager. Others will whisper that something improper occurred to necessitate such haste. I know nothing did. But gossip does not require truth, only opportunity."
        },
        {
          "speaker": "alvaro_de_luna",
          "text": "Second: The Italian delegation expects certain courtesies. A formal betrothal ceremony, exchange of gifts, time for the lady's household to prepare. Her uncle the Marquess sent six ladies-in-waiting and two confessors—they will want to feel their presence matters, not that they were rushed through like merchants at a toll gate."
        },
        {
          "speaker": "alvaro_de_luna",
          "text": "Third: Christmas is six weeks away. A wedding in early December would overshadow the season—or be overshadowed by it. Some would counsel waiting until after Epiphany, mid-January, when the court is refreshed and the roads more passable for those who wish to attend."
        },
        {
          "speaker": "alvaro_de_luna",
          "text": "My counsel? Announce the formal betrothal this Sunday, with appropriate ceremony. Let the banns be read. Wed in early December—perhaps Saturday the 3rd—before Christmas makes travel difficult. That gives three weeks for preparation, which is swift but not scandalous. Unless, of course, you have reasons for greater haste that I should know about?"
        },
        {
          "speaker": "juan_ii",
          "text": "Make it so Alvaro. Good suggestions. No, there is no need for more haste. Let's do things properly. Anything else for now?"
        },
        {
          "speaker": "alvaro_de_luna",
          "text": "December 3rd it shall be. I will coordinate with Archbishop Alonso and the Italian delegation. The betrothal ceremony this Sunday will require some arrangement—I suggest the Cathedral, followed by a formal reception here at the Alcázar. Nothing so grand as Fernando's baptism, but dignified."
        },
        {
          "speaker": "alvaro_de_luna",
          "text": "Other matters, Your Majesty. None urgent enough to spoil your breakfast, but several requiring your attention today or in coming days. First: Doña Beatriz sent word that Princess Catalina has been asking for you since she woke. Apparently she wishes to show you something she built with her wooden blocks. The lady Lucia has also been mentioned—Catalina keeps asking about 'the pretty lady' and whether she will visit again. The children will need to be told about the betrothal before the public announcement. How you wish to handle that is... delicate."
        },
        {
          "speaker": "alvaro_de_luna",
          "text": "Second: A courier arrived late last night from Commander Martín's Morocco expedition. The message is brief—they made landfall safely at Tétouan and have begun establishing contacts. No detailed intelligence yet, merely confirmation they arrived. The full report remains expected in the coming weeks."
        },
        {
          "speaker": "alvaro_de_luna",
          "text": "Third: Don Íñigo López de Mendoza requests an audience at your convenience. The Council of Great Houses has completed its first round of internal audits, and he wishes to present the findings personally. He seemed pleased, which suggests the news is good."
        },
        {
          "speaker": "juan_ii",
          "text": "The other matters can wait an hour. Have Don Íñigo come this afternoon. And tell Doña Beatriz I will see the children shortly—but first, I have a lady to attend upon."
        }
      ],
      "roll": null,
      "recap": "Juan and Álvaro plan the royal wedding to Lucia Visconti, deciding on a formal betrothal announcement this Sunday followed by the wedding on December 3rd. They discuss the canonical requirements, diplomatic considerations, and court protocol needed for a proper ceremony."
    },
    {
      "id": "evt_1433_00221",
      "type": "relationship_change",
      "date": "1433-11-11",
      "end_date": null,
      "location": "Toledo, Alcázar",
      "participants": [
        "juan_ii",
        "lucia_d_este",
        "francesca_de_roberti"
      ],
      "exchanges": [
        {
          "speaker": "narrator",
          "text": "You set aside Álvaro's papers with a wave of your hand. The corridors of the Alcázar are quiet at this hour, servants moving softly about their morning duties. You pass through the gallery where autumn light falls in long golden rectangles across the stone floor, then climb the stairs to the guest apartments in the eastern wing—the finest rooms the fortress offers, traditionally reserved for visiting royalty."
        },
        {
          "speaker": "narrator",
          "text": "Two of Lucia's Italian guards stand at the door, liveried in Ferrara's colors. They stiffen at your approach, clearly uncertain of protocol. You spare them the dilemma by stopping at a respectful distance and inclining your head."
        },
        {
          "speaker": "juan_ii",
          "text": "Please inform the Lady Lucia that the King of Castile requests the honor of her company, if she is receiving visitors."
        },
        {
          "speaker": "narrator",
          "text": "One guard disappears inside. You hear a brief murmur of feminine voices—Italian, too quick to follow—and then laughter. Lucia's laughter, you think. Sharp and bright. The door opens wider. Lucia stands in the entrance herself, rather than sending a servant. She wears a morning gown of deep green wool, simple but beautifully cut, her dark hair loosely braided rather than elaborately styled. The sapphire ring glints on her finger—she has not removed it."
        },
        {
          "speaker": "lucia_d_este",
          "text": "The King of Castile. Knocking at doors like a common suitor. Do they not teach kings to send servants with flowery messages and wait to be summoned? I was just telling my ladies that Castilian breakfasts appear to consist entirely of bread, olives, and stubbornness. They did not believe me. Come. Tell them I am not exaggerating. And explain to me why there is no frittata, no sweet pastries, no proper coffee— You do have coffee in Castile, yes?"
        },
        {
          "speaker": "juan_ii",
          "text": "Good morning ladies. I hear that we must amend our breakfast and include coffee?"
        },
        {
          "speaker": "narrator",
          "text": "Lucia's six Italian ladies-in-waiting rise hastily from their seats around a small table, curtsying in a flutter of silk and murmured greetings. The room smells of bread and honey—apparently someone found something sweet for the Ferrarese contingent—and a fire crackles in the hearth against the November chill. Lucia closes the door behind you, leaving her guards in the corridor."
        },
        {
          "speaker": "lucia_d_este",
          "text": "Coffee. You say it as though you know what it is. This gives me hope. In Ferrara, we have it from the Venetian traders. Bitter, black, hot—it wakes the mind like nothing else. My uncle claims it is a Muslim invention and therefore suspect, but he drinks three cups every morning nonetheless."
        },
        {
          "speaker": "francesca_de_roberti",
          "text": "Your Majesty, I am Donna Francesca de' Roberti. I served the Lady Lucia's mother, God rest her soul, and now attend the Lady herself. We have been... adapting to Castilian hospitality. The bread is excellent. The olives are... Abundant."
        },
        {
          "speaker": "lucia_d_este",
          "text": "Ignore them. They are testing whether the King of Castile has a sense of humor or whether they must spend the rest of their lives being solemn and dull. You came yourself. This morning. Without sending a herald or a formal invitation or a procession of servants. I was not certain you would. Kings are busy. There are... matters of state, I am told."
        },
        {
          "speaker": "juan_ii",
          "text": "Yes, I have received reports that a certain structure has been built requiring inspection by both myself and a mysterious 'Pretty lady'. But I also wanted to meet the ladies who have accompanied you from Italy. Donna Francesca, an honour to meet you. I understand that our Castilian diet seems crude to Italians and I look forward to discover how Italian cuisine can delight my entire court."
        }
      ],
      "roll": null,
      "recap": "Juan visits Lucia's chambers informally, meeting her Italian ladies-in-waiting. They discuss Castilian versus Italian breakfast customs, with playful banter about coffee and cuisine. The visit establishes a more personal tone between Juan and Lucia, away from formal court protocol."
    },
    {
      "id": "evt_1433_00222",
      "type": "diplomatic_proposal",
      "date": "1433-11-11",
      "end_date": null,
      "location": "Toledo, Alcázar",
      "participants": [
        "juan_ii",
        "lucia_gonzaga",
        "francesca_strozzi",
        "isabella_strozzi",
        "giulia_bentivoglio",
        "caterina_de_medici",
        "alessandra_gonzaga",
        "beatrice_d_este"
      ],
      "exchanges": [
        {
          "speaker": "lucia_gonzaga",
          "text": "Ignore them. They are testing whether the King of Castile has a sense of humor or whether they must spend the rest of their lives being solemn and dull."
        },
        {
          "speaker": "lucia_gonzaga",
          "text": "You came yourself. This morning. Without sending a herald or a formal invitation or a procession of servants. I was not certain you would. Kings are busy. There are... matters of state, I am told."
        },
        {
          "speaker": "juan_ii",
          "text": "Yes, I have recieved reports that a certain structure has been build requiring inspection by both myself and a mysterious 'Pretty lady'. But I also wanted to meet the ladies who have accompanied you from Italy. Donna Francesca, an honour to meet you. I understand that our Castillian diet seems crude to Italians and I look forward to discover how Italian cuisine can delight my entire court."
        },
        {
          "speaker": "francesca_strozzi",
          "text": "Your Majesty is gracious. We Ferrarese pride ourselves on our kitchens, it is true. Perhaps too much. If Your Majesty permits, I would be honored to work with your household cooks. Not to replace Castilian traditions, but to... complement them. The Lady Lucia's mother always said that a harmonious table makes for a harmonious house."
        },
        {
          "speaker": "narrator",
          "text": "Lucia watches this exchange with evident pleasure, then turns to introduce the others."
        },
        {
          "speaker": "lucia_gonzaga",
          "text": "Your Majesty, my ladies. Donna Isabella Strozzi—she has the sharpest needle in Ferrara and will judge your entire court by the quality of their embroidery."
        },
        {
          "speaker": "lucia_gonzaga",
          "text": "Donna Giulia Bentivoglio—her family are patrons of artists in Bologna, and she will expect paintings on every wall."
        },
        {
          "speaker": "lucia_gonzaga",
          "text": "Donna Caterina de' Medici—a distant cousin of the Florentine branch, and our resident scholar. She reads Greek, which she reminds us of constantly."
        },
        {
          "speaker": "caterina_de_medici",
          "text": "Only when relevant."
        },
        {
          "speaker": "lucia_gonzaga",
          "text": "Donna Alessandra Gonzaga—her aunt married into Mantua, and she knows more gossip about every court in Italy than any spymaster."
        },
        {
          "speaker": "lucia_gonzaga",
          "text": "And Donna Beatrice d'Este—my own cousin, sent by my uncle to ensure I do not do anything scandalous. She takes her duties very seriously."
        },
        {
          "speaker": "beatrice_d_este",
          "text": "Your Majesty, I am honored—that is—the Lady Lucia exaggerates—"
        },
        {
          "speaker": "lucia_gonzaga",
          "text": "I never exaggerate. I merely emphasize."
        },
        {
          "speaker": "lucia_gonzaga",
          "text": "Now. You mentioned a structure requiring inspection, and a 'pretty lady.' I confess I do not know what structure you mean—but I am very curious to meet this mysterious pretty lady of whom you speak. Is she a rival I should know about?"
        },
        {
          "speaker": "juan_ii",
          "text": "Mysterious indeed. I do not know, maybe if you come with me we can unravel this together."
        },
        {
          "speaker": "narrator",
          "text": "Lucia takes your arm without hesitation, her hand light but confident on your sleeve. She glances back at her ladies."
        },
        {
          "speaker": "lucia_gonzaga",
          "text": "Donna Francesca, you have command of the breakfast crisis. I expect solutions by the time I return."
        }
      ],
      "roll": null,
      "recap": "Juan meets Lucia's Italian ladies-in-waiting, each introduced with wit and personality. Donna Francesca offers to enhance the court's cuisine, and the group displays the sophisticated humor of the Italian Renaissance. Juan cryptically mentions a mysterious structure and 'pretty lady' requiring inspection, prompting Lucia to accompany him arm-in-arm to investigate."
    },
    {
      "id": "evt_1433_00223",
      "type": "relationship_change",
      "date": "1433-11-11",
      "end_date": null,
      "location": "Toledo, Alcázar Nursery",
      "participants": [
        "juan_ii",
        "lucia_de_ferrara",
        "catalina",
        "dona_beatriz",
        "donna_francesca"
      ],
      "exchanges": [
        {
          "speaker": "lucia_de_ferrara",
          "text": "I never exaggerate. I merely emphasize. Now. You mentioned a structure requiring inspection, and a 'pretty lady.' I confess I do not know what structure you mean—but I am very curious to meet this mysterious pretty lady of whom you speak. Is she a rival I should know about?"
        },
        {
          "speaker": "juan_ii",
          "text": "Mysterious indeed. I do not know, maybe if you come with me we can unravel this together."
        },
        {
          "speaker": "narrator",
          "text": "Lucia takes your arm without hesitation, her hand light but confident on your sleeve. She glances back at her ladies."
        },
        {
          "speaker": "lucia_de_ferrara",
          "text": "Donna Francesca, you have command of the breakfast crisis. I expect solutions by the time I return."
        },
        {
          "speaker": "donna_francesca",
          "text": "Yes, my lady. We shall storm the kitchens."
        },
        {
          "speaker": "narrator",
          "text": "You walk together through the corridors of the Alcázar, and Lucia takes in everything—the tapestries, the stonework, the servants who stop and stare and then remember to bow. She says little, but you feel her attention like a living thing, cataloging, assessing."
        },
        {
          "speaker": "lucia_de_ferrara",
          "text": "Your fortress is older than I expected. Ferrara is all new construction—my uncle tears down anything more than fifty years old and rebuilds it with more columns. This has... weight. History."
        },
        {
          "speaker": "narrator",
          "text": "She pauses at a window overlooking the Tagus, the river silver-grey under the November sky."
        },
        {
          "speaker": "lucia_de_ferrara",
          "text": "Isabel walked these halls."
        },
        {
          "speaker": "narrator",
          "text": "Before you can respond, you reach the royal family's apartments. Doña Beatriz meets you at the door, and her eyes widen slightly at the sight of Lucia on your arm—but she is too well-trained to show more than a flicker of surprise."
        },
        {
          "speaker": "dona_beatriz",
          "text": "Your Majesty. The princess has been waiting most eagerly."
        },
        {
          "speaker": "narrator",
          "text": "She opens the door. The nursery is warm, a fire burning low, morning light streaming through the windows. And there in the center of the room sits Catalina—nineteen months old, dark-haired like her mother, serious-faced with concentration—surrounded by an ambitious construction of wooden blocks that appears to be either a castle or a very confused cathedral. She looks up at the sound of the door."
        },
        {
          "speaker": "catalina",
          "text": "Papá!"
        },
        {
          "speaker": "narrator",
          "text": "Her face splits into a radiant smile. Then her eyes move to the woman beside you, and she goes very still, studying Lucia with that peculiar intensity that small children possess."
        },
        {
          "speaker": "catalina",
          "text": "Pretty lady. Come see. I builded it."
        },
        {
          "speaker": "narrator",
          "text": "She points imperiously at her block structure. Lucia's grip on your arm tightens almost imperceptibly. You glance at her face and see something you did not expect—uncertainty. This sharp-tongued, quick-witted woman who bantered with you about empires in a moonlit garden looks, for just a moment, genuinely nervous. She takes a breath, releases your arm, and crosses the room to kneel beside your daughter, heedless of her fine green gown on the nursery floor."
        },
        {
          "speaker": "lucia_de_ferrara",
          "text": "You builded this? It is very tall. What is it?"
        },
        {
          "speaker": "narrator",
          "text": "You lower yourself to the floor beside your daughter, crossing your legs as you have done a hundred times in this nursery. Catalina barely glances at you—her attention is fixed entirely on Lucia, this fascinating new creature who has knelt down to her level."
        },
        {
          "speaker": "catalina",
          "text": "Is a castle. That's where Papá sleeps. That's where I sleep. Fernando sleeps... somewhere. He's little. Where do you sleep?"
        },
        {
          "speaker": "narrator",
          "text": "Lucia glances at you—a flash of those grey-green eyes, amused and slightly panicked—then turns back to Catalina with appropriate gravity."
        },
        {
          "speaker": "lucia_de_ferrara",
          "text": "I sleep in a room with many ladies who talk too much. It is very noisy. Your castle looks much more peaceful."
        },
        {
          "speaker": "narrator",
          "text": "Catalina considers this. Then, with the decisive air of a monarch granting a great favor, she selects a single wooden block from her pile and holds it out to Lucia."
        },
        {
          "speaker": "catalina",
          "text": "You can have a room. Next to Papá."
        },
        {
          "speaker": "narrator",
          "text": "From somewhere behind you, you hear Doña Beatriz make a small, strangled sound that might be a suppressed laugh. Lucia takes the block as though receiving a precious gift. Her hands, you notice, are not entirely steady."
        },
        {
          "speaker": "lucia_de_ferrara",
          "text": "Thank you, Princess. I am honored."
        },
        {
          "speaker": "narrator",
          "text": "Catalina nods, satisfied, and turns her attention to the critical work of integrating this new architectural element. She pats the floor beside her."
        },
        {
          "speaker": "catalina",
          "text": "You help. Papá is bad at building. He makes it fall down."
        },
        {
          "speaker": "narrator",
          "text": "The single block tumbles, striking another, and a cascade of wooden destruction follows—Catalina's careful tower collapsing in a clattering avalanche across the nursery floor. For one frozen moment, Catalina stares at the ruins of her castle, her mouth a perfect O of shock. Then she rounds on you with the righteous fury that only a nineteen-month-old princess can muster."
        }
      ],
      "roll": null,
      "recap": "Juan brings Lucia de Ferrara to meet Princess Catalina in the nursery. Despite initial nervousness, Lucia charms the nineteen-month-old princess by engaging seriously with her block castle construction. Catalina, delighted with the 'pretty lady,' offers Lucia a block to build a room 'next to Papá,' creating an unexpectedly intimate moment before Juan playfully destroys part of the castle."
    },
    {
      "id": "evt_1433_00224",
      "type": "domestic_event",
      "date": "1433-11-11",
      "end_date": null,
      "location": "Toledo, Alcázar Nursery",
      "participants": [
        "juan_ii",
        "catalina",
        "lucia",
        "dona_beatriz",
        "fernando"
      ],
      "exchanges": [
        {
          "speaker": "narrator",
          "text": "From somewhere behind you, you hear Doña Beatriz make a small, strangled sound that might be a suppressed laugh. Lucia takes the block as though receiving a precious gift. Her hands, you notice, are not entirely steady."
        },
        {
          "speaker": "lucia",
          "text": "Thank you, Princess. I am honored."
        },
        {
          "speaker": "narrator",
          "text": "Catalina nods, satisfied, and turns her attention to the critical work of integrating this new architectural element. She pats the floor beside her."
        },
        {
          "speaker": "catalina",
          "text": "You help. Papá is bad at building. He makes it fall down."
        },
        {
          "speaker": "narrator",
          "text": "The single block tumbles, striking another, and a cascade of wooden destruction follows—Catalina's careful tower collapsing in a clattering avalanche across the nursery floor. For one frozen moment, Catalina stares at the ruins of her castle, her mouth a perfect O of shock. Then she rounds on you with the righteous fury that only a nineteen-month-old princess can muster."
        },
        {
          "speaker": "catalina",
          "text": "PAPÁ! No! Bad! I builded that!"
        },
        {
          "speaker": "narrator",
          "text": "She smacks your arm with her small hand—it has all the force of an angry sparrow—and her face crumples into theatrical outrage. She turns to Lucia, appealing to this new ally for justice."
        },
        {
          "speaker": "catalina",
          "text": "You see? He always does this."
        },
        {
          "speaker": "narrator",
          "text": "Lucia is biting her lip, her shoulders shaking with barely contained laughter. She meets your eyes over Catalina's head, and something passes between you—a warmth, an ease, a shared recognition of the absurd and wonderful moment you find yourselves in. Then Lucia schools her expression into exaggerated solemnity and places a comforting hand on Catalina's shoulder."
        },
        {
          "speaker": "lucia",
          "text": "I see. This is very serious. What should we do with him?"
        },
        {
          "speaker": "narrator",
          "text": "Catalina considers the question with the weight it deserves, her brow furrowed in concentration. She looks at you, then at Lucia, then at the scattered blocks."
        },
        {
          "speaker": "catalina",
          "text": "He has to fix it. And no knocking down."
        },
        {
          "speaker": "narrator",
          "text": "You set to work under Catalina's exacting supervision, picking up blocks and presenting each one for her approval before placing it."
        },
        {
          "speaker": "juan_ii",
          "text": "This one?"
        },
        {
          "speaker": "catalina",
          "text": "No, Papá. That one goes there."
        },
        {
          "speaker": "narrator",
          "text": "And so it goes—block by block, correction by correction. Catalina stands with her hands on her hips like a master mason overseeing incompetent apprentices, occasionally sighing at your inadequacy. When you place a block at a slight angle, she fixes it herself with an air of long-suffering patience. Lucia watches from her place on the floor, her chin resting on her hand. At some point during the reconstruction, Catalina apparently decided that the 'pretty lady' had earned supervisory privileges as well, and began directing comments to both of you."
        },
        {
          "speaker": "catalina",
          "text": "There, see? Now it's the big one. The big one, Papá."
        },
        {
          "speaker": "narrator",
          "text": "The structure rises again—not quite the same as before, but close. Catalina adds the final block herself, a small wooden rectangle that she places at the very top with ceremonial gravity."
        },
        {
          "speaker": "catalina",
          "text": "Done. Is better now. The pretty lady has a room. And no one knocks it down."
        },
        {
          "speaker": "narrator",
          "text": "This last is delivered with a stern look directly at you. From the corner, you hear the soft fussing sounds of Fernando stirring in his cradle—ten weeks old now, beginning to notice the world around him. Doña Beatriz moves quietly to check on him. Lucia rises from the floor, brushing off her gown, and extends a hand to help Catalina up—an instinctive gesture, natural and unthinking. Catalina takes it without hesitation."
        },
        {
          "speaker": "lucia",
          "text": "Your castle is very fine, Princess. Perhaps tomorrow you will show me how to build one myself?"
        },
        {
          "speaker": "juan_ii",
          "text": "Have you been keeping watch over your brother Catalina?"
        }
      ],
      "roll": null,
      "recap": "Juan playfully knocks down Catalina's block castle, earning her theatrical outrage. Under her strict supervision, he rebuilds it with Lucia's help, creating a warm family moment that deepens the bond between all three as they approach baby Fernando's crib together."
    },
    {
      "id": "evt_1433_00225",
      "type": "domestic_event",
      "date": "1433-11-11",
      "end_date": null,
      "location": "Toledo, Alcázar Nursery",
      "participants": [
        "juan_ii",
        "catalina",
        "lucia",
        "dona_beatriz"
      ],
      "exchanges": [
        {
          "speaker": "narrator",
          "text": "From the corner, you hear the soft fussing sounds of Fernando stirring in his cradle—ten weeks old now, beginning to notice the world around him. Doña Beatriz moves quietly to check on him."
        },
        {
          "speaker": "narrator",
          "text": "Lucia rises from the floor, brushing off her gown, and extends a hand to help Catalina up—an instinctive gesture, natural and unthinking. Catalina takes it without hesitation."
        },
        {
          "speaker": "lucia",
          "text": "Your castle is very fine, Princess. Perhaps tomorrow you will show me how to build one myself?"
        },
        {
          "speaker": "juan_ii",
          "text": "Have you been keeping watch over your brother Catalina?"
        },
        {
          "speaker": "narrator",
          "text": "Catalina giggles as you lift her, wrapping her arms around your neck. She immediately adopts your exaggerated stealth, pressing one finger to her lips in imitation of what you've clearly done before."
        },
        {
          "speaker": "catalina",
          "text": "Shhhhh."
        },
        {
          "speaker": "narrator",
          "text": "You creep together toward the cradle, your footsteps theatrical and slow. Catalina cranes her neck to peer over the edge as you approach, her small body tense with the importance of the mission. Fernando lies in his cradle, ten weeks old and growing quickly. He has kicked off part of his swaddling and is making the soft gurgling sounds of a baby discovering his own hands. His eyes—dark like his mother's, like Catalina's—track vaguely toward the movement above him."
        },
        {
          "speaker": "catalina",
          "text": "I watch him. He's very little. He doesn't do anything yet. But Doña Beatriz says he will get bigger and then he can play. He cries a lot."
        },
        {
          "speaker": "narrator",
          "text": "Fernando, as if to demonstrate, makes a small squawking sound and waves one tiny fist in the air. Catalina watches this with great interest. Behind you, you hear the soft rustle of fabric—Lucia has followed, standing a few paces back. When you glance at her, she is watching the three of you with an expression you cannot quite read. Something tender and guarded all at once, as though she is witnessing something precious and fragile that she is not yet certain she is allowed to touch."
        },
        {
          "speaker": "juan_ii",
          "text": "This pretty lady is called Lucia. She is staying with us from now on. Would you like to give her a hug like you do with papa?"
        },
        {
          "speaker": "narrator",
          "text": "Catalina studies Lucia with the grave deliberation of a princess evaluating a new addition to her court. She looks at Lucia's face, then at you, then back at Lucia—processing this information with visible care."
        },
        {
          "speaker": "catalina",
          "text": "Lucia. Loo-thee-ah. Okay."
        },
        {
          "speaker": "narrator",
          "text": "She leans out from your arms toward Lucia, reaching with the absolute trust of a child who has never been dropped—arms extended, fingers grasping, wholly committed to the transfer. Lucia hesitates for just a heartbeat. You see her take a breath. Then she steps forward and receives Catalina into her arms, settling the toddler against her hip with a naturalness that surprises you both. Catalina wraps her arms around Lucia's neck and squeezes with the fierce, uncomplicated grip of a nineteen-month-old."
        },
        {
          "speaker": "catalina",
          "text": "You smell nice. Like flowers."
        },
        {
          "speaker": "lucia",
          "text": "Thank you, Princess. You smell nice too. Like... blocks. And breakfast."
        },
        {
          "speaker": "narrator",
          "text": "Catalina pulls back just enough to look at Lucia's face, apparently conducting a final inspection. Then she nods, satisfied, and pats Lucia's cheek with one small hand."
        },
        {
          "speaker": "catalina",
          "text": "You can stay."
        },
        {
          "speaker": "juan_ii",
          "text": "Dona Beatriz, has Catalina had breakfast yet?"
        },
        {
          "speaker": "dona_beatriz",
          "text": "Not yet, Your Majesty. The princess was too busy with her construction to be tempted by food. I had thought to try again after— the inspection was complete."
        }
      ],
      "roll": null,
      "recap": "Juan introduces Lucia to his children in the nursery. Catalina accepts her with characteristic directness, giving her a hug and granting permission for her to stay. The tender moment shows Lucia beginning to find her place in the royal family as she holds Catalina and observes baby Fernando."
    },
    {
      "id": "evt_1433_00226",
      "type": "domestic_event",
      "date": "1433-11-11",
      "end_date": null,
      "location": "Toledo, Lucia's Apartments",
      "participants": [
        "juan_ii",
        "lucia",
        "catalina",
        "dona_beatriz",
        "donna_francesca",
        "donna_isabella_strozzi",
        "donna_giulia_bentivoglio",
        "donna_caterina",
        "donna_beatrice_d_este",
        "donna_alessandra_gonzaga"
      ],
      "exchanges": [
        {
          "speaker": "narrator",
          "text": "Lucia's eyes meet yours over Catalina's head. They are bright—too bright—and her voice is not entirely steady when she speaks."
        },
        {
          "speaker": "lucia",
          "text": "Thank you, Princess. You smell nice too. Like... blocks. And breakfast."
        },
        {
          "speaker": "narrator",
          "text": "Catalina pulls back just enough to look at Lucia's face, apparently conducting a final inspection. Then she nods, satisfied, and pats Lucia's cheek with one small hand."
        },
        {
          "speaker": "catalina",
          "text": "You can stay."
        },
        {
          "speaker": "dona_beatriz",
          "text": "Not yet, Your Majesty. The princess was too busy with her construction to be tempted by food. I had thought to try again after the inspection was complete."
        },
        {
          "speaker": "catalina",
          "text": "I'm hungry."
        },
        {
          "speaker": "dona_beatriz",
          "text": "There is bread and honey waiting, Your Majesty, and some of the soft cheese the princess favors. I can have it brought here, or if Your Majesty wishes, the princess could take her breakfast elsewhere, if you have further need of the nursery."
        },
        {
          "speaker": "catalina",
          "text": "How many? Are they nice? Do they have... things?"
        },
        {
          "speaker": "catalina",
          "text": "Six? That's... that's a lot. Yes. We go now. To see the things."
        },
        {
          "speaker": "lucia",
          "text": "It seems I have my orders. Donna Francesca will be delighted. She has been trying to find someone who appreciates Italian sweets since we crossed the Alps."
        },
        {
          "speaker": "narrator",
          "text": "The three of you make your way back through the corridors of the Alcázar—you walking beside Lucia, Catalina still perched on her hip and providing commentary on everything you pass. By the time you reach the eastern wing, Catalina has informed Lucia about the location of the kitchens, the best window for watching horses in the courtyard, and the terrible injustice of not being allowed to touch Papá's sword."
        },
        {
          "speaker": "catalina",
          "text": "Hello! We're HERE! We have come to see the THINGS!"
        },
        {
          "speaker": "donna_francesca",
          "text": "Your Majesty. My lady. And this must be the Princess Catalina. We have heard much about you."
        },
        {
          "speaker": "narrator",
          "text": "The moment Lucia sets Catalina down, the princess stands frozen for a moment—overwhelmed by the reality of six ladies, all of them turning to look at her with various expressions of delight and curiosity. Then Catalina's natural confidence reasserts itself. She walks directly to Donna Isabella Strozzi and points at the embroidery hoop in her lap."
        },
        {
          "speaker": "catalina",
          "text": "What's that?"
        },
        {
          "speaker": "donna_isabella_strozzi",
          "text": "This is needlework, Princess. I am making a picture with thread. See?"
        },
        {
          "speaker": "catalina",
          "text": "It's a bird."
        },
        {
          "speaker": "narrator",
          "text": "She makes her way around the room like a small dignitary conducting inspections. Donna Giulia Bentivoglio receives a long stare and the observation that her necklace is 'very sparkly.' Donna Caterina—the scholar—is asked if she can read, and when she confirms that she can, Catalina nods sagely and says, 'Doña Beatriz reads to me. About horses.' Young Donna Beatrice d'Este receives the declaration 'You look like Lucia,' before Catalina moves on."
        },
        {
          "speaker": "donna_francesca",
          "text": "I understand you have come to see the things. And to have breakfast. Is this true? Then you have come to the right place. This is called a crostata. It is made with almonds and honey. Would you like to try?"
        },
        {
          "speaker": "juan_ii",
          "text": "I think this is something very special Catalina. Not something we can eat every time, but for now we can."
        },
        {
          "speaker": "narrator",
          "text": "Catalina accepts the pastry with both hands, holding it like a sacred object. She takes a bite. Her face transforms. Eyes widening, cheeks bulging, an expression of pure wonder spreading across her small features."
        },
        {
          "speaker": "catalina",
          "text": "Papá, it's so good. Is there... more?"
        },
        {
          "speaker": "juan_ii",
          "text": "Is there a crostata for papa as well?"
        },
        {
          "speaker": "donna_francesca",
          "text": "Your Majesty, we had hoped you might ask. The kitchens were... receptive to collaboration. Once we explained that Italian pastries require Italian techniques, they were most accommodating. The honey is Castilian, of course. Excellent quality."
        },
        {
          "speaker": "donna_caterina",
          "text": "Coffee, Your Majesty. We brought our own supply from Ferrara. There is enough to share, if you are curious."
        },
        {
          "speaker": "lucia",
          "text": "Now, it is a proper morning."
        },
        {
          "speaker": "juan_ii",
          "text": "You can have one more crostata Catalina. But you have to choose carefully. Each one is slightly different you see? Which one will you pick?"
        },
        {
          "speaker": "catalina",
          "text": "That one is... brown. What's that one? A sun. The sun one. But I can try the brown one tomorrow?"
        },
        {
          "speaker": "juan_ii",
          "text": "I do not know if there will be crostatas tomorrow Catalina. Crostatas are something very special. But maybe next time when we visit the six ladies, they will have very special good bread."
        },
        {
          "speaker": "catalina",
          "text": "Okay. Next time, special bread. The sun."
        },
        {
          "speaker": "lucia",
          "text": "She is... She is extraordinary, Juan. You have done well with her. Isabel must have been remarkable."
        },
        {
          "speaker": "narrator",
          "text": "The study is warm, a fire crackling in the hearth against the November chill. Catalina has settled onto a cushion near the fireplace with a wooden horse—someone, probably Doña Beatriz working through the Alcázar's efficient servant network, has ensured toys were waiting."
        }
      ],
      "roll": null,
      "recap": "Juan brings Catalina to meet Lucia's Italian ladies in their apartments for breakfast. The princess charms the ladies while discovering Italian pastries, particularly crostatas made with almonds and apricots. The morning creates a warm domestic scene as Catalina bonds with Lucia and the Italian women show their delight with the young princess, leading to genuine affection between the groups."
    },
    {
      "id": "evt_1433_00227",
      "type": "intelligence_report",
      "date": "1433-11-28",
      "end_date": null,
      "location": "Toledo, Royal Study",
      "participants": [
        "juan_ii",
        "alvaro_de_luna",
        "lucia_d_este",
        "catalina"
      ],
      "exchanges": [
        {
          "speaker": "narrator",
          "text": "The study is warm, a fire crackling in the hearth against the November chill. Catalina has settled onto a cushion near the fireplace with a wooden horse—someone, probably Doña Beatriz working through the Alcázar's efficient servant network, has ensured toys were waiting. She makes the horse trot across the cushion, murmuring quiet narratives to herself. Lucia takes a seat near the window, slightly apart from your desk but clearly present. She has brought a small book from her apartments—devotional, by the look of it—but her eyes drift toward you and Álvaro more often than toward the pages."
        },
        {
          "speaker": "alvaro_de_luna",
          "text": "Your Majesty. The more pressing matter is this: a letter arrived this morning from Commander Martín in Morocco. More substantial than the brief landing confirmation we received previously. I have not opened it, but the messenger indicated it contains his initial assessment of conditions in Tétouan and prospects for the mission."
        },
        {
          "speaker": "narrator",
          "text": "Álvaro hands you the sealed packet. You break the wax—Commander Martín's seal, a simple cross over a crescent moon, the symbol he chose after his baptism. The letter is substantial: several pages in Martín's careful hand, written in Castilian but with occasional Arabic terms where no translation suffices."
        },
        {
          "speaker": "narrator",
          "text": "Commander Martín reports establishing presence in Tangier and Tétouan, with all twenty-three delegation members alive and well. In Tangier, they present as merchants, aided by freed prisoners' testimony of your honorable treatment. The city is fragmented with competing factions. In Tétouan, rebuilt by al-Andalus refugees, the local qadi shows cautious interest in trade relations. Salé proved impossible—corsairs control it and threatened to kill 'apostates.' The Marinid Sultan is weak, Morocco fragmenting into independent local powers. Martín advises Morocco cannot be conquered like Granada, but relationships can be built with future leaders. He requests trade goods and formal introduction for Fernando's scholarly work."
        },
        {
          "speaker": "juan_ii",
          "text": "This is good news. We are establishing a foothold and are beginning to understand Morocco. But a conquest proves to be much more difficult than anticipated. We should write them back and let them continue their work as is, grant them the trade goods requested. Ask them to begin exploring if we could put one faction in power in exchange for the city to become a Castilian vassal. Religious customs would be respected and trade would increase. The city would be ruled by a christian with strong ties to the region or Islam. Who understands the traditions. Do not approach any faction with an offer yet, just gather information for now."
        },
        {
          "speaker": "lucia_d_este",
          "text": "May I see the letter?"
        }
      ],
      "roll": null,
      "recap": "Commander Martín's detailed report from Morocco reveals moderate success: presence established in Tangier and Tétouan, basic intelligence network functioning, and cautious local reception aided by freed prisoners' testimony. However, Morocco proves too fragmented for conquest, with the Marinid Sultan weak and local powers acting independently. Juan approves continued operations and requests intelligence on potential vassal arrangements with local factions."
    },
    {
      "id": "evt_1433_00228",
      "type": "council_meeting",
      "date": "1433-11-11",
      "end_date": null,
      "location": "Toledo, Royal Study",
      "participants": [
        "juan_ii",
        "lucia_d_este",
        "alvaro_de_luna",
        "catalina"
      ],
      "exchanges": [
        {
          "speaker": "juan_ii",
          "text": "We should write them back and let the continue their work as is, grant them the trade goods requested. Ask them to begin exploring if we could put one faction in power in exchange for the city to become a Castillian vassal. Religious customs would be respected and trade would increase. The city would be ruled by a christian with strong ties to the region or Islam. Who understands the traditions. Do not approach any faction with an offer yet, just gather information for now. I turn to Lucia. Anything to add?"
        },
        {
          "speaker": "narrator",
          "text": "Lucia rises from her seat by the window and moves closer, her expression thoughtful. She has clearly been following every word."
        },
        {
          "speaker": "lucia_d_este",
          "text": "May I see the letter?"
        },
        {
          "speaker": "narrator",
          "text": "She takes it from your hand and scans the pages quickly—you notice her eyes moving with the practiced speed of someone accustomed to reading correspondence. When she finishes, she sets it down on your desk."
        },
        {
          "speaker": "lucia_d_este",
          "text": "Your Commander Martín writes well. He understands that information is worth more than territory. This is the key passage. A dying realm with a child sultan and competing regents. Factions that hate each other more than they hate you."
        },
        {
          "speaker": "lucia_d_este",
          "text": "Your instinct is sound—find a faction to support. But I would add a caution. Do not let them know you are choosing between factions. Let each faction believe they are the only one you are considering. The moment they learn you are shopping for allies, your value to any of them diminishes. They will compete to offer you less, not more."
        },
        {
          "speaker": "lucia_d_este",
          "text": "In Ferrara, my uncle plays the Italian powers against each other this way. Venice believes they are the only one you are considering. Also—the qadi in Tétouan. Ahmad ibn Yusuf. He waits to see which way the wind blows, your commander says. Such men are useful, but they are not loyal. They serve whoever appears strongest. If you elevate him, you must remain stronger than any alternative, or he will turn the moment a better offer appears."
        },
        {
          "speaker": "lucia_d_este",
          "text": "But these are merely observations. I do not know Morocco. Your commander does."
        },
        {
          "speaker": "juan_ii",
          "text": "For now, we just observe and do not approach any faction yet. We need more information. Send these instructions to Martin. Make sure he recieves the trade goods. What else?"
        },
        {
          "speaker": "alvaro_de_luna",
          "text": "I will draft the response for your seal and arrange for the trade goods—steel, worked leather, and a selection of Granada silks. We can send them by way of a Genoese merchant vessel out of Málaga; it will attract less attention than a Castilian ship."
        },
        {
          "speaker": "alvaro_de_luna",
          "text": "That leaves Don Íñigo López de Mendoza this afternoon—the Council of Great Houses audit results. He has been waiting patiently. From what I understand, the news is favorable. The Council has conducted audits on three member houses and collected some fifteen thousand maravedís in underpayments. More importantly, the other great houses are watching. If this model proves effective, we may see additional families petition to join."
        },
        {
          "speaker": "narrator",
          "text": "He glances at Catalina, who has abandoned her wooden horse and is now attempting to stack the loose papers on the corner of your desk into a tower."
        },
        {
          "speaker": "alvaro_de_luna",
          "text": "Shall I schedule Don Íñigo for after the midday meal? That would give Your Majesty time to... attend to other matters."
        },
        {
          "speaker": "narrator",
          "text": "From her chair, Lucia suppresses a smile."
        },
        {
          "speaker": "juan_ii",
          "text": "Schedule him for lunch today, this is fine."
        }
      ],
      "roll": null,
      "recap": "Juan discusses Morocco policy with Lucia and Álvaro, deciding to gather more intelligence on factions before making any approaches. They arrange for trade goods to be sent to Commander Martín via Genoese merchants. Álvaro reports that Don Íñigo López de Mendoza is ready to present the Council of Great Houses audit results, which appear favorable with 15,000 maravedís collected and growing interest from other noble houses."
    },
    {
      "id": "evt_1433_00229",
      "type": "council_meeting",
      "date": "1433-11-11",
      "end_date": null,
      "location": "Toledo, Royal Study",
      "participants": [
        "juan_ii",
        "inigo_lopez_de_mendoza",
        "alvaro_de_luna",
        "lucia_deste"
      ],
      "exchanges": [
        {
          "speaker": "narrator",
          "text": "The small dining chamber adjacent to your study has been prepared for an informal working lunch. Nothing so grand as a banquet—bread, roasted fowl, cheese, olives, and wine sufficient for conversation without ceremony. Catalina has been returned to Doña Beatriz's care, though not without protest. Lucia remains, positioned to observe without intruding."
        },
        {
          "speaker": "narrator",
          "text": "Álvaro escorts Don Íñigo López de Mendoza into the chamber. The head of House Mendoza is a man in his middle fifties, his dark hair silvered at the temples, his bearing that of a scholar as much as a lord."
        },
        {
          "speaker": "inigo_lopez_de_mendoza",
          "text": "Your Majesty. I thank you for receiving me. And I see congratulations are in order. Word travels quickly in Toledo. The lady Lucia d'Este, I presume?"
        },
        {
          "speaker": "inigo_lopez_de_mendoza",
          "text": "My lady. House Mendoza welcomes you to Castile. I hope you will find our kingdom worthy of your gifts."
        },
        {
          "speaker": "lucia_deste",
          "text": "Don Íñigo. Your reputation precedes you. I am told you are both a lord and a poet—a combination I thought existed only in old romances."
        },
        {
          "speaker": "inigo_lopez_de_mendoza",
          "text": "The romance is somewhat less glamorous in practice, my lady. Mostly it involves arguing with stewards about grain prices and then writing melancholy verses about the futility of arguing with stewards."
        },
        {
          "speaker": "inigo_lopez_de_mendoza",
          "text": "Your Majesty, I come bearing news of the Council of Great Houses. We have completed our first year of operation, and I believe the results merit your attention."
        },
        {
          "speaker": "inigo_lopez_de_mendoza",
          "text": "Your Majesty, I will be direct. The Council has grown, though not as swiftly as I had hoped. When we began last November, House Mendoza stood alone—proposing a concept that many found... unusual. Great families policing themselves? Voluntary audits? Consultation without demanding concessions? My peers suspected a trap."
        },
        {
          "speaker": "inigo_lopez_de_mendoza",
          "text": "In the first months, we had only the three founding houses—Mendoza, and two families closely allied with us by marriage. The turn came in spring, after Your Majesty's return from Rome and Basel. Three more houses approached us between April and August. House Enríquez, House Guzmán, and House Manrique. That brings us to six families."
        },
        {
          "speaker": "inigo_lopez_de_mendoza",
          "text": "Collections for the full year stand at approximately forty-three thousand maravedís. The audits have uncovered modest underpayments, errors in accounting, a few cases of deliberate evasion quietly corrected. No scandals. No public humiliations. The system works as intended."
        },
        {
          "speaker": "inigo_lopez_de_mendoza",
          "text": "We have also begun something I did not anticipate. Consultation. When House Guzmán faced a dispute with a lesser family over grazing rights, they brought it to the Council rather than pursuing it through royal courts or private warfare. We mediated. The matter was resolved in three days rather than three years."
        },
        {
          "speaker": "inigo_lopez_de_mendoza",
          "text": "The foundation is solid, Your Majesty. The institution is proving itself. But it has not yet achieved the momentum that would make membership expected rather than optional. We are at a delicate stage—past the point of failure, not yet at the point of inevitability."
        },
        {
          "speaker": "inigo_lopez_de_mendoza",
          "text": "There are several paths, Your Majesty. First: The Velasco Question. If House Velasco joins, it transforms the Council overnight. Second: A Visible Royal Consultation on some matter of policy where noble input is appropriate. Third: Handle a more visible dispute to demonstrate the Council's value beyond tax compliance."
        },
        {
          "speaker": "inigo_lopez_de_mendoza",
          "text": "Fourth: Charter and Formalization. A royal charter would give us permanence. Fifth: The Danger to Avoid. The Council must never become—or appear to become—a mechanism for royal control of the nobility."
        },
        {
          "speaker": "juan_ii",
          "text": "I think that a letter signed by me would be appropriate for now. Alvaro, can we draft a letter addressed to the council thanking them for the great initiative and cooperation so far, bring honour to the houses who have joined. I will ask them on input on the structure on Granada titles and obligations and future lands to be conquered. In addition, I will instruct my marshals to first approach the council in case of a perceived issue before approaching the noble directly, should the noble be a part of the council."
        },
        {
          "speaker": "alvaro_de_luna",
          "text": "A wise approach, Your Majesty. The letter accomplishes several things at once—public recognition, genuine consultation, and a practical benefit to membership. I will draft it for your review this evening."
        },
        {
          "speaker": "inigo_lopez_de_mendoza",
          "text": "Your Majesty, the matter of the Crown Marshals is... significant. If the Marshal approaches the Council first, the dynamic transforms entirely. The Council investigates its own member. Peers examine peers. This will bring House Velasco in. I am nearly certain of it."
        },
        {
          "speaker": "lucia_deste",
          "text": "And the consultation on Granada titles—this is clever as well. You ask for advice on a matter that directly concerns noble interests. They will argue amongst themselves about the structure, which tells you what they want. In Ferrara, my uncle calls this 'letting them write the map of their own desires.'"
        },
        {
          "speaker": "inigo_lopez_de_mendoza",
          "text": "The lady has a political mind."
        },
        {
          "speaker": "lucia_deste",
          "text": "The lady grew up watching her uncle play Venice against Milan against Florence. One learns, or one becomes a pawn."
        },
        {
          "speaker": "narrator",
          "text": "The conversation turns to lighter matters over the roasted fowl and wine. Don Íñigo speaks of his children—three sons and two daughters, his youngest daughter insisting on reading everything in his library, including texts he considers unsuitable for a girl of fifteen."
        }
      ],
      "roll": {
        "table_id": "council_development_revised",
        "value": 21,
        "outcome": "Solid Growth. Three to four new houses joined, bringing total membership to six or seven great families. Collections of 40,000-50,000 maravedís. The Council meets regularly and has begun informal consultations."
      },
      "recap": "Don Íñigo reports on the Council of Great Houses' first year progress during a working lunch. The Council has grown to six families with 43,000 maravedís collected and has begun mediating disputes. Juan proposes writing a formal letter of recognition, consulting the Council on Granada titles, and having Crown Marshals approach the Council first for member issues—moves that particularly excite Don Íñigo as likely to attract House Velasco."
    },
    {
      "id": "evt_1433_00230",
      "type": "decision",
      "date": "1433-11-11",
      "end_date": null,
      "location": "Toledo, Royal Study",
      "participants": [
        "juan_ii",
        "inigo_lopez_de_mendoza",
        "lucia_visconti",
        "alvaro_de_luna"
      ],
      "exchanges": [
        {
          "speaker": "inigo_lopez_de_mendoza",
          "text": "The lady has a political mind."
        },
        {
          "speaker": "lucia_visconti",
          "text": "The lady grew up watching her uncle play Venice against Milan against Florence. One learns, or one becomes a pawn."
        },
        {
          "speaker": "inigo_lopez_de_mendoza",
          "text": "Is there anything specific you wish me to convey to the Council before the letter arrives? Any... preparation of the ground, as it were?"
        },
        {
          "speaker": "narrator",
          "text": "The conversation turns to lighter matters over the roasted fowl and wine. Don Íñigo speaks of his children—three sons and two daughters, the eldest son recently married to a lady of House Enríquez, which explains some of that family's willingness to join the Council."
        },
        {
          "speaker": "inigo_lopez_de_mendoza",
          "text": "My youngest daughter has her mother's stubbornness and my unfortunate tendency toward verse. She insists on reading everything in my library, including texts I consider unsuitable for a girl of fifteen. Last week I found her annotating Ovid. Annotating. With corrections."
        },
        {
          "speaker": "lucia_visconti",
          "text": "I think I should like to meet this daughter."
        },
        {
          "speaker": "inigo_lopez_de_mendoza",
          "text": "God help us all if you do, my lady. She needs no encouragement."
        },
        {
          "speaker": "narrator",
          "text": "You speak of Catalina's wooden horse named Horse, of Fernando's growing strength, of the small moments that make up a father's days between matters of state. Don Íñigo listens with the attention of a man who remembers his own children at that age, offering occasional observations—how quickly they grow, how the years that seem endless in the moment become precious in memory. Álvaro, for his part, remains largely silent, though you catch him smiling once or twice at the domesticity of it all."
        },
        {
          "speaker": "inigo_lopez_de_mendoza",
          "text": "Your Majesty. My lady. This has been a most productive conversation. I confess I arrived uncertain whether the Council's progress would meet your expectations. I leave... encouraged."
        },
        {
          "speaker": "inigo_lopez_de_mendoza",
          "text": "House Mendoza has served the crown for generations, Your Majesty. But I think perhaps we have never served a king who understood so well that strength and partnership are not opposites."
        },
        {
          "speaker": "juan_ii",
          "text": "Lucia, would you like to go on a little trip with me? If we are to travel together a lot, I would like to see how you travel and how best to accommodate you. When we go to Constantinople, I assume your ladies will come as well?"
        },
        {
          "speaker": "lucia_visconti",
          "text": "A trip? Before we are even formally betrothed? What will the court say? Yes, my ladies would accompany me to Constantinople. Donna Francesca would insist—she has managed my household since I was fourteen and would sooner walk into the sea than let me sail to the edge of Christendom without her."
        },
        {
          "speaker": "lucia_visconti",
          "text": "But you are not asking about Constantinople, not really. You want to know what manner of traveler I am. Whether I will slow your progress with complaints about rough roads and inadequate lodgings. Whether I require a wagon full of comforts or can ride beside you."
        },
        {
          "speaker": "lucia_visconti",
          "text": "I grew up in Ferrara, Juan. A small court, always watching larger powers circle. My uncle taught me that survival requires movement—the ability to leave quickly if necessary, to travel light, to adapt. I can ride. I can sleep in conditions that would make Donna Francesca weep. I can eat camp food without complaint, though I reserve the right to observe that it is terrible."
        },
        {
          "speaker": "juan_ii",
          "text": "Just a short trip for a few hours. I want to take Catalina as well. She best get used to riding on horses. I want to see how well she is suited for travel as well."
        },
        {
          "speaker": "lucia_visconti",
          "text": "A few hours, with a child of nineteen months? You are testing all of us, I see. Very well. I accept your challenge."
        }
      ],
      "roll": null,
      "recap": "After concluding the Council discussion with Don Íñigo López de Mendoza over lunch, Juan proposes a short riding trip to test how well Lucia and young Catalina travel together, planning for future journeys including the eventual trip to Constantinople."
    },
    {
      "id": "evt_1433_00231",
      "type": "domestic_event",
      "date": "1433-11-11",
      "end_date": null,
      "location": "Toledo, Royal Stables and Countryside",
      "participants": [
        "juan_ii",
        "catalina",
        "lucia_visconti",
        "alvaro_de_luna"
      ],
      "exchanges": [
        {
          "speaker": "lucia_visconti",
          "text": "Catalina—does she ride with you, or does she have her own pony? At nineteen months, I assume she is not yet in the saddle alone, but children vary. My youngest cousin was on a pony at two and terrorizing the stable master by three."
        },
        {
          "speaker": "narrator",
          "text": "She waits for your answer, already calculating, already adapting—the mind of a woman who approaches even a simple afternoon ride as a problem to be solved efficiently. Álvaro, still gathering his papers, watches this exchange with the expression of a man who is revising his estimates. Whatever he expected of the Italian bride, this practical directness was perhaps not it."
        },
        {
          "speaker": "juan_ii",
          "text": "She will ride with me for now."
        },
        {
          "speaker": "narrator",
          "text": "You find Catalina in the nursery with Doña Beatriz, engaged in what appears to be a very serious conversation with her wooden horse about the merits of various types of hay. Fernando sleeps peacefully in his cradle, oblivious to his sister's agricultural discourse."
        },
        {
          "speaker": "catalina",
          "text": "Papá! You came back!"
        },
        {
          "speaker": "narrator",
          "text": "You carry Catalina through the corridors of the Alcázar and out into the afternoon air. November in Toledo is crisp but not bitter—the sky a pale blue, the sun providing warmth enough for a short ride. Catalina chatters the entire way, pointing out everything she sees."
        },
        {
          "speaker": "narrator",
          "text": "The royal stables are warm with the smell of horses and hay. Grooms snap to attention at your arrival, bowing low. Catalina goes suddenly quiet, her eyes wide as saucers. She has seen horses before, of course—from windows, from the courtyard at a distance. But here, in the stables themselves, the animals loom enormous."
        },
        {
          "speaker": "catalina",
          "text": "Papá, they are big. That one, what is her name?"
        },
        {
          "speaker": "juan_ii",
          "text": "That is my horse, Hidalgo."
        },
        {
          "speaker": "narrator",
          "text": "Hidalgo is a destrier of Andalusian blood—grey coat shimmering almost silver in the stable light, black mane and tail, the powerful chest and strong legs of a warhorse bred for generations. You stand before him, letting his warm breath wash over you both. Slowly, carefully, he extends his great head toward Catalina. She shrinks back against your chest for a moment. Then, with the unpredictable courage of children, she reaches out one small hand."
        },
        {
          "speaker": "catalina",
          "text": "He's soft. He likes me, Papá. He likes me!"
        },
        {
          "speaker": "narrator",
          "text": "The groom moves quickly to assist, holding Hidalgo's bridle steady as you lift Catalina onto the saddle. She grips the pommel with both hands, her knuckles white, suddenly aware of how high she is from the ground. Then you swing up behind her, settling into the saddle, your arms coming around her to take the reins. The tension drains from her small body."
        },
        {
          "speaker": "catalina",
          "text": "Good Hidalgo. Good horse. We are going to ride now. Where are we going, Papá? Can we go fast?"
        },
        {
          "speaker": "narrator",
          "text": "The sound of boots on cobblestones interrupts her. Lucia emerges from the stable entrance, transformed. Gone is the fine wool morning gown. She wears now a riding habit of deep green—practical, well-cut, clearly made for actual riding rather than merely looking elegant on horseback."
        },
        {
          "speaker": "lucia_visconti",
          "text": "I see the princess has claimed the best seat. Wise girl. Always ride with the king if you can. Which horse have you prepared for me?"
        },
        {
          "speaker": "narrator",
          "text": "Lucia moves into the stables with purpose, not rushing but not hesitating either. She stops before a black mare with a white blaze on her forehead—tall, perhaps fifteen hands, with an intelligent eye and a restless energy."
        },
        {
          "speaker": "lucia_visconti",
          "text": "This one. What is her name?"
        },
        {
          "speaker": "narrator",
          "text": "Tormenta, my lady. She is... spirited."
        },
        {
          "speaker": "lucia_visconti",
          "text": "Spirited. Is that a polite way of saying she has thrown riders? Saddle Tormenta."
        },
        {
          "speaker": "narrator",
          "text": "You guide Hidalgo out of the stables and into the courtyard, where the afternoon sun casts long shadows across the cobblestones. Around the courtyard you go, letting Catalina find her balance. By the fifth circuit, she is confident enough to release one hand and pat Hidalgo's neck."
        },
        {
          "speaker": "catalina",
          "text": "I'm riding! Good horse. Good Hidalgo. You walk very nice."
        },
        {
          "speaker": "narrator",
          "text": "You hear hoofbeats behind you—sharper, more energetic. Lucia emerges from the stables on Tormenta. The black mare is indeed spirited, tossing her head and dancing sideways as Lucia guides her into the courtyard. But Lucia sits her well—back straight, hands firm but not harsh on the reins."
        },
        {
          "speaker": "lucia_visconti",
          "text": "She is spirited. But she listens. She just needed to know I meant it."
        },
        {
          "speaker": "catalina",
          "text": "You look like a queen."
        },
        {
          "speaker": "narrator",
          "text": "A small escort assembles quickly—six mounted guards under the command of Sergeant Tomás who has ridden with you through worse than a peaceful afternoon in the Castilian countryside. They form up around you with practiced efficiency, three ahead and three behind, close enough for protection but far enough to allow conversation."
        }
      ],
      "roll": null,
      "recap": "Juan takes nineteen-month-old Catalina for her first horse riding lesson at the royal stables. Despite initial fear, Catalina bonds with Juan's warhorse Hidalgo. Lucia demonstrates her riding skills by choosing and successfully handling the spirited black mare Tormenta. The family prepares to ride out into the countryside with an escort, marking Catalina's first proper equestrian experience."
    },
    {
      "id": "evt_1433_00232",
      "type": "domestic_event",
      "date": "1433-11-11",
      "end_date": null,
      "location": "Toledo, Countryside",
      "participants": [
        "juan_ii",
        "lucia",
        "catalina"
      ],
      "exchanges": [
        {
          "speaker": "lucia",
          "text": "She is spirited, but she listens. She just needed to know I meant it."
        },
        {
          "speaker": "narrator",
          "text": "Tormenta snorts and stamps, eyeing Hidalgo with the wariness of a mare assessing a much larger stallion. Hidalgo, for his part, ignores her entirely—the unflappable dignity of a veteran. Catalina stares at Lucia on the black horse, her mouth open."
        },
        {
          "speaker": "catalina",
          "text": "You look like a queen."
        },
        {
          "speaker": "narrator",
          "text": "A small escort assembles quickly—six mounted guards under the command of Sergeant Tomás who has ridden with you through worse than a peaceful afternoon in the Castilian countryside. You guide Hidalgo through the gates of the Alcázar and down through Toledo's winding streets. Citizens stop and stare—their king, riding with a child before him and a striking dark-haired woman at his side."
        },
        {
          "speaker": "juan_ii",
          "text": "Catalina, we are going to ride out into the country. Do you see the river down there? The river is called the Tagus. We will cross the bridge and ride along the other side, where there are farms and fields and olive groves."
        },
        {
          "speaker": "catalina",
          "text": "Olives? I like olives."
        },
        {
          "speaker": "narrator",
          "text": "You reach the Puente de Alcántara, ancient Roman stonework that has spanned the Tagus for over a thousand years. Catalina watches the water flowing beneath with fascination."
        },
        {
          "speaker": "catalina",
          "text": "The water goes fast, Papá."
        },
        {
          "speaker": "juan_ii",
          "text": "It does. The Tagus flows all the way to the sea, far to the west. To Portugal, where your grandmother lives."
        },
        {
          "speaker": "catalina",
          "text": "Abuela? The water visits Abuela?"
        },
        {
          "speaker": "juan_ii",
          "text": "In a manner of speaking. We will ride for perhaps an hour, and then rest and have something to eat. And then we will ride back. The whole time, you will be with Papá, safe on Hidalgo. And the Lady Lucia will ride with us, so she can see the land that will be her home."
        },
        {
          "speaker": "catalina",
          "text": "I will show her the olives."
        },
        {
          "speaker": "juan_ii",
          "text": "There is another matter we must still discuss, love. You have six ladies, but there are also the four Portuguese doñas still taking care of Catalina and Fernando. I have offered them a home in my court to give Catalina something to remember her mother by. If all four Portuguese ladies want to come along to Constantinople as well, we may not have space for everyone. And how do you feel about their presence anyway?"
        },
        {
          "speaker": "lucia",
          "text": "You are asking me several questions at once. Let me answer them separately. First—how do I feel about their presence. They are not a threat to me. They served Isabel. They love Isabel's children. This does not diminish me. I would be a fool to resent women who have cared for Catalina and Fernando when I was not yet here to do so. In truth, I am grateful for them. Catalina knows their faces, their voices, their ways. She has already lost her mother. To strip away everyone familiar in favor of Italian strangers would be cruel. Children need continuity, Juan. Even when everything else changes."
        },
        {
          "speaker": "lucia",
          "text": "Second—Constantinople. You are right that space will be limited, even on a royal flagship. Ten ladies-in-waiting, plus servants, plus your retinue, plus guards... It becomes a floating court, not a diplomatic mission. My suggestion: let the ladies choose. Some of my Italians may prefer to remain in Toledo. Perhaps two or three of mine come, and one or two of the Portuguese, and the others remain to manage the household and care for Fernando. Fernando should not come to Constantinople. He is too young, the voyage too dangerous. Which means someone must stay with him whom we trust absolutely. Doña Beatriz, perhaps—she has been with Isabel's household the longest."
        },
        {
          "speaker": "lucia",
          "text": "Third—you called me 'love.' I noticed. I am choosing to notice. You may continue."
        },
        {
          "speaker": "juan_ii",
          "text": "Have you seen a ship Catalina? Do you know what a ship is?"
        },
        {
          "speaker": "catalina",
          "text": "Ship. Ship is... boat? Big boat? Doña Beatriz has a picture. In her book. A big boat with... the things. That catch the wind."
        },
        {
          "speaker": "lucia",
          "text": "Sails. They are called sails, little one."
        },
        {
          "speaker": "catalina",
          "text": "Sails. Ships have sails, Hidalgo. Why, Papá? Are we going on a ship? Where does the ship go? Does the ship go to Abuela? On the water that visits her?"
        },
        {
          "speaker": "juan_ii",
          "text": "In many days and nights, we will go on Hidalgo and travel to the sea. There is a ship with sails. And we will go on the ship and then travel on the sea for many days. And you know what? Ships have names. And do you know what the name is of the ship we will be travelling on? The ship is called 'Princess Catalina'."
        },
        {
          "speaker": "narrator",
          "text": "Catalina goes very still. She stares up at you, her small mouth falling open. For a moment she seems unable to process what you have said—the words too large, too strange, too wonderful to fit inside her nineteen-month-old understanding of the world."
        },
        {
          "speaker": "catalina",
          "text": "The ship... the ship is called me?"
        },
        {
          "speaker": "lucia",
          "text": "It is true, little one. Your Papá named his great ship after you."
        },
        {
          "speaker": "narrator",
          "text": "Catalina looks back at you. Her lower lip trembles—not with sadness, but with the overwhelming weight of a feeling she does not yet have words for. Then her face breaks into the most radiant smile you have ever seen on her, a smile that seems to illuminate her entire being."
        },
        {
          "speaker": "catalina",
          "text": "My ship. I have a ship. I love you, Papá. I love you so much. Can Lucia come on my ship? And Hidalgo? Can Hidalgo come?"
        },
        {
          "speaker": "juan_ii",
          "text": "I dont know if Lucia will come. Maybe you should ask her."
        },
        {
          "speaker": "catalina",
          "text": "Lucia, will you come on my ship? Please?"
        }
      ],
      "roll": null,
      "recap": "Juan takes Catalina and Lucia on a countryside ride outside Toledo to discuss travel arrangements. They plan the household for the Constantinople voyage, with some Portuguese and Italian ladies staying to care for Fernando while others accompany the journey. Juan reveals that his flagship is named 'Princess Catalina,' delighting his daughter, who then formally invites Lucia to join them on the voyage."
    },
    {
      "id": "evt_1433_00233",
      "type": "roll_result",
      "date": "1433-11-11",
      "end_date": null,
      "location": "Toledo, Countryside",
      "participants": [
        "juan_ii",
        "catalina",
        "lucia"
      ],
      "exchanges": [
        {
          "speaker": "catalina",
          "text": "These are for you. I picked them. From the tree."
        },
        {
          "speaker": "lucia",
          "text": "These are beautiful. You picked these yourself? From the tree?"
        },
        {
          "speaker": "catalina",
          "text": "From the tree. They live there. I didn't know."
        },
        {
          "speaker": "narrator",
          "text": "She settles onto the blanket between you and Lucia, reaching immediately for the bread and cheese. Her legs stick out in front of her, still slightly unsteady from the ride, and she chatters as she eats—a stream of observations about the horses, the hawk she saw, the olive trees, the funny way Tormenta tossed her head."
        },
        {
          "speaker": "narrator",
          "text": "You watch her, and you see it clearly now—what the Portuguese ladies have surely noticed, what Doña Beatriz must report in her quiet way. Catalina is not merely recovering from the loss of her mother. She is thriving. She learned Lucia's name after hearing it once and has not forgotten it. She remembers the promise of crostatas from this morning and connected it to the concept of \"special bread\" for future negotiations. When Hidalgo frightened her, she mastered her fear within minutes. When presented with six strange Italian women, she conducted her own inspection and rendered judgment. She accepted Lucia into her world with remarkable speed—not indiscriminate trust, but genuine openness."
        },
        {
          "speaker": "narrator",
          "text": "She is curious about everything. Why do olives grow on trees? Where does the water go? What is the ship's name? The questions tumble out faster than you can answer them, each answer spawning three more questions. And beneath the curiosity, there is warmth. She offered Lucia a hug this morning without prompting—a gift freely given. She wanted Lucia to come on \"her\" ship. She picked olives not to eat herself, but to give."
        },
        {
          "speaker": "narrator",
          "text": "She laughs easily, recovers quickly from small upsets, and seems to genuinely enjoy meeting new people rather than fearing them. The trauma of losing Isabel at ten months old has not broken her. Perhaps she was too young to fully understand; perhaps she was surrounded by enough love that the wound healed cleanly; perhaps she simply has a resilient spirit."
        },
        {
          "speaker": "lucia",
          "text": "She is... She is sunshine, Juan. How did you make such a child?"
        },
        {
          "speaker": "catalina",
          "text": "I'm not sunshine. I'm Catalina."
        }
      ],
      "roll": {
        "table_id": "catalina_early_development",
        "value": 59,
        "outcome": "Warm and Quick. Catalina combines genuine intelligence with a sunny, affectionate disposition. She is curious, eager to learn, quick to laugh, and forms bonds easily. She handled her mother's loss with remarkable resilience—sad at times, but not broken. She adapts well to new situations. A genuinely delightful child who brings joy to those around her. Robust health."
      },
      "recap": "A developmental assessment reveals that 19-month-old Princess Catalina has thrived despite losing her mother at ten months. She displays remarkable intelligence, curiosity, and emotional warmth, easily forming bonds and adapting to new situations while maintaining a sunny disposition and robust health."
    },
    {
      "id": "evt_1433_00234",
      "type": "ceremony",
      "date": "1433-11-13",
      "end_date": null,
      "location": "Toledo, Cathedral",
      "participants": [
        "juan_ii",
        "lucia_of_ferrara",
        "archbishop_alonso_de_toledo",
        "catalina",
        "inigo_lopez_de_mendoza",
        "pedro_fernandez_de_velasco"
      ],
      "exchanges": [
        {
          "speaker": "narrator",
          "text": "The Cathedral of Toledo fills before dawn. Word has spread through the city, and citizens crowd the plaza outside, hoping for a glimpse of their king and his Italian bride. Inside, the great families of Castile assemble in their finest—velvets and silks, gold chains and family jewels, the accumulated splendor of a kingdom celebrating peace after generations of war."
        },
        {
          "speaker": "narrator",
          "text": "Don Íñigo López de Mendoza sits with his family in a place of honor. The Enríquez contingent occupies another section. You note, with quiet satisfaction, that Don Pedro Fernández de Velasco has come from Burgos—the first time the Count of Haro has attended a royal ceremony since your coronation. He catches your eye and inclines his head, his weathered face unreadable."
        },
        {
          "speaker": "narrator",
          "text": "The altar blazes with candles. Archbishop Alonso de Toledo waits in his ceremonial vestments, ancient and solemn. You stand before the assembled court in cloth-of-gold, your father's sword at your side. The True Cross fragment and Santiago's bone rest on the altar—the relics you carried to Rome and back, now witnessing another sacred moment."
        },
        {
          "speaker": "narrator",
          "text": "A murmur ripples through the cathedral. The doors have opened. Lucia enters on the arm of Don Íñigo, who has been granted the honor of escorting her in the absence of her uncle. She wears a gown of deep blue velvet embroidered with silver stars—the colors of Ferrara, but also of the Virgin. A thin circlet of gold sits on her dark hair. She carries no flowers, no ornament but the sapphire ring already on her finger."
        },
        {
          "speaker": "narrator",
          "text": "She walks the length of the cathedral with her head high, her grey-green eyes fixed on you. The Archbishop raises his hands."
        },
        {
          "speaker": "archbishop_alonso_de_toledo",
          "text": "We are gathered in the sight of God and these witnesses to join this man and this woman in the sacred promise of betrothal..."
        },
        {
          "speaker": "narrator",
          "text": "The ceremony is brief and ancient. The Archbishop asks the questions required by canon law."
        },
        {
          "speaker": "juan_ii",
          "text": "I do so promise."
        },
        {
          "speaker": "lucia_of_ferrara",
          "text": "I do so promise."
        },
        {
          "speaker": "narrator",
          "text": "You take the ring from her finger—the ring you gave her in the moonlit garden—and place it there again, publicly this time, before God and Castile."
        },
        {
          "speaker": "archbishop_alonso_de_toledo",
          "text": "Before these witnesses, I pronounce you betrothed, bound by sacred promise to wed according to the rites of Holy Mother Church. What God has begun, let no man put asunder."
        },
        {
          "speaker": "narrator",
          "text": "The cathedral erupts. 'Vivat! Vivat Rey Juan! Vivat Lady Lucia!' Lucia's hand trembles slightly in yours. When you look at her face, her eyes are bright with unshed tears—but she is smiling."
        },
        {
          "speaker": "lucia_of_ferrara",
          "text": "Trapped."
        },
        {
          "speaker": "narrator",
          "text": "The great hall of the Alcázar has been transformed for the reception. Musicians play in the gallery. Wine flows freely. Tables groan with food—Castilian and Italian dishes side by side, a culinary alliance to match the matrimonial one. Catalina, in a gown of pale yellow that matches the autumn chrysanthemums decorating the hall, sits in a place of honor with Doña Beatriz hovering nearby."
        },
        {
          "speaker": "catalina",
          "text": "Papá, crostatas?"
        },
        {
          "speaker": "lucia_of_ferrara",
          "text": "As promised, little one. You earned it."
        },
        {
          "speaker": "narrator",
          "text": "The evening stretches on. There is dancing—you lead Lucia through the steps of a pavane, her hand light in yours, her movements graceful despite unfamiliarity with Castilian forms. And through it all, Lucia stays at your side, her ring catching the candlelight, her sharp tongue softened for once into simple happiness."
        },
        {
          "speaker": "lucia_of_ferrara",
          "text": "Three weeks. Three weeks until I am truly yours."
        }
      ],
      "roll": null,
      "recap": "King Juan II and Lucia of Ferrara are formally betrothed in a grand ceremony at Toledo Cathedral before the assembled nobility of Castile. The Archbishop performs the ancient ritual, rings are exchanged, and the cathedral erupts in celebration. A festive reception follows at the Alcázar with dancing, music, and both Castilian and Italian cuisine, marking the successful alliance between the kingdoms."
    },
    {
      "id": "evt_1433_00235",
      "type": "domestic_event",
      "date": "1433-11-14",
      "end_date": null,
      "location": "Toledo, Royal Stables",
      "participants": [
        "juan_ii",
        "catalina",
        "pedro_carrillo"
      ],
      "exchanges": [
        {
          "speaker": "narrator",
          "text": "The days settle into a rhythm. Mornings find you in the stables with Catalina, lifting her onto Hidalgo's back before mounting behind her. She has grown bolder with each ride—no longer gripping the pommel with white-knuckled terror, but sitting straighter, sometimes releasing one hand to pat Hidalgo's neck or point at something that catches her eye."
        },
        {
          "speaker": "catalina",
          "text": "Faster, Papá?"
        },
        {
          "speaker": "juan_ii",
          "text": "Not yet, little one."
        },
        {
          "speaker": "narrator",
          "text": "The stable master is a grizzled man named Pedro Carrillo, who has served the royal stables for thirty years and trained horses for your father before you. He watches your daily rides with Catalina from the courtyard, arms folded, professional eye assessing. When you pose your question, he strokes his grey beard thoughtfully."
        },
        {
          "speaker": "pedro_carrillo",
          "text": "For sitting a horse with an adult, as Your Majesty does now? She is already learning—balance, rhythm, comfort with the animal. This is good. The earlier they lose their fear, the better. For a pony of her own, with a lead rope held by a groom? Three years old, Your Majesty. Some say four, but I have seen children of three take to it well, if they have the temperament. The princess... She has no fear. That is half the battle. For riding independently, without a lead? Five or six, depending on the child. Short distances, gentle ponies, always supervised. By eight or nine, if she takes to it, she could ride properly—hunts, hawking, travel."
        },
        {
          "speaker": "pedro_carrillo",
          "text": "There is a mare in the stables, Your Majesty. Andalusian, but small—fourteen hands only. Gentle disposition, good with noise and confusion. She was meant for Queen Isabel, before... She has been idle too long. In a year or so, she might suit the princess for her first pony. With your permission, I could begin training her for a child's temperament."
        },
        {
          "speaker": "pedro_carrillo",
          "text": "It shall be done, Your Majesty. I will begin working with the mare immediately—accustoming her to sudden movements, high voices, the unpredictability of small children. For the pony, I will send inquiries to the breeders in Córdoba and Jerez. What we want is a Castilian pony, twelve hands or less—sturdy, calm, forgiving of mistakes. They are not rare, but a good one, one worthy of a princess... That takes time to find. I will have candidates for Your Majesty's inspection by spring, well before the princess turns three."
        },
        {
          "speaker": "pedro_carrillo",
          "text": "If I may speak plainly, Your Majesty? The princess has a gift. Some children freeze on horseback—their bodies fight the animal's movement. Others relax too much and flop about like sacks of grain. But she... She listens to the horse. Feels him. It cannot be taught, only encouraged. Her mother was the same way, Your Majesty. Queen Isabel rode like she was born to it. God rest her soul."
        },
        {
          "speaker": "juan_ii",
          "text": "Hi Catalina. This is Pedro. He looks after the horses. When you are older, you will have a horse of your own to ride on. Would you like that?"
        },
        {
          "speaker": "narrator",
          "text": "Catalina studies Pedro Carrillo with the intense scrutiny she reserves for new people—taking in his grey beard, his weathered hands, the smell of horses and leather that clings to him. After a moment, she apparently finds him acceptable."
        },
        {
          "speaker": "catalina",
          "text": "Hello Pedro. A horse? My own horse? Like Hidalgo? But Hidalgo is very big, Papá. I am small. How will I get up?"
        },
        {
          "speaker": "pedro_carrillo",
          "text": "Not a horse like Hidalgo, Your Highness. A pony. A small horse, just the right size for a princess. She will grow as you grow, and when you are bigger, you will have a bigger horse. But first— A little one. Just for you."
        },
        {
          "speaker": "catalina",
          "text": "What is her name? What color is she? Can I see her now?"
        },
        {
          "speaker": "juan_ii",
          "text": "Ha! No not yet Catalina. It will be many many more nights before you will have your horse. You can ride with papa on Hidalgo or with Lucia on her horse until then."
        },
        {
          "speaker": "catalina",
          "text": "But Papá... I want to see her now. Lucia's horse? The black one? Tormenta? Can I ride with Lucia today? Where is she? Can we go find her? I will be very good, Papá. I will hold on tight. I won't pull Tormenta's hair. Maybe just a little pull. To say hello."
        },
        {
          "speaker": "juan_ii",
          "text": "We can go and have a ride, sure. Why don't you go to Lucia and ask her if you can ride with her on her horse? I think she is inside in her chambers."
        },
        {
          "speaker": "catalina",
          "text": "I will ask her. I will say please."
        }
      ],
      "roll": null,
      "recap": "Juan takes Catalina for her regular horsemanship training with Hidalgo. He consults stable master Pedro Carrillo about appropriate ages for children to learn riding. Pedro recommends starting with a pony at age three and offers to prepare a gentle mare for Catalina. Catalina shows natural talent and enthusiasm for riding, and eagerly anticipates riding with Lucia on her horse Tormenta."
    },
    {
      "id": "evt_1433_00236",
      "type": "domestic_event",
      "date": "1433-11-14",
      "end_date": null,
      "location": "Toledo, Alcázar Corridors",
      "participants": [
        "juan_ii",
        "catalina",
        "lucia_ferrarese"
      ],
      "exchanges": [
        {
          "speaker": "catalina",
          "text": "Can I ride with Lucia today? Where is she? Can we go find her?"
        },
        {
          "speaker": "catalina",
          "text": "I will be very good, Papá. I will hold on tight. I won't pull Tormenta's hair. Maybe just a little pull. To say hello."
        },
        {
          "speaker": "juan_ii",
          "text": "We can go and have a ride, sure. Why don't you go to Lucia and ask her if you can ride with her on her horse? I think she is inside in her chambers."
        },
        {
          "speaker": "narrator",
          "text": "Catalina's face transforms with delight. You set her down, and she stands for a moment, vibrating with barely contained energy—a small princess with a mission."
        },
        {
          "speaker": "catalina",
          "text": "I will ask her. I will say please."
        },
        {
          "speaker": "narrator",
          "text": "She turns and toddles toward the Alcázar with surprising determination, her small legs pumping. Then she stops abruptly and looks back at you."
        },
        {
          "speaker": "catalina",
          "text": "Papá? Where is Lucia's chambers?"
        },
        {
          "speaker": "narrator",
          "text": "She has been there before, of course, but the geography of the Alcázar is vast and confusing for a nineteen-month-old whose previous navigation has always involved being carried. A groom nearby suppresses a smile. Pedro Carrillo develops a sudden cough that sounds suspiciously like laughter. Catalina stands in the courtyard, halfway between you and the fortress, her face scrunched with the realization that her grand independent mission has encountered an immediate logistical obstacle."
        },
        {
          "speaker": "catalina",
          "text": "Maybe maybe Papá can show me. Just this time. And then I will remember."
        },
        {
          "speaker": "juan_ii",
          "text": "I think it is this way...what door shall we explore now Catalina? You can point me in the direction and we will go there."
        },
        {
          "speaker": "narrator",
          "text": "Catalina takes to this new game with enthusiasm, her earlier impatience transformed into the thrill of exploration. She peers down the corridors from her vantage point in your arms, her small face screwed up in concentration."
        },
        {
          "speaker": "catalina",
          "text": "That one."
        },
        {
          "speaker": "narrator",
          "text": "You oblige, walking toward it. A servant passing by flattens himself against the wall, bowing deeply and looking faintly alarmed at the sight of the King of Castile taking navigational directions from a toddler. The door leads to a storage room. Catalina peers inside at stacked linens and folded tapestries."
        },
        {
          "speaker": "catalina",
          "text": "No. Not this one. That one."
        },
        {
          "speaker": "narrator",
          "text": "You try another door—a small chapel, empty and quiet. Catalina shakes her head."
        },
        {
          "speaker": "catalina",
          "text": "Lucia is not praying. She is... she is doing lady things."
        },
        {
          "speaker": "narrator",
          "text": "The third door opens onto a servant's staircase. Catalina frowns at the narrow steps disappearing upward."
        },
        {
          "speaker": "catalina",
          "text": "Too small. Lucia is tall."
        },
        {
          "speaker": "narrator",
          "text": "A guard at the end of the corridor watches this procession with a carefully blank expression, though his mustache twitches suspiciously. Finally, after two more incorrect guesses—a disused antechamber and what appears to be someone's private office—Catalina spots a door flanked by two men in Ferrarese livery."
        },
        {
          "speaker": "catalina",
          "text": "There! The men with the funny clothes! That's Lucia's door!"
        },
        {
          "speaker": "narrator",
          "text": "The Ferrarese guards exchange glances, uncertain whether 'funny clothes' constitutes an insult requiring response. They settle for bowing."
        },
        {
          "speaker": "narrator",
          "text": "Catalina lands on her feet and straightens her dress with a gesture she has clearly observed from adult women—a small, unconscious imitation that tugs at something in your chest. She looks up at the Ferrarese guards. They are tall, armored, utterly foreign to her experience. For a moment she hesitates, her natural boldness warring with the sheer bigness of these strangers blocking her path. Then she draws herself up to her full height—which brings her roughly to their knees—and announces with tremendous dignity:"
        },
        {
          "speaker": "catalina",
          "text": "I am Princess Catalina. I am here to see Lucia. Please."
        },
        {
          "speaker": "narrator",
          "text": "One guard—younger, with a kind face beneath his helmet—smothers a smile and bows deeply to her. He cracks the door open and murmurs something in Italian. There is a flutter of female voices within, and then Lucia's voice cuts through, sharp with curiosity:"
        },
        {
          "speaker": "lucia_ferrarese",
          "text": "Catalina? By herself?"
        },
        {
          "speaker": "narrator",
          "text": "The door swings wide. Lucia stands in the entrance, dressed simply for an afternoon indoors, her dark hair loose around her shoulders. Behind her, the Italian ladies peer out with expressions of delighted surprise."
        },
        {
          "speaker": "lucia_ferrarese",
          "text": "Princess Catalina. To what do I owe this honor?"
        },
        {
          "speaker": "narrator",
          "text": "Catalina clasps her hands in front of her, takes a deep breath, and delivers her petition:"
        },
        {
          "speaker": "catalina",
          "text": "Lucia. Will you please come riding with me? On Tormenta? I will hold on very tight and I will not pull her hair. Maybe only a little pull. To say hello. Papá said I could ask you."
        },
        {
          "speaker": "juan_ii",
          "text": "Well...It seems the princess has delivered a petition. O how shall the lady respond?"
        },
        {
          "speaker": "lucia_ferrarese",
          "text": "A royal petition! Delivered in person by the Princess of Asturias herself! I see the King of Castile has sent his most formidable ambassador."
        },
        {
          "speaker": "narrator",
          "text": "She drops to one knee, bringing herself to Catalina's level—a gesture that makes the Italian ladies behind her exchange knowing glances."
        },
        {
          "speaker": "lucia_ferrarese",
          "text": "Your Highness, I am deeply honored by your invitation. However, I must ask certain questions before I can render my decision. This is how diplomacy works, you understand. First: Will there be fast riding, or slow riding? Tormenta prefers to go fast, but I am told princesses must be careful."
        },
        {
          "speaker": "catalina",
          "text": "Slow. Maybe... a little fast? Just once?"
        },
        {
          "speaker": "lucia_ferrarese",
          "text": "Second: If Tormenta's mane is very soft and beautiful, am I to understand that you will only pull it gently, to say hello, and not yank it like a bell-rope?"
        },
        {
          "speaker": "catalina",
          "text": "Gentle. Very gentle. Like... like petting a gato."
        },
        {
          "speaker": "lucia_ferrarese",
          "text": "A cat. Acceptable. And third, most important: After our ride, will the princess share a crostata with me? Diplomacy requires the sharing of sweets. It is an ancient tradition."
        },
        {
          "speaker": "catalina",
          "text": "Yes! I will share! I promise!"
        },
        {
          "speaker": "lucia_ferrarese",
          "text": "Then the lady accepts the petition. Let me change into my riding clothes, and we shall away to the stables. With your permission, Your Majesty? I believe I have been summoned by a higher authority."
        },
        {
          "speaker": "juan_ii",
          "text": "And should the princess change into riding clothes as well? I think she should. Come, lets get changed."
        },
        {
          "speaker": "catalina",
          "text": "But Papá, this dress is fine. It is not even very dirty."
        },
        {
          "speaker": "lucia_ferrarese",
          "text": "Perhaps the princess might consider that Tormenta is a very elegant horse. And elegant horses prefer riders who wear their riding clothes. It is a matter of respect."
        },
        {
          "speaker": "catalina",
          "text": "You are not wearing riding clothes."
        },
        {
          "speaker": "lucia_ferrarese",
          "text": "No. Which is why I must also change. We shall both change into our riding clothes, and then we shall both be elegant enough for Tormenta. Do you see? It is only fair."
        },
        {
          "speaker": "catalina",
          "text": "Oh. Oh. Yes. We will both change. Because of Tormenta. Come, Papá. We must be quick. Lucia is waiting."
        }
      ],
      "roll": null,
      "recap": "Princess Catalina embarks on an independent mission to find Lucia and invite her riding. After navigating the Alcázar corridors with Juan's help, she formally presents her petition to Lucia, who accepts with diplomatic ceremony. The encounter showcases Catalina's growing independence and the warm relationship developing between her and Lucia."
    },
    {
      "id": "evt_1433_00237",
      "type": "domestic_event",
      "date": "1433-11-14",
      "end_date": null,
      "location": "Toledo, Countryside",
      "participants": [
        "juan_ii",
        "lucia",
        "catalina"
      ],
      "exchanges": [
        {
          "speaker": "narrator",
          "text": "The nursery transformation is swift—Doña Beatriz, summoned by a servant, produces a smaller, sturdier dress of brown wool that she calls Catalina's \"adventure dress.\" Catalina submits to the change with unusual patience, motivated entirely by the promise of riding with Lucia."
        },
        {
          "speaker": "catalina",
          "text": "Quickly, Doña Beatriz. Tormenta is waiting."
        },
        {
          "speaker": "narrator",
          "text": "By the time you reach the stables, Lucia is already there, transformed back into her green riding habit. Tormenta stamps and tosses her head, sensing activity, her black coat gleaming in the afternoon light. You lift Catalina up first. She is lighter than a sack of grain, and you settle her onto the saddle in front of where Lucia will sit."
        },
        {
          "speaker": "juan_ii",
          "text": "Hold tight."
        },
        {
          "speaker": "catalina",
          "text": "I know, Papá."
        },
        {
          "speaker": "narrator",
          "text": "Lucia mounts behind her with practiced grace, her arms coming around Catalina to take the reins, creating the same protective cage you form when riding with her on Hidalgo. Catalina leans back against Lucia's chest, looking up at her with absolute trust."
        },
        {
          "speaker": "catalina",
          "text": "I am ready."
        },
        {
          "speaker": "lucia",
          "text": "Where shall we ride, Your Majesty? The princess and I await your command."
        },
        {
          "speaker": "narrator",
          "text": "You lead the small procession through Toledo's winding streets, Hidalgo's hooves ringing on the cobblestones. Citizens bow and step aside as you pass—their king, the Italian lady who will soon be queen, and the small princess perched before her like a figurehead on a ship's prow."
        },
        {
          "speaker": "catalina",
          "text": "Look, Lucia, a dog! And that man has bread! So much bread! Why does he have so much bread?"
        },
        {
          "speaker": "narrator",
          "text": "Once through the gates and across the bridge, the road opens before you. The November afternoon is crisp and clear, the olive groves giving way to open fields where farmers have finished the autumn harvest. You turn Hidalgo off the main road onto a cart track that runs between fallow fields. The ground here is firm and level—good footing for horses, safe enough for a faster pace."
        },
        {
          "speaker": "juan_ii",
          "text": "Ready?"
        },
        {
          "speaker": "catalina",
          "text": "Fast now, Papá? Can we go fast?"
        },
        {
          "speaker": "lucia",
          "text": "Ready."
        },
        {
          "speaker": "narrator",
          "text": "Hidalgo surges forward, his powerful stride eating up the ground. You hold him to a collected canter—faster than the sedate walk of the city streets, slow enough for control. Beside you, Lucia gives Tormenta her head. The black mare leaps forward eagerly, matching Hidalgo's pace with evident joy. And between Lucia's arms, Catalina shrieks. Not with fear—with pure, unbridled delight."
        },
        {
          "speaker": "catalina",
          "text": "FAST! We're going FAST, Papá!"
        },
        {
          "speaker": "lucia",
          "text": "She's a natural! Feel how she moves with the horse!"
        },
        {
          "speaker": "catalina",
          "text": "More! Faster, Lucia! Faster!"
        },
        {
          "speaker": "narrator",
          "text": "You look across at Lucia. Her arms are locked firmly around Catalina, the child pressed securely against her chest. Lucia meets your gaze and gives a single sharp nod—she's safe, I have her. You lean forward in the saddle and touch your spurs to Hidalgo's flanks. The destrier explodes beneath you. Behind you, Lucia gives Tormenta her head. The black mare surges forward, her competitive spirit ignited by Hidalgo's challenge."
        },
        {
          "speaker": "catalina",
          "text": "PAPÁÁÁÁÁ!"
        },
        {
          "speaker": "narrator",
          "text": "Tormenta pulls alongside Hidalgo, and for a moment you ride neck and neck, grey and black, king and future queen, with a nineteen-month-old princess laughing between you like the world has never contained anything so wonderful as this single moment."
        },
        {
          "speaker": "juan_ii",
          "text": "How was that Catalina? Did you go fast?"
        },
        {
          "speaker": "catalina",
          "text": "So fast. So fast, Papá. We were... we were like birds."
        },
        {
          "speaker": "catalina",
          "text": "Lucia. Tormenta is the best horse."
        },
        {
          "speaker": "lucia",
          "text": "Better than Hidalgo?"
        },
        {
          "speaker": "catalina",
          "text": "They are both best. Hidalgo is best for Papá. Tormenta is best for me and Lucia. Can we do it again?"
        },
        {
          "speaker": "narrator",
          "text": "Without waiting for an answer, you give Hidalgo the spurs and sprint back the way you came. You hear Catalina's outraged shriek behind you—\"PAPÁ! WAIT!\"—and then the thunder of Tormenta's hooves as Lucia gives chase."
        },
        {
          "speaker": "catalina",
          "text": "FASTER, Tormenta! We have to catch Papá! FASTER!"
        },
        {
          "speaker": "catalina",
          "text": "We're CATCHING you!"
        },
        {
          "speaker": "lucia",
          "text": "The King of Castile, fleeing before a toddler and an Italian! What would the chronicles say?"
        },
        {
          "speaker": "narrator",
          "text": "You rein Hidalgo in, letting the grey destrier slow to a canter, then a trot, then a walk. Tormenta thunders past you, and Lucia has to circle the black mare twice before bringing her to a stop."
        },
        {
          "speaker": "catalina",
          "text": "We won! We won, Papá! Tormenta is the FASTEST!"
        },
        {
          "speaker": "juan_ii",
          "text": "So it would seem."
        },
        {
          "speaker": "lucia",
          "text": "You let us win."
        },
        {
          "speaker": "juan_ii",
          "text": "I wanted to be careful with Catalina. This is her first fast ride. Besides...I would gladly lose against you Lucia. How is she doing?"
        },
        {
          "speaker": "lucia",
          "text": "She is remarkable, Juan. Most children her age would be terrified. Or at least crying for their nurse by now. But she wanted more. When you sprinted ahead, she did not scream with fear. She urged Tormenta to chase you. She competed. Her seat is natural. She moves with the horse without being taught. And her courage... That is not something that can be trained into a child. That comes from somewhere deeper."
        },
        {
          "speaker": "catalina",
          "text": "Lucia, is Tormenta tired? She is breathing very loud."
        },
        {
          "speaker": "lucia",
          "text": "She is tired, little one. We ran very fast. She needs to rest."
        },
        {
          "speaker": "catalina",
          "text": "Good girl, Tormenta. You are very brave. You can rest now."
        },
        {
          "speaker": "lucia",
          "text": "She will not remember Isabel. Not truly. She is too young. But Isabel is in her, Juan. I can see it. The warmth. The fearlessness. The way she loves without reservation."
        },
        {
          "speaker": "juan_ii",
          "text": "Tell me about your mother Lucia. Have you inherited your mother's beauty?"
        },
        {
          "speaker": "lucia",
          "text": "My mother was considered the beauty of Ferrara in her youth. Dark hair, like mine. Grey eyes—though hers were softer, I think. Less sharp. She had a way of looking at people that made them feel seen. Valued."
        }
      ],
      "roll": null,
      "recap": "Juan takes Catalina and Lucia on a riding expedition to the countryside outside Toledo. Catalina shows remarkable courage and natural horsemanship during her first fast ride, delighting in the speed and competition. The outing strengthens the bond between Lucia and Catalina, with Lucia noting how the child has inherited Isabel's fearlessness and capacity for love. The event ends with intimate conversation about family and heritage."
    },
    {
      "id": "evt_1433_00238",
      "type": "military_inspection",
      "date": "1433-11-15",
      "end_date": null,
      "location": "Toledo, Royal War Academy",
      "participants": [
        "juan_ii",
        "thomas_beaumont"
      ],
      "exchanges": [
        {
          "speaker": "narrator",
          "text": "The Royal War Academy has taken residence in a former monastery on Toledo's eastern slope, its cloisters converted to training yards, its cells to barracks, its refectory to a great hall where officers gather for instruction. The monks were relocated—generously compensated—and the building now rings with the clash of steel rather than the chanting of psalms. You arrive without fanfare, accompanied only by two guards. Sir Thomas Beaumont meets you at the gate, his weathered English face creasing with surprise and pleasure."
        },
        {
          "speaker": "thomas_beaumont",
          "text": "Your Majesty. I did not expect— You honor us."
        },
        {
          "speaker": "juan_ii",
          "text": "I wished to observe. Show me what you have built."
        },
        {
          "speaker": "narrator",
          "text": "Sir Thomas leads you through the grounds, explaining as you walk. The academy currently houses forty-seven students—young men drawn from noble families across Castile, Aragon, and even a handful from Portugal. They range from seventeen to twenty-five years of age, some already blooded in the Granada campaign, others fresh from their fathers' estates with nothing but ambition and family names."
        },
        {
          "speaker": "thomas_beaumont",
          "text": "We teach them in three streams. Horsemanship and cavalry tactics. Infantry command and siege craft. And the new arts. Gunpowder. Artillery. The weapons that will define the wars to come."
        },
        {
          "speaker": "narrator",
          "text": "You watch the drill in silence. The students move with varying degrees of competence—some crisp and confident, others still fumbling through the formations."
        },
        {
          "speaker": "juan_ii",
          "text": "How do they fare?"
        },
        {
          "speaker": "thomas_beaumont",
          "text": "The Castilians are proud. Sometimes too proud to learn. The Aragonese are clever but clannish—they stick together and resist mixing with the others. The Portuguese... There are only three, but they work hard. The greatest challenge, Your Majesty, is teaching them to think. Any fool can swing a sword. But reading a battlefield, anticipating an enemy's movements, knowing when to press and when to withdraw—that requires a different kind of training."
        },
        {
          "speaker": "juan_ii",
          "text": "We will soon be departing with 700 additional soldiers to Constantinople, preferably led by cadets of the academy. They will be facing the Ottomans. You think some are ready to be put to the test?"
        },
        {
          "speaker": "thomas_beaumont",
          "text": "The Ottomans. Your Majesty, I have never faced them myself, but I have spoken with men who have. Hungarians. Venetians. Knights of Rhodes who passed through England in my youth. They are not like the Moors of Granada. The Granadan army was brave, but fractured—tribal loyalties, factional disputes, commanders who would not coordinate. The Ottomans... They are professional. Disciplined. Their janissaries train from childhood. Their cavalry can feign retreat and draw you into ambush with terrifying precision. Their commanders study war as scholars study scripture."
        },
        {
          "speaker": "thomas_beaumont",
          "text": "To answer your question, Your Majesty: yes, some of my cadets are ready to fight. Perhaps a dozen have the skill and temperament to lead men in battle. But ready to face the Ottomans? That is a harder question. See the tall one there, with the red sash? Don Álvaro de Zúñiga's second son. Excellent horseman, quick mind, men follow him naturally. He commanded a company at Málaga—acquitted himself well. He could lead a hundred lances and not disgrace himself. The stocky one beside him—Rodrigo Manrique. Slower to learn, but steady. He does not panic. In a siege, holding a wall, you want men like him. I could give you eight, perhaps ten, who are ready for real command. Another fifteen who could serve as junior officers under experienced captains. But Your Majesty... Constantinople is not a training ground. If you send boys to learn war against the Ottomans, many of them will learn only how to die."
        },
        {
          "speaker": "juan_ii",
          "text": "Let me put it differently Thomas. I am sending 700 knights from the orders to Constantinople next spring. How best can the war academy be involved?"
        },
        {
          "speaker": "thomas_beaumont",
          "text": "Ah. That is a different matter entirely. The Military Order knights are experienced soldiers—they know how to fight, how to hold discipline, how to follow commands. What they lack is knowledge of Ottoman warfare specifically. Their experience is against the Moors, who fight differently. First: I could assign my best cadets as observers, not commanders. Attach them to the Order captains, let them watch, learn, record. They study Ottoman tactics firsthand and bring that knowledge back to the academy. We build a library of experience for future campaigns. Second: Before the expedition departs, I could conduct intensive instruction for the Order officers themselves—a week, perhaps two, on what we know of Ottoman methods. The feigned retreats. The horse archery. The janissary formations. János Hunyadi's letters have been... invaluable. The man knows his enemy. I have been translating his observations into training exercises. Third: When the expedition returns—God willing, when, not if—we debrief every officer extensively. What worked. What failed. What surprised them. That knowledge becomes the foundation for training the next generation. The academy should not try to lead this expedition, Your Majesty. The Order masters would rightly resent boys commanding veterans. But we can learn from it. We can prepare those who go. And we can ensure that the blood spent in Constantinople purchases wisdom for Castile. There is one more thing. If Your Majesty permits."
        },
        {
          "speaker": "juan_ii",
          "text": "Tell me."
        },
        {
          "speaker": "thomas_beaumont",
          "text": "When I trained knights in England, and later when I served with the French, I saw the same pattern repeat itself. Experienced soldiers return from campaign, and their knowledge... scatters. They go back to their estates, their garrisons, their families. What they learned dies with them, or survives only in tavern stories. The Ottomans do not make this mistake. Their janissaries train together, fight together, teach together. Knowledge passes from veteran to recruit in an unbroken chain. It is one of the reasons they are so formidable. When your seven hundred return from Constantinople, I would ask Your Majesty's permission to keep some of them. Not permanently—perhaps six months, a year. The best of them, the ones who learned the most. Let them teach at the academy. Let them drill the cadets in what they saw, what they faced, what they survived. Knights do not like to teach. They think it beneath them. But if it came as a royal command—a mark of honor, to be selected as an instructor at the King's own academy... Pride can be redirected, if you know how to push it. In five years, Your Majesty, I could give you officers who have never seen an Ottoman but know how to fight them. In ten years, I could give you an army that does not need to learn on the battlefield—because the lessons have already been paid for in other men's blood."
        },
        {
          "speaker": "juan_ii",
          "text": "Good idea. I will send for the orders to assemble their command at Toledo well before departure so their commanders may be involved with the academy before departure. We will attach the cadets as observers. And I will seek to reform the orders to adopt a system to preserve knowledge. I return to Alvaro and tell him to write to the orders. Include an invitation for the order masters to come to me and to start preparing the 700 soldiers in anticipation of our decision to send them to Constantinople, but make clear that we still have to decide this together. There has been intelligence from Morocco and Constantinople so we can now develop our strategy together."
        }
      ],
      "roll": null,
      "recap": "Juan inspects the War Academy and discusses the planned Constantinople expedition with Sir Thomas Beaumont. They develop a strategy to involve academy cadets as observers rather than commanders, conduct pre-departure training for Order knights on Ottoman tactics, and establish a system for preserving battlefield knowledge through veteran instructors at the academy."
    },
    {
      "id": "evt_1433_00239",
      "type": "decision",
      "date": "1433-11-15",
      "end_date": null,
      "location": "Toledo, Alcázar",
      "participants": [
        "juan_ii",
        "alvaro_de_luna"
      ],
      "exchanges": [
        {
          "speaker": "juan_ii",
          "text": "Good idea. I will send for the orders to assemble their command at Toledo well before departure so their commanders may be involved with the academy before departure. We will attach the cadets as observers. And I will seek to reform the orders to adopt a system to preserve knowledge. I return to Alvaro and tell him to write to the orders. Include an invitation for the order masters to come to me and to start preparing the 700 soldiers in anticipation of our decision to send them to Constantinople, but make clear that we still have to decide this together. There has been intelligence from Morocco and Constantinople so we can now develop our strategy together."
        },
        {
          "speaker": "narrator",
          "text": "Álvaro receives your instructions in his study, making careful notes as you speak. The afternoon light slants through the windows, illuminating the ever-present stacks of correspondence on his desk."
        },
        {
          "speaker": "alvaro_de_luna",
          "text": "It shall be done, Your Majesty. I will write to Don Luis de Guzmán of Santiago, Don Pedro González de Padilla of Calatrava, and Don Juan de Sotomayor of Alcántara. The letters will go out today."
        },
        {
          "speaker": "alvaro_de_luna",
          "text": "To summarize: an invitation to Toledo, framed as consultation rather than command. We inform them that intelligence has arrived from Morocco and Constantinople—though we do not detail the contents in writing. We request they begin preparing their knights for potential deployment, while emphasizing that the final decision will be made jointly."
        },
        {
          "speaker": "narrator",
          "text": "He taps the quill against the paper thoughtfully."
        },
        {
          "speaker": "alvaro_de_luna",
          "text": "The timing is fortunate, Your Majesty. With your wedding on December 3rd, the Masters may arrive for the ceremony and remain for the strategic discussions afterward. It gives them reason to come without appearing to be summoned like servants."
        },
        {
          "speaker": "alvaro_de_luna",
          "text": "Shall I mention Sir Thomas's proposal regarding the academy—the intensive instruction before departure, the attachment of cadets as observers? Or do you wish to present that yourself when they arrive?"
        },
        {
          "speaker": "narrator",
          "text": "He sets down the quill and folds his hands."
        },
        {
          "speaker": "alvaro_de_luna",
          "text": "Also, Your Majesty should know: a letter arrived this morning from Fray Hernando. He requests an audience at your convenience. He did not specify the subject, but... He mentioned it concerned a spiritual matter he wished to discuss before the wedding."
        },
        {
          "speaker": "juan_ii",
          "text": "Leave out Thomas for now, we will discuss in time with them. I will go to Hernando myself now."
        },
        {
          "speaker": "narrator",
          "text": "Álvaro nods, making a final note."
        }
      ],
      "roll": null,
      "recap": "Juan instructs Álvaro to write to the military order masters, inviting them to Toledo for strategic discussions about the potential Constantinople deployment. The letters will frame this as consultation rather than command, mentioning new intelligence from Morocco and Constantinople. Álvaro suggests timing the meeting around Juan's wedding on December 3rd, and mentions that Fray Hernando has requested an audience about a spiritual matter."
    },
    {
      "id": "evt_1433_00240",
      "type": "religious_event",
      "date": "1433-11-16",
      "end_date": null,
      "location": "Toledo, Royal Chapel",
      "participants": [
        "juan_ii",
        "fray_hernando"
      ],
      "exchanges": [
        {
          "speaker": "narrator",
          "text": "You find Fray Hernando in the small chapel adjacent to the royal apartments—the same chapel where you have confessed to him countless times over the years, where he has guided you through crises of faith and conscience, where he refused you absolution in Basel when your soul needed correction more than comfort. He kneels before the altar, his Franciscan robes pooling on the cold stone floor. The chapel is dim, lit only by candles and the fading afternoon light filtering through narrow windows. The air smells of incense and beeswax."
        },
        {
          "speaker": "fray_hernando",
          "text": "Your Majesty, thank you for coming. I wished to speak with you before the wedding. Not as your confessor—unless you wish to confess—but as... As a friend, perhaps. If a friar may presume to call a king his friend. I have been watching you with the Lady Lucia. With Catalina. With the court. I have observations. And I have concerns. Will you hear them?"
        },
        {
          "speaker": "juan_ii",
          "text": "Of course friend, let us sit together. I have always valued your company and yes, you are my friend. What is on your mind?"
        },
        {
          "speaker": "fray_hernando",
          "text": "I will speak plainly, as I always have with you. And I ask that you hear me fully before you respond. When I first became your confessor, you were a young man trapped in your own palace—a king in name only, surrounded by those who used you for their own ends. I watched you break free of that cage through courage, cunning, and genuine faith. You have grown into a remarkable king, Juan. Perhaps a great one. But I must ask you something, and I ask it as a friend who has walked with you through darkness and light. It has been mere days since you met this woman. Days. And already you speak of her as though she were your partner in all things. So I ask you, not as your confessor but as your friend: Do you love this woman? Or do you love what she represents?"
        },
        {
          "speaker": "juan_ii",
          "text": "Isabel's shadow hangs over me still fray. And I have addressed this immediately with Lucia as well. I arranged to re-marry soon for two reasons. First; succession. I need another son and so does the realm. And secondly, Catalina has taken the loss of her mama very well, but I wanted to give her someone who could love her like a mother soon. Right after Isabel's death, I was so very angry Fray. Angry at God as well. Going on rides with Catalina and Lucia not replaces Isabel, but we are making new memories and gives us a space to be happy. Catalina needs taking care of, needs to be educated and needs to explore the world. I have found that when I just focus on that task, everything falls into place naturally."
        },
        {
          "speaker": "fray_hernando",
          "text": "I remember your anger. After Isabel died. You raged at God in this very chapel. I stood outside the door and listened, and I did not intervene. Because it was honest. That is when I knew your faith was real, Juan. And now I see something different. Not anger. Not performance. But healing. Quiet healing. You speak of focusing on Catalina, on the task before you, and letting everything else fall into place. This is wisdom, Juan. Have you spoken to Lucia about Isabel? Truly spoken—not merely acknowledged that she existed, but shared who she was?"
        },
        {
          "speaker": "juan_ii",
          "text": "No, not really. She has expressed that Isabel must have been an incredible woman. She was. I found it difficult Fray to make Lucia feel welcome and not compare her to my late wife. She is her own person, very different from Isabel. Comparing her with or talking a lot about Isabel felt unfair to her. But you are right. Maybe the time is ripe for us to have this conversation now."
        },
        {
          "speaker": "fray_hernando",
          "text": "You show wisdom in this, Juan. And kindness—to recognize that Lucia deserves to be seen for herself, not measured against a ghost. But consider this: by not speaking of Isabel, you may inadvertently make her shadow loom larger, not smaller. If you do not fill those spaces with truth, Lucia will fill them with imagination. Isabel would want this, Juan. She loved you enough to want you happy. And happiness, true happiness, requires wholeness—not the careful partitioning of your heart into rooms that your new wife may not enter."
        },
        {
          "speaker": "juan_ii",
          "text": "I will Fray, thank you. Shall we pray together? The Constantinople campaign is on my mind a lot. Help me face this challenge with the same honesty and humility that has brought me success in the past."
        },
        {
          "speaker": "narrator",
          "text": "He rises from the bench and moves to kneel before the altar. You join him, the cold stone pressing through the fabric of your clothing, the familiar discomfort of supplication. The candles flicker, casting dancing shadows across the simple wooden cross that hangs above."
        },
        {
          "speaker": "fray_hernando",
          "text": "Heavenly Father, we come before You as we are—not as kings or priests, but as men. Flawed, uncertain, reaching toward Your light through the darkness of our own limitations. Your servant Juan faces a task that stretches beyond the borders of his realm, beyond the familiar fields of his victories. Constantinople calls—an ancient city, a wounded church, a people crying out for deliverance. Grant him wisdom to know when to act and when to wait. Grant him humility to listen to counsel, even when it contradicts his own vision. Grant him courage to face what must be faced, and grace to accept what cannot be changed. And Lord, guard his heart against the seductions of glory. Let him remember always that he is Your instrument, not Your equal. Juan. Speak to Him. In your own words. He is listening."
        }
      ],
      "roll": null,
      "recap": "Fray Hernando counsels Juan before his wedding to Lucia, expressing concerns about the speed of their courtship while affirming Juan's spiritual growth. They discuss Juan's grief over Isabel and the importance of sharing memories with his new bride. The session concludes with prayer for the upcoming Constantinople campaign, focusing on humility and divine guidance."
    },
    {
      "id": "evt_1433_00241",
      "type": "marriage",
      "date": "1433-12-03",
      "end_date": null,
      "location": "Toledo, Cathedral",
      "participants": [
        "juan_ii",
        "lucia",
        "archbishop_alonso_de_toledo",
        "alvaro_de_luna",
        "inigo_lopez_de_mendoza",
        "catalina"
      ],
      "exchanges": [
        {
          "speaker": "narrator",
          "text": "The great cathedral is transformed. Thousands of candles blaze from every surface, their light catching the gold leaf of the altarpiece, the jeweled vestments of the clergy, the silks and velvets of the assembled nobility. The air is thick with incense and the scent of winter flowers—roses brought at tremendous expense from somewhere that still grows them, white lilies, branches of evergreen."
        },
        {
          "speaker": "narrator",
          "text": "The doors open. Lucia enters on the arm of Don Íñigo, who once again has been granted the honor of escorting her. She wears a gown of white silk embroidered with silver stars, the colors of the Virgin, of purity, of Ferrara's night sky. A veil of delicate lace covers her dark hair, held in place by a circlet of pearls. She carries no flowers—only the sapphire ring on her finger, catching the candlelight with each step."
        },
        {
          "speaker": "archbishop_alonso_de_toledo",
          "text": "Dearly beloved, we are gathered in the sight of God and this congregation to join this man and this woman in holy matrimony..."
        },
        {
          "speaker": "juan_ii",
          "text": "I, Juan, take thee, Lucia, to be my wedded wife. To have and to hold, from this day forward, for better for worse, for richer for poorer, in sickness and in health, to love and to cherish, till death us do part, according to God's holy ordinance; and thereto I plight thee my troth."
        },
        {
          "speaker": "lucia",
          "text": "I, Lucia, take thee, Juan, to be my wedded husband. To have and to hold, from this day forward, for better for worse, for richer for poorer, in sickness and in health, to love, cherish, and obey, till death us do part, according to God's holy ordinance; and thereto I give thee my troth."
        },
        {
          "speaker": "archbishop_alonso_de_toledo",
          "text": "Those whom God hath joined together, let no man put asunder. I pronounce that they be man and wife together, in the name of the Father, and of the Son, and of the Holy Ghost. Amen."
        },
        {
          "speaker": "narrator",
          "text": "The cathedral erupts. 'VIVAT REX JUAN! VIVAT REGINA LUCIA!' And then Lucia is in your arms, her veil pushed back, her lips meeting yours as the bells of Toledo ring out across the city, across the kingdom, carrying the news to every corner of Castile: The King has taken a Queen."
        },
        {
          "speaker": "catalina",
          "text": "Papá, Lucia is pretty."
        },
        {
          "speaker": "juan_ii",
          "text": "Yes, she is."
        },
        {
          "speaker": "catalina",
          "text": "She is ours now?"
        },
        {
          "speaker": "juan_ii",
          "text": "Yes, little one. She is ours now."
        },
        {
          "speaker": "catalina",
          "text": "Good. I like her."
        },
        {
          "speaker": "alvaro_de_luna",
          "text": "Your Majesty. Your Grace. The hour grows late. The bridal chamber has been prepared."
        }
      ],
      "roll": null,
      "recap": "King Juan II marries Lucia of Ferrara in Toledo's cathedral before the assembled nobility of Castile. After exchanging vows blessed by Archbishop Alonso, they celebrate with a great feast where young Catalina expresses her approval of her new stepmother. The royal couple then retires to consummate their marriage."
    },
    {
      "id": "evt_1433_00242",
      "type": "relationship_change",
      "date": "1433-12-03",
      "end_date": null,
      "location": "Toledo, Royal Chambers",
      "participants": [
        "juan_ii",
        "lucia"
      ],
      "exchanges": [
        {
          "speaker": "narrator",
          "text": "The bridal chamber glows with candlelight, the great bed draped in silks, rose petals scattered across the floor. Someone has left wine and sweetmeats on a small table, though neither of you reaches for them. Lucia stands before you, her veil already removed, her dark hair loose around her shoulders. The sharp wit, the political calculation, the careful armor she has worn since arriving in Castile—all of it falls away as the door closes."
        },
        {
          "speaker": "lucia",
          "text": "Husband"
        },
        {
          "speaker": "juan_ii",
          "text": "Wife"
        },
        {
          "speaker": "narrator",
          "text": "What follows is private—a sacrament between two souls now joined before God, a conversation without words, a knowing and being known that belongs to the marriage bed alone. Afterward. The candles have burned low. Through the window, the first grey light of dawn touches the sky over Toledo. The celebrations in the city have finally quieted, the revelers gone home or collapsed where they fell. Lucia lies beside you, her head resting on your chest, her fingers tracing idle patterns on your skin."
        },
        {
          "speaker": "lucia",
          "text": "I was afraid. Not of you. Of... this. Of being known so completely. In Ferrara, I learned to hide everything. To show only what I wished to be seen. I do not wish to hide from you, Juan. Not anymore. Tell me something. Something true. Something you have never told anyone."
        },
        {
          "speaker": "juan_ii",
          "text": "I have never known my parents. I know them from the stories. Stories about them and other kings. I want to be a good king. A strong king. Like those in the stories about the great kings of old. Somehow I never seem to match up to them. But I will eventually."
        },
        {
          "speaker": "lucia",
          "text": "You speak of the kings in stories. But have you considered, Juan, that those stories were written after? That the men who lived them were just as uncertain, just as flawed, just as afraid of falling short as you are now? The chroniclers polish away the doubt. They remove the nights when a king lay awake wondering if he had made the right choice. I have known you for less than a month, Juan. And in that time, I have seen you race across a field with your daughter laughing in your arms. I have seen you kneel on a nursery floor to build block towers. The great kings of the stories—did any of them conquer Granada before their thirtieth year? Did any of them win the love of their nobles by carrying a child among them at a feast? You do not need to match the stories, husband. Someday, they will write stories about you. And some young king, centuries hence, will lie awake at night wondering how he could ever hope to be as great as Juan II of Castile. But I will know the truth. I will know that he was a man who worried he was not enough. And I will love him for it."
        },
        {
          "speaker": "juan_ii",
          "text": "You know something else? I just realized that you are older than me. That means you should be wiser as well. I must be careful that an older woman will not impress me too much and wrap me around her finger."
        },
        {
          "speaker": "lucia",
          "text": "Older? I am twenty-three, you impossible man. You are—what—twenty-eight? Twenty-nine? Wait. How old are you? I confess I never thought to ask. In Ferrara, they told me the King of Castile was young and brilliant and possibly mad. They did not mention he was a child who would tease his wife about her advanced years on their wedding night. I should warn you, husband—I have six Italian ladies who are entirely loyal to me, and Donna Francesca knows seventeen different ways to make a man regret his words."
        },
        {
          "speaker": "juan_ii",
          "text": "I am twenty one, turning twenty two next year. I was eighteen when I went on crusade."
        },
        {
          "speaker": "lucia",
          "text": "Twenty-one? You were eighteen when you knelt before the Pope? Eighteen when you conquered Granada? Dio mio. I have married a boy. The courts of Italy will never let me live this down. Lucia d'Este, the great beauty of Ferrara, ensnared by a child-king barely old enough to grow a proper beard. What were you like, Juan? At eighteen? Before all of this?"
        },
        {
          "speaker": "juan_ii",
          "text": "Like I told you in the garden. I had no power or independance at all. I knew I had to do something. But there was something else as well. I sometimes just know I have to do something. 'It must be done', I tell myself. I feel that pull whenever I am about to do something important. I know that eventually, I will drive out the Ottomans from europe and take control of an empire. They will become part of my kingdom and you Lucia will help me do it. You will be my queen and hold my court when I am away. Me on the battlefield, you on the throne in the court. And together we will lift it all closer to God."
        },
        {
          "speaker": "lucia",
          "text": "When you say these things... when you speak of empires and driving out the Ottomans and lifting the world closer to God... Do you hear yourself, Juan? Any other man, I would think him mad. But you... you mean it. Every word. And the terrifying thing is that I believe you. What if it is real, Juan? What if God truly has marked you for something beyond what any king has achieved in a thousand years? Promise me something. Promise me that if this pull, this certainty, ever leads you toward something monstrous—something that would damn your soul or destroy everything you love—you will stop. Promise me you will remain the man who knelt in a garden and whispered his dreams to a woman he barely knew."
        },
        {
          "speaker": "juan_ii",
          "text": "Lucia, I did not choose you to be a decoration on the wall. I am telling you because I want us to share this dream together. I will make you a queen Lucia. You have no idea yet of what you are capable of. Your sharp mind will serve you well. You will learn to command. I will enjoy seeing you develop into this role. Now that you are my wife, your old life is over."
        },
        {
          "speaker": "lucia",
          "text": "You see me. You actually see me. All my life, men have looked at me and seen... a prize. A beauty to be won. But you look at me and see someone I have not yet become. Someone I did not know I could be. You want to make me a queen. Not a decoration—a queen. Someone who commands, who rules, who stands beside you as an equal in all but name. Then teach me, husband. My old life is over, you say? Good. Let it burn. I am Lucia of Castile now. Your wife. Your queen. Your partner in an empire that does not yet exist. Show me what I can become."
        },
        {
          "speaker": "juan_ii",
          "text": "From now on, you will attend every meeting with me. You will know exactly what is going on so you can decide the course of the kingdom when I am away. Tomorrow, we will meet with Alvaro and the masters of Calatrava, Alcantrara, and santiago. We will discuss the coming campain to Constantinople. We need to convince the pope to reform, our first real test. Then we travel on to the eternal city by ship."
        },
        {
          "speaker": "lucia",
          "text": "Every meeting. Good. I will need to understand not just the decisions, but the men who make them. Complementary colors. Two sides of the same coin. In Ferrara, my aunt once told me that a ruler's clothing is armor of a different kind. Deep crimson, I think. Or perhaps cloth-of-gold. Something with structure. So. Tomorrow, the Masters. Then the courtiers of Toledo. Letters to the kingdom announcing my role. Then travel: Madrid first, then Valencia, then Rome by sea. The Pope. Reform. What exactly do you hope to achieve in Rome? Tell me about the Pope, about Basel, about what you need from Rome before Constantinople becomes possible."
        }
      ],
      "roll": null,
      "recap": "On their wedding night, Juan and Lucia consummate their marriage and share intimate confessions. Juan reveals his divine sense of purpose and grand ambitions for a Christian empire, while Lucia transforms from a guarded political pawn into his strategic partner. They plan their joint rule, with Lucia attending all meetings and serving as regent when Juan campaigns. Their partnership deepens into a shared vision of conquest and reform."
    },
    {
      "id": "evt_1433_00243",
      "type": "briefing",
      "date": "1433-12-04",
      "end_date": null,
      "location": "Toledo, Royal Chambers",
      "participants": [
        "juan_ii",
        "lucia",
        "catalina",
        "dona_beatriz"
      ],
      "exchanges": [
        {
          "speaker": "lucia",
          "text": "The Pope. Reform. What exactly do you hope to achieve in Rome? And what resistance do you expect? I know the Church is... fractured. Basel and Rome pulling in different directions. But I do not yet understand the full shape of it."
        },
        {
          "speaker": "lucia",
          "text": "Teach me, husband. Start now. We have—a few hours before the world demands us. Tell me about the Pope, about Basel, about what you need from Rome before Constantinople becomes possible."
        },
        {
          "speaker": "narrator",
          "text": "You rise and begin to dress, your body servants arriving to assist with the layers of clothing appropriate for a king the morning after his wedding. As they work, you explain the situation to Lucia, who listens from the bed, wrapped in silks, her sharp mind absorbing every detail. The Church is fractured. Pope Eugenius IV sits in Rome, but his authority is contested by the Council of Basel, which claims that a general council of the Church holds authority superior to any pope. The conciliarists at Basel push for reforms—limits on papal power, restrictions on benefices, an end to certain abuses—while Eugenius resists what he sees as an assault on the very foundations of papal supremacy. Castile has walked a careful line. Fray Hernando led your delegation at Basel with skill, positioning Castile as a moderate voice—supportive of genuine reform, but not hostile to papal authority. The situation with Constantinople complicates everything. The Byzantine Emperor desperately needs Western aid against the Ottomans, but he also needs Church unity—specifically, reunion between the Eastern and Western churches."
        },
        {
          "speaker": "lucia",
          "text": "So we need the Pope's blessing for Constantinople, but we cannot appear to be his creature, or we lose influence at Basel. And we need Basel's reform energy, but we cannot openly defy Rome, or we lose the Pope's support for the expedition."
        },
        {
          "speaker": "lucia",
          "text": "And I thought Ferrarese politics were complicated."
        },
        {
          "speaker": "narrator",
          "text": "The private dining chamber is warm, a fire crackling against the December chill. Catalina sits at the table, her feet dangling above the floor, attacking a crostata with determined enthusiasm. Doña Beatriz hovers nearby, ready to intervene against the worst excesses of toddler dining."
        },
        {
          "speaker": "catalina",
          "text": "Papá! Lucia! You are wearing the same colors."
        },
        {
          "speaker": "catalina",
          "text": "Good. Now you match. Like... like a set."
        },
        {
          "speaker": "narrator",
          "text": "Breakfast passes in comfortable domesticity. Catalina provides a running commentary on her crostata, on the weather outside, and on her plans for the day."
        },
        {
          "speaker": "catalina",
          "text": "This one has nuts, Papá. It is cold, the birds are hiding. I want to see Tormenta. Can Lucia take me to see Tormenta?"
        }
      ],
      "roll": null,
      "recap": "Juan briefs Lucia on the complex Church politics involving Rome and Basel while they dress after their wedding night, then they share breakfast with Catalina. Lucia quickly grasps the delicate balance needed between papal and conciliar factions for the Constantinople expedition."
    },
    {
      "id": "evt_1433_00244",
      "type": "decision",
      "date": "1433-12-04",
      "end_date": null,
      "location": "Toledo, Royal Chambers",
      "participants": [
        "juan_ii",
        "lucia",
        "catalina",
        "master_gonzalo_de_avila",
        "donna_francesca",
        "dona_beatriz"
      ],
      "exchanges": [
        {
          "speaker": "narrator",
          "text": "Breakfast passes in comfortable domesticity. Catalina provides a running commentary on her crostata, on the weather outside, and on her plans for the day. Lucia handles each pronouncement with patience and genuine warmth, promising they can visit Tormenta later, after the grown-ups attend to some boring matters first."
        },
        {
          "speaker": "catalina",
          "text": "Boring matters? What boring matters?"
        },
        {
          "speaker": "lucia",
          "text": "Clothes. Lots and lots of clothes."
        },
        {
          "speaker": "catalina",
          "text": "Can I have new clothes too?"
        },
        {
          "speaker": "lucia",
          "text": "You will have the best new clothes. Clothes that match Papá and me. So we all look like a set."
        },
        {
          "speaker": "narrator",
          "text": "By mid-morning, the royal chambers have been transformed into a workshop of fabrics and sketches. Master Gonzalo de Ávila—Toledo's finest tailor—arrives with assistants bearing bolts of cloth. He is joined by Donna Francesca, who coordinates Lucia's wardrobe. The two regard each other with the wary respect of professionals who recognize a rival's competence."
        },
        {
          "speaker": "master_gonzalo_de_avila",
          "text": "Your Majesties, I understand you wish to commission garments that... complement one another?"
        },
        {
          "speaker": "donna_francesca",
          "text": "In Ferrara, the Duke and Duchess often appear in coordinated attire for formal occasions. Not identical, but harmonious. The same palette, similar motifs, fabrics that speak to one another."
        },
        {
          "speaker": "master_gonzalo_de_avila",
          "text": "The Queen should not attempt to match armor directly—that would appear martial. Instead, she should complement it. Where the King shows strength through steel, the Queen shows strength through presence."
        },
        {
          "speaker": "lucia",
          "text": "High collars. Fitted sleeves. Nothing that impedes movement or suggests fragility. I am told I am to learn to command. I should look the part."
        },
        {
          "speaker": "catalina",
          "text": "I want red. Like Papá's sword-coat."
        },
        {
          "speaker": "juan_ii",
          "text": "I think the queen and the princess should look alike. What do you propose regarding formal wear when we are receiving nobles?"
        },
        {
          "speaker": "master_gonzalo_de_avila",
          "text": "For His Majesty: a doublet of deep crimson velvet, embroidered with the castles and lions of Castile in gold thread. For Her Majesty the Queen: a gown of the same crimson velvet, with cloth-of-gold accents. For the Princess: the same crimson, but in softer wool—a simplified version of the Queen's gown."
        },
        {
          "speaker": "donna_francesca",
          "text": "The effect, when all three stand together, will be unmistakable: the King in his strength, the Queen in her grace, and the Princess as the promise of the future. A dynasty, Your Majesty. Not merely a family."
        },
        {
          "speaker": "juan_ii",
          "text": "Great. So we have one set for when I wear armour. One official set in deep red and gold. And maybe a more informal set. Less heavy with gold and bold colours."
        },
        {
          "speaker": "master_gonzalo_de_avila",
          "text": "Three sets then, Your Majesty. First: The Martial Set. Second: The Formal Set. Third: The Informal Set. With Your Majesty's approval, we can begin work immediately."
        },
        {
          "speaker": "catalina",
          "text": "Lucia, will we really match?"
        },
        {
          "speaker": "juan_ii",
          "text": "Add wrappings in the same colour scheme for Fernando should Lucia carry him. Yes, you and Lucia will both look splendid in beautiful dresses. What do you think Lucia?"
        },
        {
          "speaker": "lucia",
          "text": "I think that I have never had a sister in matching dresses. And now I shall have something better—a daughter."
        },
        {
          "speaker": "catalina",
          "text": "Daughter? That means... Lucia is my mama now?"
        },
        {
          "speaker": "lucia",
          "text": "You had a mama, little one. A wonderful mama who loved you very much, and who is with God now. I am not here to replace her. But I am here now. And I will love you, and care for you, and match dresses with you. What would you like to call me?"
        },
        {
          "speaker": "catalina",
          "text": "Can I call you Lucia-mama? So I remember both?"
        },
        {
          "speaker": "juan_ii",
          "text": "Yes, Lucia-mama! See Catalina? This is how you treat a mama."
        },
        {
          "speaker": "narrator",
          "text": "Catalina watches with solemn attention, then marches over to Lucia and throws her small arms around her neck, squeezing with all her strength. She plants a wet, slightly off-center kiss on Lucia's cheek."
        },
        {
          "speaker": "catalina",
          "text": "Like that. That is how you treat a Lucia-mama."
        },
        {
          "speaker": "narrator",
          "text": "Lucia's composure breaks. Tears spill down her cheeks as she pulls Catalina close, burying her face in the child's dark hair."
        },
        {
          "speaker": "lucia",
          "text": "Yes, little one. Exactly like that."
        },
        {
          "speaker": "catalina",
          "text": "Don't cry, Lucia-mama. Crying is for when you are sad. This is happy."
        },
        {
          "speaker": "juan_ii",
          "text": "Great. I think you have your instructions, master clothier?"
        },
        {
          "speaker": "master_gonzalo_de_avila",
          "text": "I do, Your Majesty. Three sets of coordinated garments for the King, Queen, and Princess. Wrappings for Prince Fernando in matching colors. The formal crimson set as first priority."
        }
      ],
      "roll": null,
      "recap": "The royal family commissions three coordinated sets of formal wear from Master Gonzalo and Donna Francesca. During the fitting session, Catalina asks to call Lucia 'Lucia-mama,' leading to an emotional moment where the new family bonds are formally acknowledged through the child's innocent acceptance."
    },
    {
      "id": "evt_1433_00245",
      "type": "relationship_change",
      "date": "1433-12-04",
      "end_date": null,
      "location": "Toledo, Royal Chambers",
      "participants": [
        "juan_ii",
        "lucia",
        "catalina",
        "master_gonzalo",
        "dona_beatriz",
        "donna_francesca"
      ],
      "exchanges": [
        {
          "speaker": "narrator",
          "text": "Doña Beatriz has turned away, dabbing at her eyes with her sleeve. Even Master Gonzalo, that weathered professional, clears his throat gruffly and makes unnecessary adjustments to his fabric samples. Donna Francesca watches her mistress with an expression of quiet wonder—seeing perhaps a Lucia she has never seen before, one that the gilded cage of Ferrara never permitted to exist. Catalina, pleased with herself, pats Lucia's back with the clumsy comfort of a child who has seen adults do the same."
        },
        {
          "speaker": "catalina",
          "text": "Don't cry, Lucia-mama. Crying is for when you are sad. This is happy."
        },
        {
          "speaker": "juan_ii",
          "text": "Great. I think you have your instructions, master clothier?"
        },
        {
          "speaker": "master_gonzalo",
          "text": "I do, Your Majesty. Three sets of coordinated garments for the King, Queen, and Princess. Wrappings for Prince Fernando in matching colors. The formal crimson set as first priority. I will coordinate with Donna Francesca on the Queen's measurements and preferences, and with Doña Beatriz regarding the Princess's sizing."
        },
        {
          "speaker": "master_gonzalo",
          "text": "If I may say, Your Majesty—in thirty years of serving the crown, I have dressed your father and now you. I have made wedding garments and mourning clothes, coronation robes and battle surcoats. But I have never been asked to dress a family before. Only kings. It is an honor."
        },
        {
          "speaker": "narrator",
          "text": "He departs with his assistants, Donna Francesca following after a quick curtsey and a warm glance at Lucia, who still kneels on the floor with Catalina in her arms. The room settles into quiet. Morning light streams through the windows. Somewhere in the Alcázar, the business of the kingdom continues—letters to be written, councils to be held, a campaign to Constantinople to be planned. But for this moment, there is only this: your wife, your daughter, and the simple truth that Catalina spoke without knowing its depth. This is happy."
        },
        {
          "speaker": "dona_beatriz",
          "text": "Your Majesties, the Masters of the Military Orders await your pleasure in the council chamber. Don Álvaro sent word that they have assembled as requested."
        },
        {
          "speaker": "juan_ii",
          "text": "It's time for the grown ups to do some boring things. You can go with Dona Beatriz and play with your wooden horses and look at baby Fernando. We will be back later and then we can go ride real horses if you like."
        },
        {
          "speaker": "catalina",
          "text": "Very boring things?"
        },
        {
          "speaker": "juan_ii",
          "text": "Very boring."
        },
        {
          "speaker": "catalina",
          "text": "Okay, Papá. You do the boring things. I will watch Fernando. He is also boring. He just sleeps and cries."
        },
        {
          "speaker": "dona_beatriz",
          "text": "Come, Your Highness. Perhaps we can build a stable for your wooden horses while we wait."
        },
        {
          "speaker": "catalina",
          "text": "A stable? With hay?"
        },
        {
          "speaker": "dona_beatriz",
          "text": "We shall see what we can manage."
        },
        {
          "speaker": "catalina",
          "text": "Lucia-mama, you will come find me? After the boring?"
        },
        {
          "speaker": "lucia",
          "text": "I promise, little one. After the boring, we will ride Tormenta together."
        },
        {
          "speaker": "narrator",
          "text": "Catalina nods, satisfied that all necessary commitments have been secured, and allows herself to be carried away. Her voice drifts back down the corridor: 'Doña Beatriz, did you know I have a Lucia-mama and a regular mama? The regular mama is with God...' The door closes. Silence settles over the chamber. Lucia stands beside you, her hand finding yours."
        },
        {
          "speaker": "lucia",
          "text": "Well then, husband. Shall we go discuss Constantinople with your Military Orders?"
        },
        {
          "speaker": "juan_ii",
          "text": "And morocco as well. We will continue across the strait. We both go to the study room and I introduce the three masters to the queen."
        }
      ],
      "roll": null,
      "recap": "In a touching moment, Princess Catalina formally accepts Queen Lucia as 'Lucia-mama,' bringing tears to the chamber as Master Gonzalo speaks of dressing a family rather than just kings. The intimate family scene concludes as Juan and Lucia prepare to meet with the Masters of the Military Orders to discuss the campaigns to Constantinople and Morocco."
    },
    {
      "id": "evt_1433_00246",
      "type": "council_meeting",
      "date": "1433-12-04",
      "end_date": null,
      "location": "Toledo, Council Chamber",
      "participants": [
        "juan_ii",
        "lucia",
        "don_luis_de_guzman",
        "don_pedro_gonzalez_de_padilla",
        "don_juan_de_zuniga",
        "alvaro_de_luna"
      ],
      "exchanges": [
        {
          "speaker": "narrator",
          "text": "You walk together through the corridors of the Alcázar, Lucia's hand resting lightly on your arm. She has composed herself fully now—the tears of the nursery replaced by the sharp, attentive gaze of a woman preparing to enter a room full of powerful men who do not yet know what to make of her."
        },
        {
          "speaker": "lucia",
          "text": "Tell me quickly. Which of the three will be most resistant to my presence? Which most likely to become an ally?"
        },
        {
          "speaker": "narrator",
          "text": "The room is warm, a fire crackling in the great hearth. A large table dominates the center, spread with maps of the Mediterranean, the Strait of Gibraltar, and the distant waters approaching Constantinople. Álvaro stands near the window, and the three Masters of the Military Orders rise as you enter. Don Luis de Guzmán, Master of Santiago—the eldest of the three, his white mantle marked with the red cross of his Order. Don Pedro González de Padilla, Master of Calatrava—forty-five years old, the professional soldier who wept at your inspirational speech at Íllora. Don Juan de Zúñiga, Commander of Alcántara—second-in-command of the Order, representing Master Sotomayor in his absence."
        },
        {
          "speaker": "don_luis_de_guzman",
          "text": "Your Majesty. And..."
        },
        {
          "speaker": "juan_ii",
          "text": "My lords, allow me to present Her Majesty Queen Lucia of Castile. She will be attending our councils from this day forward. When I am absent from the kingdom—as I shall be when we sail for Constantinople—she will rule as regent in my name. It is therefore essential that she understand fully the matters we discuss."
        },
        {
          "speaker": "don_luis_de_guzman",
          "text": "Your Majesty. The Order of Santiago welcomes you. We are... honored by your presence."
        },
        {
          "speaker": "don_pedro_gonzalez_de_padilla",
          "text": "Calatrava stands ready to serve the crown. Both crowns."
        },
        {
          "speaker": "don_juan_de_zuniga",
          "text": "Alcántara is at your command, Your Majesty. I confess I am curious to hear the Queen's perspective on our eastern enterprise. Fresh eyes often see what familiarity blinds us to."
        },
        {
          "speaker": "alvaro_de_luna",
          "text": "Shall we begin, Your Majesty?"
        },
        {
          "speaker": "juan_ii",
          "text": "Gentlemen, we have received reports from both Morocco and Constantinople."
        },
        {
          "speaker": "narrator",
          "text": "You begin with Morocco. Commander Martín's report: the delegation has established itself in Tangier and Tétouan, though Salé remains hostile. The Marinid Sultan is a boy of fourteen, his realm fragmenting under competing regents. Then you turn to Constantinople. The situation is grave. The 300 knights under Sotomayor arrived to find the city's defenses in worse condition than reported. The walls are crumbling in places, the treasury nearly empty, the garrison demoralized."
        },
        {
          "speaker": "don_luis_de_guzman",
          "text": "And the seven hundred additional knights we discussed? Does Your Majesty intend to proceed?"
        },
        {
          "speaker": "juan_ii",
          "text": "I intend to proceed yes. I have given my word and I always keep my word. Masters, I intend to go and to give the emperor and his people a choice. I repair their walls and keep my word and then we leave to the fate of their own making. They can also come with us, and I will grant them sanctuary in my kingdom. Constantinople will fall and we prevent a violent conquest. Or we make arrangements to fight. But I will only accept this option if we have a chance to win. And they will have to acknowledge our authority. I dont know yet what this will look like, I will have to feel this out. But I promise to represent Castillian and Christian interests."
        },
        {
          "speaker": "don_luis_de_guzman",
          "text": "Your Majesty speaks of three paths. Honor the commitment, repair the walls, and withdraw—leaving Constantinople to its fate. Or evacuate those who wish to leave—a mercy, but also an admission that the city cannot be saved. Or... Fight. But only if victory is possible, and only if the Greeks submit to our authority."
        },
        {
          "speaker": "don_pedro_gonzalez_de_padilla",
          "text": "The third option troubles me, Your Majesty. Not the fighting—Calatrava does not fear battle. But the conditions. János Hunyadi's letters were clear. Thirty-five to forty thousand professional soldiers, unified command, supply lines through Hungary. We speak of seven hundred knights. Even with the three hundred already there, we are far short of what the Hungarian says is needed."
        },
        {
          "speaker": "don_juan_de_zuniga",
          "text": "Master Sotomayor writes from Constantinople that the Emperor is... proud. Desperate, yes, but proud. The Greeks remember the Fourth Crusade. They remember Latin armies that came to help and stayed to conquer. If Your Majesty demands acknowledgment of authority as the price of aid, the Emperor may refuse—even if refusal means his city's death. Pride can be stronger than survival."
        },
        {
          "speaker": "don_luis_de_guzman",
          "text": "And yet, Your Majesty is right to demand it. We cannot spend Castilian blood and gold to prop up a throne that will not recognize our sacrifice. If we fight, we must fight for something lasting—not merely to delay the inevitable by a decade."
        },
        {
          "speaker": "alvaro_de_luna",
          "text": "There is also the question of the Pope, Your Majesty. And Basel. Both Rome and the Council seek to host the negotiations for Church reunion with the Greeks. Whoever brokers that reunion gains enormous prestige. If Castile is seen as the power that saved Constantinople and healed the schism..."
        },
        {
          "speaker": "juan_ii",
          "text": "The masters speak about important aspects. All I can say right now is that the wall repairs and the 1000 knights buys us some time. Time we will use to choose what option to take. To start a new crusade, call allies, plan the campain that requires 40.000 dedicated soldiers. But it all starts with a choice. I must also ask the masters; how are they adapting to the new situation now that Grenada has fallen? Do you plan to relocate forts? Maybe I can grant some of the Grenada forts to the orders. Forts who now still are crown property. And have the masters thought about switching more towards expanding to a naval presence as well?"
        },
        {
          "speaker": "don_luis_de_guzman",
          "text": "Your Majesty raises the question that has occupied every chapter meeting since Granada fell. For two centuries, the Orders existed for one purpose: the Reconquista. Our lands, our fortresses, our very reason for being—all oriented toward the frontier with the Moors. And now... The frontier is gone. The Moors are defeated. We find ourselves warriors without a war."
        },
        {
          "speaker": "don_pedro_gonzalez_de_padilla",
          "text": "Calatrava holds seventeen fortresses along what was the border. Good fortresses, well-maintained, strategically positioned for a conflict that no longer exists. My knights garrison walls that face... olive groves. Sheep. We train for battle and guard against farmers."
        },
        {
          "speaker": "don_juan_de_zuniga",
          "text": "Alcántara faces the same question. Master Sotomayor took the Constantinople command in part because he saw the future clearly—the Orders must find new purpose or wither into irrelevance. Become landlords collecting rents, our martial traditions fading into ceremony. Granada fortresses would help, Your Majesty. New positions, new frontiers—even if the frontier is now the sea rather than the land. It gives our knights something to do."
        },
        {
          "speaker": "don_luis_de_guzman",
          "text": "But Your Majesty mentions naval presence. This is... a significant shift. The Orders have always been cavalry, heavy horse, fortress garrisons. Ships require different skills, different men, different traditions. Santiago has some experience with coastal defense, but true naval warfare? Galleys, marines, naval tactics? We would need to learn. To adapt."
        },
        {
          "speaker": "don_pedro_gonzalez_de_padilla",
          "text": "Calatrava has no ships. No sailors. We are horsemen."
        },
        {
          "speaker": "don_juan_de_zuniga",
          "text": "And yet... if the next crusade is Constantinople, the path there is by sea. If Morocco is to be contested, it is across the Strait. If the Ottomans are the enemy, their navy is as dangerous as their armies. Perhaps the Orders must become naval powers, whether we wish it or not."
        },
        {
          "speaker": "juan_ii",
          "text": "Alvaro, is it correct that all forts are now crown property? And how many forts and ports have been taken with the reconquista?"
        },
        {
          "speaker": "alvaro_de_luna",
          "text": "Your Majesty is correct. By the terms of the conquest and the papal decree granting crown authority over the Military Orders, all captured fortifications in Granada are crown property until formally granted otherwise. The conquest yielded the following: twenty-three major fortresses, including the alcazabas of Granada, Málaga, Almería, and Guadix. Fourteen secondary fortifications—smaller castles and fortified towers controlling mountain passes and river crossings. Eight fortified ports along the coast: Málaga, Almería, Almuñécar, Motril, Adra, Vera, Mojácar, and Marbella. Additionally, there are perhaps thirty to forty minor watchtowers and signal posts throughout the Sierra Nevada and along the coastal roads."
        },
        {
          "speaker": "juan_ii",
          "text": "In order to make sure christian settlers are protected and keep the kings peace in Grenada, I am willing to grant all forts and watchtowers to be divided among the three orders. Regarding a transition to a naval presence; I am unsure. If we are fighting Ottomans, the orders just need transports to and from Constantinople and dont need ports on their own per se."
        },
        {
          "speaker": "don_luis_de_guzman",
          "text": "Your Majesty is... most generous. Twenty-three major fortresses, fourteen secondary fortifications, and the watchtower network—divided among three Orders, that is perhaps twelve or thirteen significant positions each, plus the minor posts. This would give the Orders a renewed purpose in the south. Garrison duties, yes, but also the work of settlement—protecting Christian farmers, overseeing the transition of Moorish lands, maintaining the roads."
        },
        {
          "speaker": "don_pedro_gonzalez_de_padilla",
          "text": "Calatrava would welcome fortresses in the eastern reaches—toward Almería and Guadix. Our existing holdings lie that direction. It would create a coherent territory."
        },
        {
          "speaker": "don_juan_de_zuniga",
          "text": "Master Sotomayor would wish me to express gratitude on the Order's behalf, Your Majesty. The western positions—toward Málaga and Ronda—would suit Alcántara's current disposition. Though I cannot commit formally without the Master's approval."
        },
        {
          "speaker": "don_luis_de_guzman",
          "text": "Santiago would take the central region. Granada city and its surroundings. The symbolic heart of the conquest. It seems fitting. Regarding naval matters, Your Majesty speaks wisdom. Transport is not the same as naval warfare. If the Orders require only passage to Constantinople and back, the crown's fleet—or hired Genoese and Venetian vessels—would suffice. Building our own naval capacity is a generation's work, not a season's. But I would ask Your Majesty to consider: if Morocco is truly the next horizon, the Strait must be controlled. And if the Ottomans are the enemy beyond that, their galleys raid as far as Sicily and Sardinia. The day may come when Castile needs more ships than the crown alone can provide."
        },
        {
          "speaker": "juan_ii",
          "text": "The crown is building up it's fleet as we speak. For the Constantinople campain, the orders do not need a fleet of their own. As we develop a strategy for morocco, this may change. Alvaro, what pirate activity is there currently? And how does this affect our revenue?"
        },
        {
          "speaker": "alvaro_de_luna",
          "text": "Your Majesty, the situation is... mixed. Since the fall of Granada, Barbary corsairs operating from the Moroccan coast have grown bolder. They no longer have Granada as a friendly port, which has pushed them westward—but it has also made them more desperate and aggressive. In the past six months, we have confirmed reports of fourteen merchant vessels attacked or seized in waters between Málaga and Almería. Another eight along the approaches to the Strait itself."
        }
      ],
      "roll": null,
      "recap": "Juan convenes a council meeting with the Military Orders to discuss Constantinople and Morocco strategy. He introduces Queen Lucia as his future regent and grants all Granada fortresses to the three Orders. The discussion covers three strategic options for Constantinople: honor commitments and withdraw, evacuate willing Greeks, or fight under Castilian authority. The Orders express concerns about their future purpose post-Reconquista and the challenges of naval warfare, while reports reveal increasing Barbary corsair activity affecting merchant shipping."
    },
    {
      "id": "evt_1433_00247",
      "type": "council_meeting",
      "date": "1433-12-04",
      "end_date": null,
      "location": "Toledo, Council Chamber",
      "participants": [
        "juan_ii",
        "alvaro_de_luna",
        "luis_de_guzman",
        "pedro_gonzalez_de_padilla",
        "juan_de_zuniga",
        "lucia"
      ],
      "exchanges": [
        {
          "speaker": "pedro_gonzalez_de_padilla",
          "text": "But I would ask Your Majesty to consider: if Morocco is truly the next horizon, the Strait must be controlled. And if the Ottomans are the enemy beyond that, their galleys raid as far as Sicily and Sardinia. The day may come when Castile needs more ships than the crown alone can provide. I do not argue for haste. Only that the door not be closed entirely."
        },
        {
          "speaker": "juan_ii",
          "text": "The crown is building up it's fleet as we speak. For the Constantinople campain, the orders do not need a fleet of their own. As we develop a strategy for morocco, this may change. Alvaro, what pirate activity is there currently? And how does this affect our revenue?"
        },
        {
          "speaker": "narrator",
          "text": "Álvaro sets aside his notes on the fortress distribution and retrieves another set of papers—these bearing the marks of naval reports and merchant complaints."
        },
        {
          "speaker": "alvaro_de_luna",
          "text": "Your Majesty, the situation is... mixed. Since the fall of Granada, Barbary corsairs operating from the Moroccan coast have grown bolder. They no longer have Granada as a friendly port, which has pushed them westward—but it has also made them more desperate and aggressive. In the past six months, we have confirmed reports of fourteen merchant vessels attacked or seized in waters between Málaga and Almería. Another eight along the approaches to the Strait itself. The corsairs operate primarily from Tétouan, Tangier, and most aggressively from Salé—the same city that rejected Commander Martín's delegation. Salé is effectively a corsair republic; the Marinid Sultan has no control there whatsoever. Direct losses to Castilian merchants: approximately twelve thousand florins in cargo and vessels over the past year. But the greater damage is indirect. Merchants now demand higher fees for the risk, or refuse certain routes entirely. Venetian and Genoese traders are beginning to favor other ports—Valencia, Barcelona—where the crown of Aragon provides better escort. This costs us perhaps another twenty to thirty thousand florins annually in trade that simply goes elsewhere. The crown fleet is growing, but it is designed for military transport and major naval engagements—not the constant patrol work required to suppress piracy. For that, we would need lighter, faster vessels stationed permanently at the coastal ports. Galleys or caravels that can chase corsairs into shallow waters where our larger ships cannot follow. This is where the question of ports becomes relevant, Your Majesty. If the Orders held coastal fortifications with associated harbors—even small ones—they could maintain patrol vessels as part of their garrison duties. It would give them naval experience gradually, in defensive operations, before any thought of offensive campaigns against Morocco."
        },
        {
          "speaker": "juan_ii",
          "text": "But are the masters ready for such a responsibility? Do they truly want to also take on the responsibility of not only keeping the land safe, but also the sea who is becoming more and more important for this kingdom?"
        },
        {
          "speaker": "narrator",
          "text": "The three men shift in their seats. This is no longer a discussion of gifts and grants—it is a challenge to their identity, their capability, their willingness to transform."
        },
        {
          "speaker": "luis_de_guzman",
          "text": "Your Majesty asks a fair question. And I will give a fair answer. Santiago has guarded Castile's frontiers for two hundred years. We learned to fight Moors when our grandfathers' grandfathers were young. We adapted to new weapons, new tactics, new enemies. When the bombards came, we learned siege warfare. When Granada built its mountain fortresses, we learned to starve them out. We can learn the sea. But I will not pretend we already know it. If Your Majesty grants us coastal responsibilities, Santiago will need time—years, not months—to build the ships, train the men, develop the knowledge. We would need to hire experienced captains, perhaps Genoese or Catalan, to teach us. It would be... humbling. But Santiago has never feared hard work. Only irrelevance."
        },
        {
          "speaker": "pedro_gonzalez_de_padilla",
          "text": "Calatrava is a cavalry order. Horsemen. I will not lie to Your Majesty and claim my knights are eager to trade saddles for ship decks. But Don Luis speaks truth. The alternative is to wither. To become ceremonial guards with pretty mantles and no purpose. If the sea is where Castile's enemies are, then Calatrava will learn to fight on the sea. But we will need guidance. And patience. And perhaps some assurance that our horses will not be expected to swim."
        },
        {
          "speaker": "juan_de_zuniga",
          "text": "Master Sotomayor took three hundred knights to Constantinople precisely because he understood this moment was coming. Alcántara is the smallest of the three Orders. We cannot compete with Santiago or Calatrava in land holdings or numbers. But the sea... the sea is new ground for all of us. A smaller Order that masters naval warfare early could find itself more valuable than larger Orders still learning. I cannot speak for Master Sotomayor with certainty. But I believe he would say: yes. Alcántara is ready for this responsibility. Eager for it, even. We see it as opportunity, not burden."
        },
        {
          "speaker": "narrator",
          "text": "The room falls silent. The fire crackles. The maps of coastlines and distant waters seem to pulse with possibility. Álvaro catches your eye, his expression carefully neutral—but you know him well enough to read the slight raise of his eyebrow. This is the moment. They are ready to commit, if you push them. Lucia, at your right hand, watches the Masters with that sharp, assessing gaze you are coming to know well."
        },
        {
          "speaker": "juan_ii",
          "text": "This is no matter of honour, all three orders should not have exactly the same role. But if the masters will want to commit, then I shall grant every order one reinforced port in Grenada, and permission to moor in Malaga port as well. I encourage the masters to cooperate when it comes to constructing new ships. And take time. Focus on fighting piracy for now. As we develop our role against morocco, we may expand our naval operations. I shall write to Portugal, our ally, and ask what lies beyond Sale and further down south along the coast. Maybe there lies another task for the orders as well. The port of Sale troubles me. I will write and ask our informants how the other cities would react is we raid Sale because of all the piracy."
        },
        {
          "speaker": "luis_de_guzman",
          "text": "Your Majesty's generosity honors the Orders. Santiago accepts this charge. We will learn to fight on the water as we learned to fight on land—through discipline, faith, and perseverance."
        },
        {
          "speaker": "pedro_gonzalez_de_padilla",
          "text": "Calatrava will not be found wanting. If pirates threaten Castilian waters, we will hunt them. Though I reserve the right to complain about seasickness."
        },
        {
          "speaker": "juan_de_zuniga",
          "text": "Alcántara is honored, Your Majesty. I will write to Master Sotomayor in Constantinople immediately. He will be... pleased."
        },
        {
          "speaker": "alvaro_de_luna",
          "text": "I will prepare documents for the fortress distribution and port assignments, Your Majesty. And draft letters to King João regarding Portuguese knowledge of the African coast—Prince Henrique in particular has been exploring southward for years. His expertise would be invaluable. Regarding Salé—the question of how Tangier and Tétouan would react to a punitive raid is delicate. Commander Martín's reports suggest the cities operate largely independently; there is little love lost between them. Salé's corsairs prey on everyone's shipping, including vessels that might otherwise trade with Tangier. It is possible the other cities would quietly welcome Salé being... chastened. But we should confirm this before acting. A raid that unites Morocco against us would be counterproductive. Shall I instruct Commander Martín to make discreet inquiries? Assess whether Tangier and Tétouan might turn a blind eye—or even provide intelligence—if Castile moved against Salé?"
        },
        {
          "speaker": "juan_ii",
          "text": "Yes, write Martin to seek this out. Alvaro, lets make a list of all the forts and lets divide them fairly among the orders."
        },
        {
          "speaker": "narrator",
          "text": "Lucia catches your wink and raises an eyebrow almost imperceptibly—a silent acknowledgment that she is watching, learning, filing away every detail of how you manage men and institutions."
        },
        {
          "speaker": "alvaro_de_luna",
          "text": "Very well, Your Majesty. Let me compile the full list and propose a division. Santiago receives the central region with 8 major fortresses including the Alcazaba of Granada, Alhambra garrison complex, Loja, Alhama, Montefrío, Íllora, Moclín, and Santa Fe. Calatrava takes the eastern region with 8 fortresses including the Alcazaba of Almería, Alcazaba of Guadix, Baza, Vera, Mojácar, Purchena, Fiñana, and Huéscar. Alcántara receives the western region with 7 fortresses including the Alcazaba of Málaga as garrison, Ronda, Marbella fortress, Estepona, Setenil, Archidona, and Antequera. For ports: Santiago gets Almuñécar, Calatrava gets Almería, and Alcántara gets Marbella. All three Orders granted mooring rights at Málaga, which remains crown property as the primary Mediterranean trading hub. Does this division seem equitable, Your Majesty? The Masters may wish to negotiate specific positions amongst themselves, but this provides a framework."
        },
        {
          "speaker": "juan_ii",
          "text": "Do the masters agree with this division?"
        },
        {
          "speaker": "luis_de_guzman",
          "text": "Santiago is well served by this arrangement. The central region—Granada itself, the heart of what we conquered—carries symbolic weight, and the fortresses form a coherent defensive line. Almuñécar as our port is acceptable. It is modest, but sufficient to begin learning the naval craft. Santiago agrees."
        },
        {
          "speaker": "pedro_gonzalez_de_padilla",
          "text": "Calatrava holds the route to Almería and the eastern approaches. Good. Guadix and Baza guard the mountain passes. Almería itself is a fine port—deep water, defensible. I might ask whether Vera and Mojácar could be exchanged for something closer to Guadix, to tighten our lines. But these are minor matters. Calatrava agrees in principle. We can negotiate details amongst ourselves."
        },
        {
          "speaker": "juan_de_zuniga",
          "text": "Alcántara receives one fewer major fortress than the other Orders. But Marbella and Ronda are strong positions, and the western coast faces Morocco directly. If the future lies across the Strait... Master Sotomayor will need to formally ratify any agreement, but speaking for the Order in his absence—Alcántara agrees. The western region suits our ambitions."
        },
        {
          "speaker": "luis_de_guzman",
          "text": "There is one matter we should settle amongst ourselves, with Your Majesty's permission. The secondary fortifications and watchtowers along the borders of our regions—where Santiago's territory meets Alcántara's, for instance. We will need to agree on precise boundaries to avoid... disputes. I propose the three Orders meet separately to draw these lines, then present the agreement to Your Majesty for approval. This keeps minor territorial squabbles out of the royal council chamber."
        },
        {
          "speaker": "juan_ii",
          "text": "I would like to have the grant ready and signed by me before you all leave. I will take the grant to Alcantara with me to Constantinople, but the others I can sign now. I want each order to have one document stating what new titles, forts and areas they now also command. Why dont the masters work out any details together and present the result to me so I can sign it. Would that suit the masters? The queen and I have other matters to attend to in the mean time."
        },
        {
          "speaker": "luis_de_guzman",
          "text": "Your Majesty honors us with such trust. We shall retire and work out the details amongst ourselves—the boundary lines, the secondary fortifications, the watchtower assignments. I expect we can have a proposal ready by tomorrow morning. These are complex matters, but the framework Your Majesty has provided is clear."
        }
      ],
      "roll": null,
      "recap": "Juan II assigns the three military orders their portions of conquered Granada, granting each order coastal fortresses and ports to develop naval capabilities against Barbary pirates. Santiago receives the central region including Granada itself, Calatrava takes the eastern region with Almería, and Alcántara gets the western region facing Morocco with Marbella. All orders are granted mooring rights at Málaga. The masters agree to work out detailed boundaries amongst themselves and present formal agreements for royal signature."
    },
    {
      "id": "evt_1433_00248",
      "type": "domestic_event",
      "date": "1433-12-04",
      "end_date": null,
      "location": "Toledo, Countryside",
      "participants": [
        "juan_ii",
        "lucia",
        "catalina"
      ],
      "exchanges": [
        {
          "speaker": "narrator",
          "text": "You find Catalina in the nursery, presiding over an elaborate construction of wooden blocks, cushions, and what appears to be an entire collection of wooden horses arranged in military formation. Doña Beatriz sits nearby, mending a small garment while keeping one watchful eye on her charge. Fernando lies in his cradle, awake for once, his dark eyes tracking the movement of a cloth bird that Doña Beatriz has hung above him."
        },
        {
          "speaker": "catalina",
          "text": "Papá! Lucia-mama! I was very good. I watched Fernando. He did nothing. He just looked at the bird. For ages. Is it time for horses now? You promised. Lucia-mama promised Tormenta. You said after the boring."
        },
        {
          "speaker": "narrator",
          "text": "Fernando blinks up at you, his dark eyes—so like Isabel's, so like Catalina's—focusing slowly on your face. At three months old, he is beginning to take notice of the world around him, though his understanding of it remains a mystery known only to infants and God. He makes a small sound, somewhere between a gurgle and a coo, his tiny fists waving aimlessly in the air. One hand finds your finger and grips it with surprising strength—the instinctive grasp of a baby who has discovered something solid in a confusing world."
        },
        {
          "speaker": "catalina",
          "text": "I ride with Lucia-mama to the stable. And then I ride with Papá on Hidalgo. And then I ride with Lucia-mama on Tormenta on the way back. That way it is fair."
        },
        {
          "speaker": "lucia",
          "text": "The princess drives a hard bargain. Very well. I accept these terms."
        },
        {
          "speaker": "narrator",
          "text": "Hidalgo surges beneath you, his powerful muscles coiling and releasing as he thunders across the open field. Catalina shrieks with delight, pressed safely against your chest, her small hands gripping the pommel with white-knuckled excitement."
        },
        {
          "speaker": "catalina",
          "text": "FAST! Papá, we're going SO FAST!"
        },
        {
          "speaker": "narrator",
          "text": "Behind you, you hear Tormenta's hooves—Lucia giving chase, the black mare's competitive spirit ignited once more. The sound grows closer, and Catalina twists in your arms to look back."
        },
        {
          "speaker": "lucia",
          "text": "The King flees! What will the chronicles say?"
        },
        {
          "speaker": "catalina",
          "text": "Go faster, Papá! Go faster, Lucia-mama!"
        },
        {
          "speaker": "narrator",
          "text": "The two horses run neck and neck across the stubbled field, grey and black, king and queen, with a princess laughing between them as the sun sinks toward the western hills and the first stars begin to prick the darkening sky."
        },
        {
          "speaker": "catalina",
          "text": "That was... so good. Can we do it every day?"
        },
        {
          "speaker": "narrator",
          "text": "You bring Hidalgo alongside Tormenta, and Lucia reaches out to receive the drowsy princess. The transfer is gentle—Catalina's small arms releasing your neck and finding Lucia's, her head settling against the woman's chest as naturally as if she had always belonged there."
        },
        {
          "speaker": "lucia",
          "text": "I have you, little one."
        },
        {
          "speaker": "catalina",
          "text": "Tormenta is warm. And Lucia-mama smells nice..."
        },
        {
          "speaker": "lucia",
          "text": "She trusts me. Completely. Without reservation. I have done nothing to earn this, Juan. I have been here mere weeks. And yet she..."
        },
        {
          "speaker": "narrator",
          "text": "The walls of Toledo rise before you, torches already lit along the battlements, the city preparing for night. Somewhere within, Fernando sleeps in his cradle. Somewhere, Álvaro drafts letters and the Military Order Masters negotiate boundaries. Somewhere, the machinery of a kingdom turns. But here, on this road, there is only the quiet clop of hooves, the weight of a sleeping child, and two people riding home together."
        }
      ],
      "roll": null,
      "recap": "Juan takes Lucia and Catalina to the stables for the promised riding expedition. They visit Fernando in the nursery first, then head to the countryside where Juan and Catalina gallop on Hidalgo while Lucia gives chase on Tormenta. Catalina falls asleep in Lucia's arms on the ride home, demonstrating the deep trust and bond that has formed between stepmother and daughter in just a few weeks."
    }
  ]
}