{
  "chapter": "2.17",
  "title": "Meeting with Don Ramon de Perellós on Council Administration",
  "date_range": "1434-01-27 / 1434-03-01",
  "encounters": [
    {
      "id": "evt_1434_00332",
      "type": "diplomatic_proposal",
      "date": "1434-01-27",
      "end_date": null,
      "location": "Barcelona, Palau Reial",
      "participants": [
        "juan_ii",
        "lucia",
        "ramon_de_perellos"
      ],
      "exchanges": [
        {
          "speaker": "narrator",
          "text": "The walk through the Barri Gòtic is pleasant despite the weight of the morning's conversations. Lucia walks beside you, her hand resting lightly on your arm. She says little, but her presence is steady. The Palau Reial rises at the heart of the old city—less imposing than Toledo's Alcázar, but older, its stones worn smooth by centuries of Catalan counts and Aragonese kings."
        },
        {
          "speaker": "narrator",
          "text": "Don Ramon de Perellós receives you in the regent's council chamber—a long room dominated by a heavy oak table and tapestries depicting the conquest of Majorca. He rises from behind a desk cluttered with documents, bowing precisely."
        },
        {
          "speaker": "ramon_de_perellos",
          "text": "Your Majesty. Your Majesty. I trust the morning has been productive. I have prepared a proposed itinerary for Your Majesty's remaining time in Barcelona. The Consell de Cent at midday, as arranged. The Count of Pallars has requested a private audience—I have suggested the fourth hour after noon, if that suits. Don Guillem de Vic wishes to present certain communications he has drafted on Your Majesty's behalf. I understand Your Majesty visited Bishop Climent Sapera this morning. A lengthy meeting, by all accounts."
        },
        {
          "speaker": "juan_ii",
          "text": "Thank you for the effort and care you took for facilitating these meetings. I trust there are issues or matters you yourself want to discuss with us as well? We are here and you have our ear."
        },
        {
          "speaker": "ramon_de_perellos",
          "text": "Your Majesty is gracious. The matter of the itinerary is not... merely logistical. Barcelona is not Toledo, Your Majesty. The Consell de Cent guards its prerogatives jealously. The Count of Pallars speaks for nobles who remember when Aragón's king lived in Aragón. The merchants want to know whether Castilian trade agreements will respect Catalan privileges. In four years as head of the regency council, I have learned that scheduling is governance. Who sees the king, and when, and in what order—these things matter. They send signals. They create expectations. They establish... hierarchies. Your Majesty arrived yesterday evening. Since then, you have spoken privately with Don Guillem de Vic, with the Count of Pallars, and this morning—at considerable length—with Bishop Climent Sapera. The regency council was not consulted regarding any of these conversations. Queen María has requested that I coordinate all further meetings through Her Majesty's secretary. She wishes to be informed in advance of Your Majesty's appointments."
        },
        {
          "speaker": "juan_ii",
          "text": "And I appologize immediately for not consulting with you sooner. An oversight I cannot take back. You have my word that not seeing you sooner was somehow a deliberate act to undermine your authority or to diminish it. I simply took audiences with anyone willing to speak with me. But now that we are here, what matters should we discuss? And what are the concerns of the regency council?"
        },
        {
          "speaker": "ramon_de_perellos",
          "text": "Your Majesty's word is noted. Your Majesty asks what the council's concerns are. That is a... complex question. The council's concerns depend greatly on circumstances. On what is being proposed. On what commitments may already have been made. I have served as head of this council for four years. In that time, I have learned that I cannot advise a king on what he should do until I understand what he has done. Don Guillem de Vic left the reception last night speaking of 'great things to come' and 'bringing the kingdoms together.' The Count of Pallars sent a messenger to his estates at first light—I do not know why. Bishop Climent Sapera has reportedly cancelled his morning appointments to draft letters to the Archbishop of Tarragona. What should the regency council's concerns be, Your Majesty? What has been discussed? What has been offered? What expectations now exist that did not exist two days ago?"
        },
        {
          "speaker": "narrator",
          "text": "Juan tells the regent exactly what has happened and does not hold back. He tells him about his vision for a better world and how bringing the kingdoms closer together might help this. That he has been able to share this vision with others who are now also trying to achieve this. That the kingdoms uniting should not be Aragon joining Castille, but both kingdoms joining to become something else with neither holding dominance. He also tells him that he talked about the crown succession with Maria. And that he should have asked her about the current situation regarding succession and his own role in this."
        },
        {
          "speaker": "narrator",
          "text": "Don Ramon listens without interruption. His face remains carefully composed throughout—the practiced stillness of a man who has spent decades hearing kings and nobles speak of grand designs. When Juan finishes, Don Ramon is silent for a long moment. He moves to the window again, looking out at the courtyard below where servants cross on their errands."
        },
        {
          "speaker": "ramon_de_perellos",
          "text": "Your Majesty has been... remarkably candid. You ask about the succession. That, at least, is a matter of law rather than vision. King Alfonso has no legitimate children. Queen María has borne none, and the physicians hold little hope after so many years. Should Alfonso die, the Crown of Aragón passes to his nearest male relative. The Infantes Juan and Enrique are dead. Their legitimate male issue—Carlos of Viana—is also dead. This leaves... King Ferdinand of Aragón, Alfonso's father, had one other son who survived infancy. That son married into the House of Trastámara. His daughter María is our regent. His son... His son is Your Majesty. By strict succession law, should Alfonso die without heir, the Crown of Aragón would pass to the descendants of Ferdinand's second son—that is, to Juan II of Castile. Your Majesty is, in fact, Alfonso's heir presumptive. The regency council is aware of this. The factions are aware of this. When Your Majesty speaks of 'bringing kingdoms together,' every man in Barcelona hears it through this lens. I would suggest that further discussions regarding succession—or visions of unity—include Her Majesty the Regent and the full council. These are not matters for private conversations with faction leaders and bishops. Is there anything else Your Majesty requires for the midday reception with the Consell de Cent?"
        },
        {
          "speaker": "juan_ii",
          "text": "You indicate that further discussions about unity should include the full council. Since everybody seems to be thinking about this already, can such a meeting be arranged?"
        }
      ],
      "roll": null,
      "recap": "Juan meets with Don Ramon de Perellós, head of the regency council, who questions his private meetings with various factions. Juan makes full disclosure of his unity vision and succession concerns. Don Ramon reveals that Juan is legally Alfonso's heir presumptive to Aragón, explaining why his talk of 'bringing kingdoms together' alarms everyone. He insists future discussions involve the full council."
    },
    {
      "id": "evt_1434_00333",
      "type": "decision",
      "date": "1434-01-27",
      "end_date": null,
      "location": "Barcelona, Palau Reial",
      "participants": [
        "juan_ii",
        "ramon_de_perrellos"
      ],
      "exchanges": [
        {
          "speaker": "ramon_de_perrellos",
          "text": "The regency council is aware of this. The factions are aware of this. When Your Majesty speaks of 'bringing kingdoms together,' every man in Barcelona hears it through this lens."
        },
        {
          "speaker": "narrator",
          "text": "He moves back toward the desk, straightening papers that do not need straightening."
        },
        {
          "speaker": "ramon_de_perrellos",
          "text": "I would suggest that further discussions regarding succession—or visions of unity—include Her Majesty the Regent and the full council. These are not matters for private conversations with faction leaders and bishops."
        },
        {
          "speaker": "ramon_de_perrellos",
          "text": "Is there anything else Your Majesty requires for the midday reception with the Consell de Cent?"
        },
        {
          "speaker": "juan_ii",
          "text": "Since everybody seems to be thinking about this already, can such a meeting be arranged?"
        },
        {
          "speaker": "narrator",
          "text": "Don Ramon's expression flickers—something that might be satisfaction, quickly suppressed."
        },
        {
          "speaker": "ramon_de_perrellos",
          "text": "A meeting can always be arranged, Your Majesty."
        },
        {
          "speaker": "narrator",
          "text": "He moves to the desk, pulling a ledger toward him and opening it with the practiced ease of a man who lives by schedules."
        },
        {
          "speaker": "ramon_de_perrellos",
          "text": "The question is when, and with what preparation. The Consell de Cent expects you at midday. The Count of Pallars has the afternoon. Don Guillem wishes to present his drafted communications. Your Majesty departs for Rome within... how many days?"
        },
        {
          "speaker": "ramon_de_perrellos",
          "text": "A full council meeting requires the presence of all principal members. Don Berenguer de Bardaxí is at his estates—two days' ride. The Bishop of Girona sits on the council; he is in Girona. The Viscount of Rocabertí... These men cannot be summoned like servants. They must be invited, given time to arrange their affairs, travel to Barcelona."
        },
        {
          "speaker": "narrator",
          "text": "He closes the ledger."
        },
        {
          "speaker": "ramon_de_perrellos",
          "text": "And Her Majesty the Regent must, of course, preside. Given Your Majesty's conversation with her this morning, I would suggest... I would suggest that Her Majesty's consent to such a meeting should be obtained before invitations are dispatched."
        },
        {
          "speaker": "ramon_de_perrellos",
          "text": "Shall I inquire of Her Majesty whether she finds such a meeting advisable, and if so, when it might be convened? I could have an answer for Your Majesty by this evening. After the Count of Pallars, perhaps."
        },
        {
          "speaker": "juan_ii",
          "text": "Don Ramon, I have 4-5 weeks before I have to leave for Rome. I realize that I cannot summon the council. You have told me that everyone is thinking about succession right now. And you have indicated that talk about succession should happen through the council. Would it please the council to discuss these matters? To create stability and clarity perhaps? I will refrain from succession talk and refer to the council should the subject come up. Would this be in accordance with your wishes?"
        }
      ],
      "roll": null,
      "recap": "Juan requests a full regency council meeting to address succession matters that are already on everyone's minds. Don Ramón carefully explains the logistical requirements and political protocols needed for such a meeting, emphasizing that Queen María must consent and preside. Juan agrees to defer all succession discussions to the council's authority."
    },
    {
      "id": "evt_1434_00334",
      "type": "economic_event",
      "date": "1434-01-27",
      "end_date": null,
      "location": "Barcelona, Saló de Cent",
      "participants": [
        "juan_ii",
        "lucia_queen",
        "pere_joan_de_sant_climent",
        "bernat_fiveller"
      ],
      "exchanges": [
        {
          "speaker": "narrator",
          "text": "The Saló de Cent—the Hall of the Hundred—occupies the heart of the Casa de la Ciutat, a stern stone building that speaks of civic pride and commercial power. Inside, the hall is smaller than Toledo's throne room but no less impressive in its way. Pointed arches rise to a wooden ceiling painted in red and gold. The walls bear the arms of Barcelona—the red and gold bars of Aragón quartered with the cross of Sant Jordi. Wooden benches line the chamber in rising tiers, and upon them sit the jurats: one hundred men in dark robes and furred caps, the elected governors of one of the Mediterranean's greatest trading cities."
        },
        {
          "speaker": "pere_joan_de_sant_climent",
          "text": "Your Majesties of Castile. Barcelona welcomes you. I am Pere Joan de Sant Climent, conseller en cap. We are honored by your presence in our city. We understand Your Majesty has recently achieved a great victory against the Moor. The Consell wishes to offer its congratulations. Granada's fall is a triumph for all Christendom. We also understand that Granada's ports now fly Castilian banners. Málaga. Almería. Ports that once competed with Barcelona for the African trade. Perhaps Your Majesty would honor us by sharing how Castile intends to... organize these new commercial opportunities?"
        },
        {
          "speaker": "juan_ii",
          "text": "Thank you for granting us audience and to introduce us to this chamber and this intricate system of governance. I am here with my queen to meet with my sister and to learn about Catalan customs. You ask specifically about how to exploit the trade in Grenada. I must confess that I have not yet made any major decisions. Maybe I should summon all the traders in the region in one council and come up with a system or structure for trade. But I can already tell you what my aim is going to be; I want trade to increase and cooperation as well. There are many fields where Aragonese and Castillian interests align. Already I am moving against Muslim piracy that has plagued our coasts for so long. Areas where Castille can indeed draw upon the expertise of friends like Aragon, should they choose to give it."
        },
        {
          "speaker": "bernat_fiveller",
          "text": "Your Majesty mentions summoning traders to create a system. A worthy thought. Might we ask—which traders? Castilian traders from Seville, who already control the Atlantic routes? Or will Catalan houses receive equal voice in this... council? Your Majesty speaks of cooperation. Of aligned interests. We hear these words and we are grateful for them. But Your Majesty will forgive us—we are merchants. We think in contracts, not sentiments. When Málaga's harbor opens to Christian trade, will a Catalan ship pay the same duties as a Castilian ship? Will Barcelona's cloth merchants have the same rights in Granada's markets as Burgos wool factors? These are not challenges, Your Majesty. Merely... the questions that keep merchants awake at night."
        },
        {
          "speaker": "juan_ii",
          "text": "Maybe I should take a step back and let you explain what you are really concerned about. And what a king such as I could do to address them. I do not set or control prices of trade goods. If Grenada weavers choose to now enter the Christian market, they are free to do so. My question to you would be: Is this not free commerce? Please tell me what a king of a kingdom not even your own gathers so much interest from this council."
        },
        {
          "speaker": "pere_joan_de_sant_climent",
          "text": "Your Majesty asks a fair question. You are correct. You are King of Castile. Aragonese trade policy is a matter for King Alfonso and the regency council. We overstep. And yet. Your Majesty will forgive us if we speak plainly. We are Catalans. Plainness is our vice. King Alfonso pursues his destiny in Naples. Queen María holds Aragón in trust. And the man who stands before us today is... a man of great consequence. A man who has achieved what no Christian king has achieved in two centuries. A man whose shadow falls long across all of Iberia."
        },
        {
          "speaker": "bernat_fiveller",
          "text": "Your Majesty asks what a Castilian king could do to address our concerns. The answer is simple: nothing. Today. But we are merchants. We plan for tomorrow. We sign contracts that bind our grandchildren. We think in generations. Every man in this chamber knows the succession laws of Aragón. Every man knows that King Alfonso has no heir. Every man knows who stands next in line. We do not ask Your Majesty to make promises you cannot keep. We ask only... to understand what kind of king you are. Whether you see Barcelona as a partner or as a... subject."
        },
        {
          "speaker": "juan_ii",
          "text": "Ha! I consider plainness no vice at all. And even if it is a sin, I am a likewise a sinner like you. You ask me what kind of king I am. That I can do. Though I risk a bit of pride about my accomplishments, but I have taken my queen with me, who is sure to let me know when I do. When developing trade policy, I ask myself one question. What will increase trade the most? What develops ports? How can trade goods reach workshops? In short; how will this benefit the kingdom the most. And I must confess that trade and naval matters are not areas of Castillian strengths. My kingdom barely has a fleet compared to Aragon. A matter I intend to address and I have moored my full fleet in Valencia, putting it at the disposal of your king in support of his Naples campaign. I honestly do not know what trade policies to adopt. I have never done so yet. But I have already said what I want these policies to achieve. Should anything change, I can assure this council that I will always seek out advice from bodies such as these and that I aim for policies that increase trade. Does this address your question?"
        },
        {
          "speaker": "bernat_fiveller",
          "text": "Your Majesty says you will seek advice from bodies such as ours. We are grateful. But seeking advice and heeding advice are different things. Castile has a Cortes. Aragón has Corts. Both give advice. Kings do not always listen. You say you want policies that increase trade. So do we. But whose trade? When a Castilian merchant and a Catalan merchant both want the same contract in Málaga, whose trade increases? This is not philosophy, Your Majesty. This is Tuesday."
        },
        {
          "speaker": "juan_ii",
          "text": "Well, I can be specific in case of the example of the Catalan merchant and the Castillian merchant competing for the same contract on a tuesday. In the current situation, what would happen? Is the Castillian merchant in an advantage because he is trading in what essentially is Castillian territory?"
        },
        {
          "speaker": "bernat_fiveller",
          "text": "An excellent question, Your Majesty. At present, Granada's ports are... chaos. Forgive my bluntness. Málaga fell less than two years ago. Almería even more recently. The old Moorish trading houses are disrupted. The new Christian administration is still finding its feet. In such chaos, advantage flows to those with connections. Castilian merchants from Seville know your port officials. They speak the same language. They worship in the same churches. They have cousins and brothers-in-law in the customs houses. A Catalan merchant arrives in Málaga and he is... a foreigner. Tolerated, yes. But a foreigner. So when we ask whether Catalan ships will be welcomed as friends—we ask whether Your Majesty will instruct your officials that Catalans are not foreigners. That we are... partners. With the same rights, the same access, the same three days for a license. That is not a trade policy. That is a letter. A few sentences. 'Treat Aragonese merchants as you would Castilian merchants.' Nothing more."
        },
        {
          "speaker": "juan_ii",
          "text": "I have already told you what my policy should aim to accomplish. And treating Catalan merchants the same as Castillian ones would fit that narrative."
        }
      ],
      "roll": null,
      "recap": "Juan meets with Barcelona's Consell de Cent to discuss trade relations. The councillors, led by Pere Joan de Sant Climent and merchant representative Bernat Fiveller, press him about preferential treatment for Catalan merchants in Granada's newly conquered ports. They acknowledge Juan's likely future as King of Aragón and seek concrete assurances about equal treatment. Juan offers philosophical support for fair trade but avoids specific commitments, ultimately agreeing that equal treatment would align with his stated goals."
    },
    {
      "id": "evt_1434_00335",
      "type": "economic_event",
      "date": "1434-01-27",
      "end_date": null,
      "location": "Barcelona, Saló de Cent",
      "participants": [
        "juan_ii",
        "lucia",
        "fiveller",
        "sant_climent",
        "artisan_representative",
        "citizens_representative"
      ],
      "exchanges": [
        {
          "speaker": "sant_climent",
          "text": "There is no law against Catalan trade in Granada's ports. But law and practice are different things. A Castilian factor obtains a license in three days. A Catalan factor waits three weeks. A Castilian ship unloads at the prime berths. A Catalan ship anchors in the outer harbor."
        },
        {
          "speaker": "fiveller",
          "text": "These are not conspiracies, Your Majesty. They are... human nature. Your officials favor their own. As ours would. So when we ask whether Catalan ships will be welcomed as friends—we ask whether Your Majesty will instruct your officials that Catalans are not foreigners. That we are... partners. With the same rights, the same access, the same three days for a license. That is not a trade policy. That is a letter. A few sentences. 'Treat Aragonese merchants as you would Castilian merchants.' Nothing more."
        },
        {
          "speaker": "juan_ii",
          "text": "I have already told you what my policy should aim to accomplish. And treating Catalan merchants the same as Castillian ones would fit that narrative. If you want for me to draft official trade policy right here and right now, I must disappoint you. Imagine your king Alfonso drafting Aragonese trade policy while talking with Castillian traders in Castille! No, that would be unfair to those not represented. Do traders from Aragon and Castille meet somewhere? Maybe we should invite Portugal as well. Does such a structure yet exist? And if not, should we try and set up such a meeting?"
        },
        {
          "speaker": "narrator",
          "text": "A ripple passes through the hall. Men exchange glances—some intrigued, others skeptical. Fiveller's expression tightens almost imperceptibly."
        },
        {
          "speaker": "fiveller",
          "text": "An international meeting of traders. A noble thought, Your Majesty. Truly. Such meetings have been proposed before. At Bruges. At Genoa. They take years to arrange. They produce... documents. Declarations of intent. Frameworks for future cooperation. Meanwhile, my ships sail to Málaga next month. Not next year. Next month."
        },
        {
          "speaker": "sant_climent",
          "text": "Senyor Fiveller speaks from... urgency. Which is understandable. But Your Majesty raises an interesting question. Such a structure does not exist—not formally. The crowns negotiate. The merchants... adapt. Barcelona would be honored to host such a gathering, should one be arranged. It would be... good for the city. But this is a matter of years, not weeks."
        },
        {
          "speaker": "fiveller",
          "text": "Your Majesty, I asked for a letter. A few sentences instructing your port officials to treat our merchants as equals. Not a policy. Not a treaty. A letter. Is that truly something that requires an international conference to decide?"
        },
        {
          "speaker": "juan_ii",
          "text": "Done. Can I have ink and quill? Lucia, would you be so kind as to draft this letter? Are there other issues we should include in the letter? Cooperation about piracy maybe? Or other matters?"
        },
        {
          "speaker": "narrator",
          "text": "The hall stirs. Whatever the merchants expected, it was not this. Fiveller stands frozen for a moment—a man who asked for a fish and has been handed the net. Sant Climent gestures to a clerk, who scurries forward with writing materials. A small table is brought, set before Lucia."
        },
        {
          "speaker": "sant_climent",
          "text": "If Your Majesty is inclined to address matters of mutual concern... the piracy question is indeed pressing. A statement of intent—that Castile and Aragón will cooperate against the Salé corsairs—would be most welcome."
        },
        {
          "speaker": "fiveller",
          "text": "And perhaps... clarification on customs rates? If Catalan merchants are to be treated as equals, does this extend to the duties they pay? Equal access means little if we are taxed more heavily."
        },
        {
          "speaker": "artisan_representative",
          "text": "The silk, Majestic. You spoke of increasing trade. But trade in what? If Granada's silk floods our markets without restriction... Can the letter say something about... balance? That Your Majesty will not permit Granada's looms to destroy Valencia's? Some protection for those who weave, not only those who trade?"
        },
        {
          "speaker": "citizens_representative",
          "text": "And information, Your Majesty. When Castile makes decisions that affect our merchants, will Barcelona be informed? Consulted? Or will we learn of new policies when our ships are turned away?"
        },
        {
          "speaker": "juan_ii",
          "text": "Before we start, I want to make sure that you all understand that I write this letter as king of Castille, aiming to increase cooperation and good standing between my kingdom and Aragon. Lets start with the pirates. The military orders have been ordered to construct a navy to fight pirates. Order them to focus their efforts on Sale. Coordinate with Aragon should they support this effort. We await what they should choose to commit. Harbour officials should know that Aragonese, Portugese and Castillian merchants should be treated equally and are subject to the same treatment and tax. Regarding the silk trade from Grenada, inform the duke of Grenada to develop policies to prevent Grenada silk to flood and disrupt the christian markets as we integrate Grenada into Castille. We adopt a policy where Portugese and Aragonese traders are informed about our taxes and any significant changes to them so traders can make better informed decisions. And finally, If Barcelona would be so kind as to host a meeting of traders of these kingdoms so we can further develop and discuss these issues, I would encourage the Castillian traders to attend, send a delegation and to work in good spirit towards a common purpose where trade flourishes. Does the council have anything else to add?"
        },
        {
          "speaker": "artisan_representative",
          "text": "Your Majesty says the Governor of Granada should 'develop policies to prevent disruption.' Forgive me, Majestic—but what policies? Tariffs on Moorish silk entering Christian markets? Quotas on how much can be sold? Policies can mean many things. My weavers need to know if they will have work next year."
        },
        {
          "speaker": "citizens_representative",
          "text": "Your Majesty offers to inform us of tax changes. We are grateful. But I asked whether Barcelona might be consulted. These are... different things. To be informed is to learn what has been decided. To be consulted is to speak before the decision is made."
        },
        {
          "speaker": "fiveller",
          "text": "And the equal treatment—this is most welcome. But does 'subject to the same tax' mean Catalan merchants pay what Castilians pay now? Or might all rates rise together, equally but... higher? We do not doubt Your Majesty's intentions. Only... words on parchment have a way of meaning different things to different readers."
        },
        {
          "speaker": "juan_ii",
          "text": "I am willing to accomodate this council in the spirit of cooperation. But cooperation goes both ways. Is this council ready to commit to consult Castillian traders on future trade policy of Aragon? I am not asking for it, but my traders would ask me right now to ask reciprocity in regards to a commitment to the same taxes and treatment of Castillian traders in Aragonese harbours. Before you ask for something, consider what it would look like if the shoe were on the other foot. I am taking very concrete steps to adress your concerns right now and I must leave my officials enough flexibility to effectively implement them. So I ask again, what issues would this council like to include as well?"
        },
        {
          "speaker": "sant_climent",
          "text": "Your Majesty raises a... fair point. We have perhaps spoken as though this chamber sets policy for the Crown of Aragón. It does not. We govern Barcelona. We advise Her Majesty the Regent. But trade policy for the realm... That is a matter for the regency council. We cannot commit King Alfonso to reciprocal treatment of Castilian merchants in Aragonese ports. That is not our authority."
        },
        {
          "speaker": "citizens_representative",
          "text": "What we can commit, Your Majesty, is Barcelona. This city. This port. If Your Majesty instructs Málaga and Almería to treat Catalans as equals, this council can instruct Barcelona's harbor officials to extend the same courtesy to Castilians. Equal berthing. Equal licensing times. Equal treatment in the customs house."
        },
        {
          "speaker": "sant_climent",
          "text": "That much is within our power. And we would be... willing to put it in writing. A matching commitment. Barcelona's word alongside Castile's."
        },
        {
          "speaker": "fiveller",
          "text": "And the trading conference. If Barcelona hosts such a meeting, we commit our resources. Our halls. Our hospitality. That is something concrete we can offer."
        },
        {
          "speaker": "sant_climent",
          "text": "Is this acceptable, Your Majesty? Barcelona's commitment, in writing, to match your own terms—equal treatment, equal access—for Castilian merchants in our port? And our pledge to host and support the international gathering you propose?"
        },
        {
          "speaker": "juan_ii",
          "text": "That sounds fair. Is the letter finished Lucia? If it is, would you be so kind as to read it aloud for this council?"
        },
        {
          "speaker": "narrator",
          "text": "Lucia sets down the quill and lifts the parchment, allowing the ink a moment to dry. She rises from the small table, her bearing regal despite the improvised setting. The hall falls utterly silent."
        },
        {
          "speaker": "lucia",
          "text": "Juan, by the Grace of God King of Castile and León, to all officials, harbor masters, and servants of the Crown within Our realm, and to all Christian princes and merchants who may read these words, greeting. In the spirit of cooperation between Christian kingdoms and for the increase of honest trade, We do hereby decree and instruct as follows: First, that the Masters of the Orders of Santiago, Calatrava, and Alcántara shall direct their nascent naval forces toward the suppression of piracy, with particular attention to the corsairs of Salé who prey upon Christian shipping. They shall coordinate such efforts with the Kingdom of Aragón, should that realm choose to commit forces to this righteous cause. Second, that all harbor officials within Our realm, and most especially those of Málaga, Almería, and such other ports as fall under Our authority, shall treat merchants of Aragón and Portugal as they would treat merchants of Castile—subject to the same customs, the same duties, the same courtesies, and the same speed of licensing, with no distinction made upon the origin of their vessels. Third, that Don García López de Padilla, Governor of Granada, shall develop such policies as prevent the silk trade of that newly Christian territory from flooding and disrupting the markets of our brother kingdoms, so that the integration of Granada into Christendom proceeds with balance and justice to all. Fourth, that Our officials shall adopt a practice of informing the merchants of Portugal and Aragón of significant changes to customs rates and trading regulations, so that honest traders may make informed decisions. Fifth, that We encourage the city of Barcelona, should it choose to host a gathering of traders from the Christian kingdoms of Iberia, and We shall encourage Castilian merchants to attend such a meeting in good faith, sending proper delegation to work toward the common flourishing of trade. Given under Our hand, in the city of Barcelona, in the year of Our Lord fourteen hundred and thirty-four. Juan Rex"
        },
        {
          "speaker": "sant_climent",
          "text": "This is... more than we expected, Your Majesty. Barcelona will honor its commitment. Equal treatment for Castilian merchants in our port. In writing, as promised. Does the Consell de Cent consent to Barcelona's reciprocal commitment?"
        },
        {
          "speaker": "narrator",
          "text": "A murmur rises—and then, starting from the merchants' benches and spreading through the artisans and citizens, a growing chorus: 'Sí. Sí. Sí.'"
        }
      ],
      "roll": null,
      "recap": "Juan II concludes trade negotiations with Barcelona's Consell de Cent by drafting a comprehensive royal letter addressing Catalan concerns about equal treatment in Castilian ports, anti-piracy cooperation, Granada silk regulation, and information sharing. The council reciprocates by committing Barcelona to equal treatment of Castilian merchants and agreeing to host an international traders' conference."
    },
    {
      "id": "evt_1434_00336",
      "type": "diplomatic_proposal",
      "date": "1434-01-27",
      "end_date": null,
      "location": "Barcelona, Palau Reial",
      "participants": [
        "juan_ii",
        "lucia",
        "hug_roger_iii"
      ],
      "exchanges": [
        {
          "speaker": "narrator",
          "text": "Don Ramon returns precisely as the cathedral bells mark the hour. He escorts Juan and Lucia through the Palau Reial to a smaller receiving chamber—intimate, private, away from listening ears. \"The Count awaits within. I informed Her Majesty of the Consell de Cent's... outcome.\" He pauses. \"She expressed surprise.\" He does not elaborate on what kind of surprise. The door opens. Hug Roger III, Count of Pallars Sobirà, rises from a chair by the window. He is perhaps fifty, grey-bearded, with the weathered face of a man who has spent decades managing mountain territories on the French border. His clothing is fine but not ostentatious—practicality over display. His bow is correct, nothing more."
        },
        {
          "speaker": "hug_roger_iii",
          "text": "Your Majesties. Thank you for receiving me privately. What I have to say is... not for general ears."
        },
        {
          "speaker": "juan_ii",
          "text": "Of course count. Let us go inside and listen to what you have to say."
        },
        {
          "speaker": "narrator",
          "text": "The chamber is small, wood-paneled, lit by narrow windows overlooking an interior courtyard. Don Ramon withdraws, closing the door behind him with a soft click. Pallars does not sit until Juan and Lucia have taken their seats. When he does, he leans forward, elbows on knees, hands clasped—a soldier's posture, not a courtier's."
        },
        {
          "speaker": "hug_roger_iii",
          "text": "I will not waste Your Majesty's time with pleasantries. Last night you showed me Alfonso's letter. You spoke of ending the Naples war quickly. Of the cost in coin and sons. This morning, I learned Your Majesty visited the Consell de Cent and gave them a royal charter promising equal treatment for Catalan merchants in Granada's ports. The merchants are delighted. Don Guillem de Vic speaks of 'new beginnings.' Bishop Climent Sapera has apparently rediscovered his faith. Your Majesty moves quickly. In two days, you have done more for Aragonese interests than most visiting kings manage in a month. So I ask myself: why? What does the King of Castile want from Aragón that he works so hard to charm us?"
        },
        {
          "speaker": "juan_ii",
          "text": "Who is to say that it is not Aragon who is charming me? The trade arrangements are reciprocal and Castilian merchants benefit from it as well when visiting Aragonese ports. And it is the bishop himself who discovered his calling again. There is nothing more beautiful than someone coming before God in humility. But I must confess that there is the matter of succession looming over us. If fate would have me be king of Aragon, then I want Aragon to know me. And I will want to know Aragon. That seems to be what everyone is asking me. Will I make Aragon a subject of Castile? Will I change trade arrangements? Will I honour existing feudal contracts? All while my cousin is still alive and well and will be hopefully for many years to come."
        },
        {
          "speaker": "narrator",
          "text": "Pallars listens without interruption. His weathered face reveals little—a man who has learned to keep his thoughts behind stone walls. When Juan finishes, the Count is silent for a long moment. He rises from his chair and moves to the window, looking out at the courtyard below."
        },
        {
          "speaker": "hug_roger_iii",
          "text": "Your Majesty speaks plainly. I respect that. Most men in your position would offer reassurances. Promises. Vows that nothing will change. You admit the truth—that you are here to be seen. To prepare for what may come. But Your Majesty will forgive me if I have heard kings speak of 'knowing' realms before. My grandfather heard Pedro of Castile speak of knowing Aragón. It did not end well for anyone."
        },
        {
          "speaker": "narrator",
          "text": "He returns to his chair but does not sit. He stands behind it, hands resting on its back."
        },
        {
          "speaker": "hug_roger_iii",
          "text": "You ask what everyone fears. I will tell you what I fear. I fear that my sons will die in Italy for a crown Alfonso will never wear. I fear that Aragonese gold will continue flowing south while our mountain villages empty. I fear that when Alfonso finally falls from a Neapolitan wall or catches Roman fever, the man who inherits will see Aragón as a treasury to be raided for Castilian ambitions. Your Majesty has sent forty thousand florins to support Alfonso's Italian campaign. Catalan ships carry Castilian gold to fund a war that has already cost me a nephew and three cousins' sons. So when Your Majesty speaks of wanting to know Aragón—I must ask: do you wish to know us as partners? Or as the next source of men and money for the next war?"
        },
        {
          "speaker": "juan_ii",
          "text": "What would you do then? End the war? Capitulate? Will the Anjou accept a white peace? Or will they demand concessions? What would you do?"
        },
        {
          "speaker": "narrator",
          "text": "Pallars' jaw tightens. The question has landed where Juan intended it. He is silent for a long moment. When he speaks, his voice is quieter—harder."
        },
        {
          "speaker": "hug_roger_iii",
          "text": "What would I do. Your Majesty asks me to solve in a sentence what Alfonso has failed to solve in twelve years. I would not have started it. But that counsel comes too late by a decade. If it were mine to decide? I would negotiate. Not capitulate—negotiate. René of Anjou is not his brother. He has Provence to manage, a claim to Naples he cannot enforce alone, and less stomach for endless war than Louis had. Would he accept a white peace? No. But he might accept a partition. Alfonso keeps Calabria and Sicily. René takes Naples itself. Both claim the title, neither fights for it. It is ugly. It satisfies no one fully. But it stops the bleeding. Your Majesty has influence with Alfonso now. Castilian gold speaks loudly. If you counseled partition rather than total victory... But that is not what Your Majesty has done. You have sent florins and ships to help Alfonso win. So I ask again—what manner of king will you be to us?"
        },
        {
          "speaker": "juan_ii",
          "text": "You make an important point. The war should not have started in the first place. But we are past this now. You say that the war has cost Aragon gold and blood. A sentiment I share, the war has gone on for long enough. I have given Alfonso support in order to bring the war to a conclusion, not to let it drag along. I will visit him this year on my way to Constantinople and will council his on the situation. I will tell him that the war has to end, that ten years of war has drained his kingdom and he can ask no more of his subjects. Hopefully he will listen to me. Even if he cannot take all of Naples, the war has now come to a conclusion."
        }
      ],
      "roll": null,
      "recap": "Count Pallars confronts Juan about his true intentions in Aragón, expressing fear that Juan sees the realm as a source of men and money for future wars. Juan admits the succession question openly and promises to counsel Alfonso to end the Italian war when he visits him en route to Constantinople. The conversation reveals the deep tensions between Aragonese war-weariness and Juan's previous financial support for Alfonso's campaign."
    },
    {
      "id": "evt_1434_00337",
      "type": "diplomatic_proposal",
      "date": "1434-01-27",
      "end_date": null,
      "location": "Barcelona, Palau Reial",
      "participants": [
        "juan_ii",
        "count_of_pallars",
        "lucia"
      ],
      "exchanges": [
        {
          "speaker": "count_of_pallars",
          "text": "You will counsel him to end the war. And you say the war must conclude, even without total victory. These are better words than I expected, Your Majesty. I will not pretend otherwise. But words are easy. Alfonso has heard counsel before. His own wife has begged him to come home. María has managed his kingdom for four years while he chases Italian dreams. He does not listen."
        },
        {
          "speaker": "count_of_pallars",
          "text": "So I must ask: when will you see Alfonso? You say you travel to Constantinople—that is east. Naples is... Will you go to him before Constantinople? After? Will this counsel happen in weeks, or months, or next year? And what will you propose? You say the war must end. End how? Partition, as I suggested? Complete withdrawal? Some other arrangement? Telling Alfonso 'the war must end' means nothing. He believes he is winning. He will say 'yes, it will end—when I am crowned in Naples.' That is not what we need. Give me something concrete, Your Majesty. A route. A timeline. A proposal. Something I can take back to men who have buried their sons."
        },
        {
          "speaker": "juan_ii",
          "text": "I will travel to Rome first at the 1st of March. After my meeting with the pope, I will travel to Alfonso, wherever in Naples he is. I will tell him what I have told you. But I can only speak for myself, for Castille. I cannot speak on behalf of his own council or subjects. If you ask me to speak to my cousin on your behalf and maybe on behalf as well of others, then I could. But only with the blessing of the regency council. Otherwise, I would be meddling in the affairs of his kingdom. Remember that I hold no office or position in Aragon. If you want me to deliver a letter or statement from his kingdom concerning the state of the war and the kingdom, I can carry and deliver this message of course."
        },
        {
          "speaker": "narrator",
          "text": "Pallars' expression closes like a fortress gate. He is silent for a long moment. When he speaks, his voice is flat—not angry, which would be easier to address, but tired."
        },
        {
          "speaker": "count_of_pallars",
          "text": "A letter. I came here hoping to find a king who would use his influence. Who would tell Alfonso: the war ends, or the gold stops. Who would speak with the voice of a man who has power and is willing to wield it. Instead, Your Majesty offers to carry letters. To deliver messages. To wait for the regency council's blessing before speaking words that might actually matter."
        },
        {
          "speaker": "count_of_pallars",
          "text": "I have buried a nephew and three cousins' sons in Italian soil, Your Majesty. Their mothers did not ask me to find someone who respects proper channels. They asked me to find someone who would stop the bleeding. You say you hold no office in Aragon. This is true. But you hold forty thousand florins of influence with Alfonso. You hold a fleet in Valencia's harbor. You hold the papal favor that legitimizes his claim. These are not nothing. These are power. And you choose to wrap that power in procedure and wait for authorization."
        },
        {
          "speaker": "count_of_pallars",
          "text": "I thank Your Majesty for the audience. I will inform the Aragonese faction that the King of Castile is a man of careful words and proper process. God keep Your Majesty. And may your caution serve you better than boldness has served Alfonso."
        },
        {
          "speaker": "juan_ii",
          "text": "I do understand your position, and let me assure you that I will do what I can as best as I can to end the war. I have learned that smashing my fist on the table does not always yield the best results. I will pray for the fallen sons and the families who have lost them. Thank you for your time."
        },
        {
          "speaker": "narrator",
          "text": "Pallars hesitates for a moment. Then he takes Juan's hand. His grip is firm—a soldier's grip—but brief. His eyes search Juan's face, looking for something. Whether he finds it is unclear."
        },
        {
          "speaker": "count_of_pallars",
          "text": "I believe you mean what you say, Your Majesty. I simply do not know if meaning well is enough. Pray for them. They would appreciate that."
        },
        {
          "speaker": "narrator",
          "text": "He opens the door, bows once more to Lucia, and is gone. His footsteps echo down the corridor, measured and steady, carrying the weight of a man returning to deliver unwelcome news. The chamber is quiet after he leaves. Lucia rises from her chair, moving to stand beside Juan. She does not speak immediately—she has learned when words help and when they do not."
        }
      ],
      "roll": null,
      "recap": "Juan offers to counsel Alfonso to end the war and carry messages from the Aragonese faction, but insists on proper authorization from the regency council. Pallars, disappointed by Juan's cautious approach and reluctance to use his influence directly, leaves believing Juan means well but doubts his effectiveness in stopping the Italian war that has claimed so many Aragonese lives."
    },
    {
      "id": "evt_1434_00338",
      "type": "religious_event",
      "date": "1434-01-28",
      "end_date": null,
      "location": "Barcelona, Cathedral of Santa Eulàlia",
      "participants": [
        "juan_ii",
        "lucia",
        "catalina",
        "bishop_francesc_climent_sapera",
        "maria",
        "count_of_pallars",
        "don_guillem_de_vic"
      ],
      "exchanges": [
        {
          "speaker": "narrator",
          "text": "The cathedral rises from the heart of the Barri Gòtic like a prayer carved in stone. Gothic spires reach toward a winter sky, and the morning light filters through high windows, casting colored shadows across ancient flagstones. The royal party processes through the great doors: Juan and Lucia, Catalina carried by Inés, the household knights in their best doublets, Don Ramon and a contingent of Aragonese officials. The pews are full—word has spread that the King of Castile attends Mass, and Barcelona's faithful have come to see."
        },
        {
          "speaker": "narrator",
          "text": "Bishop Francesc Climent Sapera waits at the altar in full vestments. He looks... different. There is something in his bearing that was not there two days ago. A straightness to the spine. A clarity in the eyes. Before the Mass begins, Juan approaches the bishop with his request."
        },
        {
          "speaker": "bishop_francesc_climent_sapera",
          "text": "The fallen sons of Aragón. And their families. Yes. Yes, I will pray for them. This is... not a prayer I expected a Castilian king to request. But it is a prayer that is long overdue."
        },
        {
          "speaker": "narrator",
          "text": "The Mass itself is... remarkable. Bishop Climent Sapera preaches not of politics or crowns, but of service. Of the difference between power wielded for glory and power wielded for others. He speaks of Christ washing the feet of his disciples—a king becoming a servant. He does not mention Juan by name. He does not need to."
        },
        {
          "speaker": "narrator",
          "text": "And when he prays for the fallen sons—reading the names of those Barcelona families have lost in Italy, names he has clearly gathered in the night—something breaks open in the cathedral. Weeping. Not performative grief, but the raw sound of wounds finally acknowledged. An old woman in black clutches her rosary and sobs. A grey-haired man bows his head, shoulders shaking. Somewhere near the back, a young widow holds her children close. The prayer continues for nearly ten minutes. Name after name. Family after family."
        },
        {
          "speaker": "narrator",
          "text": "Afterward, as the congregation files out into the morning light, Juan notices several things: The Count of Pallars stands near the back of the cathedral. He was not there when the Mass began. His weathered face is unreadable, but he has not left. Don Guillem de Vic hovers near the doors, looking uncertain—the Naples prayer was not what the Neapolitan faction expected from their new ally. And María—Queen María—stands in a side chapel, alone, a candle flickering before her. She has been crying."
        },
        {
          "speaker": "catalina",
          "text": "Long. Very long. The man talked and talked. People were sad. The lady cried. Why sad, Papa? Why the people crying?"
        },
        {
          "speaker": "juan_ii",
          "text": "Sometimes, people die. That means they leave and never come back. That makes us all sad, especially if we love them very much. Would you be sad if I would leave and never come back?"
        },
        {
          "speaker": "catalina",
          "text": "No. Papa not leave. Papa stay. Catalina not sad. Papa not go away. Papa promise. The crying lady. Her papa went away? Her papa not come back?"
        },
        {
          "speaker": "juan_ii",
          "text": "The children's papa did not come back. They are very sad and so is the mama. If this happens we are all sad with them."
        },
        {
          "speaker": "catalina",
          "text": "Sad with them. Catalina sad with them too? Mama. We give the crying lady a crostata? Papa stay and be sad with Catalina if... if someone goes away."
        },
        {
          "speaker": "juan_ii",
          "text": "Catalina, what do we do when we are sad with someone else? We have no crostata here so we cannot give one. What else can we do? Can we give them a hug?"
        },
        {
          "speaker": "catalina",
          "text": "A hug. But... Catalina not know her. Strangers. Inés says strangers are... Papa come too? Okay. Catalina give hug. Papa and Mama come."
        }
      ],
      "roll": {
        "table_id": "cathedral_mass_resonance",
        "value": 73,
        "outcome": "The Mass Resonates"
      },
      "recap": "Juan requests Bishop Climent Sapera pray for the fallen sons of Aragón during Mass at Barcelona Cathedral. The bishop's powerful sermon and prayer for the war dead moves the congregation to tears, creating a moment of profound grief and healing. Juan's young daughter Catalina learns about death and compassion, ultimately deciding to offer comfort to grieving strangers with her parents' support."
    },
    {
      "id": "evt_1434_00339",
      "type": "npc_action",
      "date": "1434-01-28",
      "end_date": null,
      "location": "Barcelona, Cathedral of Santa Eulàlia",
      "participants": [
        "juan_ii",
        "catalina",
        "lucia",
        "maria",
        "count_of_pallars"
      ],
      "exchanges": [
        {
          "speaker": "narrator",
          "text": "She reaches out, wanting to be set down. Her small hand finds Juan's and grips it tightly. Across the cathedral, the old woman in black has noticed the royal family's attention. She freezes, uncertain, clutching her rosary. Her daughter—or granddaughter—beside her looks equally bewildered. María remains in the chapel doorway, watching. The Count of Pallars has not moved from the back of the cathedral. The moment holds, waiting."
        },
        {
          "speaker": "narrator",
          "text": "Catalina walks three steps toward the widow, her small hand gripping Juan's fingers tightly. Then she stops. The old woman in black looms before her—a stranger in dark clothes, face wet with tears, eyes red and swollen. The daughter beside her stares down at the approaching princess with barely concealed alarm. Catalina's courage evaporates. She spins and buries her face against Juan's leg, arms wrapping around his knee. A small whimper escapes her."
        },
        {
          "speaker": "catalina",
          "text": "Papa..."
        },
        {
          "speaker": "narrator",
          "text": "The cathedral seems to hold its breath. The widow stands frozen, uncertain—should she kneel? Approach? Retreat? A king has walked toward her with his child and now the child clings to him in obvious distress."
        },
        {
          "speaker": "narrator",
          "text": "Your—Your Majesty, the widow manages, dropping into an unsteady curtsy. Her daughter follows suit, nearly stumbling. We are—I am honored—I do not— She trails off, lost. Catalina refuses to look up. Her small shoulders tremble. Lucia moves closer, her hand finding Catalina's back, murmuring something soft and reassuring. But the moment has curdled. What was meant to be simple grace has become awkward theater—a king standing in the middle of a cathedral with a frightened toddler attached to his leg and a bewildered widow unsure whether she has somehow given offense."
        },
        {
          "speaker": "narrator",
          "text": "Forgive us, Your Majesty, she says quickly. My mother is... it has been a difficult morning. We should not take more of your time—"
        },
        {
          "speaker": "juan_ii",
          "text": "It's allright. Catalina felt sad for you for losing your husband and father. She is still very young and sometimes a bit shy. I have been praying for you and families like yours and will continue to do so. Hopefully the war will finally be over."
        },
        {
          "speaker": "narrator",
          "text": "The widow's hands tremble as she clutches her rosary. Up close, Juan can see the depth of the lines etched into her face—not old, but aged by grief. She might be forty. She looks sixty."
        },
        {
          "speaker": "narrator",
          "text": "My husband, she says, her voice barely a whisper. And my son. Both. The daughter's hand tightens on her mother's arm. The widow's eyes flicker to Catalina, still hiding her face against Juan's shoulder. Something softens in her expression—the universal recognition of a mother seeing a frightened child. She is beautiful, the widow manages. Your daughter. She is... She cannot finish. Tears spill down her cheeks."
        },
        {
          "speaker": "narrator",
          "text": "Thank you, Your Majesty. For the prayers. For— She gestures vaguely toward the altar, toward where the bishop read the names. No one has... we have not heard their names spoken in church before. Not once. Not in three years. She curtsies again, unsteady, clearly desperate to flee but unsure if she has permission. God keep Your Majesty, she whispers. And your little one. Keep her safe. Keep her... Her voice breaks."
        },
        {
          "speaker": "narrator",
          "text": "The daughter steps in, supporting her mother's elbow. Thank you, Your Majesty, she says quietly, her eyes unreadable. We will pray for your family as well. It is not warm. It is not cold. It is the response of people who do not know what to make of a king who approaches them in a cathedral—who cannot tell if this is genuine or performance, and who are too exhausted by grief to parse the difference. They retreat toward the doors, the daughter guiding her mother with gentle hands."
        },
        {
          "speaker": "catalina",
          "text": "Lady still sad, Papa"
        },
        {
          "speaker": "juan_ii",
          "text": "It's allright love. We dont have to give hugs or crostatas to everyone who is sad."
        }
      ],
      "roll": {
        "table_id": "catalina_approaches_widow",
        "value": 4,
        "outcome": "Catalina loses courage. She hides behind Juan's leg, suddenly shy. The moment becomes awkward. The widow curtsies uncertainly, unsure what is expected. The gesture, though well-meant, falls flat."
      },
      "recap": "Juan attempts to comfort a grieving widow by having Catalina approach her, but the toddler becomes frightened and hides against her father's leg. The encounter becomes awkward, though Juan manages to salvage it somewhat by speaking gently with the widow about her losses and offering prayers. The widow reveals she lost both husband and son in the war, and expresses gratitude that their names were finally spoken in church."
    },
    {
      "id": "evt_1434_00340",
      "type": "economic_event",
      "date": "1434-01-28",
      "end_date": null,
      "location": "Barcelona, Don Guillem de Vic's Residence",
      "participants": [
        "juan_ii",
        "don_guillem_de_vic",
        "lucia"
      ],
      "exchanges": [
        {
          "speaker": "narrator",
          "text": "Don Guillem straightens as Juan approaches, composing his features into something resembling courtly ease. It does not quite succeed."
        },
        {
          "speaker": "don_guillem_de_vic",
          "text": "Your Majesty. Your Majesty. A... powerful Mass. The bishop spoke well. And the prayer for the fallen— Very moving."
        },
        {
          "speaker": "don_guillem_de_vic",
          "text": "I have prepared the letters Your Majesty requested. Introductions to the Gualbes banking family. A framework for financial cooperation between Castilian and Catalan merchant houses. I was not certain... that is, I did not know if today was still appropriate to discuss such matters. Given the tone of the morning."
        },
        {
          "speaker": "juan_ii",
          "text": "We are happy to review the letters with you, although we trust your instincts in these matters. Regarding the prayers, know that I am committed to continued aid to Alfonso to finish the war. But must never close our eyes to the costs of war. Don't you agree?"
        },
        {
          "speaker": "don_guillem_de_vic",
          "text": "The costs of war. Yes. Of course, Your Majesty. War is... costly. I confess I did not expect— The Neapolitan faction has perhaps focused on the prize. Naples. The crown. The Mediterranean trade that flows from victory. We speak less of the price."
        },
        {
          "speaker": "don_guillem_de_vic",
          "text": "My own cousin died at Ponza. When Alfonso was captured. I have not thought of him in... some time. There is always the next letter to write. The next alliance to secure. The next ship to fund. You are asking if I can hold both things at once. The necessity of victory and the weight of what victory costs. I do not know if I have done so before. But I take Your Majesty's point."
        },
        {
          "speaker": "narrator",
          "text": "Don Guillem's residence is a fine townhouse near the Plaça del Rei—not ostentatious, but comfortable. Catalan practicality over Castilian grandeur. The letters are well-crafted. Introductions to the Gualbes family emphasizing mutual benefit. A framework for joint ventures in the Granada trade. Careful language that commits to cooperation without surrendering leverage."
        },
        {
          "speaker": "juan_ii",
          "text": "We visit him and approve the letters there. Then we spend the next few days relaxing and acquainting ourselves with Catalan customs and sports."
        }
      ],
      "roll": null,
      "recap": "Juan meets with Don Guillem de Vic to review trade correspondence, including letters to the Gualbes banking family and frameworks for Castilian-Catalan merchant cooperation. The conversation reveals Don Guillem's internal conflict between supporting the war effort and acknowledging its human costs, particularly after Juan's prayer for fallen soldiers. Juan approves the well-crafted letters and plans to spend coming days experiencing Catalan culture."
    },
    {
      "id": "evt_1434_00341",
      "type": "ceremony",
      "date": "1434-01-28",
      "end_date": "1434-02-05",
      "location": "Barcelona, Various Sites",
      "participants": [
        "juan_ii",
        "catalina",
        "lucia",
        "don_guillem",
        "arnau_despujol",
        "count_of_pallars",
        "count_of_cardona",
        "maria_of_aragon",
        "don_ramon"
      ],
      "exchanges": [
        {
          "speaker": "narrator",
          "text": "The enormous painted figures—a king and queen, a Moor and a Christian knight, fantastical creatures three times the height of a man—sway through Barcelona's narrow streets on the shoulders of hidden carriers. Drums pound. Pipes wail. The crowd surges and cheers."
        },
        {
          "speaker": "catalina",
          "text": "Papa! Big people! Very big people!"
        },
        {
          "speaker": "narrator",
          "text": "She insists on being held aloft to see better, then insists on being put down to dance, then insists on being picked up again when the dragon gegant passes too close and she loses her nerve. Lucia laughs more than Juan has heard in weeks."
        },
        {
          "speaker": "narrator",
          "text": "The Barcelonans notice their visitors. Word spreads through the crowd: the Castilian king, the one who conquered Granada, he came to our festival. Some press closer to see. Others offer sweets to the little princess. An old woman presses a ribbon into Catalina's hands—a blessing, she says, for la princesita de la cuerda."
        },
        {
          "speaker": "arnau_despujol",
          "text": "Thirty oars each side. Lateen sail for speed. Ram-prow reinforced with bronze."
        },
        {
          "speaker": "arnau_despujol",
          "text": "Your Majesty knows ships."
        },
        {
          "speaker": "juan_ii",
          "text": "I am learning. Castile has never been a naval power. That must change."
        },
        {
          "speaker": "arnau_despujol",
          "text": "If Your Majesty ever wishes to send shipwrights to study our methods... Barcelona's techniques are no secret to those who ask properly."
        },
        {
          "speaker": "narrator",
          "text": "Juan listens more than he speaks. He asks about trade routes, shipping costs, the challenges of dealing with Italian city-states. He does not promise. He does not commit. He learns."
        },
        {
          "speaker": "count_of_pallars",
          "text": "A good kill."
        },
        {
          "speaker": "juan_ii",
          "text": "The falcon did the work."
        },
        {
          "speaker": "count_of_pallars",
          "text": "A modest king. Unusual."
        },
        {
          "speaker": "count_of_pallars",
          "text": "The council meets in four days. I have spoken with Don Ramon about the message to Alfonso. We are... drafting language."
        },
        {
          "speaker": "catalina",
          "text": "Papa! Fish! Big fish!"
        },
        {
          "speaker": "catalina",
          "text": "Papa! Bird! Dead bird!"
        },
        {
          "speaker": "catalina",
          "text": "Papa! Smell bad!"
        },
        {
          "speaker": "narrator",
          "text": "The market vendors are charmed. Word spreads. By afternoon, someone has given Catalina a small basket of candied almonds, a ribbon for her hair, and a tiny wooden cat that a craftsman carved on the spot."
        },
        {
          "speaker": "don_ramon",
          "text": "From His Majesty King Alfonso. Addressed to Her Majesty the Regent."
        },
        {
          "speaker": "don_ramon",
          "text": "Her Majesty wishes to inform His Majesty of Castile that the council meeting will proceed as planned. His Majesty's presence is... welcome."
        },
        {
          "speaker": "lucia",
          "text": "Tomorrow."
        },
        {
          "speaker": "juan_ii",
          "text": "Tomorrow."
        },
        {
          "speaker": "lucia",
          "text": "Are you ready?"
        }
      ],
      "roll": null,
      "recap": "Over nine days in Barcelona, Juan participates in the Festa de Sant Pau, visits shipyards and markets, hunts with Aragonese nobles, and builds relationships with local merchants and craftsmen. Catalina charms the citizens while the Count of Pallars begins to warm to Juan. María receives a letter from Alfonso and declares Juan's presence at the upcoming council 'welcome.'"
    },
    {
      "id": "evt_1434_00342",
      "type": "decision",
      "date": "1434-02-06",
      "end_date": null,
      "location": "Barcelona, Palau Reial",
      "participants": [
        "juan_ii",
        "maria_of_aragon",
        "lucia_of_castile",
        "ramon_de_perellos",
        "count_of_pallars",
        "berenguer_de_bardaxi",
        "viscount_of_rocaberti",
        "guillem_de_vic",
        "bishop_of_girona"
      ],
      "exchanges": [
        {
          "speaker": "narrator",
          "text": "The council chamber of the Palau Reial is smaller than Juan expected—intimate, even. A rectangular table of dark oak dominates the space, surrounded by high-backed chairs bearing the arms of Aragón. Tapestries depicting the conquest of Valencia line the walls. Morning light streams through narrow windows. The councillors are already assembled when Juan and Lucia enter."
        },
        {
          "speaker": "maria_of_aragon",
          "text": "Your Majesty of Castile. Your Majesty. The Council of Aragón welcomes you as honored guests."
        },
        {
          "speaker": "narrator",
          "text": "The word guests carries weight. She gestures to two chairs set slightly apart from the table—visible, included, but not of the council."
        },
        {
          "speaker": "maria_of_aragon",
          "text": "Please. Be seated."
        },
        {
          "speaker": "ramon_de_perellos",
          "text": "Her Majesty the Regent has prepared an agenda for today's proceedings. With Your Majesty's permission?"
        },
        {
          "speaker": "narrator",
          "text": "María nods."
        },
        {
          "speaker": "ramon_de_perellos",
          "text": "First: the matter of trade cooperation between the kingdoms, including the recent agreements with the Consell de Cent. Second: the Constantinople expedition and Castile's intentions regarding aid to the Emperor. Third: the Naples campaign and its... current state. Her Majesty has ruled that discussion of succession, inheritance, or the formal union of crowns shall be reserved until King Alfonso has been consulted."
        },
        {
          "speaker": "narrator",
          "text": "Around the table, eyes flicker toward Juan. Watching. Measuring."
        },
        {
          "speaker": "ramon_de_perellos",
          "text": "Does Your Majesty of Castile have any questions before we proceed?"
        },
        {
          "speaker": "juan_ii",
          "text": "No questions. If I may thank the council for inviting me and my queen. We will be honoured observers."
        },
        {
          "speaker": "narrator",
          "text": "María's expression remains neutral, but something in her posture eases—barely perceptible. Juan has accepted the boundaries."
        },
        {
          "speaker": "maria_of_aragon",
          "text": "The council thanks Your Majesty for your courtesy. The first matter. Trade cooperation."
        },
        {
          "speaker": "ramon_de_perellos",
          "text": "The Consell de Cent has provided a summary of their recent agreements with His Majesty of Castile. Equal treatment for Catalan merchants in Granada's ports. Reciprocal treatment for Castilian merchants in Barcelona. A commitment to host an international trading conference. Don Guillem de Vic has also prepared agreements with the Gualbes banking family establishing frameworks for financial cooperation."
        },
        {
          "speaker": "viscount_of_rocaberti",
          "text": "A moment. Before we celebrate agreements made outside this council's authority, perhaps we should understand what was actually promised."
        },
        {
          "speaker": "narrator",
          "text": "He turns to face Juan directly for the first time."
        },
        {
          "speaker": "viscount_of_rocaberti",
          "text": "Your Majesty wrote a letter to Castilian port officials. Signed and sealed in Barcelona, in the hall of the Consell de Cent. A letter establishing trade policy for Granada. Policy that affects Aragonese merchants. Did Your Majesty consult this council before signing? Did Your Majesty consult the Regent? Or did Your Majesty simply... decide?"
        },
        {
          "speaker": "narrator",
          "text": "The chamber is very quiet. The moment stretches. The Viscount's question hangs in the air. Around the table, councillors watch—some looking at Juan, others at María. Don Guillem's hand has frozen over his documents. María regards Juan for a long moment. Her expression is unreadable. Then she inclines her head, the barest fraction."
        },
        {
          "speaker": "maria_of_aragon",
          "text": "His Majesty of Castile may respond to the Viscount's question."
        },
        {
          "speaker": "juan_ii",
          "text": "It is true what you say. I have indeed written a letter to my officials in Castille. An act to address concerns of Aragonese merchants and done in full openness and transparency. I have nothing to hide. But I think the question the count is actually asking is this: Is Juan undermining the authority of both the regency council and the king himself? Would he not have asked permission before writing to his own court? To those questions I say this. I fully respect the authority of both the king and this council. Witnesses to the meeting can attest that I specifically stated this publicly. Maria and king Alfonso know of my ambition to improve christian trade and my policies should come as no surprise. I would never draft policies regarding a kingdom other than my own. But when it concerns my own kingdom, I require no permission from other kingdoms as well."
        },
        {
          "speaker": "narrator",
          "text": "The silence that follows Juan's words is absolute. Rocabertí opens his mouth to respond—"
        },
        {
          "speaker": "maria_of_aragon",
          "text": "Enough."
        },
        {
          "speaker": "narrator",
          "text": "María's voice cuts through the chamber like a blade. Every head turns. The Regent has risen from her chair, the chain of office glinting in the morning light. Her eyes are fixed on the Viscount, and there is ice in them."
        },
        {
          "speaker": "maria_of_aragon",
          "text": "Viscount Rocabertí. Did I hear you correctly? Did you just question a sovereign king's right to instruct his own officials in his own kingdom?"
        },
        {
          "speaker": "viscount_of_rocaberti",
          "text": "Your Majesty, I merely—"
        },
        {
          "speaker": "maria_of_aragon",
          "text": "You merely suggested that the King of Castile requires our permission to govern Castile. You have insulted a crowned monarch. In my council. Under my authority. His Majesty of Castile came to this council as an honored guest. He accepted conditions. He has shown this body respect that—that he did not owe us. And you repay that courtesy by questioning his sovereignty? The letter His Majesty wrote instructs Castilian officials to treat Catalan merchants as equals. As equals. Is there anyone here who wishes to object to that? Anyone who believes our merchants should be treated worse in Granada's ports?"
        },
        {
          "speaker": "narrator",
          "text": "Silence."
        },
        {
          "speaker": "maria_of_aragon",
          "text": "I thought not. His Majesty of Castile has answered the question satisfactorily. The matter is closed. Don Ramon, proceed with the agenda."
        },
        {
          "speaker": "narrator",
          "text": "She turns to Juan. For a moment, their eyes meet. Something passes between them—not warmth, not yet, but something closer to recognition. The Count of Pallars catches Juan's eye across the table. He nods. Once. Barely perceptible."
        },
        {
          "speaker": "guillem_de_vic",
          "text": "The potential is significant. Granada's trade alone could generate returns of fifteen to twenty percent annually for participating houses—both Catalan and Castilian."
        },
        {
          "speaker": "bishop_of_girona",
          "text": "And the Church's interests? The tithes from this new commerce—how are they to be divided between dioceses?"
        },
        {
          "speaker": "guillem_de_vic",
          "text": "That... would require further consultation, Your Excellency."
        },
        {
          "speaker": "bishop_of_girona",
          "text": "Indeed it would. I trust such consultation will occur before agreements are finalized."
        },
        {
          "speaker": "maria_of_aragon",
          "text": "So noted. The trade agreements are accepted in principle, pending resolution of Church matters. The second item. Constantinople."
        },
        {
          "speaker": "berenguer_de_bardaxi",
          "text": "We have heard reports that His Majesty of Castile has committed substantial forces to Constantinople's defense. One thousand knights. Sixty thousand florins. We have also heard that His Majesty intends to travel there personally. Aragón has interests in the eastern Mediterranean. Our merchants trade in Constantinople. Our ships sail those waters. If Castile commits to a major military expedition in waters where Aragonese vessels operate, this council should understand the implications."
        },
        {
          "speaker": "count_of_pallars",
          "text": "And the costs. Another crusade. Another war requiring gold and men. We have experience with such ventures."
        },
        {
          "speaker": "maria_of_aragon",
          "text": "His Majesty of Castile may speak to the Constantinople matter, if he wishes."
        },
        {
          "speaker": "juan_ii",
          "text": "Let me state that I am not on crusade to fight the Ottomans. I am going to Constantinople to aid fellow Christians in need. This is publicly known but let me repeat the three options I will present to the Greeks. I will offer them sanctuary in my kingdom. They can leave their city and prevent further bloodshed in a war that can never be won. Constantinople will be no more, but its memory will live on."
        }
      ],
      "roll": null,
      "recap": "Juan faces the Aragonese Regency Council as an honored guest with limited authority. When Viscount Rocabertí challenges his right to write trade instructions to his own officials, Juan defends himself directly, prompting María to intervene decisively against the Viscount for questioning royal sovereignty. The council accepts trade agreements in principle and begins discussing Juan's Constantinople expedition."
    },
    {
      "id": "evt_1434_00343",
      "type": "decision",
      "date": "1434-02-06",
      "end_date": null,
      "location": "Barcelona, Palau Reial",
      "participants": [
        "juan_ii",
        "maria_of_castile",
        "berenguer_de_bardaxi",
        "count_of_pallars",
        "bishop_of_girona",
        "don_ramon",
        "viscount_of_rocaberti",
        "don_guillem"
      ],
      "exchanges": [
        {
          "speaker": "juan_ii",
          "text": "Let me state that I am not on crusade to fight the Ottomans. I am going to Constantinople to aid fellow Christians in need. I will offer them sanctuary in my kingdom. If they refuse to leave, I will repair their walls as promised and wish them good luck and leave with my men. Only if I think we can really win, if not only Castille, but also other christian kingdoms are serious about committing to war with the Ottomans, will I commit to war. Either way, the Greeks have asked for help and I have responded. How they wish to continue is up to them."
        },
        {
          "speaker": "narrator",
          "text": "The chamber stirs as Juan finishes. Councillors exchange glances—calculating, assessing."
        },
        {
          "speaker": "don_guillem",
          "text": "If Constantinople's trade survives—and if Castilian forces help ensure it survives—Catalan merchants stand to benefit. The eastern routes are... There are commercial considerations."
        },
        {
          "speaker": "count_of_pallars",
          "text": "Three options. Evacuation. Repair and departure. Or war, if others commit. This is... not what I expected to hear."
        },
        {
          "speaker": "berenguer_de_bardaxi",
          "text": "His Majesty speaks of grand strategy. Of Ottoman banners on Christian coasts. But I asked about Aragonese interests. Our merchants. Our ships. Our sailors. If Castilian warships operate in waters where Catalan trading vessels sail, what arrangements exist to prevent... confusion?"
        },
        {
          "speaker": "maria_of_castile",
          "text": "Gentlemen. His Majesty of Castile has outlined his intentions. He has not asked Aragón for troops, ships, or gold. The question before this council is whether Aragón has specific concerns that should be communicated."
        },
        {
          "speaker": "berenguer_de_bardaxi",
          "text": "First. What arrangements will His Majesty make to ensure Catalan vessels are recognized and protected by Castilian naval forces? Second. If the city falls, does Castile accept any obligation to evacuate Aragonese subjects? Third. If Castile decides to withdraw, what warning will His Majesty provide?"
        },
        {
          "speaker": "juan_ii",
          "text": "Do your ships not carry the flag of your kingdom? I assure you that my captains know of your flags and will not regard you as the enemy. You have my word that I shall grant aid and sanctuary to any Aragonese brothers who wish to leave. I will use my fleet to break any blockade and make sure everyone gets home safely should this occur."
        },
        {
          "speaker": "berenguer_de_bardaxi",
          "text": "These are not small promises, Your Majesty. A king's word in a council chamber is one thing. A treaty signed and sealed is another. If His Majesty were willing to formalize these commitments—a written undertaking, perhaps..."
        },
        {
          "speaker": "juan_ii",
          "text": "Of course sister, I will sign this document immediately if it serves to provide assurance to this council. Maybe we could include that Aragon shall also aid in the evacuation to the best of their ability, should such a situation occur? It seems fair to me since both kingdoms share the same interest."
        },
        {
          "speaker": "maria_of_castile",
          "text": "This council cannot commit the Crown of Aragón to military obligations without the King's consent. However. If His Majesty is willing to sign a document pledging Castilian protection... this council can recommend to King Alfonso that Aragón offer reciprocal assistance."
        },
        {
          "speaker": "juan_ii",
          "text": "If I arrive with Castille already committed and a recommendation from this council that Alfonso reciprocate, I may bring him in a difficult position. If this council can not commit to sign as well, then I propose I discuss this matter with the king directly so we may both sign at the same time."
        },
        {
          "speaker": "narrator",
          "text": "The chamber falls silent. María stares at Juan. For a long moment, her composed mask slips—not into anger or suspicion, but something closer to surprise."
        },
        {
          "speaker": "berenguer_de_bardaxi",
          "text": "His Majesty of Castile has just voluntarily surrendered an advantage."
        },
        {
          "speaker": "maria_of_castile",
          "text": "You would have had us in a corner. Castile committed, the council recommending, Alfonso with no graceful way to refuse. And you chose not to."
        },
        {
          "speaker": "don_ramon",
          "text": "Then the matter of Constantinople shall be noted as follows: His Majesty of Castile will discuss mutual protection of subjects with King Alfonso directly. This council will prepare a letter outlining our considerations and concerns."
        }
      ],
      "roll": null,
      "recap": "Juan presents his three-option approach to Constantinople to the Aragonese council, emphasizing caution over crusading glory. When pressed on protecting Aragonese interests, he offers written commitments but suggests mutual obligations. Rather than forcing Aragón into an awkward position, he voluntarily proposes to negotiate directly with Alfonso as equals, earning unexpected respect from the council."
    },
    {
      "id": "evt_1434_00344",
      "type": "decision",
      "date": "1434-02-06",
      "end_date": null,
      "location": "Barcelona, Palau Reial",
      "participants": [
        "juan_ii",
        "maria_of_aragon",
        "pallars",
        "don_ramon",
        "don_guillem",
        "rocaberti",
        "don_berenguer_de_bardaxi",
        "bishop_of_girona"
      ],
      "exchanges": [
        {
          "speaker": "maria_of_aragon",
          "text": "You would have had us in a corner. Castile committed, the council recommending, Alfonso with no graceful way to refuse. And you chose not to."
        },
        {
          "speaker": "don_ramon",
          "text": "Then the matter of Constantinople shall be noted as follows: His Majesty of Castile will discuss mutual protection of subjects with King Alfonso directly. This council will prepare a letter outlining our considerations and concerns for His Majesty to carry. Is this acceptable?"
        },
        {
          "speaker": "maria_of_aragon",
          "text": "The third item. Naples."
        },
        {
          "speaker": "narrator",
          "text": "The room tenses. This is the wound that has bled Aragón for twelve years."
        },
        {
          "speaker": "maria_of_aragon",
          "text": "Count Pallars. You indicated that you and Don Ramon have been drafting language regarding a message to the King. Will you present it?"
        },
        {
          "speaker": "narrator",
          "text": "Pallars rises from his chair. He is not a man given to theatrics—his movements are deliberate, economical. He produces a folded document from his doublet and spreads it on the table before him."
        },
        {
          "speaker": "pallars",
          "text": "This council has long debated how to address the Naples question with His Majesty King Alfonso. Some believe we should demand immediate withdrawal. Others believe we should support the campaign to its conclusion. For twelve years, we have done neither—sending gold and men while wringing our hands. Don Ramon and I have attempted to draft language that this council might actually agree upon. Language that speaks truth without ultimatum. That honors the King's sacrifices while acknowledging the kingdom's exhaustion."
        },
        {
          "speaker": "narrator",
          "text": "Pallars reads the draft letter to Alfonso, requesting he weigh the costs of continuing the Naples campaign after twelve years of war have strained the kingdom's treasury and noble houses."
        },
        {
          "speaker": "narrator",
          "text": "The chamber is silent. Don Guillem's face has gone pale. The Viscount of Rocabertí looks as though he wants to speak but is restraining himself. The Bishop of Girona studies his folded hands."
        },
        {
          "speaker": "don_guillem",
          "text": "The letter is... eloquent. But I wonder if 'swiftly' is not already within reach. His Majesty's recent victories—Calabria turning to his banner, Queen Joanna's envoys—"
        },
        {
          "speaker": "pallars",
          "text": "Queen Joanna has sent envoys before. Twice she has offered adoption. Twice she has revoked it. Joanna's word is written in sand. The situation has been 'different now' for twelve years, Don Guillem. My nephew's bones lie in Italian soil. Three cousins' sons. How many more until the situation is 'different enough'?"
        },
        {
          "speaker": "maria_of_aragon",
          "text": "This letter asks my husband to consider abandoning his life's work. The crown he has fought for since before our marriage. The dream that has sustained him through capture, through humiliation, through years of exile from his own kingdom. And yet. I have governed Aragón for four years in his absence. I have signed the levies. I have heard the widows' petitions. I have watched the treasury dwindle and the noble houses grow restless. The letter is not wrong."
        },
        {
          "speaker": "maria_of_aragon",
          "text": "His Majesty of Castile has indicated he will meet with King Alfonso. He has offered to carry messages from this council. Perhaps His Majesty has thoughts on how such a message might be received. If he wishes to share them."
        },
        {
          "speaker": "juan_ii",
          "text": "The council asks how this message might be received. I think it will achieve nothing. The message states that if the war is won swiftly - an unlikely outcome despite the recent victories - he should conclude and win it. But if it takes another decade, he should sue for peace. Also an unlikely outcome. I think that it will take another year to fully secure victory. Alfonso believes he can win in one year and this letter will not change anything about this I believe. Personally, I will assess the situation and see with my own eyes if indeed the war is effectively won. If it is not, I will counsel him to sue for peace immediately."
        },
        {
          "speaker": "pallars",
          "text": "The letter speaks for this council. It says what we believe, what we have paid, what we fear. His Majesty's assessment and counsel are his own matter—between kings. I would not discard the letter simply because His Majesty will also speak. But perhaps... the letter need not travel with His Majesty. Perhaps it should go through other channels. Royal courier. So that it arrives as this council's voice, separate from whatever His Majesty chooses to say."
        },
        {
          "speaker": "maria_of_aragon",
          "text": "Is this acceptable? The Naples letter sent by royal courier, arriving before or alongside His Majesty's visit, but not carried by his hand?"
        },
        {
          "speaker": "narrator",
          "text": "María counts the votes. Four in favor - Pallars, Don Berenguer de Bardaxí, the Bishop of Girona, and Rocabertí. Don Guillem opposes. The Regent abstains."
        },
        {
          "speaker": "maria_of_aragon",
          "text": "The letter will be sent. By royal courier. Within the week."
        },
        {
          "speaker": "pallars",
          "text": "His Majesty of Castile came to this council as a guest. He accepted conditions that no sovereign was obligated to accept. He answered challenges with patience. He offered commitments and then—declined to press advantage when he might have. I have been in councils for thirty years. I have seen kings bluster and threaten and demand. I have seen precious few listen. I would have the record note that the King of Castile conducted himself with honor in these proceedings."
        }
      ],
      "roll": null,
      "recap": "The Aragonese council debates a letter to King Alfonso urging him to reconsider the costly Naples campaign. Juan offers to personally assess the situation and counsel Alfonso if needed, but predicts the letter will achieve nothing. The council votes 4-1 to send the letter by royal courier rather than having Juan carry it. Pallars concludes by formally commending Juan's honorable conduct during the proceedings."
    },
    {
      "id": "evt_1434_00345",
      "type": "relationship_change",
      "date": "1434-02-06",
      "end_date": null,
      "location": "Barcelona, Regent's Garden",
      "participants": [
        "juan_ii",
        "maria_of_aragon",
        "lucia"
      ],
      "exchanges": [
        {
          "speaker": "narrator",
          "text": "The chamber empties slowly. Soon only Juan, Lucia, and María remain—and Don Ramon, hovering near the door with his papers. María stands at the head of the table, her hand resting on the regent's chair."
        },
        {
          "speaker": "maria_of_aragon",
          "text": "Brother. Will you walk with me? There is a garden. We could speak. Just the two of us. If your queen permits."
        },
        {
          "speaker": "juan_ii",
          "text": "Of course Maria. Will you give us a moment Lucia?"
        },
        {
          "speaker": "narrator",
          "text": "Lucia rises from her chair with quiet grace. Her eyes meet Juan's—a moment of wordless understanding passes between them."
        },
        {
          "speaker": "lucia",
          "text": "Of course. Sister. Take all the time you need. I will be with Catalina. She will want to hear about the very important meeting where Papa sat in a big chair and talked to important people."
        },
        {
          "speaker": "narrator",
          "text": "A soft smile, and she withdraws. Don Ramon holds the door for her, then glances at María."
        },
        {
          "speaker": "maria_of_aragon",
          "text": "Leave us, Don Ramon. The documents can wait an hour."
        },
        {
          "speaker": "narrator",
          "text": "The administrator bows and departs, closing the heavy door behind him. The council chamber falls silent. Dust motes drift in the afternoon light slanting through the narrow windows. María moves toward a small door half-hidden behind a tapestry. The garden is small—an intimate courtyard enclosed by high walls, invisible from the rest of the palace. A fountain murmurs at its center. Winter roses climb a trellis, their blooms sparse but fragrant. Stone benches line the paths. María walks to the fountain and stands with her back to Juan, looking down at the water. For a long moment, she does not speak."
        },
        {
          "speaker": "maria_of_aragon",
          "text": "I watched you today. In the council. You could have pressed us. On Constantinople. On the trade agreements. On a dozen small things where you held advantage. Why didn't you?"
        },
        {
          "speaker": "juan_ii",
          "text": "Advantage or imbalance also creates conflict. I seek none with Aragon."
        },
        {
          "speaker": "narrator",
          "text": "María is still for a long moment."
        },
        {
          "speaker": "maria_of_aragon",
          "text": "Conflict. I have spent four years managing conflict. Between the factions. Between what Alfonso wants and what the kingdom can give. Between what I am told to do and what I know must be done. You hurt me, Juan. When you first came. I know. Lucia told me you understood. That you learned. I watched you prove it today—with the Consell, with Don Ramon, with the council itself. But I need to understand something."
        },
        {
          "speaker": "narrator",
          "text": "She moves to a stone bench and sits, her hands folded in her lap. She looks up at him, and for a moment she is not the Regent of Aragón. She is his sister. A woman in her thirties, childless, governing a kingdom for a husband who may never return, watching her brother build an empire while she holds together what remains."
        },
        {
          "speaker": "maria_of_aragon",
          "text": "You speak of unity. Of kingdoms joining to become something new. Of neither holding dominance. But you are King of Castile. Conqueror of Granada. Heir presumptive to this throne I sit upon in Alfonso's absence. If Alfonso dies—when Alfonso dies—you will have everything. Castile. Aragón. Perhaps Naples, if his war succeeds. The largest Christian kingdom since Charlemagne. What happens to me, Juan? In this vision of yours. What place is there for a childless queen whose husband is gone and whose brother wears all the crowns?"
        },
        {
          "speaker": "narrator",
          "text": "Juan embraces her. María stiffens at first—the reflex of a woman who has held herself rigid for four years, who cannot afford softness. Then something breaks. She sags against him. A shudder runs through her. She does not weep—perhaps she has forgotten how—but her breath comes ragged, and her hands grip the fabric of his doublet like a drowning woman gripping driftwood."
        },
        {
          "speaker": "juan_ii",
          "text": "You are my sister Maria. I want nothing but for you to be happy. You already told me you do not want an estate somewhere to live in peace. What do you want? If you are interested in statecraft, I need many governors I can trust. Or you can stay at my court. Watch Catalina and my other children grow up. Educate them, be their aunt. But I do not know what you would want Maria. All I can say is that I will take care of you. What do you want?"
        },
        {
          "speaker": "narrator",
          "text": "A long moment passes. When she pulls back, her eyes are dry but reddened. She turns away, walking a few steps toward the winter roses. Her hand reaches out to touch a bloom, then withdraws."
        },
        {
          "speaker": "maria_of_aragon",
          "text": "What do I want. Alfonso wanted Naples. So I wanted Alfonso to have Naples. Father wanted a strong alliance with Castile. So I wanted to be a good wife, a good queen, a good regent. No one has ever asked me what I want, Juan. Not once. Not in thirty-four years. You offer me an estate. A governorship. A place at your court, watching your children grow. These are kind offers. Generous offers. The offers of a brother who wishes to take care of his sister. I have governed Aragón for four years. I have held together a kingdom while its king chased dreams in Italy. I have managed factions that wanted to tear each other apart. I have signed levies and heard petitions and made decisions that cost men their lives and livelihoods. And you offer me... an estate. Children to watch. A quiet corner where I will not be in the way. Is that what you see when you look at me, brother? A woman to be taken care of? Given a comfortable place and a gentle purpose?"
        },
        {
          "speaker": "juan_ii",
          "text": "No, not at all! I just offered them up as possibilities. And I just said you do NOT want an estate somewhere. I love you sister. I will never forget how you taught me about love when we met four years ago when I fell in love with that noble woman. It made me realize how important family is and how much I needed a sister. I love you Maria, but please let me love you. I cannot give what I cannot see. You have not answered my question. What do you want?"
        }
      ],
      "roll": null,
      "recap": "Juan and María share a private conversation in the regent's garden. María confronts Juan about her future role as his power grows, expressing fear of being marginalized despite her years of governing Aragón. When Juan offers various possibilities for her future, she rejects them as condescending charity, revealing her deep struggle with never having been asked what she truly wants for herself."
    },
    {
      "id": "evt_1434_00346",
      "type": "relationship_change",
      "date": "1434-02-06",
      "end_date": null,
      "location": "Barcelona, Regent's Garden",
      "participants": [
        "juan_ii",
        "maria_of_castile"
      ],
      "exchanges": [
        {
          "speaker": "juan_ii",
          "text": "I love you sister. I will never forget how you taught me about love when we met four years ago when I fell in love with that noble woman. It made me realize how important family is and how much I needed a sister. I love you Maria, but please let me love you. I cannot give what I cannot see. You have not answered my question. What do you want?"
        },
        {
          "speaker": "narrator",
          "text": "María opens her mouth. Closes it. She turns away again, her arms crossing over her chest. For a long moment she is silent, and when she speaks, her voice is rough."
        },
        {
          "speaker": "maria_of_castile",
          "text": "I don't know. I don't know, Juan. I have never— When I was a girl, I wanted to ride horses and read books about faraway places. Then I was told I would marry Alfonso, and I wanted to be a good wife. Then Alfonso left for Naples, and I wanted to be a good regent. Then the years passed, and I wanted— I wanted a child. Just one. Something that was mine. Something I had not been given or assigned or obligated to."
        },
        {
          "speaker": "narrator",
          "text": "She stands rigid, her back to him."
        },
        {
          "speaker": "maria_of_castile",
          "text": "God did not grant me that. So I governed. Because governing was what was needed. Because if I could not be a mother, I could at least be useful. And now you ask me what I want, and I stand here like a fool, because I have spent so long wanting what others needed me to want that I do not know if there is anything left underneath."
        },
        {
          "speaker": "narrator",
          "text": "She turns. Her eyes are bright—not with tears, but with something fiercer. Anger, perhaps. Or fear."
        },
        {
          "speaker": "maria_of_castile",
          "text": "You want to give me something, brother? Then give me time. Time to answer a question I have never been allowed to ask myself. And if I find an answer—if I discover that what I want is something you cannot give, or something that frightens you, or something that does not fit neatly into your vision of unity and family— Will you still love me then?"
        },
        {
          "speaker": "juan_ii",
          "text": "Maria. When I was struggling with matters of love, you spoke with such certainty. Such wisdom. I will never forget it. It surprises me you now seem so uncertain. Maybe it is so much easier to help others than we can help ourselves. Why don't you come and visit us tomorrow? Bring a crostata or better yet, a Catalan treat Catalina may like. I think it will do you much good. Family can see things other can not."
        },
        {
          "speaker": "narrator",
          "text": "María stares at him. For a moment, something flickers across her face—a dozen emotions too quick to name. Surprise. Uncertainty. Something that might be the beginning of a smile, quickly suppressed."
        },
        {
          "speaker": "maria_of_castile",
          "text": "A crostata. You are offering me... a crostata. And time with your daughter. I just told you that I do not know who I am. That I have spent my entire life being what others needed. That I am terrified of becoming irrelevant. And your answer is pastry."
        },
        {
          "speaker": "narrator",
          "text": "She turns away, her hand covering her mouth. Her shoulders shake. When she turns back, there are tears on her cheeks—but she is smiling. A strange, broken, genuine thing."
        },
        {
          "speaker": "maria_of_castile",
          "text": "You impossible man. You absolute fool. I pour out my heart and you invite me for crostatas. Yes. Fine. Tomorrow. I will bring ensaïmadas. They are Mallorcan. Catalina will make a mess of herself. The nurses will despair."
        },
        {
          "speaker": "narrator",
          "text": "She steps forward and takes his hands."
        },
        {
          "speaker": "maria_of_castile",
          "text": "I do not have answers yet, Juan. I may not have them before you sail. I may not have them for years. But I will... try. To find them. To ask the question. And yes. I will come tomorrow. To see your daughter. To meet your wife properly—not as a wounded queen, but as... As a sister. If she will have me."
        }
      ],
      "roll": null,
      "recap": "In an emotional breakthrough, María finally opens up about her lifelong struggle with never being allowed to want anything for herself, from childhood dreams to her desperate desire for a child. When Juan offers simple family connection through a visit with pastries, she breaks down in tears of recognition and agrees to come meet his family as a sister rather than a queen."
    },
    {
      "id": "evt_1434_00347",
      "type": "roll_result",
      "date": "1434-02-06",
      "end_date": null,
      "location": "Barcelona, Royal Nursery",
      "participants": [
        "juan_ii",
        "lucia_de_arenoso",
        "catalina_de_trastamara"
      ],
      "exchanges": [],
      "roll": {
        "table_id": "catalina_childhood_survival",
        "value": 73,
        "outcome": "Survives childhood healthy. Fortune and constitution carry her through to adulthood."
      },
      "recap": "A critical survival roll determines that Princess Catalina will survive the dangerous years of medieval childhood. Despite the high mortality rates of the 15th century, she will grow up healthy, living through occasional fevers and childhood ailments but ultimately reaching adulthood intact."
    },
    {
      "id": "evt_1434_00348",
      "type": "roll_result",
      "date": "1434-02-06",
      "end_date": null,
      "location": "Barcelona, Royal Palace Nursery",
      "participants": [
        "catalina"
      ],
      "exchanges": [],
      "roll": {
        "table_id": "character_trait_generation",
        "value": "87,76,34,7,70,5",
        "outcome": "Intelligence: 87 (Brilliant) - Temperament: 76 (Commanding) - Special Talent: 34 (Music/Voice) - Piety: 7 (Indifferent) - Beauty: 70 (Beautiful) - Voice Focus: 5 (Angelic singing voice)"
      },
      "recap": "Character generation rolls for Princess Catalina reveal her future traits: exceptional intelligence and natural command presence, beautiful appearance, and a divine singing voice. However, she will lack genuine religious faith despite her musical gifts making her the finest sacred performer in Castile - creating a painful irony for her deeply devout father Juan II."
    },
    {
      "id": "evt_1434_00349",
      "type": "relationship_change",
      "date": "1434-02-07",
      "end_date": null,
      "location": "Barcelona, Royal Apartments",
      "participants": [
        "juan_ii",
        "maria_of_castile",
        "lucia_zuniga",
        "catalina_of_castile"
      ],
      "exchanges": [
        {
          "speaker": "narrator",
          "text": "The ensaïmadas arrive before María does. A servant brings them on a silver tray—spiraled pastries dusted with powdered sugar, their surfaces glistening with rendered pork fat in the Mallorcan style. The scent fills the nursery: butter, sweetness, something faintly exotic. Catalina's eyes grow very wide."
        },
        {
          "speaker": "catalina_of_castile",
          "text": "What are those."
        },
        {
          "speaker": "lucia_zuniga",
          "text": "Those are ensaïmadas, cariño. Your Aunt María is bringing them. We must wait for her."
        },
        {
          "speaker": "catalina_of_castile",
          "text": "But they are here."
        },
        {
          "speaker": "lucia_zuniga",
          "text": "The pastries are here. Your aunt is not."
        },
        {
          "speaker": "catalina_of_castile",
          "text": "Catalina will guard them. Until Aunt María comes. So no one eats them."
        },
        {
          "speaker": "juan_ii",
          "text": "A noble sacrifice."
        },
        {
          "speaker": "catalina_of_castile",
          "text": "Yes. Very noble."
        },
        {
          "speaker": "narrator",
          "text": "María arrives at the hour of Terce. She wears a simpler gown than yesterday—still fine, but less formal. The regent's chain of office is absent. Her hair is braided in a style Juan remembers from their childhood, before crowns and politics complicated everything. She hesitates at the nursery door. Lucia rises, crossing to meet her."
        },
        {
          "speaker": "lucia_zuniga",
          "text": "Sister. Thank you for coming."
        },
        {
          "speaker": "maria_of_castile",
          "text": "I... brought ensaïmadas. For Catalina."
        },
        {
          "speaker": "catalina_of_castile",
          "text": "AUNT MARÍA! I guarded them! The pastries! No one ate them! I was VERY NOBLE!"
        },
        {
          "speaker": "narrator",
          "text": "She collides with María's skirts, wrapping her arms around the queen's legs. María looks down at the small face beaming up at her. Something in her expression cracks."
        },
        {
          "speaker": "maria_of_castile",
          "text": "Very well, little one. You guarded them. You should have the honor of first choice."
        },
        {
          "speaker": "catalina_of_castile",
          "text": "This one. No. This one. The big one has more sugar."
        },
        {
          "speaker": "maria_of_castile",
          "text": "It does."
        },
        {
          "speaker": "catalina_of_castile",
          "text": "But this one is more... swirly."
        },
        {
          "speaker": "maria_of_castile",
          "text": "Also true."
        },
        {
          "speaker": "catalina_of_castile",
          "text": "Catalina will take... the swirly one. Because swirly is special. You take the big one. Because you are the queen and queens get the big ones."
        },
        {
          "speaker": "maria_of_castile",
          "text": "Thank you, Catalina. That is very generous."
        },
        {
          "speaker": "narrator",
          "text": "They settle around the small table—Juan, Lucia, María, and Catalina, with Inés hovering nearby. The ensaïmadas are everything promised: light, buttery, the sugar melting on the tongue. Catalina gets powdered sugar on her nose, her cheeks, somehow in her hair."
        },
        {
          "speaker": "catalina_of_castile",
          "text": "Aunt María, do you have a horse?"
        },
        {
          "speaker": "maria_of_castile",
          "text": "I do. Several, actually."
        },
        {
          "speaker": "catalina_of_castile",
          "text": "What are their names?"
        },
        {
          "speaker": "maria_of_castile",
          "text": "Well, there is Estrella—that means 'star.' And Ventisco—"
        },
        {
          "speaker": "catalina_of_castile",
          "text": "I have a horse. His name is Hidalgo. He is very brave. Can your horses jump?"
        },
        {
          "speaker": "maria_of_castile",
          "text": "I believe Estrella jumps quite well."
        },
        {
          "speaker": "catalina_of_castile",
          "text": "Hidalgo jumps higher."
        },
        {
          "speaker": "juan_ii",
          "text": "Shall we go horse riding later today? We still have some time. Catalina loves to ride on horses. We can watch the ships."
        },
        {
          "speaker": "maria_of_castile",
          "text": "Horse riding. To watch the ships."
        },
        {
          "speaker": "lucia_zuniga",
          "text": "Yes. The harbor is beautiful from the Montjuïc hill. And Catalina has been asking to see the big ships since we arrived."
        },
        {
          "speaker": "catalina_of_castile",
          "text": "THE BIG SHIPS! With the sails! And the flags! Inés says they go very far away across the water!"
        },
        {
          "speaker": "maria_of_castile",
          "text": "I... cannot remember the last time I rode for pleasure. There is always a procession, or a formal hunt, or some delegation to receive. Riding has become... another duty. But today there is no procession. No delegation. No council. I would like that. Very much."
        },
        {
          "speaker": "catalina_of_castile",
          "text": "AUNT MARÍA IS COMING! We will see the ships AND the horses will jump AND— Aunt María, can you race?"
        },
        {
          "speaker": "maria_of_castile",
          "text": "I used to. When I was young."
        },
        {
          "speaker": "catalina_of_castile",
          "text": "You are not that old. You can probably still go a little fast."
        },
        {
          "speaker": "maria_of_castile",
          "text": "I suppose we shall find out."
        }
      ],
      "roll": null,
      "recap": "María visits Juan's family in their private apartments, sharing ensaïmadas with young Catalina. Through the child's innocent enthusiasm, María begins to soften from her formal regent role, rediscovering simple pleasures like family time and the prospect of riding horses for enjoyment rather than duty. The intimate breakfast leads to plans for a family outing to watch ships from Montjuïc hill."
    },
    {
      "id": "evt_1434_00350",
      "type": "relationship_change",
      "date": "1434-02-07",
      "end_date": null,
      "location": "Barcelona, Royal Apartments",
      "participants": [
        "juan_ii",
        "maria_of_castile",
        "catalina_of_trastamara",
        "lucia"
      ],
      "exchanges": [
        {
          "speaker": "narrator",
          "text": "María rides beside Lucia, their horses walking abreast. The Regent sits her saddle well—the muscle memory of a noblewoman trained from childhood—but there is something stiff in her posture. The body remembers; the spirit has forgotten why it once loved this. They pass through the Porta de Mar and the city falls away behind them. The road winds upward toward the hill of Montjuïc, the harbor spreading out below like a map painted in blue and white and the warm brown of wooden hulls. The wind freshens, carrying salt and tar and distant places."
        },
        {
          "speaker": "catalina_of_trastamara",
          "text": "There! SHIPS! Many ships!"
        },
        {
          "speaker": "narrator",
          "text": "And there are. Dozens of vessels crowd the harbor—fishing boats and merchant carracks, sleek war galleys with their oars shipped, fat-bellied traders from Genoa and Venice and places beyond. The banners of a dozen nations flutter in the breeze. María reins up beside them, her eyes on the water."
        },
        {
          "speaker": "maria_of_castile",
          "text": "I used to come here as a girl. Before I was married. I would watch the ships and wonder where they were going. I never found out."
        },
        {
          "speaker": "juan_ii",
          "text": "You know Catalina, we will be going on a big ship and leave over the water in a few weeks time? We will travel for many days on the big ship."
        },
        {
          "speaker": "catalina_of_trastamara",
          "text": "On the water? In a ship?"
        },
        {
          "speaker": "juan_ii",
          "text": "Yes, cariño. A very big ship. With sails and flags, just like those."
        },
        {
          "speaker": "catalina_of_trastamara",
          "text": "Will Hidalgo come?"
        },
        {
          "speaker": "juan_ii",
          "text": "Hidalgo will stay here and rest. But there will be other horses where we are going."
        },
        {
          "speaker": "catalina_of_trastamara",
          "text": "Will Mama come? Will Inés come? Will Aunt María come?"
        },
        {
          "speaker": "juan_ii",
          "text": "Mama is coming. Yes, Inés too. Aunt María has to stay here. She has an important job. She takes care of Aragón while King Alfonso is away."
        },
        {
          "speaker": "catalina_of_trastamara",
          "text": "But who takes care of Aunt María?"
        },
        {
          "speaker": "narrator",
          "text": "The wind gusts. A gull cries somewhere overhead. Lucia's horse shifts beneath her. María looks away, toward the ships, toward the horizon, toward all the places she wondered about as a girl and never saw."
        },
        {
          "speaker": "maria_of_castile",
          "text": "That is a very good question."
        },
        {
          "speaker": "juan_ii",
          "text": "We shall take care of Maria while we are here ok? Im sure she will like that."
        },
        {
          "speaker": "catalina_of_trastamara",
          "text": "Yes. We will take care of Aunt María. Aunt María, do you like crostatas?"
        },
        {
          "speaker": "maria_of_castile",
          "text": "I... yes. I suppose I do."
        },
        {
          "speaker": "catalina_of_trastamara",
          "text": "Good. Catalina will give you a crostata. And a hug. That is what we do when people are sad or need taking care of. Papa said we don't have to give hugs to everyone. But you are family. Family gets hugs."
        },
        {
          "speaker": "narrator",
          "text": "María's composure cracks. She turns her horse away slightly, one hand rising to her face. Her shoulders tremble. Lucia quietly moves her mount closer, placing a gentle hand on María's arm."
        },
        {
          "speaker": "catalina_of_trastamara",
          "text": "Aunt María? Did Catalina say something wrong?"
        },
        {
          "speaker": "maria_of_castile",
          "text": "No, little one. No, you said something very right. Thank you, Catalina. I would very much like a crostata. And a hug. I cannot remember the last time someone offered me either."
        },
        {
          "speaker": "catalina_of_trastamara",
          "text": "We will get crostatas on the way home. Papa will pay. He is the king. Kings have lots of money."
        },
        {
          "speaker": "narrator",
          "text": "They find a baker in the Plaça del Pi, near the church of Santa Maria. The shop is small and warm, fragrant with sugar and butter and woodsmoke. The baker's wife nearly faints when she realizes who has entered her establishment. The crostata is produced—golden-brown, glistening with honey, studded with almonds. It is not the refined work of a palace kitchen. It is better. It is real."
        },
        {
          "speaker": "narrator",
          "text": "They gather in María's private chambers rather than the formal apartments—smaller, warmer, less like a throne room. Cushions and chairs pulled close together. The crostata set on a table between them. No servants. No ceremony. Catalina has claimed a position on María's lap, which María accepted with an expression of stunned wonder, as if a wild bird had landed on her hand."
        },
        {
          "speaker": "catalina_of_trastamara",
          "text": "You must take the first piece, Aunt María. Because you are the queen here. Then Papa, because he paid. Then Mama. Then Catalina. Then Catalina again, if there is more."
        },
        {
          "speaker": "narrator",
          "text": "They eat. The crostata is sweet and sticky and imperfect and wonderful. Catalina gets honey on her chin, her fingers, somehow on her forehead. She chatters about ships and horses and whether fish know they are wet. At some point, María's arm settles around Catalina's small body—not stiffly, not formally, but naturally. As if it belongs there."
        },
        {
          "speaker": "catalina_of_trastamara",
          "text": "Aunt María? You are not so sad anymore."
        },
        {
          "speaker": "maria_of_castile",
          "text": "No. No, I am not so sad anymore."
        },
        {
          "speaker": "narrator",
          "text": "María looks at Juan over the child's head. Her eyes are bright."
        },
        {
          "speaker": "maria_of_castile",
          "text": "Thank you."
        }
      ],
      "roll": null,
      "recap": "During a family outing to view ships from Montjuïc, young Catalina's innocent questions about who cares for María touch the lonely Regent deeply. The child's offer of comfort through 'crostatas and hugs' breaks María's emotional barriers. They share a simple pastry together in María's private chambers, where she finds unexpected healing through Catalina's pure affection and the warmth of family connection."
    },
    {
      "id": "evt_1434_00351",
      "type": "military_action",
      "date": "1434-02-28",
      "end_date": null,
      "location": "Barcelona, Fields Outside City",
      "participants": [
        "juan_ii",
        "fernan_alonso_de_robles"
      ],
      "exchanges": [
        {
          "speaker": "narrator",
          "text": "Seven hundred knights in white tabards marked with the crosses of their orders—Santiago's red sword-cross, Calatrava's crimson fleur-de-lys cross, Alcántara's green cross—stand in formation on the fields beyond the city walls. They have been assembling for weeks, arriving in groups from their commanderies across Castile and Aragón. Veterans of the Granada campaign, most of them. Men who stormed the walls of Málaga and Loja, who stood in the breach at Alhama, who watched the Sultan's banner fall over the Alhambra. Now they prepare for a longer journey. Constantinople."
        },
        {
          "speaker": "fernan_alonso_de_robles",
          "text": "Your Majesty. The men are assembled for inspection."
        },
        {
          "speaker": "narrator",
          "text": "Captain Robles' expression tells Juan something is wrong before they reach the first rank. The inspection reveals the problems starkly. Sickness. A fever has swept through the camp over the past week. Nearly sixty men lie in the infirmary tents, shivering under blankets. Three have died. Supply Issues. A shipment of preserved meat from Valencia arrived spoiled. The replacement shipment is delayed—perhaps another week, perhaps longer. Morale. The waiting has worn on them. These are veterans of Granada—men who fought and won. Now they sit in muddy fields outside Barcelona while their commanders negotiate politics and their supplies rot."
        },
        {
          "speaker": "fernan_alonso_de_robles",
          "text": "Your Majesty should be aware... There have been difficulties. The Order commanders blame each other for the supply failures. Santiago says Calatrava's quartermaster accepted the spoiled meat without proper inspection. Calatrava says Santiago's camp placement contaminated the water. Alcántara's men feel overlooked entirely—they claim their equipment requests have been ignored. The men need to see leadership, Your Majesty. They need to know this expedition has purpose. Right now, they see only confusion and sickness and delay."
        },
        {
          "speaker": "narrator",
          "text": "The armor weighs on Juan's shoulders like memory. It is the same harness he wore at Málaga, at Loja, at the final assault on Granada's gates. The white banner of the crusade snaps in the February wind—the same banner that flew over Alhama, that was carried through the breach at Alcalá la Real. Six hundred and forty-three men able to stand assemble in ragged ranks. Some lean on their neighbors. The Santiago knight who coughed during inspection is there, pale as milk, swaying slightly but upright. Behind them, the infirmary tents. Sixty more men who will hear this speech through canvas walls."
        },
        {
          "speaker": "juan_ii",
          "text": "Brothers. We are about to embark on a great journey. A journey that will take us from Barcelona to Rome and beyond to Constantinople. Much is at stake. The church is divided and the eternal city, the last light of Christendom is about to be snuffed out. We have just won a great victory against the Moors and have done things no-one had deemed possible. We ended the reconquista. It was hard in the beginning. We have suffered setbacks and even defeats here and there. The muslims are hard fighters and they made us bleed made us suffer. Cut our supply lines. Left us hungry and miserable while we were sieging mighty walls. Right now, we are tired, sick. Maybe even hungry. Such is the fate of knights and soldiers. But have we not been here before? Have we not overcome hunger and pain? Yes! we have. We know what to do as well. We lack supplies, so we aquire more. We are sick, so we tend to our brothers until we are better. And when we are ready to move out, when we are ready to go on this incredible journey, only then we will leave. When I met the Greek delegation in Basel, they had given up all hope. No-one was going to help them. No-one had the courage, the will, the determination. No-one but the sons of Castille! We go where no-one else dared journey. We face what no-one else dared face. We fight for what everyone else seems to have forgotten. We know that when we raise our swords in the name of Christ, we serve a higher purpose. I stand before you today on the first day of this incredible journey to speak the words. Words that have carried us over blood-soaked fields and towards victory. Non nobis Domine!"
        },
        {
          "speaker": "narrator",
          "text": "For a moment—a long, terrible moment—there is only silence. Then, from somewhere in the Santiago ranks, a voice answers: 'Non nobis Domine.' Another joins. Then another. The response spreads—but slowly, unevenly, like fire struggling to catch in wet kindling. It is not the thunder of Granada. It is not the roar that shook the walls of Málaga or echoed through the Alhambra's halls. It is tired men doing what they have been trained to do. Speaking words they remember because their bodies remember, even when their hearts are uncertain. The sick Santiago knight mouths the prayer, but no sound comes. His neighbor grips his arm to keep him upright."
        },
        {
          "speaker": "fernan_alonso_de_robles",
          "text": "They answered, Your Majesty. That is something. But they need more than words now. They need to see the supply wagons arrive. They need to see the sick recover. They need to see that someone is solving the problems, not just acknowledging them. You have bought time, Your Majesty. Perhaps a week. Perhaps less. What would you have me do?"
        }
      ],
      "roll": {
        "table_id": "knights_morale_inspection",
        "value": 16,
        "outcome": "Grudging acknowledgment. The response comes—'Non nobis Domine'—but muted, tired. The veterans remember Granada, but Constantinople feels different. Doubt lingers. The speech bought time, not belief."
      },
      "recap": "Juan inspects his 700 knights assembled for the Constantinople crusade but finds the camp in crisis—fever has struck sixty men, supplies have spoiled, and morale is broken. Despite donning his Granada armor and delivering an inspiring speech invoking their past victories, the men's response is lukewarm. The speech steadies them temporarily but does not restore their faith, leaving Juan with only days to solve the practical problems before losing them entirely."
    },
    {
      "id": "evt_1434_00352",
      "type": "decision",
      "date": "1434-02-28",
      "end_date": null,
      "location": "Barcelona, Command Tent",
      "participants": [
        "juan_ii",
        "fernan_alonso_de_robles",
        "rodrigo_de_cervantes",
        "inigo_de_mendoza",
        "vasco_de_orozco"
      ],
      "exchanges": [
        {
          "speaker": "narrator",
          "text": "The tent is cramped, utilitarian—a campaign shelter, not a throne room. A table dominates the center, covered with supply manifests, maps, and the detritus of a troubled expedition. The canvas walls snap in the wind. Juan enters still in armor. Captain Robles follows, then the three Order commanders file in behind. They do not sit. No one has offered, and the tension in the air does not invite comfort."
        },
        {
          "speaker": "fernan_alonso_de_robles",
          "text": "Your Majesty. Commanders."
        },
        {
          "speaker": "rodrigo_de_cervantes",
          "text": "Your Majesty's speech was stirring. But speeches do not fill bellies or cure fevers. If we are to address problems, let us begin with who created them. Calatrava's quartermaster accepted meat that a blind man could smell was rotten—"
        },
        {
          "speaker": "inigo_de_mendoza",
          "text": "Santiago's camp placement put us downstream from a tanner's waste. My men did not poison the water. Yours did."
        },
        {
          "speaker": "vasco_de_orozco",
          "text": "If either of you had listened to Alcántara's concerns three weeks ago—"
        },
        {
          "speaker": "rodrigo_de_cervantes",
          "text": "Alcántara has one hundred men. This is not your expedition to command."
        },
        {
          "speaker": "juan_ii",
          "text": "Enough! Lets focus on the problem. Care for the sick first. They are now taken care of in tents right? Could we not accomodate them in a hospital or grant them other and better accomodation?"
        },
        {
          "speaker": "narrator",
          "text": "The tent falls silent. The three commanders stand rigid, their accusations still hanging in the air like smoke. But Juan's voice—sharp, commanding—has cut through the noise."
        },
        {
          "speaker": "fernan_alonso_de_robles",
          "text": "There is a hospital, Your Majesty. The Hospital de la Santa Creu, within the city walls. It is run by the Church—the canons of the Cathedral. It is one of the finest in Aragón. They have tended plague victims, pilgrims, soldiers. If anyone can help our sick, they can."
        },
        {
          "speaker": "inigo_de_mendoza",
          "text": "Moving sixty men through the city... it would be visible. Public. Word would spread that the expedition is weakened. That the King of Castile's knights are dying in camp before they even board ships."
        },
        {
          "speaker": "vasco_de_orozco",
          "text": "They are already dying in camp. Three dead. More to follow if we do nothing."
        },
        {
          "speaker": "rodrigo_de_cervantes",
          "text": "Alcántara speaks truth, for once. The tents are inadequate. Cold at night, damp, no proper drainage. The physicians do what they can, but... They need walls. Hearths. Clean water. Things we cannot provide in a field camp."
        },
        {
          "speaker": "fernan_alonso_de_robles",
          "text": "If Her Majesty the Regent were to request the hospital's assistance—or if Your Majesty were to ask directly—I do not think they would refuse. The Church has been... favorable to Your Majesty's cause since the Granada campaign. Shall I send word to Don Ramon to arrange it? We could have the men moved by nightfall."
        },
        {
          "speaker": "juan_ii",
          "text": "I will secure the hospital for our brothers. Food is next. What are we missing? Both what we consume right now and what we need for the journey."
        },
        {
          "speaker": "narrator",
          "text": "Captain Robles spreads a supply manifest across the table, weighting the corners with a dagger and a cup."
        },
        {
          "speaker": "fernan_alonso_de_robles",
          "text": "For current consumption, we are... adequate. Barely. Bread from Barcelona's bakers—that supply holds. Wine from local merchants. Cheese and oil. The men are not starving. But they are not eating well either. Morale suffers when soldiers see thin rations."
        },
        {
          "speaker": "vasco_de_orozco",
          "text": "My men have been on half-portions of meat for six days. The Alcántara quartermaster has been requesting resupply since before the fever struck. We were told to wait. We waited."
        },
        {
          "speaker": "fernan_alonso_de_robles",
          "text": "For the voyage, the situation is worse. A sea journey from Barcelona to Rome—ten days to two weeks, depending on weather. Then Rome to Naples, if Your Majesty visits King Alfonso. Then onward to Constantinople—another three weeks, perhaps a month, with stops for water and provisions. We need, at minimum: Salted meat: Four hundred barrels. We have sixty-three. The Valencia shipment was to provide two hundred—all spoiled. The replacement is delayed. Ship's biscuit: Six hundred crates. We have four hundred. Sufficient if we resupply in Rome. Dried fish: Two hundred barrels. We have one hundred twenty. Wine: Eight hundred casks. We have six hundred. Sufficient. Dried legumes and grain: Three hundred sacks. We have two hundred. Olive oil and vinegar: Adequate. Fresh water barrels: The ships carry these. That is the fleet's concern, not ours."
        },
        {
          "speaker": "inigo_de_mendoza",
          "text": "The meat is the crisis. Without it, men weaken. Weak men sicken. Sick men die—especially at sea. Valencia failed us. We need another source. Quickly."
        },
        {
          "speaker": "rodrigo_de_cervantes",
          "text": "Barcelona's markets could provide some. But four hundred barrels for an army? We would drain the city. The Consell de Cent would not thank us for emptying their storehouses."
        },
        {
          "speaker": "fernan_alonso_de_robles",
          "text": "There are other options, Your Majesty. Tarragona has salting houses. Mallorca trades in preserved pork. We could send riders, ships, purchasing agents—but all of this takes time. And money. How long is Your Majesty willing to delay departure?"
        },
        {
          "speaker": "juan_ii",
          "text": "We will have to pay either way. Can we send riders for other markets? And can we resupply in Naples and other cities we pass along the way?"
        },
        {
          "speaker": "fernan_alonso_de_robles",
          "text": "Riders to Tarragona—one day there, one day back. If their salting houses have stock, we could see barrels arriving within the week. Mallorca requires a ship, but they export preserved pork throughout the Mediterranean. Two weeks, perhaps, if winds favor us. As for resupply along the way... yes. It is possible. Even advisable—fresh provisions keep men healthier than salt-stores alone."
        },
        {
          "speaker": "inigo_de_mendoza",
          "text": "Rome will be expensive. The papal court inflates prices for everything. But the markets there are vast—we can find what we need if we pay. Here is better. Alfonso's army has established supply lines. If His Majesty is visiting the King of Aragón, we could arrange provisions in advance. Neapolitan salt pork is serviceable. Not as good as Castilian, but it keeps."
        },
        {
          "speaker": "rodrigo_de_cervantes",
          "text": "Sicily. If we stop there. Messina has warehouses. Cheaper than Rome, better quality than Naples."
        },
        {
          "speaker": "vasco_de_orozco",
          "text": "If we are dividing the supply burden across multiple ports... we need fewer barrels from Barcelona. Carry enough to reach Rome. Resupply there for Naples. Resupply in Naples for Constantinople. We stretch our coin further and reduce the risk of another spoilage."
        },
        {
          "speaker": "fernan_alonso_de_robles",
          "text": "If we reduce our Barcelona requirement to... one hundred fifty barrels of salt meat instead of four hundred... combined with what we have... Achievable. Tarragona alone might provide that within a week. I can dispatch riders within the hour, Your Majesty. And send word ahead to Rome and Naples to prepare provisions for our arrival. We would need letters of credit. The Gualbes banking arrangements Don Guillem negotiated—they could facilitate payments in Rome and Naples without carrying chests of gold aboard ship."
        },
        {
          "speaker": "inigo_de_mendoza",
          "text": "This could work."
        },
        {
          "speaker": "rodrigo_de_cervantes",
          "text": "If we do not delay further. Every day in camp is another day for fever to spread."
        },
        {
          "speaker": "juan_ii",
          "text": "I want to leave with enough meat in stock to last us a while. We can supplement our stock as we visit ports along the way. Send riders for more meat. I want to sail with around 250-300 barrels. Pay their price to secure this. And finally, we must adress the situation of half ration while we are still in friendly territory. Make sure the men have enough to eat and drink the coming days. They must regain their strength, it will not get easier. I will speak with my sister about how the men can be fed properly. Now, if we assume the sick will have proper accomodation, we are getting enouth supplies and the men have a full belly, are there other issues we should adress?"
        },
        {
          "speaker": "vasco_de_orozco",
          "text": "Equipment, Your Majesty. Alcántara requisitioned replacement armor and weapons six weeks ago. Twelve hauberks. Twenty swords. Horse tack for the mounted sergeants. We were told supplies were limited and priority went to the larger Orders. My men are patching rust with prayer."
        },
        {
          "speaker": "inigo_de_mendoza",
          "text": "There is also the matter of... command structure. At Granada, Your Majesty led. The Orders followed. Clear. Simple. Here, we have three commanders, three quartermasters, three chains of supply. We have been working beside each other, not together."
        },
        {
          "speaker": "rodrigo_de_cervantes",
          "text": "Calatrava speaks truth. When problems arose, each Order blamed the others because no one had authority to solve them. We need a single commander under Your Majesty. Someone who can knock heads together when quartermasters squabble over spoiled meat."
        },
        {
          "speaker": "fernan_alonso_de_robles",
          "text": "There is also the matter of the camp water, Your Majesty. We have moved the latrine trenches and forbidden use of the contaminated stream. But the men are wary. Some have been drinking only wine for days. Clean water barrels from the city would help. A visible sign that the problem is solved."
        },
        {
          "speaker": "juan_ii",
          "text": "Regarding the command structure; we need one subordinate commander under myself. And one quarter master. Lets not make a choice right now, but rather think about it for one day. I want the most experienced and capable commander and quarter master in command. We will meet back here tomorrow. Either you have chosen a commander and quarter master yourself from your own ranks or I will appoint someone on the spot. Either way, we will have one quarter master and one commander. I will make sure there is fresh water."
        },
        {
          "speaker": "narrator",
          "text": "The tent falls silent. The three commanders stand frozen, processing what Juan has just done. He has not chosen between them—which would have created a winner and two resentful losers. He has not imposed an outsider—which would have united them in indignation. He has told them to solve it themselves, or have the decision taken from their hands. It is elegant. And uncomfortable."
        },
        {
          "speaker": "rodrigo_de_cervantes",
          "text": "Your Majesty is wise to give us time. Santiago will... confer with the other Orders."
        },
        {
          "speaker": "inigo_de_mendoza",
          "text": "Calatrava concurs. One day. We will present a unified recommendation. Or we will accept Your Majesty's judgment."
        },
        {
          "speaker": "fernan_alonso_de_robles",
          "text": "I will arrange the fresh water barrels, Your Majesty. And dispatch riders to Tarragona within the hour. Is there anything else before we adjourn?"
        },
        {
          "speaker": "juan_ii",
          "text": "We all have our assignments, we meet back here tomorrow."
        }
      ],
      "roll": null,
      "recap": "Juan meets with his military commanders to address the expedition's crisis. After breaking up their feuding, he secures hospital care for sick men, arranges expanded food supplies through multiple Mediterranean ports, and forces the three Order commanders to choose unified leadership or have it imposed upon them by tomorrow."
    },
    {
      "id": "evt_1434_00353",
      "type": "roll_result",
      "date": "1434-02-28",
      "end_date": null,
      "location": "Barcelona, Royal Camp",
      "participants": [
        "juan_ii"
      ],
      "exchanges": [],
      "roll": {
        "table_id": "camp_crisis_resolution",
        "value": 69,
        "outcome": "Strong success. Hospital welcomes the sick; physicians optimistic. María provides generously—roasted meats, good bread, Catalan delicacies. Camp conditions improve visibly. Men begin to believe."
      },
      "recap": "Juan personally oversees comprehensive improvements to the crusader camp. The Hospital de la Santa Creu accepts all sixty sick knights, María arranges a generous feast from palace stores, fresh water barrels arrive, and latrines are properly relocated. The camp transforms from a place of despair into one of renewed hope and purpose."
    },
    {
      "id": "evt_1434_00354",
      "type": "npc_action",
      "date": "1434-02-28",
      "end_date": null,
      "location": "Barcelona, Royal Apartments",
      "participants": [
        "juan_ii",
        "catalina",
        "ines",
        "lucia"
      ],
      "exchanges": [
        {
          "speaker": "narrator",
          "text": "The nursery is warm, lit by a single candle. Catalina lies in her small bed, blankets pulled up to her chin, her dark hair spread across the pillow like spilled ink. Her eyes flutter open as Juan enters."
        },
        {
          "speaker": "catalina",
          "text": "Papa. Papa smells funny."
        },
        {
          "speaker": "narrator",
          "text": "Inés stifles a laugh from her corner, then curtsies and withdraws to give them privacy. When Juan asks about singing, Catalina nods solemnly."
        },
        {
          "speaker": "catalina",
          "text": "I was singing to the horse. He was scared. The dark is scary for horses."
        },
        {
          "speaker": "narrator",
          "text": "She reaches up, small fingers finding Juan's hand."
        },
        {
          "speaker": "catalina",
          "text": "Sing, Papa. Sing the good one."
        },
        {
          "speaker": "narrator",
          "text": "Juan sings. Catalina's eyes grow heavy. Her grip on his hand loosens. Her breathing slows, deepens. Somewhere in the middle of the lullaby, she slips away into dreams—perhaps of horses that jump very high, or ships with many sails, or crostatas shared with queens. When the song ends, she is asleep. The candle flickers. Beyond the window, Barcelona lies quiet under winter stars. Somewhere in the camp, seven hundred men sleep with full bellies. Somewhere in the hospital, sixty sick knights rest in clean beds. And here, in this small room, a princess sleeps with her wooden horse watching over her. Lucia appears in the doorway, silhouetted by the light from their chambers. She says nothing. She does not need to."
        }
      ],
      "roll": null,
      "recap": "After the day's crisis, Juan visits his daughter Catalina in the nursery. She asks him to sing a lullaby, and he does so until she falls asleep. Queen Lucia appears silently in the doorway, sharing this quiet family moment after the troubles of the day."
    },
    {
      "id": "evt_1434_00355",
      "type": "decision",
      "date": "1434-03-01",
      "end_date": null,
      "location": "Barcelona, Command Tent",
      "participants": [
        "juan_ii",
        "commander_cervantes",
        "commander_mendoza",
        "commander_orozco",
        "tomas_de_palencia",
        "ferran_alonso_de_robles"
      ],
      "exchanges": [
        {
          "speaker": "narrator",
          "text": "The day has dawned grey and cold, but the camp is transformed. Men move with purpose. Cook fires burn cleanly. The new latrine trenches steam in the morning chill, properly distant from the water supply. Fresh bread is being distributed—María's generosity extending into a second day. Word has spread about the king who inspected latrines. About the Regent of Aragón who opened her stores. About the sick brothers now resting in the finest hospital in Catalunya. The men do not cheer as Juan passes. They do something better. They stand straighter."
        },
        {
          "speaker": "narrator",
          "text": "The command tent is the same as yesterday—cramped, utilitarian, the table still covered with manifests and maps. But the atmosphere has shifted. The three commanders are already present when Juan arrives. They stand together—not in their separate corners as before, but clustered near the table. They have been talking."
        },
        {
          "speaker": "commander_cervantes",
          "text": "Your Majesty. We have... conferred. As Your Majesty commanded. It was not easy. Santiago, Calatrava, and Alcántara have proud traditions. None of us wished to kneel to another."
        },
        {
          "speaker": "commander_mendoza",
          "text": "But Your Majesty was clear. One commander. One quartermaster. Unity, or have the choice made for us."
        },
        {
          "speaker": "commander_orozco",
          "text": "We have a proposal, Your Majesty. If you will hear it."
        },
        {
          "speaker": "juan_ii",
          "text": "Lets have it then."
        },
        {
          "speaker": "commander_cervantes",
          "text": "Command should go to the man with the most experience leading combined forces. That is not me. Santiago has fought alone, gloriously—but this expedition requires coordination between Orders."
        },
        {
          "speaker": "commander_mendoza",
          "text": "At the siege of Antequera, I served as second to the Infante Ferdinand. Three Orders under one banner. I know how it is done—the politics, the rotations, the wounded pride that must be managed. I am not the youngest, nor do I command the largest contingent. But I have done this before."
        },
        {
          "speaker": "commander_orozco",
          "text": "Alcántara supports Commander Mendoza for overall command. In exchange, the unified quartermaster position goes to our man—Sergeant Tomás de Palencia. He has served Alcántara's supply lines for eleven years. He predicted the spoiled meat. He warned about the camp placement. No one listened."
        },
        {
          "speaker": "commander_cervantes",
          "text": "Santiago concurs. Mendoza commands. Alcántara supplies. I will serve as Mendoza's second. My men will follow his orders as they would follow mine."
        },
        {
          "speaker": "commander_mendoza",
          "text": "This is our proposal, Your Majesty. If it does not please you, we will accept whatever command structure you impose. But we believe this can work."
        },
        {
          "speaker": "juan_ii",
          "text": "You have chosen a commander and quartermaster from your ranks. I accept. Commander Mendoza, some men lack proper equipment. I expect every men to be fighting fit and properly equipped. Take measures to make it so. Quartermaster, how are we on the meat? When do we have enough for us to leave?"
        },
        {
          "speaker": "commander_mendoza",
          "text": "Your Majesty. I will conduct a full inspection today. Every man, every blade, every hauberk. What is lacking, we will procure. Barcelona has armorers. What cannot be bought, we will requisition from the Orders' reserves in the city. Alcántara's equipment requests will be filled first. They have waited longest."
        },
        {
          "speaker": "tomas_de_palencia",
          "text": "Your Majesty. I received the supply reports an hour ago. We have sixty-three barrels of salt meat in camp. The riders reached Tarragona yesterday evening. The salting houses there have stock—they can provide one hundred twenty barrels, ready for transport. At a premium. They know we are desperate. The barrels should arrive by March third. That gives us one hundred eighty-three total. Short of Your Majesty's target of two hundred fifty to three hundred. But I have also sent word to Tortosa—smaller market, but closer. If they can provide another forty to sixty barrels... March fifth, Your Majesty. Perhaps March fourth if the Tortosa shipment arrives early. We could sail with two hundred forty barrels—near the lower end of your requirement—and resupply in Rome as planned. Will this suffice, Your Majesty?"
        },
        {
          "speaker": "juan_ii",
          "text": "This will be sufficient. This gives the men more time to recover as well. We plan to sail at march 5th. Anything else for now?"
        },
        {
          "speaker": "commander_mendoza",
          "text": "The sick, Your Majesty. Sixty men in the hospital. The physicians say most will recover—but perhaps not all by March fifth. Some may need another week. Perhaps two."
        },
        {
          "speaker": "commander_cervantes",
          "text": "Do we leave them behind? Or delay further?"
        },
        {
          "speaker": "tomas_de_palencia",
          "text": "We could sail with reduced numbers and arrange for recovered men to follow on later vessels. Merchant ships make the Rome passage regularly. It would cost, but... It is possible."
        },
        {
          "speaker": "commander_orozco",
          "text": "The men who recover should have the choice. Some will want to follow, even if it means traveling alone. Others may... Not every man who survives fever survives it whole. Some may never fight again."
        },
        {
          "speaker": "commander_mendoza",
          "text": "We will know more by March fifth. The physicians can tell us who is fit, who will recover, and who..."
        },
        {
          "speaker": "ferran_alonso_de_robles",
          "text": "There is also the matter of the fleet, Your Majesty. The ships have been waiting in harbor. I have sent word that we sail on the fifth, but the captains will want confirmation. And the flagship—the Princesa Catalina—should be inspected before departure. Will Your Majesty wish to address the men again before we sail? Now that they are fed and rested, the words might land differently."
        },
        {
          "speaker": "juan_ii",
          "text": "I will adress them again, but later when we are about to depart. I want to make sure no other issues crop up. I will inspect the fleet shortly. And will be at camp regularly from now on. The campain has begun."
        }
      ],
      "roll": null,
      "recap": "The three military order commanders present a unified proposal for command structure after private negotiations. Mendoza of Calatrava becomes overall commander, Palencia of Alcántara becomes quartermaster, and Cervantes of Santiago accepts second-in-command. Juan accepts their proposal, sets March 5th as the departure date, and commits to regular presence at camp as the campaign officially begins."
    },
    {
      "id": "evt_1434_00356",
      "type": "military_action",
      "date": "1434-03-01",
      "end_date": null,
      "location": "Barcelona Harbor, Princesa Catalina",
      "participants": [
        "juan_ii",
        "lucia",
        "catalina",
        "diego_de_sotomayor"
      ],
      "exchanges": [
        {
          "speaker": "narrator",
          "text": "The journey from the palace to the harbor is short, but Catalina makes it feel like an expedition to distant lands. \"The ship is called what?\" Lucia smiles, adjusting Catalina on her hip as they descend toward the docks. \"Princesa Catalina, my love. Named after you.\" Catalina's eyes grow very round. \"A whole ship? With my name?\" \"A whole ship. The biggest one in the fleet.\" Catalina processes this information with the gravity it deserves. Her small brow furrows. \"Does the ship know it has my name?\" \"I think the ship is very proud,\" Lucia says. \"Good.\" Catalina nods firmly. \"It should be. Catalina is a very good name.\""
        },
        {
          "speaker": "narrator",
          "text": "The harbor spreads before them—a forest of masts and rigging, the snap of canvas, the cries of gulls and dockworkers. The smell of tar and salt and fish hangs thick in the air. And there, riding at anchor in the outer harbor, is the Princesa Catalina. She is a carrack—three-masted, high-castled, her hull painted in the red and gold of Castile. The royal standard flies from her mainmast. She is not the largest ship ever built, but she is substantial—a vessel meant to carry a king across dangerous waters."
        },
        {
          "speaker": "catalina",
          "text": "That one? The big one?"
        },
        {
          "speaker": "lucia",
          "text": "That one."
        },
        {
          "speaker": "catalina",
          "text": "Mine?"
        },
        {
          "speaker": "lucia",
          "text": "Named after you, cariño. Not quite the same thing."
        },
        {
          "speaker": "catalina",
          "text": "Mine."
        },
        {
          "speaker": "diego_de_sotomayor",
          "text": "Your Majesties. And the Princess herself. The ship has been waiting to meet its namesake."
        },
        {
          "speaker": "narrator",
          "text": "The boat crosses the harbor in minutes, but for Catalina it might as well be a voyage to the edge of the world. She grips the gunwale with white-knuckled intensity, staring at everything—the oarsmen, the seabirds, the approaching bulk of \"her\" ship. \"It's big,\" she whispers."
        },
        {
          "speaker": "diego_de_sotomayor",
          "text": "Your Majesties. Welcome to the Princesa Catalina. She completed sea trials in December. Stable in heavy swells. Handles better than any carrack I've commanded in thirty years."
        },
        {
          "speaker": "narrator",
          "text": "The cabin beyond is surprisingly spacious—paneled in dark wood, with windows of thick glass looking out over the stern. A bed built into the bulkhead, wide enough for two. Cushioned benches along the walls. A writing desk secured to the deck. Tapestries hang to soften the wood and muffle the creak of timber. It was designed for Isabel. She never saw it. Lucia steps inside, her hand trailing along the polished wood. Her expression is unreadable."
        },
        {
          "speaker": "catalina",
          "text": "This is mine?"
        },
        {
          "speaker": "diego_de_sotomayor",
          "text": "This is the queen's cabin, little one. For your mama."
        },
        {
          "speaker": "catalina",
          "text": "Lucia-mama. She can have it. It's nice."
        },
        {
          "speaker": "narrator",
          "text": "Captain Sotomayor leads them through the ship with the pride of a man showing off his life's work. The king's cabin adjacent to the queen's chambers, smaller and more functional—a soldier's space. The great cabin below, spanning the width of the stern, where councils will be held and meals taken. A long table dominates the space, bolted to the deck."
        },
        {
          "speaker": "catalina",
          "text": "Where are the cannons?"
        },
        {
          "speaker": "diego_de_sotomayor",
          "text": "Twelve bombards. Six to each side. Not the heaviest—we sacrificed weight for speed and stability—but enough to discourage pirates and punish any galley foolish enough to close with us. She's not a warship. Not built to stand in a battle line. But she can fight if she must, and outrun what she cannot fight."
        },
        {
          "speaker": "catalina",
          "text": "But I want to see it boom."
        },
        {
          "speaker": "diego_de_sotomayor",
          "text": "Perhaps when we are at sea."
        },
        {
          "speaker": "narrator",
          "text": "In the hold, the smell changes—bilge water, tar, the mustiness of stored provisions. \"Stores for three months if we must,\" Sotomayor explains. \"Water barrels here, salt meat, biscuit, dried fish. Wine. Oil. Everything a crew of eighty needs to cross any sea.\""
        },
        {
          "speaker": "catalina",
          "text": "It smells funny."
        },
        {
          "speaker": "diego_de_sotomayor",
          "text": "All ships smell funny, little one. You get used to it."
        },
        {
          "speaker": "narrator",
          "text": "The view from the bow is extraordinary. The harbor spreads before them, Barcelona's spires rising beyond. The sea stretches to the horizon, grey-green and endless. Catalina grips the rail, the wind whipping her dark hair."
        },
        {
          "speaker": "catalina",
          "text": "Where is Constanti-popple?"
        },
        {
          "speaker": "lucia",
          "text": "Constantinople. Far away, cariño. Many days sailing. Past Rome, past Naples, past many islands."
        },
        {
          "speaker": "diego_de_sotomayor",
          "text": "Eighty souls, Your Majesty. Sailors, marines, gunners, officers. Every man knows his duty. Every man has sailed with me before. She is ready, Your Majesty. The Princesa Catalina will carry you wherever you need to go."
        },
        {
          "speaker": "lucia",
          "text": "It is a good ship."
        },
        {
          "speaker": "catalina",
          "text": "Papa. Can we sail now?"
        }
      ],
      "roll": null,
      "recap": "Juan takes Lucia and Catalina to inspect the flagship Princesa Catalina in Barcelona harbor. The young princess is delighted that the great carrack bears her name, while Captain Sotomayor gives them a comprehensive tour of the vessel's royal cabins, gun deck, holds, and fighting platforms. The ship is well-built and ready for the coming voyage to Constantinople, though the queen's cabin—originally designed for Isabel—carries poignant reminders of the past."
    }
  ]
}