{
  "meta": {
    "version": "2.0",
    "total_rolls": 117
  },
  "rolls": [
    {
      "roll_id": "roll_001",
      "book": 1,
      "chapter": "1.01",
      "event_id": "evt_1430_00003",
      "title": "Royal Guard Morale Speech",
      "context": "Juan II addresses the royal guard to inspire personal loyalty. He gives a speech invoking religious duty and promising better equipment.",
      "roll_type": "persuasion",
      "date": "1430-05-02",
      "rolled": null,
      "outcome_range": "status_quo",
      "outcome_label": "Status Quo",
      "outcome_detail": "The speech neither inspires special loyalty nor alienates the guards. They remain professional but not personally devoted. The king is reminded he has much to learn about leadership.",
      "evaluation": "Despite favorable conditions (royal authority, new equipment promised, religious framing), the delivery fell flat. The guards remain dutiful but uninspired.",
      "success_factors": [
        "Royal authority",
        "Equipment promise",
        "Religious framing",
        "Captain's support"
      ],
      "failure_factors": [
        "King's youth and inexperience",
        "Overly formal delivery"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_002",
      "book": 1,
      "chapter": "1.01",
      "event_id": "evt_1430_00010",
      "title": "Infantes Revolt During Pilgrimage",
      "context": "After successfully negotiating with the Infantes and establishing a regency council, Juan II rolls to see if the Infantes revolt during his absence on pilgrimage.",
      "roll_type": "chaos",
      "date": "1430-05-20",
      "rolled": null,
      "outcome_range": "revolt",
      "outcome_label": "Critical Failure",
      "outcome_detail": "Despite careful planning and giving the Infantes real power through a regency council, the dice decree that a revolt WILL take place during Juan's pilgrimage. The how and why will be determined later.",
      "evaluation": "The GM assessed 70-75% probability of no revolt. The dice overruled the careful diplomacy. This sets up the central crisis of the early game.",
      "success_factors": [
        "Infantes have a bloodless path to power through the council",
        "They believe they're controlling governance",
        "No immediate reason to rebel — they got what they wanted"
      ],
      "failure_factors": [
        "King's extended absence creates opportunity",
        "Noble ambitions may exceed council powers",
        "Aragonese interference possible"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_003",
      "book": 1,
      "chapter": "1.02",
      "event_id": "evt_1430_00017",
      "title": "Subterfuge Secrecy",
      "context": "Juan II staged a fake departure on pilgrimage and is hiding near Valladolid to crash the first regency council meeting. This roll determines whether the Infantes have discovered the deception.",
      "roll_type": "intrigue",
      "date": "1430-05-16",
      "rolled": null,
      "outcome_range": "status_quo",
      "outcome_label": "Status Quo",
      "outcome_detail": "The Infantes received vague information that something seems off — Captain Fernán seemed troubled, the hermitage prayer was unusual — but couldn't piece together the full picture. They proceed with their plans despite slight uncertainty.",
      "evaluation": "Juan's tight circle of knowledge and short timeline kept the plan mostly secret. However, the unusual behavior at the hermitage raised suspicions that prevented total surprise.",
      "success_factors": [
        "Very small circle of knowledge (only Álvaro knew the plan)",
        "Short timeline (only 3 days)",
        "Legitimate departure ceremony with full party",
        "Plausible cover story (prayer at hermitage)"
      ],
      "failure_factors": [
        "Fray Hernando's suspicions about the prayer",
        "Captain Fernán's visible concern",
        "Infantes' own intelligence networks",
        "Unusual behavior of king staying behind to pray"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_004",
      "book": 1,
      "chapter": "1.02",
      "event_id": "evt_1430_00017",
      "title": "Infantes' Council Boldness",
      "context": "The Infantes hold their first regency council meeting while Juan II is supposedly away on pilgrimage. This roll determines how aggressively they push their agenda.",
      "roll_type": "chaos",
      "date": "1430-05-16",
      "rolled": null,
      "outcome_range": "critical_success",
      "outcome_label": "Critical Success",
      "outcome_detail": "The Infantes make extremely bold moves far exceeding expectations: proposing to make the regency permanent, removing Álvaro's loyalists from key positions, and openly discussing how to constrain the king upon his return. Their spectacular overreach provides perfect ammunition for Juan's surprise entrance.",
      "evaluation": "Despite the status quo on secrecy (vague suspicions), the Infantes' overconfidence drove them to reveal their full hand. Infante Juan's proposal to formalize permanent constraints on royal authority was far more aggressive than merely administering the realm.",
      "success_factors": [
        "Infantes believed Juan was truly gone",
        "First meeting — eager to establish precedent",
        "Overconfidence after getting regency power",
        "Desire to lock in gains before Juan returns"
      ],
      "failure_factors": [
        "Enrique's brief hesitation about king's hermitage behavior",
        "Archbishop and Marquis expressed caution"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_005",
      "book": 1,
      "chapter": "1.03",
      "event_id": "evt_1430_00020",
      "title": "Pilgrimage to Santiago",
      "context": "Juan II and his party of ~30 travel from near Valladolid through Castile to Santiago de Compostela. High probability of success given they travel in their own kingdom with a well-equipped royal escort.",
      "roll_type": "travel",
      "date": "1430-06-02",
      "rolled": null,
      "outcome_range": "critical_success",
      "outcome_label": "Great Success",
      "outcome_detail": "The journey goes exceptionally well. Warm receptions in Palencia and León, common people showing genuine affection. Intelligence gathered about noble feuds affecting commoners. Party arrives in Santiago with stronger bonds, growing popular support, and deeper understanding of the kingdom.",
      "evaluation": "Ideal conditions: own territory, established pilgrimage route, well-equipped guard, spring weather. The great success added popular goodwill and valuable intelligence.",
      "success_factors": [
        "Traveling in own kingdom",
        "Well-established pilgrimage route",
        "Professional guard escort",
        "Good weather (May-June)",
        "Recent demonstration of royal authority"
      ],
      "failure_factors": [
        "Infante Juan's hostility (newly removed)",
        "Political tensions among nobles"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_006",
      "book": 1,
      "chapter": "1.03",
      "event_id": "evt_1430_00022",
      "title": "Overland Journey to Rome",
      "context": "A lean party of 10 travels from Santiago through Navarre, France, and Italy to Rome. Route through France is well-established but crosses Infante Juan's kingdom of Navarre.",
      "roll_type": "travel",
      "date": "1430-07-24",
      "rolled": null,
      "outcome_range": "success",
      "outcome_label": "Success",
      "outcome_detail": "The party arrives in Rome by late July with time for papal diplomacy. Letters of recommendation gathered from Toulouse and Avignon. Some complications: tense crossing through Navarre, a horse injury, and concerning letters from home about Infante Juan's propaganda campaign. But nothing derails the plan.",
      "evaluation": "Well-planned route with good letters of introduction. The complications (Navarre tension, horse injury) were manageable. Cardinal de Foix's private letter to Orsini proved invaluable.",
      "success_factors": [
        "Well-established route through France",
        "Summer travel season",
        "Sir Thomas's knowledge of French roads",
        "Strong letters of recommendation"
      ],
      "failure_factors": [
        "Navarre crossing through hostile territory",
        "Horse injury in Pyrenees",
        "Budget strain from replacement horse",
        "Infante Juan's intelligence networks"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_007",
      "book": 1,
      "chapter": "1.03",
      "event_id": "evt_1430_00023",
      "title": "Cardinal Orsini Audience",
      "context": "Juan II meets Cardinal Giordano Orsini, Pope Martin V's closest advisor, using an approach of radical honesty about his spiritual and political motivations.",
      "roll_type": "persuasion",
      "date": "1430-07-27",
      "rolled": null,
      "outcome_range": "status_quo",
      "outcome_label": "Status Quo",
      "outcome_detail": "Orsini neither endorses nor rejects Juan's approach. He finds the young king 'worth meeting' and arranges a papal audience, but doesn't commit to supporting the crusade bull. He remains uncertain whether Juan is a genuine seeker or confused, but is intrigued enough to proceed.",
      "evaluation": "The radical honesty strategy was high-risk. Describing vague 'feelings' and 'pulls' could have seemed unstable, but Juan's sincerity and letters of recommendation earned him a chance. The status quo result is functional — it gets him before the Pope.",
      "success_factors": [
        "Radical honesty about mixed motives",
        "Strong letters of recommendation",
        "Fray Hernando's careful testimony",
        "Cardinal de Foix's private letter"
      ],
      "failure_factors": [
        "Vague description of spiritual experiences",
        "Youth and inexperience",
        "Mixing political calculation with spiritual seeking"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_008",
      "book": 1,
      "chapter": "1.03",
      "event_id": "evt_1430_00025",
      "title": "Act of Renunciation Before the Pope",
      "context": "Juan II strips himself of crown, wealth, and clothing before Pope Martin V, offering body and soul as God's servant. An unprecedented act of complete submission and self-offering.",
      "roll_type": "persuasion",
      "date": "1430-07-31",
      "rolled": null,
      "outcome_range": "critical_success",
      "outcome_label": "Great Success",
      "outcome_detail": "Pope Martin V is profoundly moved — kneels beside Juan, accepts his offering, and personally commissions the crusade. Grants a sweeping crusade bull with sole command, call to all Christendom, Military Order obedience, crusade taxation authority, papal legate, 20,000 florins, sacred relics (True Cross fragment, Saint James bone), and diplomatic pressure on Aragon. The Pope embraces Juan and whispers: 'This was grace.'",
      "evaluation": "The unprecedented vulnerability transformed a political petition into a spiritual event. An 18-year-old king naked before the Pope, enacting the inscription 'Non Nobis Domine,' touched the dying pontiff's legacy instincts and genuine faith. Everything Juan had built — the letters, the honesty with Orsini, the spiritual struggles — culminated in this moment.",
      "success_factors": [
        "Unprecedented dramatic vulnerability",
        "Deep medieval Christian symbolism (kenosis)",
        "Sword inscription 'Non Nobis Domine' perfectly aligned",
        "Built on weeks of genuine spiritual seeking",
        "Pope's legacy motivation (aging, aware of mortality)",
        "Prior groundwork with Orsini"
      ],
      "failure_factors": [
        "Could have seemed unhinged or theatrical",
        "Fray Hernando's visible shock",
        "Extreme vulnerability in political context"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_009",
      "book": 1,
      "chapter": "1.04",
      "event_id": "evt_1430_00028",
      "title": "Infantes' Revolt Outcome",
      "context": "The Infantes de Aragón attempt a revolt during Juan II's absence, trying to rally nobles, seize fortresses, and establish permanent control. The revolt was predetermined by a previous roll (chapter 1.01) but its success is assessed here.",
      "roll_type": "chaos",
      "date": "1430-09-01",
      "rolled": null,
      "outcome_range": "failure",
      "outcome_label": "Failure",
      "outcome_detail": "The Infantes accomplish very little. Only 23 nobles attend their unauthorized assembly. They seize Arévalo and two minor castles but fail to take any major city. Álvaro holds Valladolid easily. When rumors of the papal bull spread, remaining support collapses. They end as exposed rebels with ~12% noble backing.",
      "evaluation": "The revolt was assessed as 'Likely to Fail' even before the roll. Álvaro's competent defense, Juan's intelligence cabinet, and the papal bull rumors all worked against the Infantes. Their overreach in chapter 1.02 had already weakened their credibility.",
      "success_factors": [],
      "failure_factors": [
        "Limited noble support after chapter 1.02 humiliation",
        "Álvaro's competent defense of royal administration",
        "Juan's intelligence cabinet functioning well",
        "Cities loyal to the crown",
        "Papal bull rumors devastating to rebel cause"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_010",
      "book": 1,
      "chapter": "1.04",
      "event_id": "evt_1430_00029",
      "title": "Granada Military Mobilization",
      "context": "Sultan Muhammad IX attempts emergency military mobilization: raising 10,000 militia, stockpiling supplies, improving fortifications on 20 frontier castles.",
      "roll_type": "military",
      "date": "1430-09-01",
      "rolled": null,
      "outcome_range": "failure",
      "outcome_label": "Failure",
      "outcome_detail": "Only 8,000 of planned 10,000 militia raised, many poorly trained and resentful (conscripted during harvest). Fortification improvements incomplete. 80,000 dinars spent. Internal discontent rising among merchants and farmers.",
      "evaluation": "Rushed mobilization during harvest season created economic disruption. The professional 8,000-man army remains intact but the additional militia are of limited quality.",
      "success_factors": [
        "Professional army intact",
        "Some fortification work completed"
      ],
      "failure_factors": [
        "Mobilization during harvest season",
        "Economic disruption from requisitions",
        "Rushed timeline",
        "Internal resentment"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_011",
      "book": 1,
      "chapter": "1.04",
      "event_id": "evt_1430_00029",
      "title": "Muslim World Alliance",
      "context": "Sultan Muhammad IX appeals to Morocco, Tunisia, Egypt, and the Ottoman Empire for support against the Christian crusade.",
      "roll_type": "diplomacy",
      "date": "1430-09-10",
      "rolled": null,
      "outcome_range": "critical_success",
      "outcome_label": "Critical Success",
      "outcome_detail": "Unprecedented response from the Muslim world: Morocco sends 5,000 troops, 1,000 cavalry, 15 war galleys, 50,000 dinars; Tunisia sends 30,000 dinars and 5-8 galleys; Egypt sends 100,000 dinars and military advisors; Ottomans send 20,000 dinars and cannon technology with master gunners. Total: 220,000 dinars, ~8,000 troops, 20-25 war galleys. Religious scholars declare defense of Granada as jihad. Granada transforms into the standard-bearer of Islamic resistance.",
      "evaluation": "The papal crusade bull and Juan's dramatic spiritual acts convinced the Muslim world this was an existential threat. The scale of support far exceeded historical precedent, turning a regional conflict into a civilizational confrontation.",
      "success_factors": [
        "Crusade bull perceived as existential threat to Islam in Iberia",
        "Religious solidarity across Muslim world",
        "Ottoman strategic interest in weakening Christendom",
        "Morocco's proximity and military capability",
        "Egypt's wealth and prestige"
      ],
      "failure_factors": [],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_012",
      "book": 1,
      "chapter": "1.04",
      "event_id": "evt_1430_00030",
      "title": "Rome to Florence Journey",
      "context": "Juan II's lean party of 10 travels from Rome to Florence via the Via Cassia, approximately 6-7 days normally.",
      "roll_type": "travel",
      "date": "1430-08-05",
      "rolled": null,
      "outcome_range": "critical_success",
      "outcome_label": "Critical Success",
      "outcome_detail": "Journey completed in just 4 days with excellent weather and growing party camaraderie. Juan's health issues (early scurvy) are identified and addressed by companions. Arrived in Florence ahead of schedule and received by Cosimo de' Medici.",
      "evaluation": "Perfect conditions, experienced party, well-maintained roads. The critical success allowed early arrival and time for health recovery.",
      "success_factors": [
        "Well-maintained Italian roads",
        "Experienced travel party",
        "Good weather",
        "Well-rested horses from Rome"
      ],
      "failure_factors": [
        "Juan's developing health issues"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_013",
      "book": 1,
      "chapter": "1.04",
      "event_id": "evt_1430_00032",
      "title": "Florence Crusade Speech",
      "context": "Juan II delivers a public crusade speech before 8,000-10,000 people in Florence's Piazza della Signoria, attaching sacred relics to his white banner and calling for support.",
      "roll_type": "persuasion",
      "date": "1430-08-09",
      "rolled": null,
      "outcome_range": "critical_success",
      "outcome_label": "Critical Success",
      "outcome_detail": "The speech becomes legendary. Juan's passionate delivery, the drawing of his father's sword with 'Non Nobis Domine,' and the public attachment of relics to the white banner creates religious fervor. Florentine merchants pledge 15,000 florins, 200 volunteers sign up including 50 professional soldiers, the Bishop of Florence endorses publicly. Word spreads across Europe of a young king risen to complete the Reconquista.",
      "evaluation": "Juan's genuine conviction, combined with powerful theatrical elements (sword, relics, white banner, youth) and Cosimo's staging of the event, created a perfect moment. His growing reputation from Rome magnified the impact.",
      "success_factors": [
        "Genuine spiritual conviction",
        "Powerful theatrical elements (relics, sword, white banner)",
        "Cosimo's staging and elite audience",
        "Youth as asset — passionate and sincere",
        "Papal endorsement lending authority"
      ],
      "failure_factors": [
        "Health issues (managed)",
        "Foreign king on foreign soil"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_014",
      "book": 1,
      "chapter": "1.05",
      "event_id": "evt_1430_00034",
      "title": "Journey from Florence to Barcelona",
      "context": "Juan's party travels overland to Pisa and takes ship across the Mediterranean to Barcelona, carrying the crusade bull, relics, and treasury.",
      "roll_type": "travel",
      "date": "1430-08-18",
      "rolled": null,
      "outcome_range": "success",
      "outcome_label": "Success",
      "outcome_detail": "Nine-day journey completed safely. One tense encounter with a pirate galley that broke off when the Sant'Angelo proved too well-armed. All cargo and passengers arrived intact.",
      "evaluation": "Well-organized party with experienced crew. Captain Grimaldi's decision to avoid the Balearics added time but reduced risk.",
      "success_factors": [
        "Experienced ship captain (Grimaldi)",
        "Well-armed escort",
        "Good weather",
        "Avoiding pirate-heavy Balearic waters"
      ],
      "failure_factors": [
        "Pirate encounter (resolved)",
        "Juan's health issues continuing"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_015",
      "book": 1,
      "chapter": "1.05",
      "event_id": "evt_1430_00038",
      "title": "Barcelona Cathedral Relic Display & Recruitment",
      "context": "Juan displays the True Cross and Saint James relics at Barcelona Cathedral for a week, with systematic recruitment and fundraising.",
      "roll_type": "persuasion",
      "date": "1430-08-27",
      "rolled": null,
      "outcome_range": "critical_success",
      "outcome_label": "Great Success",
      "outcome_detail": "Overwhelming response over a week: 82,000 florins raised (including 20,000 from converso merchant Ruiz, 8,000 from shipping magnate Medina), 62 crusaders recruited and training. Archbishop of Zaragoza endorses the crusade and secures Consell Reial support including 3 ships for transport. Barcelona's elite pledge financial and logistical support. The crusade gains institutional Aragonese backing.",
      "evaluation": "The combination of sacred relics, papal authority, Juan's growing reputation from Rome and Florence, and María's social networking created a perfect environment for recruitment and fundraising.",
      "success_factors": [
        "Sacred relics (True Cross, Santiago bone) as draws",
        "Papal authority backing the crusade",
        "Juan's reputation from Rome and Florence",
        "María's social network and hosting",
        "Archbishop of Zaragoza's endorsement",
        "Systematic recruitment process"
      ],
      "failure_factors": [],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_016",
      "book": 1,
      "chapter": "1.06",
      "event_id": "evt_1430_00041",
      "title": "Captain Fernán's Mission Delivery",
      "context": "Captain Fernán rides from Barcelona to Valladolid with royal arrest orders for the Infantes.",
      "roll_type": "travel",
      "date": "1430-09-02",
      "rolled": null,
      "outcome_range": "success",
      "outcome_label": "Success",
      "outcome_detail": "Fernán and two guards arrive in Valladolid after 14 days of hard riding. Orders delivered to Álvaro intact.",
      "evaluation": "Three experienced riders on a well-known route. The main risk was Navarrese interception, which didn't materialize.",
      "success_factors": [
        "Experienced riders",
        "Known route",
        "Consell Reial safe passage"
      ],
      "failure_factors": [],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_017",
      "book": 1,
      "chapter": "1.06",
      "event_id": "evt_1430_00041",
      "title": "Arrest of the Infantes",
      "context": "Álvaro attempts to execute Juan's orders to arrest the Infantes for rebellion.",
      "roll_type": "intrigue",
      "date": "1430-09-10",
      "rolled": null,
      "outcome_range": "failure",
      "outcome_label": "Failure",
      "outcome_detail": "The Infantes were prepared — they'd been intercepting correspondence and knew the orders were coming. They publicly refused, withdrew to fortified positions, and Alfonso V threatened war. A three-day standoff at Arévalo ended with Álvaro withdrawing. The Infantes remain free but are now exposed as refusing royal justice.",
      "evaluation": "The intercepted correspondence gave the Infantes warning. Without sufficient military force and with Alfonso V's threat looming, Álvaro couldn't force the issue.",
      "success_factors": [],
      "failure_factors": [
        "Infantes intercepted correspondence and were forewarned",
        "Insufficient royal military force for siege",
        "Alfonso V's threat of war from Aragon",
        "Infantes' fortified positions",
        "Political risk of open civil war"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_018",
      "book": 1,
      "chapter": "1.06",
      "event_id": "evt_1430_00043",
      "title": "Voyage from Barcelona to Seville",
      "context": "Three galleys carry Juan, 62 crusaders, relics, and treasury from Barcelona around the Iberian coast to Seville.",
      "roll_type": "travel",
      "date": "1430-09-28",
      "rolled": null,
      "outcome_range": "success",
      "outcome_label": "Success",
      "outcome_detail": "Ten-day voyage completed with all cargo intact. Several tense encounters: bluffed past Valencia's inspection, corsairs retreated from armed formation, Moroccan galleys shadowed through Strait of Gibraltar but didn't attack.",
      "evaluation": "Three-ship formation provided security. Tense moments managed through combination of bluffing, arms display, and good seamanship.",
      "success_factors": [
        "Three-ship convoy formation",
        "Experienced Catalan captains",
        "Armed crusaders visible on deck",
        "Papal authority used to bluff Valencia"
      ],
      "failure_factors": [
        "Corsair presence near Cartagena",
        "Moroccan galleys in Strait of Gibraltar",
        "Valencia's attempted inspection"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_019",
      "book": 1,
      "chapter": "1.07",
      "event_id": "evt_1430_00046",
      "title": "Noble Address on Infantes' Rebellion",
      "context": "Juan addresses Seville's nobles, presenting evidence of rebellion and the papal bull, demanding the Infantes surrender for trial.",
      "roll_type": "persuasion",
      "date": "1430-09-28",
      "rolled": null,
      "outcome_range": "failure",
      "outcome_label": "Failure (Not Catastrophic)",
      "outcome_detail": "Nobles remain divided. About 30% rally behind Juan, but the majority are cautious — distrustful of Álvaro, fearing civil war, and seeing the arrest demand as heavy-handed. The papal bull impresses but doesn't override political calculation.",
      "evaluation": "The speech was well-constructed but the political landscape was against success. Many nobles resent Álvaro de Luna's influence and fear being drawn into a civil war between the crown and Aragon.",
      "success_factors": [
        "Papal bull as evidence of divine mandate",
        "Clear evidence of Infantes' rebellion",
        "Juan's growing reputation"
      ],
      "failure_factors": [
        "Noble distrust of Álvaro de Luna",
        "Fear of civil war with Aragon",
        "Arrest demand seen as heavy-handed",
        "50% of nobility neutral and cautious"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_020",
      "book": 1,
      "chapter": "1.07",
      "event_id": "evt_1430_00049",
      "title": "Crusader Spiritual Assessment",
      "context": "Juan assesses whether his 62 crusaders have maintained genuine spiritual commitment through their selective recruitment and Fray Hernando's spiritual formation.",
      "roll_type": "intrigue",
      "date": "1430-10-01",
      "rolled": null,
      "outcome_range": "success",
      "outcome_label": "Success",
      "outcome_detail": "The crusaders show genuine faith and commitment. Daily confession, group prayer, and careful vetting have created a core of believers rather than mercenaries. Not all are saints, but their sincerity is real.",
      "evaluation": "Fray Hernando's spiritual formation program and the two-stage recruitment process (physical by Rodrigo, spiritual by Hernando) created a genuine core.",
      "success_factors": [
        "Selective recruitment process",
        "Fray Hernando's daily spiritual formation",
        "Strong group cohesion from shared journey"
      ],
      "failure_factors": [],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_021",
      "book": 1,
      "chapter": "1.07",
      "event_id": "evt_1430_00049",
      "title": "Seville Plaza Speech",
      "context": "Juan addresses 8,000-10,000 people at the Plaza de San Francisco with the banner and relics, covering the papal mandate, Infantes' rebellion, safe conduct offer, and crusade vision.",
      "roll_type": "persuasion",
      "date": "1430-10-02",
      "rolled": null,
      "outcome_range": "success",
      "outcome_label": "Success",
      "outcome_detail": "Solid political win. Common people and middle class rally, donations flow, crusade narrative gains traction. Not the overwhelming triumph of Florence but a meaningful advance in Juan's home territory. The safe conduct offer is perceived positively as showing fairness.",
      "evaluation": "After the noble address failure, this public speech to the broader population proved more effective. Common people respond to the crusade message more readily than cautious nobles.",
      "success_factors": [
        "Strong message and relics on display",
        "Home territory (Seville)",
        "Safe conduct narrative showing fairness",
        "Common people more responsive than nobles"
      ],
      "failure_factors": [
        "Recent noble address failure dampened expectations"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_022",
      "book": 1,
      "chapter": "1.08",
      "event_id": "evt_1430_00053",
      "title": "Council: Portuguese Betrothal Announcement",
      "context": "Juan opens the Royal Council by announcing his betrothal to Princess Isabel of Portugal.",
      "roll_type": "persuasion",
      "date": "1430-11-08",
      "rolled": null,
      "outcome_range": "success",
      "outcome_label": "Success",
      "outcome_detail": "Nobles impressed by the strategic marriage. Portugal's naval power, wealth, and neutrality make it an excellent choice. Momentum established early.",
      "evaluation": "Strong opening move. The betrothal demonstrates Juan's growing diplomatic network and strategic thinking.",
      "success_factors": [
        "Excellent match strategically",
        "Letter from Portuguese king as proof",
        "Sets positive tone"
      ],
      "failure_factors": [],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_023",
      "book": 1,
      "chapter": "1.08",
      "event_id": "evt_1430_00053",
      "title": "Council: Aragonese Relations",
      "context": "Juan describes Barcelona's warm welcome, 82,000 florins raised, and ongoing diplomatic relations with Alfonso V.",
      "roll_type": "persuasion",
      "date": "1430-11-08",
      "rolled": null,
      "outcome_range": "success",
      "outcome_label": "Success",
      "outcome_detail": "Nobles impressed by the Barcelona achievements. The scale of support and Aragonese Consell Reial's backing demonstrates Juan's international standing.",
      "evaluation": "Building momentum. Each success makes the next segment more impactful.",
      "success_factors": [
        "82,000 florins concrete evidence",
        "Consell Reial backing",
        "Building on Portuguese announcement"
      ],
      "failure_factors": [],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_024",
      "book": 1,
      "chapter": "1.08",
      "event_id": "evt_1430_00053",
      "title": "Council: Papal Bull Presentation",
      "context": "Juan presents the papal crusade bull with the Archbishop of Toledo's formal endorsement.",
      "roll_type": "persuasion",
      "date": "1430-11-08",
      "rolled": null,
      "outcome_range": "success",
      "outcome_label": "Success",
      "outcome_detail": "The Archbishop's endorsement and the physical presence of the papal bull with its lead seal are powerfully convincing. Nobles pledge their arms to the crusade.",
      "evaluation": "The religious framing transforms the Council from political to sacred. Opposition becomes opposition to God.",
      "success_factors": [
        "Papal authority",
        "Archbishop's endorsement",
        "Accumulated momentum from prior segments"
      ],
      "failure_factors": [],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_025",
      "book": 1,
      "chapter": "1.08",
      "event_id": "evt_1430_00053",
      "title": "Council: Rebellion Evidence Against Infantes",
      "context": "Juan transitions to the Infantes' rebellion, framing it as obstacle to the sacred crusade. Álvaro presents evidence with twelve witnesses.",
      "roll_type": "persuasion",
      "date": "1430-11-08",
      "rolled": null,
      "outcome_range": "critical_success",
      "outcome_label": "Great Success",
      "outcome_detail": "Seamless transition from crusade fervor to rebellion charges. The nobles accept the framing completely — opposing the Infantes becomes a matter of faith, not just politics. Twelve witnesses deliver devastating testimony. The case is overwhelming.",
      "evaluation": "The accumulated momentum of three previous successes made this great success possible. By the time evidence was presented, the nobles were already committed to the crusade and saw the Infantes as obstacles to God's work.",
      "success_factors": [
        "Three prior successes building momentum",
        "Framing rebellion as obstacle to crusade",
        "Twelve witnesses with devastating evidence",
        "Álvaro's thorough preparation"
      ],
      "failure_factors": [],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_026",
      "book": 1,
      "chapter": "1.08",
      "event_id": "evt_1430_00054",
      "title": "Infantes' Defense at the Council",
      "context": "The Infantes respond to overwhelming evidence of rebellion. Rather than contest the charges, they choose complete submission.",
      "roll_type": "persuasion",
      "date": "1430-11-08",
      "rolled": null,
      "outcome_range": "critical_success",
      "outcome_label": "Great Success",
      "outcome_detail": "The Infantes' surrender exceeds all expectations. Infante Enrique weeps genuinely. Infante Juan breaks from his script and drops to his knees, offering to renounce everything and serve as a common crusader. The nobles are deeply moved. Juan brilliantly draws a parallel to his own renunciation before the Pope, transforming the moment from humiliation into redemption.",
      "evaluation": "Surprising outcome — the Infantes chose the one strategy that could save them. Their complete submission, whether calculated or genuine, gave Juan the opportunity to show mercy and strengthen his position simultaneously.",
      "success_factors": [
        "Complete submission rather than defiance",
        "Genuine emotion (Enrique's tears)",
        "Infante Juan's dramatic renunciation offer",
        "Nobles' emotional readiness after earlier Council sessions"
      ],
      "failure_factors": [],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_027",
      "book": 1,
      "chapter": "1.09",
      "event_id": "evt_1430_00057",
      "title": "Infantes' Decision After Council",
      "context": "After publicly confessing rebellion and offering to join the crusade, the Infantes must decide whether to honor their oaths.",
      "roll_type": "chaos",
      "date": "1430-11-09",
      "rolled": 32,
      "outcome_range": "success",
      "outcome_label": "Honor Oaths Completely",
      "outcome_detail": "The Infantes arrive at dawn for spiritual examination, present themselves without armed retinue, dressed simply. They send formal orders for their household troops to muster at Seville under Juan II's command. About 800 soldiers join as individual crusaders.",
      "evaluation": "50% probability of full compliance. The sacred oath before the True Cross and the political calculus (nowhere else to go) combined to produce genuine commitment.",
      "success_factors": [
        "Sacred oath binding",
        "Political reality (no alternatives)",
        "Genuine spiritual impact of relics"
      ],
      "failure_factors": [],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_028",
      "book": 1,
      "chapter": "1.09",
      "event_id": "evt_1430_00060",
      "title": "Building Partnership with Princess Isabel",
      "context": "Juan II meets his Portuguese betrothed and attempts to build a genuine partnership through complete honesty about the challenges ahead.",
      "roll_type": "persuasion",
      "date": "1430-12-14",
      "rolled": null,
      "outcome_range": "critical_success",
      "outcome_label": "Great Success",
      "outcome_detail": "Isabel transforms from terrified and defensive to genuinely hopeful. She reveals her love of learning and desire to be useful. Juan's honesty and his act of kneeling before her (unprecedented for a king to his bride) creates a genuine emotional connection. She gives a confident public speech in Castilian. Their Portuguese and Castilian escorts are visibly shocked by the transformation.",
      "evaluation": "Juan's approach of radical honesty — the same approach that worked with the Pope — proved effective again. Treating Isabel as an intellectual partner rather than a political asset struck exactly the right note.",
      "success_factors": [
        "Complete honesty about challenges",
        "Kneeling before her (unprecedented vulnerability)",
        "Treating her as intellectual partner",
        "Offering books and education"
      ],
      "failure_factors": [],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_029",
      "book": 1,
      "chapter": "1.09",
      "event_id": "evt_1430_00061",
      "title": "Alfonso V's Response to Brothers' Renunciation",
      "context": "Alfonso V receives news that his brothers have renounced all Aragonese succession claims before sacred relics, throwing Aragon's succession into chaos.",
      "roll_type": "diplomacy",
      "date": "1430-12-18",
      "rolled": null,
      "outcome_range": "success",
      "outcome_label": "Success",
      "outcome_detail": "Alfonso accepts with cold wariness. He acknowledges the Infantes deserved punishment, doesn't challenge sacred oaths, but notes outcomes are 'remarkably convenient' for Castile. Withdraws active crusade support to focus on Naples. Maintains formal relations through María. No war threats or diplomatic break.",
      "evaluation": "Best realistic outcome given the magnitude of the succession shift. Alfonso is too focused on Naples to risk war with a papally-backed crusader king.",
      "success_factors": [
        "Complete transparency about oaths",
        "Sacred context prevents challenging legitimacy",
        "Alfonso focused on Italian ambitions",
        "María serving as diplomatic bridge"
      ],
      "failure_factors": [
        "Succession implications deeply concerning to Alfonso",
        "Cold tone signals lasting damage to relationship"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_030",
      "book": 1,
      "chapter": "1.10",
      "event_id": "evt_1430_00064",
      "title": "Journey from Seville to Toledo",
      "context": "Royal procession of ~200 people travels from Seville to Toledo in late December/early January winter conditions.",
      "roll_type": "travel",
      "date": "1431-01-14",
      "rolled": 76,
      "outcome_range": "critical_success",
      "outcome_label": "Very Successful",
      "outcome_detail": "Unusually good winter weather. Fast pace, arriving Toledo January 14. Isabel transforms on the journey — riding openly, accepting flowers, gaining confidence. Towns welcome the crusade procession enthusiastically.",
      "evaluation": "Lucky weather and good logistics. The visual spectacle of white-tabarded crusaders became a publicity event along the entire route.",
      "success_factors": [
        "Unusually mild winter weather",
        "Well-organized procession",
        "Popular enthusiasm along the route"
      ],
      "failure_factors": [],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_031",
      "book": 1,
      "chapter": "1.10",
      "event_id": "evt_1431_00065",
      "title": "Initial Meeting with Cardinal Capranica",
      "context": "Juan II meets the papal legate, Cardinal Capranica, for the first time in Toledo. Initial honeymoon period.",
      "roll_type": "diplomacy",
      "date": "1431-01-14",
      "rolled": null,
      "outcome_range": "success",
      "outcome_label": "Honeymoon Success",
      "outcome_detail": "Initial meeting goes well. Cardinal pleased by Juan's meticulous records and willingness to establish proper financial oversight. However, long-term relationship rolled as 'serious conflict' — deterioration expected after 2-3 weeks.",
      "evaluation": "Juan's approach of acknowledging the Cardinal's authority while maintaining his own discretion worked in the short term. The fundamental conflict over control vs. flexibility will emerge later.",
      "success_factors": [
        "Juan's meticulous records (Diego's work)",
        "Willingness to cooperate on budgets",
        "Shared language of proper stewardship"
      ],
      "failure_factors": [
        "Cardinal's fundamentally obstructionist nature",
        "Different priorities (control vs. flexibility)"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_032",
      "book": 1,
      "chapter": "1.10",
      "event_id": "evt_1431_00065",
      "title": "Álvaro-Tommaso Budget Partnership",
      "context": "Álvaro de Luna and Father Tommaso (legate's administrator) work together on detailed crusade budget management.",
      "roll_type": "diplomacy",
      "date": "1431-01-20",
      "rolled": 77,
      "outcome_range": "critical_success",
      "outcome_label": "Excellent Partnership",
      "outcome_detail": "Álvaro and Father Tommaso develop an outstanding working relationship. Their complementary skills (Álvaro's practical knowledge, Tommaso's administrative rigor) produce a comprehensive and realistic crusade budget. This partnership provides a critical buffer for the coming Juan-Capranica conflict.",
      "evaluation": "A fortunate pairing. The administrator's practical focus contrasts with his Cardinal's obstructionism, creating a functional channel even when the leaders clash.",
      "success_factors": [
        "Complementary skills",
        "Shared focus on practical outcomes",
        "Both experienced administrators"
      ],
      "failure_factors": [],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_033",
      "book": 1,
      "chapter": "1.11",
      "event_id": "evt_1431_00068",
      "title": "End of Honeymoon with Cardinal Capranica",
      "context": "After weeks of productive cooperation, what event causes the inevitable tension between Juan II and Cardinal Capranica?",
      "roll_type": "chaos",
      "date": "1431-01-24",
      "rolled": 98,
      "outcome_range": "critical_failure",
      "outcome_label": "Breaking Point — Portuguese Ladies Dismissal",
      "outcome_detail": "Capranica demands Isabel dismiss her Portuguese ladies-in-waiting (Dona Beatriz, Dona Inês, Dona Catarina) and replace them with Spanish women he has selected. Massive overreach into royal household management — the papal bull grants no such authority. Creates serious crisis requiring careful diplomatic handling.",
      "evaluation": "Near-worst possible outcome. Capranica's overreach threatened both the Portuguese alliance and Isabel's personal wellbeing. However, Juan's established good relationship moderated the damage — what could have been a catastrophic break instead became a manageable crisis.",
      "success_factors": [],
      "failure_factors": [
        "Capranica's controlling nature",
        "Ambition to expand legatine authority",
        "Desire to place allies in Queen's household"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_034",
      "book": 1,
      "chapter": "1.11",
      "event_id": "evt_1431_00069",
      "title": "Cardinal's Response to Portuguese Ladies Resolution",
      "context": "After Juan blocks Capranica's demand through passive resistance and guard protection, how does the Cardinal react?",
      "roll_type": "diplomacy",
      "date": "1431-01-27",
      "rolled": 83,
      "outcome_range": "failure",
      "outcome_label": "Public Pressure at Dinner",
      "outcome_detail": "Capranica makes pointed public comments at a formal dinner about 'foreign influences' and Spanish tradition, clearly targeting the Portuguese attendants. Never names them directly but the implication is unmistakable. Forces Juan to respond publicly. Juan turns the moment into a triumphant speech praising Isabel's piety and announcing a Portuguese chapel commission.",
      "evaluation": "Capranica escalated to public pressure rather than accepting the situation privately. This backfired — Juan's masterful speech rallied the room behind Isabel and forced Capranica into a graceful retreat. The public nature of the resolution actually strengthened Juan's position.",
      "success_factors": [],
      "failure_factors": [
        "Capranica's wounded pride",
        "Unwillingness to accept private defeat",
        "Underestimation of Juan's public speaking ability"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_035",
      "book": 1,
      "chapter": "1.11",
      "event_id": "evt_1431_00067",
      "title": "Noble Response to Crusade Taxation",
      "context": "Castilian nobility learns that specific crusade taxation details (5% noble tax, 10% church tax) will be announced at the wedding. How do they respond in the weeks before the announcement?",
      "roll_type": "chaos",
      "date": "1431-01-28",
      "rolled": 45,
      "outcome_range": "mixed",
      "outcome_label": "Quiet Compliance with Grumbling",
      "outcome_detail": "Nobles accept the tax is happening but complain privately to each other. They'll comply with assessments but won't be happy. Some minor foot-dragging on producing records expected, but nothing organized. The oversight committee will need to be firm but won't face serious resistance. A few great houses (Mendoza, Guzmán) request private audiences seeking 'clarity' on tax details.",
      "evaluation": "Best realistic outcome given the unprecedented nature of direct crown taxation backed by papal authority. The combination of papal backing, popular crusade enthusiasm, absence of Infantes as opposition leaders, and personal service exemption all work to prevent organized resistance.",
      "success_factors": [
        "Papal authority behind taxation",
        "Popular crusade enthusiasm",
        "No opposition leader (Infantes eliminated)",
        "Personal service exemption offers honorable alternative"
      ],
      "failure_factors": [
        "Sets precedent for crown taxation",
        "Assessment process threatening to nobles used to controlling own reporting"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_036",
      "book": 1,
      "chapter": "1.12",
      "event_id": "evt_1431_00072",
      "title": "Don Luis de Guzmán's Response to Juan's Grace",
      "context": "After Juan treats Guzmán with extraordinary grace — sharing wine, showing relics, offering genuine choice between field command and advisory role — how does the Master of Santiago respond? He expected punishment for backing the Infantes but received redemption.",
      "roll_type": "diplomacy",
      "date": "1431-01-29",
      "rolled": 56,
      "outcome_range": "success",
      "outcome_label": "Grateful Acceptance",
      "outcome_detail": "Guzmán genuinely moved by Juan's grace and respect. Recognizes he was given more consideration than his past actions warranted. Commits Santiago fully — 2,000 knights, fortresses, resources, knowledge. Steps down from field command voluntarily, admitting his aging body would risk men's lives to protect pride. Pledges to serve as advisor, sharing 33 years of frontier knowledge. Accepts crusade taxation without resistance. Immediately contacts Master of Calatrava to advocate for full Military Order participation.",
      "evaluation": "Excellent outcome. Juan's magnanimous approach converted a potential opponent into a devoted supporter. Guzmán's voluntary step-down and advocacy work exceeded expectations for this range. The combination of religious devotion (seeing the relics), personal respect, and genuine choice enabled Guzmán to feel redeemed rather than diminished.",
      "success_factors": [
        "Juan's grace and personal hospitality",
        "Showing relics (spiritual impact)",
        "Genuine choice offered, not forced",
        "Clear path to redemption through advisory service"
      ],
      "failure_factors": [],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_037",
      "book": 1,
      "chapter": "1.13",
      "event_id": "evt_1431_00079",
      "title": "Popular Response to Royal Wedding Procession",
      "context": "Juan rides through Toledo in unprecedented white plate armor with streaming white banners on a white destrier, preceded by the Guardian Company carrying the blessed banner and relics. The visual spectacle is extraordinary — no one in Toledo has seen anything like it. The crowd has been waiting since before dawn. Factors in favor: deeply religious society, legitimate papal crusade, unprecedented visual spectacle, weeks of anticipation, Toledo as religious heart of Castile, Portuguese alliance welcomed. Factors against: Juan is young and untested, crusade hasn't achieved anything yet, medieval cynicism about royal theater, not everyone wants sons going to war.",
      "roll_type": "social",
      "date": "1431-02-15",
      "rolled": 79,
      "outcome_range": "66-85",
      "outcome_label": "Overwhelming Positive Response",
      "outcome_detail": "Deafening roar from tens of thousands. Widespread tears and open weeping. Strong religious ecstasy in significant portions of crowd. People falling to knees spontaneously. 'Angel of God' and 'Saint Michael' rhetoric spreading rapidly. Veterans and widows crying out for fallen loved ones. Monks and clergy joining procession spontaneously. Young men desperate to volunteer immediately. Even skeptical nobles caught up in the moment. Sense of divine providence and sacred mission. The spectacle transcends normal royal theater into genuine mass movement.",
      "evaluation": "Strong success. The combination of unprecedented visual spectacle (white armor, streaming banners, white destrier), legitimate religious authority (papal relics, blessed banner), and months of careful preparation created a response exceeding normal royal theater. Not quite universal fervor (86+), but enough to create irresistible political momentum — opposition to the crusade becomes politically and religiously dangerous.",
      "success_factors": [
        "Unprecedented white armor visual",
        "Streaming banner-wing effect",
        "Legitimate papal relics",
        "Weeks of popular anticipation",
        "Toledo as religious capital",
        "Well-executed Guardian Company discipline"
      ],
      "failure_factors": [],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_038",
      "book": 1,
      "chapter": "1.14",
      "event_id": "evt_1431_00084",
      "title": "Isabel's Emotional Response to Married Life",
      "context": "Isabel of Portugal (age 15) and Juan II (age 18) have been married one week. Juan has been considerate and gentle. Isabel had developing feelings before the wedding (shared faith, evening prayers, garden moment). She is conventionally pious, dutiful, sheltered, plain (rolled 41 appearance). How does she respond emotionally to the intimate aspects of marriage?",
      "roll_type": "social",
      "date": "1431-02-22",
      "rolled": 31,
      "outcome_range": "31-50",
      "outcome_label": "Comfortable and Dutiful",
      "outcome_detail": "Isabel has adjusted well to married life. Physical intimacy is no longer strange or uncomfortable. She fulfills her duties willingly and finds comfort in Juan's affection. Not overwhelming passion, but genuine growing fondness — steady warmth and trust. She feels safe with him, appreciates his gentleness. A solid foundation for their relationship. She tells him: 'I am content. More than content. You have been so kind to me.'",
      "evaluation": "Middle-range result reflecting a realistic arranged marriage. Not the fairy-tale love story, but a functional, warm partnership with room to grow. Consistent with Isabel's dutiful nature and sheltered upbringing.",
      "success_factors": [
        "Juan's consistent gentleness",
        "Shared faith foundation",
        "Pre-wedding emotional connection"
      ],
      "failure_factors": [
        "Isabel's sheltered upbringing limits emotional expression",
        "Duty-oriented processing of feelings"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_039",
      "book": 1,
      "chapter": "1.14",
      "event_id": "evt_1431_00084",
      "title": "Isabel's Pregnancy Timeline",
      "context": "Both very young and healthy (15 and 18), frequent intimacy, good nutrition. Historical parallels suggest first pregnancy often within 3-6 months for healthy young royal couples. Stress of new marriage and country could delay slightly.",
      "roll_type": "personal",
      "date": "1431-02-22",
      "rolled": 52,
      "outcome_range": "36-60",
      "outcome_label": "Early March Conception",
      "outcome_detail": "Isabel conceives in early March, about 4-5 weeks after the wedding. By April she misses her first period; by May she's missed two and experiencing clear symptoms: nausea, fatigue, breast changes. She tells Juan in late April/early May, around 8-10 weeks pregnant. Confirmed pregnancy well before crusade departure.",
      "evaluation": "Historically typical timing. Neither too fast nor delayed. Provides clear narrative beat — pregnancy confirmed as campaign is underway.",
      "success_factors": [
        "Youth and health of both partners",
        "Frequent intimacy",
        "Good nutrition"
      ],
      "failure_factors": [],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_040",
      "book": 1,
      "chapter": "1.14",
      "event_id": "evt_1431_00087",
      "title": "Toledo to Jaen Journey",
      "context": "Six-day journey from Toledo to Jaen (March 2-7, 1431). Juan travels with Isabel, Alvaro, household guard, and attendants. Isabel has never traveled this far from a palace/convent. Route passes through La Mancha plains and hill country into frontier territory.",
      "roll_type": "travel",
      "date": "1431-03-02",
      "rolled": 99,
      "outcome_range": "96-100",
      "outcome_label": "Exceptional Journey with Notable Event",
      "outcome_detail": "The journey exceeds all expectations. Isabel insists on riding horseback instead of the wagon, proving herself a competent and determined rider. The open road brings out strength neither knew she had. A transformative event occurs during the journey that fundamentally alters the relationship between Juan and Isabel.",
      "evaluation": "Near-perfect roll creating a pivotal narrative moment. The journey itself becomes a crucible for character development.",
      "success_factors": [
        "Good weather",
        "Well-planned route",
        "Isabel's hidden courage",
        "Privacy of the road"
      ],
      "failure_factors": [],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_041",
      "book": 1,
      "chapter": "1.14",
      "event_id": "evt_1431_00087",
      "title": "Transformative Event During Journey",
      "context": "Sub-roll to determine what notable event occurs during the exceptional journey (roll 99). Options ranged from battlefield discovery to bandit encounter to natural wonder to a significant letter.",
      "roll_type": "narrative",
      "date": "1431-03-06",
      "rolled": 92,
      "outcome_range": "86-95",
      "outcome_label": "The Letter from Portugal",
      "outcome_detail": "A courier delivers a letter from Isabel's mother, the Queen of Portugal. The Queen Mother reveals her own arranged marriage started cold but became deep love over 20 years. Her advice: 'Do not hide yourself from Juan. Show him your true self. Love grows like a garden — plant seeds now.' Isabel reads the letter aloud to Juan, breaks down crying, and confesses all her hidden fears: fear of failing as queen, fear of not giving him a son, fear he deserved someone better. She asks him to know the real Isabel, not just the dutiful surface. The moment fundamentally transforms their relationship.",
      "evaluation": "Powerful narrative result. The Queen Mother's letter serves as catalyst for Isabel to shed her protective shell of duty and show genuine vulnerability. Combined with the exceptional journey roll, this creates a pivotal relationship moment.",
      "success_factors": [
        "Privacy of the road (no court observers)",
        "Isabel's growing trust",
        "Mother's wisdom from lived experience"
      ],
      "failure_factors": [],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_042",
      "book": 1,
      "chapter": "1.14",
      "event_id": "evt_1431_00089",
      "title": "Portuguese Ladies' Response to Seville Ride",
      "context": "Juan invites Isabel to ride horseback to Seville (fast 4-day journey, no wagon). Isabel needs at least one lady-in-waiting. Four candidates: Dona Beatriz (54, senior, too old), Catarina (23, competent rider), Maria (19, poor rider), Ana (early 20s, adequate but not confident).",
      "roll_type": "social",
      "date": "1431-03-08",
      "rolled": 40,
      "outcome_range": "31-50",
      "outcome_label": "Duty-Bound Single Volunteer",
      "outcome_detail": "Dona Catarina (age 23) volunteers out of obligation rather than enthusiasm. She grew up near the Portuguese coast and is a competent rider, the most physically capable of the ladies. Dona Beatriz is physically unable (age 54). Maria and Ana decline as inadequate riders. Catarina approaches it as duty — she does not relish the hard ride but will not let her princess travel without a companion.",
      "evaluation": "Middle-range result. One volunteer, motivated by duty rather than excitement. Creates an interesting dynamic — Catarina and Isabel will bond over the shared ordeal of hard riding.",
      "success_factors": [
        "Catarina's riding competence",
        "Sense of duty to Isabel"
      ],
      "failure_factors": [
        "Other ladies unable or unwilling",
        "Catarina not initially enthusiastic"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_043",
      "book": 1,
      "chapter": "1.14",
      "event_id": "evt_1431_00089",
      "title": "Jaen to Seville Journey",
      "context": "Four-day horseback ride from Jaen to Seville (March 8-11). Party of 13: Juan, Isabel, Catarina, 6 crusader guards, 4 household guards. Fast pace, sleeping in the field or at waypoints. Isabel's second long ride; Catarina's first hard journey.",
      "roll_type": "travel",
      "date": "1431-03-08",
      "rolled": 44,
      "outcome_range": "31-50",
      "outcome_label": "Adequate Journey — Building Stamina",
      "outcome_detail": "First day is hard on both women — saddle-sore, exhausted, not accustomed to the pace. But bodies adapt by day two. By day three, a workmanlike routine is established. Evening camps provide the better moments — Catarina shows dry humor when relaxed. They arrive in Seville late afternoon on day four, tired and dusty but intact. Not transformative, just successful.",
      "evaluation": "Solid middle result. The journey serves its purpose without drama. Both women prove they can handle hard riding, building confidence for future travel.",
      "success_factors": [
        "Prior riding experience",
        "Good weather",
        "Manageable pace"
      ],
      "failure_factors": [
        "Physical toll of sustained riding",
        "Inexperience with military travel"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_044",
      "book": 1,
      "chapter": "1.15",
      "event_id": "evt_1431_00091",
      "title": "Sultan's Intelligence on the Crusade",
      "context": "What does Sultan Muhammad IX know about the coming crusade?",
      "roll_type": "intelligence",
      "date": "1431-03-25",
      "rolled": 41,
      "outcome_range": "26-50",
      "outcome_label": "Partial Intelligence",
      "outcome_detail": "Sultan knows: major crusade launching early April, large eastern army (~20,000) at Jaen, smaller western force at Seville. Does NOT know: true western force size, naval component, two-army coordination, or specific targets.",
      "evaluation": "Middle-range result. Enough to prepare defensively but not to anticipate the full two-army threat.",
      "success_factors": [
        "Public papal bull",
        "Active frontier informants"
      ],
      "failure_factors": [
        "Two-army coordination secret",
        "Naval preparations disguised"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_045",
      "book": 1,
      "chapter": "1.15",
      "event_id": "evt_1431_00091",
      "title": "Sultan's Strategic Response",
      "context": "Given partial intelligence, how does the Sultan position his ~18,000 field troops?",
      "roll_type": "military",
      "date": "1431-03-25",
      "rolled": 44,
      "outcome_range": "36-50",
      "outcome_label": "Mobile Defense with Raiding",
      "outcome_detail": "Main army positioned centrally between Loja and Granada. 2,500-3,000 light cavalry for raiding. Avoid pitched battles, fight from prepared positions. Western defense: 6,000-8,000 troops.",
      "evaluation": "Competent defense playing to Moorish strengths, but central positioning means Sultan must commit when attack comes.",
      "success_factors": [
        "Sound doctrine",
        "Terrain advantage",
        "Cavalry superiority"
      ],
      "failure_factors": [
        "Cannot defend both fronts",
        "Underestimates western threat"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_046",
      "book": 1,
      "chapter": "1.15",
      "event_id": "evt_1431_00094",
      "title": "Sultan's Detection of Army Movement",
      "context": "23,147 troops depart Jaen March 30. How quickly does Sultan learn?",
      "roll_type": "intelligence",
      "date": "1431-03-30",
      "rolled": 49,
      "outcome_range": "46-65",
      "outcome_label": "Rapid and Detailed",
      "outcome_detail": "Sultan learns within 24 hours. Gets complete composition, bombard confirmation, civilian workers (implying fieldworks), estimated arrival time.",
      "evaluation": "Good for Sultan but triggers reactive commitment east — plays into two-army trap.",
      "success_factors": [
        "Excellent spy network",
        "Army of 23,000 impossible to hide"
      ],
      "failure_factors": [
        "Speed forces reactive posture"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_047",
      "book": 1,
      "chapter": "1.15",
      "event_id": "evt_1431_00094",
      "title": "Sultan's Military Response",
      "context": "Sultan knows Juan marches on Alcala la Real with 23,000+ and bombards. What does he do?",
      "roll_type": "military",
      "date": "1431-03-30",
      "rolled": 44,
      "outcome_range": "39-58",
      "outcome_label": "Rapid Relief — Catch Them Building",
      "outcome_detail": "Mobilizes within 24 hours. Forced march with 16,000 (strips western defense to 2,000). 40 miles in 2 days. Arrive Day 3-4 to catch fieldworks incomplete.",
      "evaluation": "Aggressive but plays directly into two-army trap. Strips western defenses critically.",
      "success_factors": [
        "Aggressive action to prevent siege"
      ],
      "failure_factors": [
        "Strips western defenses",
        "Exhausts troops",
        "Plays into trap"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_048",
      "book": 1,
      "chapter": "1.15",
      "event_id": "evt_1431_00094",
      "title": "Castilian Cavalry Detection",
      "context": "1,000 cavalry with operational freedom (Juan de Luna's specialty). How well do they detect Sultan's march?",
      "roll_type": "military",
      "date": "1431-03-30",
      "rolled": 51,
      "outcome_range": "51-70",
      "outcome_label": "Good Warning",
      "outcome_detail": "Scouts report within 12 hours. Accurate count (~17,000), forced march pace, composition, route. 48-60 hours warning for Juan.",
      "evaluation": "Solid result giving adequate preparation time for battle plan.",
      "success_factors": [
        "Dedicated recon column",
        "Juan de Luna's expertise"
      ],
      "failure_factors": [
        "12-hour delay reduces prep time slightly"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_049",
      "book": 1,
      "chapter": "1.16",
      "event_id": "evt_1431_00097",
      "title": "Sultan's Scout Report on Castilian Deployment",
      "context": "Sultan's scouts approach Castilian positions at Alcala la Real. Deception plan in place: siege works appear vulnerable with 5,000 troops and single bombard, main army of 18,000 concealed. Cavalry screen active.",
      "roll_type": "intelligence",
      "date": "1431-04-01",
      "rolled": 73,
      "outcome_range": "72-85",
      "outcome_label": "Good Observation — Tactical Clarity",
      "outcome_detail": "Skilled scouts identify force composition: 23,000 total, siege works with 5,000 elite under Infante Enrique, three infantry formations, 4,000 heavy cavalry under Juan personally. Single bombard visible, suspects more. Construction deliberate, not panicked. May suspect bait. Professional preparation recognized.",
      "evaluation": "Good result for Sultan — accurate picture of Castilian strength. Should have warned against attack. Makes the Sultan's subsequent decision even more catastrophic.",
      "success_factors": [
        "Experienced scouts",
        "Multiple observation angles",
        "Hours of surveillance"
      ],
      "failure_factors": [
        "Doesn't know exact battle plan",
        "Hidden bombards not confirmed"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_050",
      "book": 1,
      "chapter": "1.16",
      "event_id": "evt_1431_00097",
      "title": "Sultan's Strategic Decision",
      "context": "Sultan Muhammad IX has good intelligence (roll 73). Knows 23,000 fresh Castilian troops in prepared positions with artillery. His 16,000 are exhausted from 40-mile forced march. Outnumbered, outgunned, out-positioned. But jihad declared — political/religious pressure to act.",
      "roll_type": "military",
      "date": "1431-04-01",
      "rolled": 3,
      "outcome_range": "1-8",
      "outcome_label": "Desperate Frontal Assault — Immediate Attack",
      "outcome_detail": "Sultan refuses to accept he missed his window. Orders immediate frontal assault despite exhaustion, numerical inferiority, and prepared positions. No rest, no tactical refinement. Jihad fervor overrides military prudence. Troops kept in march column, pushed straight at siege works. Catastrophic decision.",
      "evaluation": "Extraordinary low roll. The worst possible military decision given the intelligence available. Dooms 16,000 men. Jihad fervor and desperation completely override rational military judgment.",
      "success_factors": [],
      "failure_factors": [
        "Troop exhaustion total",
        "Numerical inferiority",
        "Attacking prepared positions",
        "No rest",
        "No tactical deployment"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_051",
      "book": 1,
      "chapter": "1.16",
      "event_id": "evt_1431_00098",
      "title": "Initial Battle Engagement",
      "context": "Sultan's exhausted 16,000 assault Castilian positions. Enrique holds siege works with 5,000 elite. Juan deploys 18,000 reserves — three infantry battles advance, heavy cavalry flanks. Sultan's troops have marched 40 miles in 2 days with no rest before combat.",
      "roll_type": "military",
      "date": "1431-04-01",
      "rolled": 97,
      "outcome_range": "93-100",
      "outcome_label": "Catastrophic Moorish Collapse — Immediate Rout",
      "outcome_detail": "Sultan's gambit fails spectacularly within first hour. Exhausted troops cannot sustain assault. Multiple units break on initial contact. Panic spreads through army. Enrique's defenders barely scratched. Deploying Castilian battles encounter fleeing enemies, not formed resistance. Enemy army disintegrating into mob before cavalry even charges.",
      "evaluation": "Near-maximum roll creating historic one-sided victory. Combined with Sultan's disastrous roll of 3, this is a perfect storm. Exhaustion was so total that battle ended before truly beginning.",
      "success_factors": [
        "Complete exhaustion of enemy",
        "Elite defenders at siege works",
        "Coordinated deployment",
        "Deception plan working"
      ],
      "failure_factors": [],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_052",
      "book": 1,
      "chapter": "1.16",
      "event_id": "evt_1431_00098",
      "title": "Juan's First Cavalry Charge",
      "context": "Juan leads 4,000 heavy cavalry in flanking charge against collapsing Moorish infantry. Guardian Company protecting him. Enemy formations already disintegrating. But Moroccan elite cavalry (2,000) still in the field.",
      "roll_type": "military",
      "date": "1431-04-01",
      "rolled": 17,
      "outcome_range": "9-22",
      "outcome_label": "Partial Success — Hard Fighting",
      "outcome_detail": "Charge devastates fleeing infantry but Moroccan professional cavalry counter-charges. Fierce melee erupts. Guardian Company heavily engaged protecting Juan. Juan parries enemy blade in personal combat. Guardian knight Martín de Oviedo wounded saving Juan's life (blade at neck/shoulder gap). Moroccans eventually driven off. Charge successful but messy — Juan shaken by violence.",
      "evaluation": "Low-middle roll creating real danger for Juan despite overall victory. The Moroccan counter-charge adds drama and personal stakes. Juan's first real combat experience is visceral and dangerous.",
      "success_factors": [
        "Overwhelming numbers",
        "Enemy infantry already breaking"
      ],
      "failure_factors": [
        "Moroccan elite cavalry counter-charge",
        "Guardian casualties",
        "Personal danger to king"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_053",
      "book": 1,
      "chapter": "1.16",
      "event_id": "evt_1431_00099",
      "title": "Cavalry Rally Attempt",
      "context": "After initial charge, Juan's 4,000 cavalry scattered in pursuit. Juan rides to vantage point, then attempts to rally scattered knights for organized pursuit. White armor visible, True Cross banner streaming.",
      "roll_type": "leadership",
      "date": "1431-04-01",
      "rolled": 29,
      "outcome_range": "26-45",
      "outcome_label": "Moderate Rally — Respectable Force",
      "outcome_detail": "~800 knights respond over 10-15 minutes. Guardian Company forms core. Don Álvar Pérez de Guzmán brings 200 knights. Not everyone answers — many continue individual pursuits. Some great lords' retinues ignore call. Adequate but not overwhelming response. Authority tested but not failed.",
      "evaluation": "Middle-low result reflecting realistic difficulty of rallying scattered cavalry after a victorious charge. Glory-seeking and exhaustion compete with royal authority.",
      "success_factors": [
        "King's visible presence",
        "White armor and banner",
        "Victory momentum"
      ],
      "failure_factors": [
        "Knights pursuing glory/plunder",
        "Exhaustion",
        "Scattered formation"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_054",
      "book": 1,
      "chapter": "1.16",
      "event_id": "evt_1431_00099",
      "title": "Pursuit Flanking Charge",
      "context": "Juan leads 800 rallied cavalry to reinforce pursuit. Targets Moroccan rearguard (1,200-1,500) protecting Sultan's fleeing mob (4,000-5,000). Same tactic: lead initially, let guard overtake before contact. 45 minutes daylight remaining.",
      "roll_type": "military",
      "date": "1431-04-01",
      "rolled": 13,
      "outcome_range": "13-28",
      "outcome_label": "Contested Breakthrough — Hard Fight",
      "outcome_detail": "Moroccan cavalry forms blocking force, fights desperately. Running cavalry battle. Charge hits organized resistance. Formation scattered in fighting. Guardian knight wounded. Breakthrough achieved but disorganized. ~500-800 enemy killed in pursuit before darkness. Sultan's main body (3,000+) escapes into gathering dusk. Moroccan cavalry successfully screens most of retreat.",
      "evaluation": "Another low roll creating hard fighting where easy victory expected. Consistent theme: the cavalry pursuit phases were the hardest part of an otherwise one-sided battle. Moroccan professionals proving their quality even in defeat.",
      "success_factors": [
        "Numerical advantage",
        "Enemy infantry defenseless"
      ],
      "failure_factors": [
        "Moroccan professional resistance",
        "Lost cohesion",
        "Darkness approaching"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_055",
      "book": 1,
      "chapter": "1.16",
      "event_id": "evt_1431_00101",
      "title": "Fortress Garrison Surrender Response",
      "context": "Garrison of 380 watched entire battle from walls. Sultan's army destroyed. No relief possible. Juan offers generous terms: lay down arms, keep possessions, safe passage. Or bombardment by 5 bombards.",
      "roll_type": "diplomacy",
      "date": "1431-04-02",
      "rolled": 96,
      "outcome_range": "96-100",
      "outcome_label": "Complete Capitulation — Strategic Breakthrough",
      "outcome_detail": "Commander Yusuf ibn Rashid comes not just to surrender but to convert. 70+ of 380 garrison wish to convert to Christianity and join crusade. Qadi's faith profoundly shaken. Offer fortress intact with complete intelligence. Propaganda earthquake across the frontier.",
      "evaluation": "Near-maximum roll creating unprecedented strategic development. Combined with the catastrophic battle, creates theological crisis across Granada. Every fortress commander will hear about this.",
      "success_factors": [
        "Witnessed catastrophic defeat",
        "Generous terms",
        "Crisis of faith",
        "Practical hopelessness"
      ],
      "failure_factors": [],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_056",
      "book": 1,
      "chapter": "1.16",
      "event_id": "evt_1431_00102",
      "title": "Qadi's Response to Court Invitation",
      "context": "Ahmad al-Zarqali, qadi of Alcala la Real, in deep spiritual crisis. Juan offers freedom to leave or join court with complete religious freedom. No pressure to convert.",
      "roll_type": "diplomacy",
      "date": "1431-04-02",
      "rolled": 77,
      "outcome_range": "69-82",
      "outcome_label": "Genuine Acceptance — Sees Opportunity",
      "outcome_detail": "Ahmad accepts — rare chance to honestly engage with Christianity. Expert in answers taught, not questions discovered. Values intellectual/spiritual exploration. Practical: safer than returning to Granada. Honest: 'I do not promise conversion, but I promise honest seeking.' Sincere acceptance motivated by intellectual and spiritual curiosity.",
      "evaluation": "Good result creating a complex, interesting court advisor character. Neither blind convert nor hostile prisoner — a genuine truth-seeker whose presence enriches the court.",
      "success_factors": [
        "Genuine offer of freedom",
        "Intellectual opportunity",
        "Practical safety"
      ],
      "failure_factors": [],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_057",
      "book": 1,
      "chapter": "1.17",
      "event_id": "evt_1431_00104",
      "title": "Martín de Oviedo Survival",
      "context": "Guardian knight with deep neck/shoulder wound from Moroccan mamluk blade. Fever already present. Medieval infection mortality high. Strong will to live, immediate wound care, veteran constitution.",
      "roll_type": "personal",
      "date": "1431-04-02",
      "rolled": 5,
      "outcome_range": "01-15",
      "outcome_label": "Death",
      "outcome_detail": "Player actually rolled 83 (Strong Recovery) but deliberately chose to override with 5 for narrative drama. Martin dies within 3-4 days as infection overwhelms him. Last words ask Juan to care for daughters Maria (14) and Isabel (12). 'The blow was worth it. You'll be a great king.'",
      "evaluation": "Player-chosen narrative result. The actual roll of 83 would have meant recovery, but death was deemed more dramatically appropriate.",
      "success_factors": [],
      "failure_factors": [
        "Deep wound in vulnerable area",
        "Fever present",
        "Medieval medical limitations"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_058",
      "book": 1,
      "chapter": "1.17",
      "event_id": "evt_1431_00104",
      "title": "Journey Alcala to Jaen",
      "context": "Juan and Alvaro ride north to Jaen with ~20 riders. 20-mile journey through frontier territory. Spring weather.",
      "roll_type": "travel",
      "date": "1431-04-02",
      "rolled": 11,
      "outcome_range": "09-15",
      "outcome_label": "Minor Incident",
      "outcome_detail": "Sub-roll 81: Bridge Out. Stone bridge over swollen stream collapsed from spring rains. Village headman directs to ford 3 miles upstream. 4-hour detour. Water up to horses' bellies. Push through the night. Arrive Jaen mid-afternoon April 4.",
      "evaluation": "Minor inconvenience, no danger. Realistic spring travel complication.",
      "success_factors": [
        "Local knowledge of alternate crossing"
      ],
      "failure_factors": [
        "Spring rains",
        "Bridge infrastructure"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_059",
      "book": 1,
      "chapter": "1.17",
      "event_id": "evt_1431_00106",
      "title": "Western Army Operations — First Week",
      "context": "Western army (12,000 troops + 30 ships) launches amphibious operations against Granada's coast. Sultan stripped western defenses to 2,000. Targets the coast east of Malaga.",
      "roll_type": "military",
      "date": "1431-04-02",
      "rolled": 26,
      "outcome_range": "17-28",
      "outcome_label": "Moderate Success — One Major Objective",
      "outcome_detail": "Fleet lands April 2 near Velez-Malaga. Minimal opposition (~200 defenders). Beachhead: 23 dead, 41 wounded. Town falls quickly; garrison (400-500) withdraws to citadel. By April 6, citadel surrenders after bombardment. Total: 58 dead, 94 wounded. Military government established.",
      "evaluation": "Solid but not spectacular. One major town taken with moderate casualties. Western front functional but not dominant.",
      "success_factors": [
        "Sultan stripped defenses",
        "Naval superiority",
        "Surprise"
      ],
      "failure_factors": [
        "Moderate casualties",
        "Single objective only"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_060",
      "book": 1,
      "chapter": "1.17",
      "event_id": "evt_1431_00107",
      "title": "Granada's Internal Response to Catastrophe",
      "context": "News of Alcala disaster reaches Granada. Fewer than 3,000 of 16,000 return. Court reaction.",
      "roll_type": "political",
      "date": "1431-04-03",
      "rolled": 27,
      "outcome_range": "23-35",
      "outcome_label": "Severe Crisis — Paralysis",
      "outcome_detail": "Court tears itself apart for 5 days. Qadi of Granada (lost two sons) screams accusations. Commanders blame each other. Imams debate if God abandoned Granada. Mass conversions at Alcala create theological crisis. No decisions, no orders. Sultan barely imposes his will.",
      "evaluation": "Bad for Granada. Five days of paralysis while Castilians advance. Institutional collapse at worst possible time.",
      "success_factors": [],
      "failure_factors": [
        "Catastrophic military defeat",
        "Mass conversions",
        "Court infighting"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_061",
      "book": 1,
      "chapter": "1.17",
      "event_id": "evt_1431_00107",
      "title": "Sultan's Strategic Response",
      "context": "After 5 days of paralysis, Sultan Muhammad IX tries to act. What strategy does he adopt?",
      "roll_type": "diplomacy",
      "date": "1431-04-08",
      "rolled": 82,
      "outcome_range": "79-87",
      "outcome_label": "Diplomatic Offensive — Exploit Christian Divisions",
      "outcome_detail": "Four embassies dispatched: to Aragon (territorial concessions + 20,000 gold), Portugal (family ties through Isabel), Navarre (rivalry with Castile), Morocco (vassalage offered, Islamic obligation). Attempting to break Castilian momentum through diplomacy.",
      "evaluation": "Shrewd diplomatic thinking but from position of extreme weakness.",
      "success_factors": [
        "Multiple simultaneous approaches",
        "Playing on real rivalries"
      ],
      "failure_factors": [
        "Extreme weakness",
        "Papal crusade backing",
        "Family ties favor Castile"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_062",
      "book": 1,
      "chapter": "1.17",
      "event_id": "evt_1431_00107",
      "title": "Diplomatic Success",
      "context": "Granada's four embassies reach Christian powers and Morocco. Will any respond favorably?",
      "roll_type": "diplomacy",
      "date": "1431-04-15",
      "rolled": 19,
      "outcome_range": "13-28",
      "outcome_label": "Minimal Response — Polite Refusals",
      "outcome_detail": "Aragon: 'Cannot interfere in Papal crusade.' Portugal: 'Will not undermine son-in-law's holy mission.' Navarre: 'No strategic interest.' Morocco: no response yet. Complete diplomatic failure — Granada stands alone.",
      "evaluation": "Low roll compounding Granada's problems. No Christian power willing to oppose a Papal crusade. Morocco is the only hope.",
      "success_factors": [],
      "failure_factors": [
        "Papal crusade legitimacy",
        "Family ties favor Castile",
        "No strategic incentive"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_063",
      "book": 1,
      "chapter": "1.17",
      "event_id": "evt_1431_00107",
      "title": "Granada's Broader Military Response",
      "context": "While court is paralyzed, what do surviving military commanders do on their own initiative?",
      "roll_type": "military",
      "date": "1431-04-10",
      "rolled": 19,
      "outcome_range": "19-30",
      "outcome_label": "Guerrilla Campaign Launched",
      "outcome_detail": "Commander Yahya ibn Malik gathers ~800 surviving light cavalry — Moroccan survivors, Granadan professionals, rearguard veterans. Splits into raiding parties of 10-50 targeting supply lines, foraging parties, messengers, isolated detachments.",
      "evaluation": "Smart response from surviving field commanders. Guerrilla warfare is the right strategy for an outnumbered defender.",
      "success_factors": [
        "Experienced cavalry survivors",
        "Knowledge of terrain",
        "Castilian supply line vulnerability"
      ],
      "failure_factors": [
        "Limited numbers",
        "No infantry support",
        "Attrition unsustainable"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_064",
      "book": 1,
      "chapter": "1.17",
      "event_id": "evt_1431_00107",
      "title": "Guerrilla Campaign Effectiveness",
      "context": "Yahya ibn Malik's ~800 guerrilla cavalry operating against Castilian supply lines, foraging parties, and messengers. Two-week assessment.",
      "roll_type": "military",
      "date": "1431-04-25",
      "rolled": 53,
      "outcome_range": "39-54",
      "outcome_label": "Moderate Success — Real Disruption",
      "outcome_detail": "Week 1: tentative raids. Week 2: major convoy ambushed (28 killed), 6 messengers intercepted, night raid on Illora siege camp (30 casualties). Total: 180-200 Castilians killed, ~100 wounded. 7 convoys ambushed, 3 destroyed. Illora siege delayed 2-3 weeks. Granada lost 140 cavalry. Roads no longer safe.",
      "evaluation": "Surprisingly effective. Cannot change the strategic balance but makes the crusade significantly more costly and slower.",
      "success_factors": [
        "Terrain knowledge",
        "Light cavalry mobility",
        "Castilian overextension"
      ],
      "failure_factors": [
        "Unsustainable attrition (140 of 800)",
        "Cannot prevent sieges, only delay"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_065",
      "book": 1,
      "chapter": "1.17",
      "event_id": "evt_1431_00107",
      "title": "Combined Muslim Foreign Support",
      "context": "Granada appeals to Muslim world — Morocco, Mamluks, Tunisia, other powers. What support arrives?",
      "roll_type": "diplomacy",
      "date": "1431-05-15",
      "rolled": 68,
      "outcome_range": "64-77",
      "outcome_label": "Moderate Support — Moroccan Commitment",
      "outcome_detail": "Morocco commits 2,000-2,500 professional troops in waves (first 800 arriving in 6-7 weeks). Financial aid: 60-80k dinars. Mamluks send weapons, armor, supplies, advisors. Tunisia sends 3-5 ships. Meaningful but not war-changing support.",
      "evaluation": "Moderate result. Enough to rebuild a functional army but not enough to challenge Castilian superiority directly.",
      "success_factors": [
        "Islamic solidarity",
        "Moroccan military capability"
      ],
      "failure_factors": [
        "Distance",
        "Other commitments",
        "Castilian naval presence"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_066",
      "book": 1,
      "chapter": "1.17",
      "event_id": "evt_1431_00107",
      "title": "Mercenary Recruitment",
      "context": "Sultan spends 150-200k dinars on mercenary recruitment. Who answers the call?",
      "roll_type": "military",
      "date": "1431-05-15",
      "rolled": 43,
      "outcome_range": "36-50",
      "outcome_label": "Moderate Success — Decent Force",
      "outcome_detail": "3,000-4,000 mercenaries: 45% North African veterans, 30% Muslim volunteers, 25% Mediterranean professionals. Cost: 140-170k dinars. Average to good quality. Arrive in waves through mid-July. Full force assembled ~mid-July.",
      "evaluation": "Moderate result. Decent numbers but quality mixed. Combined with Moroccan troops, gives Granada ~14,000 by July.",
      "success_factors": [
        "Substantial funding",
        "Jihad motivation for volunteers"
      ],
      "failure_factors": [
        "Quality variable",
        "Slow arrival",
        "Expensive"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_067",
      "book": 1,
      "chapter": "1.18",
      "event_id": "evt_1431_00110",
      "title": "Embassy Journey to Rome",
      "context": "Delegation (Diego, Fray Hernando, Ahmad, 3 guards) travels from Jaen to Rome overland.",
      "roll_type": "travel",
      "date": "1431-05-01",
      "rolled": 40,
      "outcome_range": "31-50",
      "outcome_label": "Minor Complications",
      "outcome_detail": "Embassy arrives Rome late May in good order with only routine travel difficulties. No significant incidents.",
      "evaluation": "Adequate result. Safe arrival is the key outcome.",
      "success_factors": [
        "Royal safe conduct",
        "Experienced diplomat leading"
      ],
      "failure_factors": [
        "Minor road difficulties"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_068",
      "book": 1,
      "chapter": "1.18",
      "event_id": "evt_1431_00110",
      "title": "Rome's Reception of Embassy",
      "context": "Embassy presents military report, Juan's personal letter pledging perpetual crusade, and Ahmad al-Zarqali as living proof of conversions. Pope Martin V elderly and ill.",
      "roll_type": "diplomacy",
      "date": "1431-06-01",
      "rolled": 51,
      "outcome_range": "46-65",
      "outcome_label": "Strong Positive Reception",
      "outcome_detail": "Pope grants nearly two-hour audience despite frailty. Deeply moved. Calls crusade 'validation of his papal legacy.' Ahmad examined by cardinals for 10 days, becomes sensation. Returns with: formal papal letter praising Juan as 'model of Christian kingship,' dying Pope's personal blessing, Cardinal Orsini's commendation, Ahmad's conversion certified by multiple cardinals.",
      "evaluation": "Strong result. Juan's international standing dramatically elevated. Every future Pope inherits this correspondence.",
      "success_factors": [
        "Living proof in Ahmad",
        "Juan's personal letter",
        "Military victories",
        "Pope's legacy concerns"
      ],
      "failure_factors": [],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_069",
      "book": 1,
      "chapter": "1.18",
      "event_id": "evt_1431_00111",
      "title": "Siege of Illora Progress",
      "context": "15,000 troops with 5 bombards besieging Illora under Master of Calatrava. Guerrilla raiders active in the area. Powder supplies being transported via vulnerable supply lines.",
      "roll_type": "military",
      "date": "1431-04-11",
      "rolled": 5,
      "outcome_range": "01-08",
      "outcome_label": "DISASTER",
      "outcome_detail": "Coordinated night raid by 800-1,000 guerrillas strikes camp in three columns April 11. Powder magazine destroyed with Greek fire — two-thirds of gunpowder eliminated. Two bombards damaged (cracked barrel, demolished carriage). 400-600 casualties. Two assault attempts repulsed (80 dead, 150 wounded). Morale collapses. Relief force approaching. Master recommends withdrawal.",
      "evaluation": "Near-worst possible outcome. Demonstrates guerrilla warfare's effectiveness. Campaign's first major setback. Propaganda victory for Granada.",
      "success_factors": [],
      "failure_factors": [
        "Powder magazine vulnerability",
        "Guerrilla sophistication",
        "Supply line exposure"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_070",
      "book": 1,
      "chapter": "1.18",
      "event_id": "evt_1431_00113",
      "title": "Journey Jaen to Alcala la Real",
      "context": "Juan rides south with ~20 escort to join eastern army. Spring weather, frontier territory with guerrilla activity.",
      "roll_type": "travel",
      "date": "1431-04-19",
      "rolled": 93,
      "outcome_range": "91-98",
      "outcome_label": "Exceptional Journey",
      "outcome_detail": "Perfect weather, clear routes. On April 19 crests hill to see Calatrava column of 3,000-4,000 about to be ambushed by 20-23 Moorish raiders. Discovers ambush in progress, enabling counter-attack.",
      "evaluation": "Outstanding result. Not just safe travel but an opportunity to save troops and boost morale dramatically.",
      "success_factors": [
        "Perfect conditions",
        "Alert scouts",
        "Good timing"
      ],
      "failure_factors": [],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_071",
      "book": 1,
      "chapter": "1.18",
      "event_id": "evt_1431_00113",
      "title": "Counter-Ambush of Moorish Raiders",
      "context": "Juan's 18-man escort (2 left with horses) attacks 23 Moorish raiders from behind as they launch ambush on Calatrava column. Total surprise.",
      "roll_type": "military",
      "date": "1431-04-19",
      "rolled": 80,
      "outcome_range": "71-85",
      "outcome_label": "Clear Success",
      "outcome_detail": "Counter-ambush strikes raiders from behind with total surprise. Raider commander killed by Sergeant Garcia. 8-10 raiders killed or wounded in 3 minutes, rest scatter. Castilian casualties: two minor cuts and a twisted ankle.",
      "evaluation": "Decisive small-unit action. Combined with the ride through the column, transforms army morale.",
      "success_factors": [
        "Total surprise",
        "Professional soldiers",
        "Numerical advantage at point of contact"
      ],
      "failure_factors": [],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_072",
      "book": 1,
      "chapter": "1.18",
      "event_id": "evt_1431_00114",
      "title": "Scout Intelligence from Alcala la Real",
      "context": "Two weeks of reconnaissance from Alcala la Real base. Multiple scout patrols sent to map fortress dispositions and guerrilla activity.",
      "roll_type": "intelligence",
      "date": "1431-05-04",
      "rolled": 26,
      "outcome_range": "21-35",
      "outcome_label": "Adequate Tactical Intelligence",
      "outcome_detail": "Good within 20 miles: Illora 650-700, Moclin 400, Montefrio 200-250, Loja 800-1,000. 14 villages secured. 8 guerrilla groups identified, 2 camps destroyed. Strategic picture incomplete — Granada assembling 8,000-12,000 by summer. 4 scouts lost (3 killed, 1 captured).",
      "evaluation": "Adequate for local operations but limited strategic picture. The scout losses reflect guerrilla activity.",
      "success_factors": [
        "Two weeks of sustained effort",
        "Multiple patrols"
      ],
      "failure_factors": [
        "Guerrilla interference",
        "4 scouts lost",
        "Strategic picture incomplete"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_073",
      "book": 1,
      "chapter": "1.18",
      "event_id": "evt_1431_00115",
      "title": "Sultan's Strategic Response to March on Granada",
      "context": "Juan marches 10,000 troops openly toward Granada. Sultan has been rebuilding forces since Alcala disaster. What is his response?",
      "roll_type": "military",
      "date": "1431-05-09",
      "rolled": 86,
      "outcome_range": "81-93",
      "outcome_label": "Excellent Strategic Response",
      "outcome_detail": "Sultan demonstrates unexpected competence. Has assembled 3,000-3,500 troops including Moroccan reinforcements arriving earlier than expected (roll 79 confirms). Plans a massive sortie (roll 41: all troops positioned behind gates, pour out when Juan approaches to kill/capture the king during demand ceremony).",
      "evaluation": "High roll giving the Sultan real teeth. The sortie plan is cunning — violating parley customs for a decapitation strike.",
      "success_factors": [
        "Moroccan reinforcements early",
        "Unified court",
        "Desperation breeds audacity"
      ],
      "failure_factors": [
        "Still outnumbered",
        "Plan depends on surprise"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_074",
      "book": 1,
      "chapter": "1.18",
      "event_id": "evt_1431_00116",
      "title": "Castilian Detection of Sultan's Sortie Plan",
      "context": "10,000 Castilians within a mile of Granada. Walls more heavily manned than expected. Cavalry scouts patrolling.",
      "roll_type": "intelligence",
      "date": "1431-05-09",
      "rolled": 93,
      "outcome_range": "91-98",
      "outcome_label": "Near-Certainty — Specific Intelligence",
      "outcome_detail": "Cavalry scouts intercept Moorish courier Muhammad ibn Tariq carrying sealed documents from Moclin fortress to Sultan. Documents reveal entire sortie plan: 2,500-3,000 troops will pour from western gate when Sultan refuses demand. Explicit goal: 'Kill or capture the Christian king.' Courier confirms authenticity.",
      "evaluation": "Near-maximum roll. Transforms the situation completely — Juan now knows every detail of the Sultan's plan and can set a counter-trap.",
      "success_factors": [
        "Active cavalry patrols",
        "Lucky interception",
        "Documents explicitly detailed"
      ],
      "failure_factors": [],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_075",
      "book": 1,
      "chapter": "1.19",
      "event_id": "evt_1431_00117",
      "title": "Sultan's Response to Challenge",
      "context": "Juan rides to Granada's gates with 300 cavalry, removes helmet, challenges Sultan. Counter-trap set.",
      "roll_type": "military",
      "date": "1431-05-10",
      "rolled": 48,
      "outcome_range": "46-65",
      "outcome_label": "Full Sortie As Originally Planned",
      "outcome_detail": "Sultan launches complete sortie force of 2,500-3,000 as planned. Full commitment of prepared forces. Gates slam open, troops pour out.",
      "evaluation": "Middle result. Sultan commits fully as intercepted plans indicated. No surprises — the counter-trap can execute as designed.",
      "success_factors": [
        "Honor culture demands response",
        "Sultan already planned sortie",
        "Personal insults unbearable"
      ],
      "failure_factors": [],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_076",
      "book": 1,
      "chapter": "1.19",
      "event_id": "evt_1431_00117",
      "title": "Counter-Trap Opening Phase Execution",
      "context": "300 escort retreats to rally point. Hidden infantry must emerge. Light cavalry must respond. Coordination critical.",
      "roll_type": "military",
      "date": "1431-05-10",
      "rolled": 49,
      "outcome_range": "41-58",
      "outcome_label": "Adequate Execution",
      "outcome_detail": "Plan executes as designed with minor issues. Both flanking infantry groups emerge and form line. Light cavalry responds within timeframe. Escort takes 15 dead, ~25 wounded. Rally point reached in good order. Enemy advance checked but not disrupted.",
      "evaluation": "Adequate but not spectacular. The plan works but timing isn't perfect. Northern section of line was under pressure.",
      "success_factors": [
        "Rehearsed plan",
        "Disciplined troops",
        "Good positioning"
      ],
      "failure_factors": [
        "Timing imperfect",
        "Northern group slower to form",
        "Enemy cavalry harassed retreat"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_077",
      "book": 1,
      "chapter": "1.19",
      "event_id": "evt_1431_00117",
      "title": "Battle Outcome — Sortie Engagement",
      "context": "Defensive line holding. 4,000 main infantry arriving. 1,500 heavy cavalry under Don Fadrique preparing hammer blow. Enemy committed with ~2,500 troops.",
      "roll_type": "military",
      "date": "1431-05-10",
      "rolled": 70,
      "outcome_range": "63-76",
      "outcome_label": "Decisive Victory — Trap Springs Well",
      "outcome_detail": "Defensive line dominates. Enemy realizes trap too late. Reinforcements arrive at perfect moments. Heavy cavalry charge crushes enemy. Castilian casualties 60-120 killed, 90-160 wounded. Moorish losses 2,000-2,600 killed/wounded/captured including ~580 prisoners. 150-500 escape. Decisive tactical victory.",
      "evaluation": "Strong result. The counter-trap works as designed. Sultan's military capability severely damaged. Campaign-significant victory.",
      "success_factors": [
        "Numerical superiority",
        "Phased reinforcement",
        "Heavy cavalry hammer",
        "Enemy trapped"
      ],
      "failure_factors": [
        "Moroccan veterans (~250) escape in fighting square"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_078",
      "book": 1,
      "chapter": "1.19",
      "event_id": "evt_1431_00118",
      "title": "Western Army Operations (April-May 1431)",
      "context": "12,000 troops with naval support, no bombards, conducting coastal operations for 6 weeks.",
      "roll_type": "military",
      "date": "1431-05-10",
      "rolled": 39,
      "outcome_range": "29-42",
      "outcome_label": "Modest Success",
      "outcome_detail": "Two coastal positions taken: Velez-Malaga (major, 3 weeks siege) and Nerja (minor). Casualties 163 dead, 254 wounded. 8,700 combat-effective remain. Progress slower than hoped without artillery.",
      "evaluation": "Modest but solid. Without bombards, every siege takes weeks. Adequate foothold but reaching operational limits.",
      "success_factors": [
        "Naval supremacy",
        "Experienced commanders",
        "Sultan focused east"
      ],
      "failure_factors": [
        "No artillery",
        "Slow traditional sieges",
        "Casualties moderate"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_079",
      "book": 1,
      "chapter": "1.19",
      "event_id": "evt_1431_00119",
      "title": "March to Loja",
      "context": "19,000 troops with 200+ wagons and 5 bombards march 25 miles SW from Alcala to Loja. Guerrilla fighters active.",
      "roll_type": "military",
      "date": "1431-05-27",
      "rolled": 20,
      "outcome_range": "13-24",
      "outcome_label": "Significant Issue",
      "outcome_detail": "Guerrilla harassment throughout march costs 43 killed, 87 wounded. Army arrives tired but intact on May 29 evening.",
      "evaluation": "Rough march. Guerrillas still dangerous despite being unable to stop the advance.",
      "success_factors": [
        "Army intact",
        "Bombards arrive safely"
      ],
      "failure_factors": [
        "130 casualties from guerrillas",
        "Troops tired on arrival"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_080",
      "book": 1,
      "chapter": "1.20",
      "event_id": "evt_1431_00120",
      "title": "Scout Discovery at Loja",
      "context": "Scout patrol found dead Moorish fighters near Loja. Manner of death unusual.",
      "roll_type": "intelligence",
      "date": "1431-05-30",
      "rolled": 59,
      "outcome_range": "46-60",
      "outcome_label": "Factional Conflict",
      "outcome_detail": "Bodies killed by fellow Muslims — different tribal/regional insignia. Granada regulars vs North African allies. Evidence of coalition tensions between Sultan's local forces and foreign reinforcements.",
      "evaluation": "Significant intelligence. Exploitable political division within Granada's forces.",
      "success_factors": [
        "Active scouting"
      ],
      "failure_factors": [],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_081",
      "book": 1,
      "chapter": "1.20",
      "event_id": "evt_1431_00120",
      "title": "Loja Garrison Response to Surrender Offer",
      "context": "Formal surrender offer before bombardment. Strong fortress, recent defeats but garrison fresh.",
      "roll_type": "diplomacy",
      "date": "1431-06-01",
      "rolled": 41,
      "outcome_range": "26-70",
      "outcome_label": "Defiant Refusal — Standard Preparation",
      "outcome_detail": "Polite but firm rejection. Garrison settles into professional defensive preparation. No heroics, no provocations. Standard siege warfare.",
      "evaluation": "Expected outcome. Most likely result given honor culture and fortress strength.",
      "success_factors": [],
      "failure_factors": [
        "Honor demands resistance",
        "Fresh garrison",
        "Strong walls"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_082",
      "book": 1,
      "chapter": "1.20",
      "event_id": "evt_1431_00120",
      "title": "Bombardment Progress at Loja",
      "context": "5 bombards positioned at two points. Garrison of 800-1,000 in well-maintained fortress.",
      "roll_type": "military",
      "date": "1431-06-02",
      "rolled": 92,
      "outcome_range": "88-95",
      "outcome_label": "Rapid Breach",
      "outcome_detail": "Bombards perform exceptionally. Major wall section collapses after just 3 days of bombardment. Breach opened far faster than expected. Garrison's defensive calculations shattered.",
      "evaluation": "Outstanding result. Loja's walls couldn't withstand sustained bombardment. Rapid breach makes assault imminent, forcing surrender negotiation.",
      "success_factors": [
        "5 bombards concentrated fire",
        "Experienced crews",
        "Wall weakness identified"
      ],
      "failure_factors": [],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_083",
      "book": 1,
      "chapter": "1.20",
      "event_id": "evt_1431_00121",
      "title": "Loja Garrison Surrender Negotiation",
      "context": "Major breach opened. Garrison commander comes out to negotiate. Hopeless military situation.",
      "roll_type": "diplomacy",
      "date": "1431-06-03",
      "rolled": 53,
      "outcome_range": "46-62",
      "outcome_label": "Accepts with Face-Saving Request",
      "outcome_detail": "Commander accepts surrender but asks for ceremony: march out in formation with banners, surrender keys to Juan personally, written safe-conduct with royal seal. Needs to show his men they negotiated honorable terms. 3-day deadline.",
      "evaluation": "Good result. Fortress taken without assault. Costs nothing of substance but establishes powerful precedent.",
      "success_factors": [
        "Rapid breach made defense hopeless",
        "Juan's reputation for mercy",
        "Pragmatic commander"
      ],
      "failure_factors": [],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_084",
      "book": 1,
      "chapter": "1.21",
      "event_id": "evt_1431_00124",
      "title": "Gibralfaro Garrison Response",
      "context": "Alcazaba already surrendered. City falling. Gibralfaro fortress (298 men) sent message: surrender now or later as prisoners.",
      "roll_type": "diplomacy",
      "date": "1431-07-09",
      "rolled": 97,
      "outcome_range": "95-100",
      "outcome_label": "Surrender with Offer of Service",
      "outcome_detail": "Captain Yusuf ibn Hassan not only surrenders 298 men but offers 50-80 professional soldiers for Castilian garrison service. Unprecedented — enemy professionals volunteering for service. Mediterranean tradition of military service transcending religious lines.",
      "evaluation": "Near-maximum roll. Historic result. Creates precedent for enemy integration and signals Granada's military cohesion is breaking down.",
      "success_factors": [
        "City already falling",
        "Hopeless situation",
        "Professional soldiers seeking employment",
        "Juan's reputation for mercy"
      ],
      "failure_factors": [],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_085",
      "book": 1,
      "chapter": "1.22",
      "event_id": "evt_1431_00126",
      "title": "Sultan's Grand Strategy",
      "context": "Sultan's response to losing Malaga — his second city and vital port. What does he do?",
      "roll_type": "diplomacy",
      "date": "1431-07-15",
      "rolled": 86,
      "outcome_range": "81-93",
      "outcome_label": "Major Foreign Aid Appeal",
      "outcome_detail": "Sultan sends desperate embassy to Morocco requesting massive military intervention. Also appeals to broader Muslim world.",
      "evaluation": "High roll giving Sultan a strong diplomatic play. Sets up Moroccan reinforcement as future complication.",
      "success_factors": [
        "Islamic solidarity",
        "Morocco's interest in Iberian affairs"
      ],
      "failure_factors": [
        "Distance and logistics",
        "Morocco has own problems"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_086",
      "book": 1,
      "chapter": "1.22",
      "event_id": "evt_1431_00126",
      "title": "Moroccan Aid Response",
      "context": "Sultan's desperate appeal to Morocco for military aid after losing Malaga.",
      "roll_type": "diplomacy",
      "date": "1431-08-01",
      "rolled": 52,
      "outcome_range": "39-63",
      "outcome_label": "Modest Success",
      "outcome_detail": "Morocco commits 2,500 troops arriving November, plus 120,000 gold dinars arriving September. Meaningful but not overwhelming support.",
      "evaluation": "Moderate result. Enough to sustain Granada through winter but not enough to change strategic balance.",
      "success_factors": [
        "Islamic obligation",
        "Moroccan military capacity"
      ],
      "failure_factors": [
        "Slow arrival timeline",
        "Limited numbers"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_087",
      "book": 1,
      "chapter": "1.22",
      "event_id": "evt_1431_00126",
      "title": "Sultan's Operational Strategy",
      "context": "While waiting for Moroccan reinforcements (November), what does Sultan do with remaining forces?",
      "roll_type": "military",
      "date": "1431-07-20",
      "rolled": 57,
      "outcome_range": "46-65",
      "outcome_label": "Active Harassment Campaign",
      "outcome_detail": "Sultan deploys 1,500-2,500 light cavalry raiders for systematic hit-and-run attacks on Castilian supply lines, foraging parties, and messengers.",
      "evaluation": "Smart asymmetric strategy. Cannot win battles but can bleed Castilian operations and delay the advance.",
      "success_factors": [
        "Light cavalry mobility",
        "Terrain knowledge",
        "Castilian supply line exposure"
      ],
      "failure_factors": [
        "Unsustainable attrition",
        "Cannot prevent sieges"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_088",
      "book": 1,
      "chapter": "1.22",
      "event_id": "evt_1431_00127",
      "title": "Master of Santiago's First 30 Days",
      "context": "10,000 troops with 5 bombards advancing west along coast from Malaga. Taking fortresses.",
      "roll_type": "military",
      "date": "1431-08-11",
      "rolled": 17,
      "outcome_range": "11-25",
      "outcome_label": "Modest Progress with Difficulties",
      "outcome_detail": "Marbella falls July 26 (fierce, 180 dead, 240 wounded). Estepona falls August 11 (85 dead, 120 wounded). 2 major + 3 minor fortresses. Total ~280 dead, 380 wounded. Behind schedule. Raiders continuously harass supply lines.",
      "evaluation": "Below expectations. Coastal advance is working but at higher cost than hoped. Raiders a persistent problem.",
      "success_factors": [
        "Bombards available",
        "Experienced troops",
        "Naval support"
      ],
      "failure_factors": [
        "Fierce resistance",
        "Raider harassment",
        "Casualties mounting"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_089",
      "book": 1,
      "chapter": "1.22",
      "event_id": "evt_1431_00127",
      "title": "Enrique's Counter-Raiding Campaign",
      "context": "3,000 cavalry force with scouts, Gibralfaro soldiers, and informant funds deployed to destroy guerrilla raiders.",
      "roll_type": "military",
      "date": "1431-08-23",
      "rolled": 6,
      "outcome_range": "01-10",
      "outcome_label": "Campaign Failure",
      "outcome_detail": "Enrique's force ambushed August 23 in hills west of Loja. 187 dead, 143 wounded (330 total). Enrique himself wounded (arrow in shoulder). Arabic-speaking scouts and informants killed or captured — entire intelligence network destroyed. Raiders emboldened, attacks INCREASE instead of decrease.",
      "evaluation": "Near-worst possible outcome. Campaign failure on every level — tactical, operational, intelligence. Sets back counter-guerrilla efforts severely.",
      "success_factors": [],
      "failure_factors": [
        "Ambush in unfamiliar terrain",
        "Intelligence failure",
        "Guerrilla expertise",
        "Enrique's inexperience with asymmetric warfare"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_090",
      "book": 1,
      "chapter": "1.23",
      "event_id": "evt_1431_00131",
      "title": "Journey to Málaga",
      "context": "Juan travels from Jaén to Málaga with 50-man royal guard escort through raider-infested territory.",
      "roll_type": "military",
      "date": "1431-09-17",
      "rolled": 18,
      "outcome_range": "9-23",
      "outcome_label": "Bad Complications",
      "outcome_detail": "Ambush by ~40 Granada light cavalry. 10 guards killed. Fighting withdrawal necessary. Juan's escort depleted but survives.",
      "evaluation": "Raiders found the king's escort. Professional ambush in broken terrain. Captain Fernán's advice against charging saved the remaining force.",
      "success_factors": [
        "Experienced royal guard",
        "Good horses"
      ],
      "failure_factors": [
        "Raider territory",
        "Speed over caution",
        "Small escort"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_091",
      "book": 1,
      "chapter": "1.23",
      "event_id": "evt_1431_00131",
      "title": "Push Through Raider Ambush",
      "context": "After initial ambush, Juan orders tight formation push through 3 miles of broken ground to open country.",
      "roll_type": "military",
      "date": "1431-09-17",
      "rolled": 89,
      "outcome_range": "79-92",
      "outcome_label": "Strong Push",
      "outcome_detail": "Raiders test formation but tight discipline holds. Only 1-2 more men lost to arrows. Reach open ground with 40 men. Raiders can't break disciplined formation.",
      "evaluation": "Juan's speech and tactical orders held the formation together. Professional discipline overwhelmed raider tactics.",
      "success_factors": [
        "Juan's leadership speech",
        "Tight formation orders",
        "Professional discipline",
        "No chasing"
      ],
      "failure_factors": [
        "Depleted force",
        "Tired horses"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_092",
      "book": 1,
      "chapter": "1.23",
      "event_id": "evt_1431_00133",
      "title": "March from Málaga to Ronda",
      "context": "6,000 men with 6 bombards and 1,600 crossbowmen march through hostile territory to besiege Ronda.",
      "roll_type": "military",
      "date": "1431-10-03",
      "rolled": 74,
      "outcome_range": "56-78",
      "outcome_label": "Good Progress",
      "outcome_detail": "Raiders shadow but crossbow discipline prevents major attacks. Most villages submit. One village (Yunquera) resists and destroyed. ~65 casualties. Arrive Ronda in 10 days, army intact.",
      "evaluation": "Crossbow-heavy formation proved effective. Village submission pattern established. Raiders couldn't break disciplined march.",
      "success_factors": [
        "Massive crossbow component",
        "Disciplined formation",
        "Bombard intimidation",
        "Village submission policy"
      ],
      "failure_factors": [
        "Hostile terrain",
        "Raider harassment",
        "Yunquera resistance"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_093",
      "book": 1,
      "chapter": "1.23",
      "event_id": "evt_1431_00134",
      "title": "Ronda Garrison Response to Surrender Demand",
      "context": "Juan rides to Ronda's gates in white armor to demand surrender from Qaida Muhammad ibn Rashid.",
      "roll_type": "diplomacy",
      "date": "1431-10-03",
      "rolled": 36,
      "outcome_range": "24-43",
      "outcome_label": "Conditional Negotiation",
      "outcome_detail": "Garrison willing to discuss but not immediate surrender. Demands: keep one mosque, no forced conversions (written treaty), reasonable taxation, safe conduct for hardliners.",
      "evaluation": "Not outright rejection but significant demands. Muhammad ibn Rashid pragmatic but must convince divided garrison.",
      "success_factors": [
        "Juan's reputation",
        "Strategic hopelessness",
        "Juan's personal courage"
      ],
      "failure_factors": [
        "Qadi opposition",
        "Military pride",
        "Religious concerns"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_094",
      "book": 1,
      "chapter": "1.23",
      "event_id": "evt_1431_00134",
      "title": "Muhammad's Response to Specific Terms",
      "context": "Juan offers specific terms: safe conduct for garrison, fair taxation, one mosque, no forced conversions.",
      "roll_type": "diplomacy",
      "date": "1431-10-03",
      "rolled": 25,
      "outcome_range": "13-28",
      "outcome_label": "Rejection with Counter-Demands",
      "outcome_detail": "Muhammad wants written treaty, one mosque preserved, lower taxes, guaranteed no forced conversions ever. Returns to fortress to build support. Juan accepts key demands, handshake seals accord.",
      "evaluation": "Initial rejection but negotiation continued. Juan's willingness to accept reasonable demands tipped the balance.",
      "success_factors": [
        "Juan's flexibility",
        "Face-to-face parley",
        "Reasonable counter-demands"
      ],
      "failure_factors": [
        "Hardliner opposition within garrison"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_095",
      "book": 1,
      "chapter": "1.23",
      "event_id": "evt_1431_00137",
      "title": "Journey from Ronda to Toledo",
      "context": "Juan travels at best speed with 100 cavalry from Ronda to Toledo through mostly secured territory.",
      "roll_type": "travel",
      "date": "1431-10-17",
      "rolled": 29,
      "outcome_range": "16-35",
      "outcome_label": "Minor Delays",
      "outcome_detail": "Guadalquivir River flooded from upstream rain. Forced detour through Córdoba. Journey takes 7 days instead of 6. Arrive Toledo safely but one day late.",
      "evaluation": "Natural obstacle (flooding) caused minor delay. No combat incidents. Territory largely secure.",
      "success_factors": [
        "Secured territory",
        "Strong escort",
        "Professional soldiers"
      ],
      "failure_factors": [
        "Flooded river crossing",
        "Hard riding"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_096",
      "book": 1,
      "chapter": "1.24",
      "event_id": "evt_1431_00140",
      "title": "Foreign Support Responses",
      "context": "Responses to Juan's letters requesting foreign Christian support for the Castilian crusade against Granada.",
      "roll_type": "diplomacy",
      "date": "1431-10-19",
      "rolled": 99,
      "outcome_range": "96-100",
      "outcome_label": "Unprecedented Response",
      "outcome_detail": "All major Christian powers respond positively. Pope sends additional funding, England sends 200 longbowmen, France sends military engineers, Burgundy sends 500 veterans, Portugal sends naval support, Florence sends financial aid. Crusade becomes international cause celebre.",
      "evaluation": "Spectacular diplomatic success. The combination of military victories (Ronda, Alcalá la Real) and papal backing made Castile's crusade irresistible.",
      "success_factors": [
        "Military victories",
        "Papal bull backing",
        "Strategic timing",
        "Well-crafted letters"
      ],
      "failure_factors": [],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_097",
      "book": 1,
      "chapter": "1.24",
      "event_id": "evt_1431_00141",
      "title": "Painter Commission",
      "context": "Which painter accepts the commission to paint the royal wedding portrait.",
      "roll_type": "diplomacy",
      "date": "1431-10-19",
      "rolled": 69,
      "outcome_range": "66-80",
      "outcome_label": "Famous Master - Fra Angelico",
      "outcome_detail": "Fra Giovanni da Fiesole (Fra Angelico), Dominican friar and one of Europe's most famous painters, accepts the commission. Came because Pope Eugenius IV personally asked him.",
      "evaluation": "Excellent result. Fra Angelico's involvement adds immense prestige to Juan's court.",
      "success_factors": [
        "Papal support",
        "Crusade prestige",
        "Dominican connections"
      ],
      "failure_factors": [],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_098",
      "book": 1,
      "chapter": "1.24",
      "event_id": "evt_1431_00142",
      "title": "Tax Assessment Results",
      "context": "How successful were the tax assessors sent to evaluate noble estates for the crusade tax.",
      "roll_type": "economic",
      "date": "1431-10-19",
      "rolled": 44,
      "outcome_range": "31-50",
      "outcome_label": "Mixed Success - Partial Compliance",
      "outcome_detail": "Upper nobility largely compliant, middle nobility partial, lower nobility mixed. Three nobles threatened/assaulted assessors. Valuable data collected but revenue fell short of projections.",
      "evaluation": "Expected result given noble resistance to new taxation. Data collected is valuable for future enforcement.",
      "success_factors": [
        "Royal authority",
        "Papal backing",
        "Crusade legitimacy"
      ],
      "failure_factors": [
        "Noble resistance",
        "Ancient tax exemptions",
        "Limited enforcement"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_099",
      "book": 1,
      "chapter": "1.25",
      "event_id": "evt_1431_00144",
      "title": "Random Events Report (4 rolls)",
      "context": "Four d100 rolls for various reports and events reaching Juan's court.",
      "roll_type": "administrative",
      "date": "1431-10-21",
      "rolled": 40,
      "outcome_range": "various",
      "outcome_label": "Mixed Reports",
      "outcome_detail": "Roll 40: Exaggerated indulgence preaching. Roll 12: Popular crusade ballad. Roll 35: Granadan executions showing desperation. Roll 78: Officer considering leaving for Aragon.",
      "evaluation": "Mix of positive and concerning developments. False indulgence preaching most urgent threat to crusade legitimacy.",
      "success_factors": [],
      "failure_factors": [],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_100",
      "book": 1,
      "chapter": "1.28",
      "event_id": "evt_1431_00153",
      "title": "Cortes Opening Speech",
      "context": "Juan's opening speech to the Cortes about the crusade's progress and future plans.",
      "roll_type": "diplomacy",
      "date": "1431-11-15",
      "rolled": 33,
      "outcome_range": "26-40",
      "outcome_label": "Mixed/Poor - Cold Reception",
      "outcome_detail": "Nobles acknowledge victories but worried about taxation and crusade duration. Polite but unenthusiastic.",
      "evaluation": "Nobles had prior concerns that Juan's speech didn't fully address.",
      "success_factors": [
        "Military victories",
        "Papal backing"
      ],
      "failure_factors": [
        "Taxation fears",
        "Extended levy service",
        "Noble self-interest"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_101",
      "book": 1,
      "chapter": "1.28",
      "event_id": "evt_1431_00153",
      "title": "Tax Debate Response",
      "context": "Noble response to Juan's proposed 8% crusade tax replacing normal taxation.",
      "roll_type": "diplomacy",
      "date": "1431-11-15",
      "rolled": 28,
      "outcome_range": "21-35",
      "outcome_label": "Poor - Minimal Movement",
      "outcome_detail": "Strong resistance to new tax rates. Nobles not convinced by arguments alone.",
      "evaluation": "Tax increase from ~3-5% to 8% met predictable resistance.",
      "success_factors": [
        "Crusade legitimacy"
      ],
      "failure_factors": [
        "Major tax increase",
        "Existing resistance",
        "Noble self-interest"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_102",
      "book": 1,
      "chapter": "1.28",
      "event_id": "evt_1431_00153",
      "title": "Humility and Concessions Response",
      "context": "Juan responds with humility, attributing victories to God, and offers concessions including levy compensation.",
      "roll_type": "diplomacy",
      "date": "1431-11-15",
      "rolled": 30,
      "outcome_range": "21-40",
      "outcome_label": "Mixed Positive - Warming Considerably",
      "outcome_detail": "Concessions and humility shift mood. Don Rodrigo Manrique proposes amendments.",
      "evaluation": "Juan's willingness to compromise opened negotiation space.",
      "success_factors": [
        "Humility",
        "Concessions offered",
        "Religious framing"
      ],
      "failure_factors": [
        "Prior cold reception persists"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_103",
      "book": 1,
      "chapter": "1.28",
      "event_id": "evt_1431_00153",
      "title": "Crusade Tax Law Vote",
      "context": "Final vote on the amended 8% crusade tax law with Juan's concessions.",
      "roll_type": "diplomacy",
      "date": "1431-11-15",
      "rolled": 41,
      "outcome_range": "36-55",
      "outcome_label": "Good Success - Strong Support",
      "outcome_detail": "Law passes with strong majority. Amendments addressing noble concerns proved crucial.",
      "evaluation": "Combination of pressure, concession, and religious legitimacy won the vote.",
      "success_factors": [
        "Concessions",
        "Rodrigo Manrique's mediation",
        "Crusade legitimacy",
        "Amendments"
      ],
      "failure_factors": [
        "Some holdouts remain"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_104",
      "book": 1,
      "chapter": "1.28",
      "event_id": "evt_1431_00154",
      "title": "Excommunication Announcement",
      "context": "Juan announces excommunication of three nobles who threatened tax assessors.",
      "roll_type": "diplomacy",
      "date": "1431-11-16",
      "rolled": 48,
      "outcome_range": "36-55",
      "outcome_label": "Accepted with Tension",
      "outcome_detail": "Assembly accepts but some nobles nervous about precedent. Most recognize the three went too far in threatening royal officers.",
      "evaluation": "Excommunication accepted because targets clearly violated royal authority.",
      "success_factors": [
        "Clear violations by the three",
        "Just cause",
        "Crusade authority"
      ],
      "failure_factors": [
        "Noble solidarity concerns",
        "Precedent worry"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_105",
      "book": 1,
      "chapter": "1.28",
      "event_id": "evt_1431_00154",
      "title": "Crown Marshal Decree Reception",
      "context": "Juan announces the Crown Marshal system for structured enforcement of royal authority.",
      "roll_type": "diplomacy",
      "date": "1431-11-16",
      "rolled": 20,
      "outcome_range": "11-25",
      "outcome_label": "Mixed Positive - Relief Emerging",
      "outcome_detail": "Nobles relieved enforcement follows structured procedures rather than arbitrary punishment. Marshal system seen as fairer than alternatives.",
      "evaluation": "The structured nature of the system (proportional fines, escalation, separation of powers) reassured nobles.",
      "success_factors": [
        "Proportional fines",
        "Structured procedures",
        "Separation of powers"
      ],
      "failure_factors": [
        "New enforcement mechanism concerns"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_106",
      "book": 1,
      "chapter": "1.28",
      "event_id": "evt_1431_00155",
      "title": "Eternal Crusade Vision Reception",
      "context": "Juan presents vision of continuing crusade into Africa after Granada falls.",
      "roll_type": "diplomacy",
      "date": "1431-11-17",
      "rolled": 53,
      "outcome_range": "41-55",
      "outcome_label": "Modest Positive",
      "outcome_detail": "Younger nobles excited by prospect of glory and land in Africa. Older nobles cautious about overextension. Vision planted but not universally embraced.",
      "evaluation": "Bold vision planted a seed. Full acceptance will take time and more victories.",
      "success_factors": [
        "Military victories backing words",
        "Religious framing",
        "Youth enthusiasm"
      ],
      "failure_factors": [
        "Overextension fears",
        "War fatigue"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_107",
      "book": 1,
      "chapter": "1.29",
      "event_id": "evt_1432_00157",
      "title": "Birth Outcome",
      "context": "How does the birth of Juan and Isabel's first child go.",
      "roll_type": "personal",
      "date": "1432-01-28",
      "rolled": 11,
      "outcome_range": "1-15",
      "outcome_label": "Severe Birth Crisis",
      "outcome_detail": "Breech presentation, 24+ hours labor, hemorrhaging. Both nearly die.",
      "evaluation": "Terrible roll. Traumatic birth.",
      "success_factors": [
        "Skilled midwives"
      ],
      "failure_factors": [
        "Breech",
        "First birth"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_108",
      "book": 1,
      "chapter": "1.29",
      "event_id": "evt_1432_00157",
      "title": "Baby Gender",
      "context": "Gender of Juan and Isabel's first child.",
      "roll_type": "personal",
      "date": "1432-01-28",
      "rolled": 45,
      "outcome_range": "1-50",
      "outcome_label": "Girl",
      "outcome_detail": "A daughter, named Catalina.",
      "evaluation": "A princess.",
      "success_factors": [],
      "failure_factors": [],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_109",
      "book": 1,
      "chapter": "1.29",
      "event_id": "evt_1432_00157",
      "title": "Baby Health",
      "context": "Health after traumatic birth.",
      "roll_type": "personal",
      "date": "1432-01-28",
      "rolled": 96,
      "outcome_range": "91-100",
      "outcome_label": "Miraculously Unscathed - Perfect Health",
      "outcome_detail": "Despite traumatic birth, baby perfectly healthy. Seen as miraculous.",
      "evaluation": "Extraordinary outcome.",
      "success_factors": [
        "Divine grace"
      ],
      "failure_factors": [],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_110",
      "book": 1,
      "chapter": "1.29",
      "event_id": "evt_1432_00157",
      "title": "Isabel's Recovery",
      "context": "Isabel's recovery after severe birth crisis.",
      "roll_type": "personal",
      "date": "1432-01-28",
      "rolled": 39,
      "outcome_range": "31-45",
      "outcome_label": "Moderate Infection - Difficult Recovery",
      "outcome_detail": "Fever, weakness, Portuguese delirium. Long recovery ahead.",
      "evaluation": "Dangerous but survivable.",
      "success_factors": [
        "Youth"
      ],
      "failure_factors": [
        "Traumatic birth",
        "Medieval medicine"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_111",
      "book": 1,
      "chapter": "1.29",
      "event_id": "evt_1432_00158",
      "title": "Sotomayor's Response",
      "context": "Noble's response to marshal summons.",
      "roll_type": "diplomacy",
      "date": "1432-02-01",
      "rolled": 9,
      "outcome_range": "1-15",
      "outcome_label": "Fortified Defiance",
      "outcome_detail": "Barricaded in castle, hoping for support.",
      "evaluation": "Open rebellion.",
      "success_factors": [],
      "failure_factors": [
        "Pride"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_112",
      "book": 1,
      "chapter": "1.29",
      "event_id": "evt_1432_00158",
      "title": "Baron de Medina's Response",
      "context": "Noble's response to marshal summons.",
      "roll_type": "diplomacy",
      "date": "1432-02-01",
      "rolled": 56,
      "outcome_range": "46-60",
      "outcome_label": "Reluctant Compliance",
      "outcome_detail": "Sees no alternative, agrees to come to Toledo.",
      "evaluation": "Best outcome of the three.",
      "success_factors": [
        "Marshal legitimacy"
      ],
      "failure_factors": [],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_113",
      "book": 1,
      "chapter": "1.29",
      "event_id": "evt_1432_00158",
      "title": "Second Noble's Response",
      "context": "Noble's response to marshal summons.",
      "roll_type": "diplomacy",
      "date": "1432-02-01",
      "rolled": 21,
      "outcome_range": "16-30",
      "outcome_label": "Defiant Refusal - Barricades",
      "outcome_detail": "Barricaded, refuses negotiation. Will require siege.",
      "evaluation": "Open defiance.",
      "success_factors": [],
      "failure_factors": [
        "Pride"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_114",
      "book": 1,
      "chapter": "1.29",
      "event_id": "evt_1432_00158",
      "title": "Count of Niebla's Response",
      "context": "Noble's response after excommunication.",
      "roll_type": "diplomacy",
      "date": "1432-02-01",
      "rolled": 6,
      "outcome_range": "1-10",
      "outcome_label": "Violent Defiance",
      "outcome_detail": "Rejects all negotiation. Preparing for siege.",
      "evaluation": "Worst response. Military force required.",
      "success_factors": [],
      "failure_factors": [
        "Arrogance",
        "Nothing to lose"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_115",
      "book": 1,
      "chapter": "1.32",
      "event_id": "evt_1432_00166",
      "title": "Church Council Opening",
      "context": "Juan's address to Toledo Church Council.",
      "roll_type": "diplomacy",
      "date": "1432-02-22",
      "rolled": 53,
      "outcome_range": "41-60",
      "outcome_label": "Respectful Consideration",
      "outcome_detail": "Bishops engage seriously. Not enthusiastic but willing to discuss.",
      "evaluation": "Solid middle ground.",
      "success_factors": [
        "Juan's piety",
        "Crusade credibility"
      ],
      "failure_factors": [
        "Clerical skepticism"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_116",
      "book": 1,
      "chapter": "1.32",
      "event_id": "evt_1432_00167",
      "title": "Military Academy Budget Challenge",
      "context": "Bishop challenges crusade fund diversion.",
      "roll_type": "personal",
      "date": "1432-02-22",
      "rolled": 11,
      "outcome_range": "1-20",
      "outcome_label": "Uncomfortable Admission",
      "outcome_detail": "Juan caught. Diversion was improper. Leads to public confession.",
      "evaluation": "Low roll but confession turns it into defining moment.",
      "success_factors": [],
      "failure_factors": [
        "Improper fund diversion"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_117",
      "book": 1,
      "chapter": "1.32",
      "event_id": "evt_1432_00167",
      "title": "Response to Public Confession",
      "context": "How council responds to Juan's confession.",
      "roll_type": "personal",
      "date": "1432-02-22",
      "rolled": 44,
      "outcome_range": "36-55",
      "outcome_label": "Genuine Appreciation",
      "outcome_detail": "Bishops deeply moved. Confession strengthens moral authority.",
      "evaluation": "Sincerity resonated. Vulnerability from a king is powerful.",
      "success_factors": [
        "Genuine humility"
      ],
      "failure_factors": [],
      "character_effects": [],
      "ranges": []
    }
  ]
}