{
  "meta": {
    "version": "2.0",
    "total_rolls": 35
  },
  "rolls": [
    {
      "roll_id": "roll_001",
      "book": 1,
      "chapter": "1.01",
      "event_id": "evt_1430_00003",
      "title": "Royal Guard Morale Speech",
      "context": "Juan II addresses the royal guard to inspire personal loyalty. He gives a speech invoking religious duty and promising better equipment.",
      "roll_type": "persuasion",
      "date": "1430-05-02",
      "rolled": null,
      "outcome_range": "status_quo",
      "outcome_label": "Status Quo",
      "outcome_detail": "The speech neither inspires special loyalty nor alienates the guards. They remain professional but not personally devoted. The king is reminded he has much to learn about leadership.",
      "evaluation": "Despite favorable conditions (royal authority, new equipment promised, religious framing), the delivery fell flat. The guards remain dutiful but uninspired.",
      "success_factors": [
        "Royal authority",
        "Equipment promise",
        "Religious framing",
        "Captain's support"
      ],
      "failure_factors": [
        "King's youth and inexperience",
        "Overly formal delivery"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_002",
      "book": 1,
      "chapter": "1.01",
      "event_id": "evt_1430_00010",
      "title": "Infantes Revolt During Pilgrimage",
      "context": "After successfully negotiating with the Infantes and establishing a regency council, Juan II rolls to see if the Infantes revolt during his absence on pilgrimage.",
      "roll_type": "chaos",
      "date": "1430-05-20",
      "rolled": null,
      "outcome_range": "revolt",
      "outcome_label": "Critical Failure",
      "outcome_detail": "Despite careful planning and giving the Infantes real power through a regency council, the dice decree that a revolt WILL take place during Juan's pilgrimage. The how and why will be determined later.",
      "evaluation": "The GM assessed 70-75% probability of no revolt. The dice overruled the careful diplomacy. This sets up the central crisis of the early game.",
      "success_factors": [
        "Infantes have a bloodless path to power through the council",
        "They believe they're controlling governance",
        "No immediate reason to rebel — they got what they wanted"
      ],
      "failure_factors": [
        "King's extended absence creates opportunity",
        "Noble ambitions may exceed council powers",
        "Aragonese interference possible"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_003",
      "book": 1,
      "chapter": "1.02",
      "event_id": "evt_1430_00017",
      "title": "Subterfuge Secrecy",
      "context": "Juan II staged a fake departure on pilgrimage and is hiding near Valladolid to crash the first regency council meeting. This roll determines whether the Infantes have discovered the deception.",
      "roll_type": "intrigue",
      "date": "1430-05-16",
      "rolled": null,
      "outcome_range": "status_quo",
      "outcome_label": "Status Quo",
      "outcome_detail": "The Infantes received vague information that something seems off — Captain Fernán seemed troubled, the hermitage prayer was unusual — but couldn't piece together the full picture. They proceed with their plans despite slight uncertainty.",
      "evaluation": "Juan's tight circle of knowledge and short timeline kept the plan mostly secret. However, the unusual behavior at the hermitage raised suspicions that prevented total surprise.",
      "success_factors": [
        "Very small circle of knowledge (only Álvaro knew the plan)",
        "Short timeline (only 3 days)",
        "Legitimate departure ceremony with full party",
        "Plausible cover story (prayer at hermitage)"
      ],
      "failure_factors": [
        "Fray Hernando's suspicions about the prayer",
        "Captain Fernán's visible concern",
        "Infantes' own intelligence networks",
        "Unusual behavior of king staying behind to pray"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_004",
      "book": 1,
      "chapter": "1.02",
      "event_id": "evt_1430_00017",
      "title": "Infantes' Council Boldness",
      "context": "The Infantes hold their first regency council meeting while Juan II is supposedly away on pilgrimage. This roll determines how aggressively they push their agenda.",
      "roll_type": "chaos",
      "date": "1430-05-16",
      "rolled": null,
      "outcome_range": "critical_success",
      "outcome_label": "Critical Success",
      "outcome_detail": "The Infantes make extremely bold moves far exceeding expectations: proposing to make the regency permanent, removing Álvaro's loyalists from key positions, and openly discussing how to constrain the king upon his return. Their spectacular overreach provides perfect ammunition for Juan's surprise entrance.",
      "evaluation": "Despite the status quo on secrecy (vague suspicions), the Infantes' overconfidence drove them to reveal their full hand. Infante Juan's proposal to formalize permanent constraints on royal authority was far more aggressive than merely administering the realm.",
      "success_factors": [
        "Infantes believed Juan was truly gone",
        "First meeting — eager to establish precedent",
        "Overconfidence after getting regency power",
        "Desire to lock in gains before Juan returns"
      ],
      "failure_factors": [
        "Enrique's brief hesitation about king's hermitage behavior",
        "Archbishop and Marquis expressed caution"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_005",
      "book": 1,
      "chapter": "1.03",
      "event_id": "evt_1430_00020",
      "title": "Pilgrimage to Santiago",
      "context": "Juan II and his party of ~30 travel from near Valladolid through Castile to Santiago de Compostela. High probability of success given they travel in their own kingdom with a well-equipped royal escort.",
      "roll_type": "travel",
      "date": "1430-06-02",
      "rolled": null,
      "outcome_range": "critical_success",
      "outcome_label": "Great Success",
      "outcome_detail": "The journey goes exceptionally well. Warm receptions in Palencia and León, common people showing genuine affection. Intelligence gathered about noble feuds affecting commoners. Party arrives in Santiago with stronger bonds, growing popular support, and deeper understanding of the kingdom.",
      "evaluation": "Ideal conditions: own territory, established pilgrimage route, well-equipped guard, spring weather. The great success added popular goodwill and valuable intelligence.",
      "success_factors": [
        "Traveling in own kingdom",
        "Well-established pilgrimage route",
        "Professional guard escort",
        "Good weather (May-June)",
        "Recent demonstration of royal authority"
      ],
      "failure_factors": [
        "Infante Juan's hostility (newly removed)",
        "Political tensions among nobles"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_006",
      "book": 1,
      "chapter": "1.03",
      "event_id": "evt_1430_00022",
      "title": "Overland Journey to Rome",
      "context": "A lean party of 10 travels from Santiago through Navarre, France, and Italy to Rome. Route through France is well-established but crosses Infante Juan's kingdom of Navarre.",
      "roll_type": "travel",
      "date": "1430-07-24",
      "rolled": null,
      "outcome_range": "success",
      "outcome_label": "Success",
      "outcome_detail": "The party arrives in Rome by late July with time for papal diplomacy. Letters of recommendation gathered from Toulouse and Avignon. Some complications: tense crossing through Navarre, a horse injury, and concerning letters from home about Infante Juan's propaganda campaign. But nothing derails the plan.",
      "evaluation": "Well-planned route with good letters of introduction. The complications (Navarre tension, horse injury) were manageable. Cardinal de Foix's private letter to Orsini proved invaluable.",
      "success_factors": [
        "Well-established route through France",
        "Summer travel season",
        "Sir Thomas's knowledge of French roads",
        "Strong letters of recommendation"
      ],
      "failure_factors": [
        "Navarre crossing through hostile territory",
        "Horse injury in Pyrenees",
        "Budget strain from replacement horse",
        "Infante Juan's intelligence networks"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_007",
      "book": 1,
      "chapter": "1.03",
      "event_id": "evt_1430_00023",
      "title": "Cardinal Orsini Audience",
      "context": "Juan II meets Cardinal Giordano Orsini, Pope Martin V's closest advisor, using an approach of radical honesty about his spiritual and political motivations.",
      "roll_type": "persuasion",
      "date": "1430-07-27",
      "rolled": null,
      "outcome_range": "status_quo",
      "outcome_label": "Status Quo",
      "outcome_detail": "Orsini neither endorses nor rejects Juan's approach. He finds the young king 'worth meeting' and arranges a papal audience, but doesn't commit to supporting the crusade bull. He remains uncertain whether Juan is a genuine seeker or confused, but is intrigued enough to proceed.",
      "evaluation": "The radical honesty strategy was high-risk. Describing vague 'feelings' and 'pulls' could have seemed unstable, but Juan's sincerity and letters of recommendation earned him a chance. The status quo result is functional — it gets him before the Pope.",
      "success_factors": [
        "Radical honesty about mixed motives",
        "Strong letters of recommendation",
        "Fray Hernando's careful testimony",
        "Cardinal de Foix's private letter"
      ],
      "failure_factors": [
        "Vague description of spiritual experiences",
        "Youth and inexperience",
        "Mixing political calculation with spiritual seeking"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_008",
      "book": 1,
      "chapter": "1.03",
      "event_id": "evt_1430_00025",
      "title": "Act of Renunciation Before the Pope",
      "context": "Juan II strips himself of crown, wealth, and clothing before Pope Martin V, offering body and soul as God's servant. An unprecedented act of complete submission and self-offering.",
      "roll_type": "persuasion",
      "date": "1430-07-31",
      "rolled": null,
      "outcome_range": "critical_success",
      "outcome_label": "Great Success",
      "outcome_detail": "Pope Martin V is profoundly moved — kneels beside Juan, accepts his offering, and personally commissions the crusade. Grants a sweeping crusade bull with sole command, call to all Christendom, Military Order obedience, crusade taxation authority, papal legate, 20,000 florins, sacred relics (True Cross fragment, Saint James bone), and diplomatic pressure on Aragon. The Pope embraces Juan and whispers: 'This was grace.'",
      "evaluation": "The unprecedented vulnerability transformed a political petition into a spiritual event. An 18-year-old king naked before the Pope, enacting the inscription 'Non Nobis Domine,' touched the dying pontiff's legacy instincts and genuine faith. Everything Juan had built — the letters, the honesty with Orsini, the spiritual struggles — culminated in this moment.",
      "success_factors": [
        "Unprecedented dramatic vulnerability",
        "Deep medieval Christian symbolism (kenosis)",
        "Sword inscription 'Non Nobis Domine' perfectly aligned",
        "Built on weeks of genuine spiritual seeking",
        "Pope's legacy motivation (aging, aware of mortality)",
        "Prior groundwork with Orsini"
      ],
      "failure_factors": [
        "Could have seemed unhinged or theatrical",
        "Fray Hernando's visible shock",
        "Extreme vulnerability in political context"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_009",
      "book": 1,
      "chapter": "1.04",
      "event_id": "evt_1430_00028",
      "title": "Infantes' Revolt Outcome",
      "context": "The Infantes de Aragón attempt a revolt during Juan II's absence, trying to rally nobles, seize fortresses, and establish permanent control. The revolt was predetermined by a previous roll (chapter 1.01) but its success is assessed here.",
      "roll_type": "chaos",
      "date": "1430-09-01",
      "rolled": null,
      "outcome_range": "failure",
      "outcome_label": "Failure",
      "outcome_detail": "The Infantes accomplish very little. Only 23 nobles attend their unauthorized assembly. They seize Arévalo and two minor castles but fail to take any major city. Álvaro holds Valladolid easily. When rumors of the papal bull spread, remaining support collapses. They end as exposed rebels with ~12% noble backing.",
      "evaluation": "The revolt was assessed as 'Likely to Fail' even before the roll. Álvaro's competent defense, Juan's intelligence cabinet, and the papal bull rumors all worked against the Infantes. Their overreach in chapter 1.02 had already weakened their credibility.",
      "success_factors": [],
      "failure_factors": [
        "Limited noble support after chapter 1.02 humiliation",
        "Álvaro's competent defense of royal administration",
        "Juan's intelligence cabinet functioning well",
        "Cities loyal to the crown",
        "Papal bull rumors devastating to rebel cause"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_010",
      "book": 1,
      "chapter": "1.04",
      "event_id": "evt_1430_00029",
      "title": "Granada Military Mobilization",
      "context": "Sultan Muhammad IX attempts emergency military mobilization: raising 10,000 militia, stockpiling supplies, improving fortifications on 20 frontier castles.",
      "roll_type": "military",
      "date": "1430-09-01",
      "rolled": null,
      "outcome_range": "failure",
      "outcome_label": "Failure",
      "outcome_detail": "Only 8,000 of planned 10,000 militia raised, many poorly trained and resentful (conscripted during harvest). Fortification improvements incomplete. 80,000 dinars spent. Internal discontent rising among merchants and farmers.",
      "evaluation": "Rushed mobilization during harvest season created economic disruption. The professional 8,000-man army remains intact but the additional militia are of limited quality.",
      "success_factors": [
        "Professional army intact",
        "Some fortification work completed"
      ],
      "failure_factors": [
        "Mobilization during harvest season",
        "Economic disruption from requisitions",
        "Rushed timeline",
        "Internal resentment"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_011",
      "book": 1,
      "chapter": "1.04",
      "event_id": "evt_1430_00029",
      "title": "Muslim World Alliance",
      "context": "Sultan Muhammad IX appeals to Morocco, Tunisia, Egypt, and the Ottoman Empire for support against the Christian crusade.",
      "roll_type": "diplomacy",
      "date": "1430-09-10",
      "rolled": null,
      "outcome_range": "critical_success",
      "outcome_label": "Critical Success",
      "outcome_detail": "Unprecedented response from the Muslim world: Morocco sends 5,000 troops, 1,000 cavalry, 15 war galleys, 50,000 dinars; Tunisia sends 30,000 dinars and 5-8 galleys; Egypt sends 100,000 dinars and military advisors; Ottomans send 20,000 dinars and cannon technology with master gunners. Total: 220,000 dinars, ~8,000 troops, 20-25 war galleys. Religious scholars declare defense of Granada as jihad. Granada transforms into the standard-bearer of Islamic resistance.",
      "evaluation": "The papal crusade bull and Juan's dramatic spiritual acts convinced the Muslim world this was an existential threat. The scale of support far exceeded historical precedent, turning a regional conflict into a civilizational confrontation.",
      "success_factors": [
        "Crusade bull perceived as existential threat to Islam in Iberia",
        "Religious solidarity across Muslim world",
        "Ottoman strategic interest in weakening Christendom",
        "Morocco's proximity and military capability",
        "Egypt's wealth and prestige"
      ],
      "failure_factors": [],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_012",
      "book": 1,
      "chapter": "1.04",
      "event_id": "evt_1430_00030",
      "title": "Rome to Florence Journey",
      "context": "Juan II's lean party of 10 travels from Rome to Florence via the Via Cassia, approximately 6-7 days normally.",
      "roll_type": "travel",
      "date": "1430-08-05",
      "rolled": null,
      "outcome_range": "critical_success",
      "outcome_label": "Critical Success",
      "outcome_detail": "Journey completed in just 4 days with excellent weather and growing party camaraderie. Juan's health issues (early scurvy) are identified and addressed by companions. Arrived in Florence ahead of schedule and received by Cosimo de' Medici.",
      "evaluation": "Perfect conditions, experienced party, well-maintained roads. The critical success allowed early arrival and time for health recovery.",
      "success_factors": [
        "Well-maintained Italian roads",
        "Experienced travel party",
        "Good weather",
        "Well-rested horses from Rome"
      ],
      "failure_factors": [
        "Juan's developing health issues"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_013",
      "book": 1,
      "chapter": "1.04",
      "event_id": "evt_1430_00032",
      "title": "Florence Crusade Speech",
      "context": "Juan II delivers a public crusade speech before 8,000-10,000 people in Florence's Piazza della Signoria, attaching sacred relics to his white banner and calling for support.",
      "roll_type": "persuasion",
      "date": "1430-08-09",
      "rolled": null,
      "outcome_range": "critical_success",
      "outcome_label": "Critical Success",
      "outcome_detail": "The speech becomes legendary. Juan's passionate delivery, the drawing of his father's sword with 'Non Nobis Domine,' and the public attachment of relics to the white banner creates religious fervor. Florentine merchants pledge 15,000 florins, 200 volunteers sign up including 50 professional soldiers, the Bishop of Florence endorses publicly. Word spreads across Europe of a young king risen to complete the Reconquista.",
      "evaluation": "Juan's genuine conviction, combined with powerful theatrical elements (sword, relics, white banner, youth) and Cosimo's staging of the event, created a perfect moment. His growing reputation from Rome magnified the impact.",
      "success_factors": [
        "Genuine spiritual conviction",
        "Powerful theatrical elements (relics, sword, white banner)",
        "Cosimo's staging and elite audience",
        "Youth as asset — passionate and sincere",
        "Papal endorsement lending authority"
      ],
      "failure_factors": [
        "Health issues (managed)",
        "Foreign king on foreign soil"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_014",
      "book": 1,
      "chapter": "1.05",
      "event_id": "evt_1430_00034",
      "title": "Journey from Florence to Barcelona",
      "context": "Juan's party travels overland to Pisa and takes ship across the Mediterranean to Barcelona, carrying the crusade bull, relics, and treasury.",
      "roll_type": "travel",
      "date": "1430-08-18",
      "rolled": null,
      "outcome_range": "success",
      "outcome_label": "Success",
      "outcome_detail": "Nine-day journey completed safely. One tense encounter with a pirate galley that broke off when the Sant'Angelo proved too well-armed. All cargo and passengers arrived intact.",
      "evaluation": "Well-organized party with experienced crew. Captain Grimaldi's decision to avoid the Balearics added time but reduced risk.",
      "success_factors": [
        "Experienced ship captain (Grimaldi)",
        "Well-armed escort",
        "Good weather",
        "Avoiding pirate-heavy Balearic waters"
      ],
      "failure_factors": [
        "Pirate encounter (resolved)",
        "Juan's health issues continuing"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_015",
      "book": 1,
      "chapter": "1.05",
      "event_id": "evt_1430_00038",
      "title": "Barcelona Cathedral Relic Display & Recruitment",
      "context": "Juan displays the True Cross and Saint James relics at Barcelona Cathedral for a week, with systematic recruitment and fundraising.",
      "roll_type": "persuasion",
      "date": "1430-08-27",
      "rolled": null,
      "outcome_range": "critical_success",
      "outcome_label": "Great Success",
      "outcome_detail": "Overwhelming response over a week: 82,000 florins raised (including 20,000 from converso merchant Ruiz, 8,000 from shipping magnate Medina), 62 crusaders recruited and training. Archbishop of Zaragoza endorses the crusade and secures Consell Reial support including 3 ships for transport. Barcelona's elite pledge financial and logistical support. The crusade gains institutional Aragonese backing.",
      "evaluation": "The combination of sacred relics, papal authority, Juan's growing reputation from Rome and Florence, and María's social networking created a perfect environment for recruitment and fundraising.",
      "success_factors": [
        "Sacred relics (True Cross, Santiago bone) as draws",
        "Papal authority backing the crusade",
        "Juan's reputation from Rome and Florence",
        "María's social network and hosting",
        "Archbishop of Zaragoza's endorsement",
        "Systematic recruitment process"
      ],
      "failure_factors": [],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_016",
      "book": 1,
      "chapter": "1.06",
      "event_id": "evt_1430_00041",
      "title": "Captain Fernán's Mission Delivery",
      "context": "Captain Fernán rides from Barcelona to Valladolid with royal arrest orders for the Infantes.",
      "roll_type": "travel",
      "date": "1430-09-02",
      "rolled": null,
      "outcome_range": "success",
      "outcome_label": "Success",
      "outcome_detail": "Fernán and two guards arrive in Valladolid after 14 days of hard riding. Orders delivered to Álvaro intact.",
      "evaluation": "Three experienced riders on a well-known route. The main risk was Navarrese interception, which didn't materialize.",
      "success_factors": [
        "Experienced riders",
        "Known route",
        "Consell Reial safe passage"
      ],
      "failure_factors": [],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_017",
      "book": 1,
      "chapter": "1.06",
      "event_id": "evt_1430_00041",
      "title": "Arrest of the Infantes",
      "context": "Álvaro attempts to execute Juan's orders to arrest the Infantes for rebellion.",
      "roll_type": "intrigue",
      "date": "1430-09-10",
      "rolled": null,
      "outcome_range": "failure",
      "outcome_label": "Failure",
      "outcome_detail": "The Infantes were prepared — they'd been intercepting correspondence and knew the orders were coming. They publicly refused, withdrew to fortified positions, and Alfonso V threatened war. A three-day standoff at Arévalo ended with Álvaro withdrawing. The Infantes remain free but are now exposed as refusing royal justice.",
      "evaluation": "The intercepted correspondence gave the Infantes warning. Without sufficient military force and with Alfonso V's threat looming, Álvaro couldn't force the issue.",
      "success_factors": [],
      "failure_factors": [
        "Infantes intercepted correspondence and were forewarned",
        "Insufficient royal military force for siege",
        "Alfonso V's threat of war from Aragon",
        "Infantes' fortified positions",
        "Political risk of open civil war"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_018",
      "book": 1,
      "chapter": "1.06",
      "event_id": "evt_1430_00043",
      "title": "Voyage from Barcelona to Seville",
      "context": "Three galleys carry Juan, 62 crusaders, relics, and treasury from Barcelona around the Iberian coast to Seville.",
      "roll_type": "travel",
      "date": "1430-09-28",
      "rolled": null,
      "outcome_range": "success",
      "outcome_label": "Success",
      "outcome_detail": "Ten-day voyage completed with all cargo intact. Several tense encounters: bluffed past Valencia's inspection, corsairs retreated from armed formation, Moroccan galleys shadowed through Strait of Gibraltar but didn't attack.",
      "evaluation": "Three-ship formation provided security. Tense moments managed through combination of bluffing, arms display, and good seamanship.",
      "success_factors": [
        "Three-ship convoy formation",
        "Experienced Catalan captains",
        "Armed crusaders visible on deck",
        "Papal authority used to bluff Valencia"
      ],
      "failure_factors": [
        "Corsair presence near Cartagena",
        "Moroccan galleys in Strait of Gibraltar",
        "Valencia's attempted inspection"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_019",
      "book": 1,
      "chapter": "1.07",
      "event_id": "evt_1430_00046",
      "title": "Noble Address on Infantes' Rebellion",
      "context": "Juan addresses Seville's nobles, presenting evidence of rebellion and the papal bull, demanding the Infantes surrender for trial.",
      "roll_type": "persuasion",
      "date": "1430-09-28",
      "rolled": null,
      "outcome_range": "failure",
      "outcome_label": "Failure (Not Catastrophic)",
      "outcome_detail": "Nobles remain divided. About 30% rally behind Juan, but the majority are cautious — distrustful of Álvaro, fearing civil war, and seeing the arrest demand as heavy-handed. The papal bull impresses but doesn't override political calculation.",
      "evaluation": "The speech was well-constructed but the political landscape was against success. Many nobles resent Álvaro de Luna's influence and fear being drawn into a civil war between the crown and Aragon.",
      "success_factors": [
        "Papal bull as evidence of divine mandate",
        "Clear evidence of Infantes' rebellion",
        "Juan's growing reputation"
      ],
      "failure_factors": [
        "Noble distrust of Álvaro de Luna",
        "Fear of civil war with Aragon",
        "Arrest demand seen as heavy-handed",
        "50% of nobility neutral and cautious"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_020",
      "book": 1,
      "chapter": "1.07",
      "event_id": "evt_1430_00049",
      "title": "Crusader Spiritual Assessment",
      "context": "Juan assesses whether his 62 crusaders have maintained genuine spiritual commitment through their selective recruitment and Fray Hernando's spiritual formation.",
      "roll_type": "intrigue",
      "date": "1430-10-01",
      "rolled": null,
      "outcome_range": "success",
      "outcome_label": "Success",
      "outcome_detail": "The crusaders show genuine faith and commitment. Daily confession, group prayer, and careful vetting have created a core of believers rather than mercenaries. Not all are saints, but their sincerity is real.",
      "evaluation": "Fray Hernando's spiritual formation program and the two-stage recruitment process (physical by Rodrigo, spiritual by Hernando) created a genuine core.",
      "success_factors": [
        "Selective recruitment process",
        "Fray Hernando's daily spiritual formation",
        "Strong group cohesion from shared journey"
      ],
      "failure_factors": [],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_021",
      "book": 1,
      "chapter": "1.07",
      "event_id": "evt_1430_00049",
      "title": "Seville Plaza Speech",
      "context": "Juan addresses 8,000-10,000 people at the Plaza de San Francisco with the banner and relics, covering the papal mandate, Infantes' rebellion, safe conduct offer, and crusade vision.",
      "roll_type": "persuasion",
      "date": "1430-10-02",
      "rolled": null,
      "outcome_range": "success",
      "outcome_label": "Success",
      "outcome_detail": "Solid political win. Common people and middle class rally, donations flow, crusade narrative gains traction. Not the overwhelming triumph of Florence but a meaningful advance in Juan's home territory. The safe conduct offer is perceived positively as showing fairness.",
      "evaluation": "After the noble address failure, this public speech to the broader population proved more effective. Common people respond to the crusade message more readily than cautious nobles.",
      "success_factors": [
        "Strong message and relics on display",
        "Home territory (Seville)",
        "Safe conduct narrative showing fairness",
        "Common people more responsive than nobles"
      ],
      "failure_factors": [
        "Recent noble address failure dampened expectations"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_022",
      "book": 1,
      "chapter": "1.08",
      "event_id": "evt_1430_00053",
      "title": "Council: Portuguese Betrothal Announcement",
      "context": "Juan opens the Royal Council by announcing his betrothal to Princess Isabel of Portugal.",
      "roll_type": "persuasion",
      "date": "1430-11-08",
      "rolled": null,
      "outcome_range": "success",
      "outcome_label": "Success",
      "outcome_detail": "Nobles impressed by the strategic marriage. Portugal's naval power, wealth, and neutrality make it an excellent choice. Momentum established early.",
      "evaluation": "Strong opening move. The betrothal demonstrates Juan's growing diplomatic network and strategic thinking.",
      "success_factors": [
        "Excellent match strategically",
        "Letter from Portuguese king as proof",
        "Sets positive tone"
      ],
      "failure_factors": [],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_023",
      "book": 1,
      "chapter": "1.08",
      "event_id": "evt_1430_00053",
      "title": "Council: Aragonese Relations",
      "context": "Juan describes Barcelona's warm welcome, 82,000 florins raised, and ongoing diplomatic relations with Alfonso V.",
      "roll_type": "persuasion",
      "date": "1430-11-08",
      "rolled": null,
      "outcome_range": "success",
      "outcome_label": "Success",
      "outcome_detail": "Nobles impressed by the Barcelona achievements. The scale of support and Aragonese Consell Reial's backing demonstrates Juan's international standing.",
      "evaluation": "Building momentum. Each success makes the next segment more impactful.",
      "success_factors": [
        "82,000 florins concrete evidence",
        "Consell Reial backing",
        "Building on Portuguese announcement"
      ],
      "failure_factors": [],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_024",
      "book": 1,
      "chapter": "1.08",
      "event_id": "evt_1430_00053",
      "title": "Council: Papal Bull Presentation",
      "context": "Juan presents the papal crusade bull with the Archbishop of Toledo's formal endorsement.",
      "roll_type": "persuasion",
      "date": "1430-11-08",
      "rolled": null,
      "outcome_range": "success",
      "outcome_label": "Success",
      "outcome_detail": "The Archbishop's endorsement and the physical presence of the papal bull with its lead seal are powerfully convincing. Nobles pledge their arms to the crusade.",
      "evaluation": "The religious framing transforms the Council from political to sacred. Opposition becomes opposition to God.",
      "success_factors": [
        "Papal authority",
        "Archbishop's endorsement",
        "Accumulated momentum from prior segments"
      ],
      "failure_factors": [],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_025",
      "book": 1,
      "chapter": "1.08",
      "event_id": "evt_1430_00053",
      "title": "Council: Rebellion Evidence Against Infantes",
      "context": "Juan transitions to the Infantes' rebellion, framing it as obstacle to the sacred crusade. Álvaro presents evidence with twelve witnesses.",
      "roll_type": "persuasion",
      "date": "1430-11-08",
      "rolled": null,
      "outcome_range": "critical_success",
      "outcome_label": "Great Success",
      "outcome_detail": "Seamless transition from crusade fervor to rebellion charges. The nobles accept the framing completely — opposing the Infantes becomes a matter of faith, not just politics. Twelve witnesses deliver devastating testimony. The case is overwhelming.",
      "evaluation": "The accumulated momentum of three previous successes made this great success possible. By the time evidence was presented, the nobles were already committed to the crusade and saw the Infantes as obstacles to God's work.",
      "success_factors": [
        "Three prior successes building momentum",
        "Framing rebellion as obstacle to crusade",
        "Twelve witnesses with devastating evidence",
        "Álvaro's thorough preparation"
      ],
      "failure_factors": [],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_026",
      "book": 1,
      "chapter": "1.08",
      "event_id": "evt_1430_00054",
      "title": "Infantes' Defense at the Council",
      "context": "The Infantes respond to overwhelming evidence of rebellion. Rather than contest the charges, they choose complete submission.",
      "roll_type": "persuasion",
      "date": "1430-11-08",
      "rolled": null,
      "outcome_range": "critical_success",
      "outcome_label": "Great Success",
      "outcome_detail": "The Infantes' surrender exceeds all expectations. Infante Enrique weeps genuinely. Infante Juan breaks from his script and drops to his knees, offering to renounce everything and serve as a common crusader. The nobles are deeply moved. Juan brilliantly draws a parallel to his own renunciation before the Pope, transforming the moment from humiliation into redemption.",
      "evaluation": "Surprising outcome — the Infantes chose the one strategy that could save them. Their complete submission, whether calculated or genuine, gave Juan the opportunity to show mercy and strengthen his position simultaneously.",
      "success_factors": [
        "Complete submission rather than defiance",
        "Genuine emotion (Enrique's tears)",
        "Infante Juan's dramatic renunciation offer",
        "Nobles' emotional readiness after earlier Council sessions"
      ],
      "failure_factors": [],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_027",
      "book": 1,
      "chapter": "1.09",
      "event_id": "evt_1430_00057",
      "title": "Infantes' Decision After Council",
      "context": "After publicly confessing rebellion and offering to join the crusade, the Infantes must decide whether to honor their oaths.",
      "roll_type": "chaos",
      "date": "1430-11-09",
      "rolled": 32,
      "outcome_range": "success",
      "outcome_label": "Honor Oaths Completely",
      "outcome_detail": "The Infantes arrive at dawn for spiritual examination, present themselves without armed retinue, dressed simply. They send formal orders for their household troops to muster at Seville under Juan II's command. About 800 soldiers join as individual crusaders.",
      "evaluation": "50% probability of full compliance. The sacred oath before the True Cross and the political calculus (nowhere else to go) combined to produce genuine commitment.",
      "success_factors": [
        "Sacred oath binding",
        "Political reality (no alternatives)",
        "Genuine spiritual impact of relics"
      ],
      "failure_factors": [],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_028",
      "book": 1,
      "chapter": "1.09",
      "event_id": "evt_1430_00060",
      "title": "Building Partnership with Princess Isabel",
      "context": "Juan II meets his Portuguese betrothed and attempts to build a genuine partnership through complete honesty about the challenges ahead.",
      "roll_type": "persuasion",
      "date": "1430-12-14",
      "rolled": null,
      "outcome_range": "critical_success",
      "outcome_label": "Great Success",
      "outcome_detail": "Isabel transforms from terrified and defensive to genuinely hopeful. She reveals her love of learning and desire to be useful. Juan's honesty and his act of kneeling before her (unprecedented for a king to his bride) creates a genuine emotional connection. She gives a confident public speech in Castilian. Their Portuguese and Castilian escorts are visibly shocked by the transformation.",
      "evaluation": "Juan's approach of radical honesty — the same approach that worked with the Pope — proved effective again. Treating Isabel as an intellectual partner rather than a political asset struck exactly the right note.",
      "success_factors": [
        "Complete honesty about challenges",
        "Kneeling before her (unprecedented vulnerability)",
        "Treating her as intellectual partner",
        "Offering books and education"
      ],
      "failure_factors": [],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_029",
      "book": 1,
      "chapter": "1.09",
      "event_id": "evt_1430_00061",
      "title": "Alfonso V's Response to Brothers' Renunciation",
      "context": "Alfonso V receives news that his brothers have renounced all Aragonese succession claims before sacred relics, throwing Aragon's succession into chaos.",
      "roll_type": "diplomacy",
      "date": "1430-12-18",
      "rolled": null,
      "outcome_range": "success",
      "outcome_label": "Success",
      "outcome_detail": "Alfonso accepts with cold wariness. He acknowledges the Infantes deserved punishment, doesn't challenge sacred oaths, but notes outcomes are 'remarkably convenient' for Castile. Withdraws active crusade support to focus on Naples. Maintains formal relations through María. No war threats or diplomatic break.",
      "evaluation": "Best realistic outcome given the magnitude of the succession shift. Alfonso is too focused on Naples to risk war with a papally-backed crusader king.",
      "success_factors": [
        "Complete transparency about oaths",
        "Sacred context prevents challenging legitimacy",
        "Alfonso focused on Italian ambitions",
        "María serving as diplomatic bridge"
      ],
      "failure_factors": [
        "Succession implications deeply concerning to Alfonso",
        "Cold tone signals lasting damage to relationship"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_030",
      "book": 1,
      "chapter": "1.10",
      "event_id": "evt_1430_00064",
      "title": "Journey from Seville to Toledo",
      "context": "Royal procession of ~200 people travels from Seville to Toledo in late December/early January winter conditions.",
      "roll_type": "travel",
      "date": "1431-01-14",
      "rolled": 76,
      "outcome_range": "critical_success",
      "outcome_label": "Very Successful",
      "outcome_detail": "Unusually good winter weather. Fast pace, arriving Toledo January 14. Isabel transforms on the journey — riding openly, accepting flowers, gaining confidence. Towns welcome the crusade procession enthusiastically.",
      "evaluation": "Lucky weather and good logistics. The visual spectacle of white-tabarded crusaders became a publicity event along the entire route.",
      "success_factors": [
        "Unusually mild winter weather",
        "Well-organized procession",
        "Popular enthusiasm along the route"
      ],
      "failure_factors": [],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_031",
      "book": 1,
      "chapter": "1.10",
      "event_id": "evt_1431_00065",
      "title": "Initial Meeting with Cardinal Capranica",
      "context": "Juan II meets the papal legate, Cardinal Capranica, for the first time in Toledo. Initial honeymoon period.",
      "roll_type": "diplomacy",
      "date": "1431-01-14",
      "rolled": null,
      "outcome_range": "success",
      "outcome_label": "Honeymoon Success",
      "outcome_detail": "Initial meeting goes well. Cardinal pleased by Juan's meticulous records and willingness to establish proper financial oversight. However, long-term relationship rolled as 'serious conflict' — deterioration expected after 2-3 weeks.",
      "evaluation": "Juan's approach of acknowledging the Cardinal's authority while maintaining his own discretion worked in the short term. The fundamental conflict over control vs. flexibility will emerge later.",
      "success_factors": [
        "Juan's meticulous records (Diego's work)",
        "Willingness to cooperate on budgets",
        "Shared language of proper stewardship"
      ],
      "failure_factors": [
        "Cardinal's fundamentally obstructionist nature",
        "Different priorities (control vs. flexibility)"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_032",
      "book": 1,
      "chapter": "1.10",
      "event_id": "evt_1431_00065",
      "title": "Álvaro-Tommaso Budget Partnership",
      "context": "Álvaro de Luna and Father Tommaso (legate's administrator) work together on detailed crusade budget management.",
      "roll_type": "diplomacy",
      "date": "1431-01-20",
      "rolled": 77,
      "outcome_range": "critical_success",
      "outcome_label": "Excellent Partnership",
      "outcome_detail": "Álvaro and Father Tommaso develop an outstanding working relationship. Their complementary skills (Álvaro's practical knowledge, Tommaso's administrative rigor) produce a comprehensive and realistic crusade budget. This partnership provides a critical buffer for the coming Juan-Capranica conflict.",
      "evaluation": "A fortunate pairing. The administrator's practical focus contrasts with his Cardinal's obstructionism, creating a functional channel even when the leaders clash.",
      "success_factors": [
        "Complementary skills",
        "Shared focus on practical outcomes",
        "Both experienced administrators"
      ],
      "failure_factors": [],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_033",
      "book": 1,
      "chapter": "1.11",
      "event_id": "evt_1431_00068",
      "title": "End of Honeymoon with Cardinal Capranica",
      "context": "After weeks of productive cooperation, what event causes the inevitable tension between Juan II and Cardinal Capranica?",
      "roll_type": "chaos",
      "date": "1431-01-24",
      "rolled": 98,
      "outcome_range": "critical_failure",
      "outcome_label": "Breaking Point — Portuguese Ladies Dismissal",
      "outcome_detail": "Capranica demands Isabel dismiss her Portuguese ladies-in-waiting (Dona Beatriz, Dona Inês, Dona Catarina) and replace them with Spanish women he has selected. Massive overreach into royal household management — the papal bull grants no such authority. Creates serious crisis requiring careful diplomatic handling.",
      "evaluation": "Near-worst possible outcome. Capranica's overreach threatened both the Portuguese alliance and Isabel's personal wellbeing. However, Juan's established good relationship moderated the damage — what could have been a catastrophic break instead became a manageable crisis.",
      "success_factors": [],
      "failure_factors": [
        "Capranica's controlling nature",
        "Ambition to expand legatine authority",
        "Desire to place allies in Queen's household"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_034",
      "book": 1,
      "chapter": "1.11",
      "event_id": "evt_1431_00069",
      "title": "Cardinal's Response to Portuguese Ladies Resolution",
      "context": "After Juan blocks Capranica's demand through passive resistance and guard protection, how does the Cardinal react?",
      "roll_type": "diplomacy",
      "date": "1431-01-27",
      "rolled": 83,
      "outcome_range": "failure",
      "outcome_label": "Public Pressure at Dinner",
      "outcome_detail": "Capranica makes pointed public comments at a formal dinner about 'foreign influences' and Spanish tradition, clearly targeting the Portuguese attendants. Never names them directly but the implication is unmistakable. Forces Juan to respond publicly. Juan turns the moment into a triumphant speech praising Isabel's piety and announcing a Portuguese chapel commission.",
      "evaluation": "Capranica escalated to public pressure rather than accepting the situation privately. This backfired — Juan's masterful speech rallied the room behind Isabel and forced Capranica into a graceful retreat. The public nature of the resolution actually strengthened Juan's position.",
      "success_factors": [],
      "failure_factors": [
        "Capranica's wounded pride",
        "Unwillingness to accept private defeat",
        "Underestimation of Juan's public speaking ability"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_035",
      "book": 1,
      "chapter": "1.11",
      "event_id": "evt_1431_00067",
      "title": "Noble Response to Crusade Taxation",
      "context": "Castilian nobility learns that specific crusade taxation details (5% noble tax, 10% church tax) will be announced at the wedding. How do they respond in the weeks before the announcement?",
      "roll_type": "chaos",
      "date": "1431-01-28",
      "rolled": 45,
      "outcome_range": "mixed",
      "outcome_label": "Quiet Compliance with Grumbling",
      "outcome_detail": "Nobles accept the tax is happening but complain privately to each other. They'll comply with assessments but won't be happy. Some minor foot-dragging on producing records expected, but nothing organized. The oversight committee will need to be firm but won't face serious resistance. A few great houses (Mendoza, Guzmán) request private audiences seeking 'clarity' on tax details.",
      "evaluation": "Best realistic outcome given the unprecedented nature of direct crown taxation backed by papal authority. The combination of papal backing, popular crusade enthusiasm, absence of Infantes as opposition leaders, and personal service exemption all work to prevent organized resistance.",
      "success_factors": [
        "Papal authority behind taxation",
        "Popular crusade enthusiasm",
        "No opposition leader (Infantes eliminated)",
        "Personal service exemption offers honorable alternative"
      ],
      "failure_factors": [
        "Sets precedent for crown taxation",
        "Assessment process threatening to nobles used to controlling own reporting"
      ],
      "character_effects": [],
      "ranges": []
    }
  ]
}