{
  "meta": {
    "version": "2.0",
    "total_rolls": 4
  },
  "rolls": [
    {
      "roll_id": "roll_001",
      "book": 1,
      "chapter": "1.01",
      "event_id": "evt_1430_00003",
      "title": "Royal Guard Morale Speech",
      "context": "Juan II addresses the royal guard to inspire personal loyalty. He gives a speech invoking religious duty and promising better equipment.",
      "roll_type": "persuasion",
      "date": "1430-05-02",
      "rolled": null,
      "outcome_range": "status_quo",
      "outcome_label": "Status Quo",
      "outcome_detail": "The speech neither inspires special loyalty nor alienates the guards. They remain professional but not personally devoted. The king is reminded he has much to learn about leadership.",
      "evaluation": "Despite favorable conditions (royal authority, new equipment promised, religious framing), the delivery fell flat. The guards remain dutiful but uninspired.",
      "success_factors": [
        "Royal authority",
        "Equipment promise",
        "Religious framing",
        "Captain's support"
      ],
      "failure_factors": [
        "King's youth and inexperience",
        "Overly formal delivery"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_002",
      "book": 1,
      "chapter": "1.01",
      "event_id": "evt_1430_00010",
      "title": "Infantes Revolt During Pilgrimage",
      "context": "After successfully negotiating with the Infantes and establishing a regency council, Juan II rolls to see if the Infantes revolt during his absence on pilgrimage.",
      "roll_type": "chaos",
      "date": "1430-05-20",
      "rolled": null,
      "outcome_range": "revolt",
      "outcome_label": "Critical Failure",
      "outcome_detail": "Despite careful planning and giving the Infantes real power through a regency council, the dice decree that a revolt WILL take place during Juan's pilgrimage. The how and why will be determined later.",
      "evaluation": "The GM assessed 70-75% probability of no revolt. The dice overruled the careful diplomacy. This sets up the central crisis of the early game.",
      "success_factors": [
        "Infantes have a bloodless path to power through the council",
        "They believe they're controlling governance",
        "No immediate reason to rebel — they got what they wanted"
      ],
      "failure_factors": [
        "King's extended absence creates opportunity",
        "Noble ambitions may exceed council powers",
        "Aragonese interference possible"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_003",
      "book": 1,
      "chapter": "1.02",
      "event_id": "evt_1430_00017",
      "title": "Subterfuge Secrecy",
      "context": "Juan II staged a fake departure on pilgrimage and is hiding near Valladolid to crash the first regency council meeting. This roll determines whether the Infantes have discovered the deception.",
      "roll_type": "intrigue",
      "date": "1430-05-16",
      "rolled": null,
      "outcome_range": "status_quo",
      "outcome_label": "Status Quo",
      "outcome_detail": "The Infantes received vague information that something seems off — Captain Fernán seemed troubled, the hermitage prayer was unusual — but couldn't piece together the full picture. They proceed with their plans despite slight uncertainty.",
      "evaluation": "Juan's tight circle of knowledge and short timeline kept the plan mostly secret. However, the unusual behavior at the hermitage raised suspicions that prevented total surprise.",
      "success_factors": [
        "Very small circle of knowledge (only Álvaro knew the plan)",
        "Short timeline (only 3 days)",
        "Legitimate departure ceremony with full party",
        "Plausible cover story (prayer at hermitage)"
      ],
      "failure_factors": [
        "Fray Hernando's suspicions about the prayer",
        "Captain Fernán's visible concern",
        "Infantes' own intelligence networks",
        "Unusual behavior of king staying behind to pray"
      ],
      "character_effects": [],
      "ranges": []
    },
    {
      "roll_id": "roll_004",
      "book": 1,
      "chapter": "1.02",
      "event_id": "evt_1430_00017",
      "title": "Infantes' Council Boldness",
      "context": "The Infantes hold their first regency council meeting while Juan II is supposedly away on pilgrimage. This roll determines how aggressively they push their agenda.",
      "roll_type": "chaos",
      "date": "1430-05-16",
      "rolled": null,
      "outcome_range": "critical_success",
      "outcome_label": "Critical Success",
      "outcome_detail": "The Infantes make extremely bold moves far exceeding expectations: proposing to make the regency permanent, removing Álvaro's loyalists from key positions, and openly discussing how to constrain the king upon his return. Their spectacular overreach provides perfect ammunition for Juan's surprise entrance.",
      "evaluation": "Despite the status quo on secrecy (vague suspicions), the Infantes' overconfidence drove them to reveal their full hand. Infante Juan's proposal to formalize permanent constraints on royal authority was far more aggressive than merely administering the realm.",
      "success_factors": [
        "Infantes believed Juan was truly gone",
        "First meeting — eager to establish precedent",
        "Overconfidence after getting regency power",
        "Desire to lock in gains before Juan returns"
      ],
      "failure_factors": [
        "Enrique's brief hesitation about king's hermitage behavior",
        "Archbishop and Marquis expressed caution"
      ],
      "character_effects": [],
      "ranges": []
    }
  ]
}