{
  "chapter": "1.01",
  "book": 1,
  "event_count": 10,
  "date_range": "1430-05-01 / 1430-05-20",
  "events": [
    {
      "event_id": "evt_1430_00001",
      "book": 1,
      "chapter": "1.01",
      "date": "1430-05-01",
      "end_date": null,
      "type": "council",
      "summary": "Juan II takes stock of his kingdom, reads urgent letters from Seville, Toledo, the frontier, and the Infante Juan de Aragón. Álvaro de Luna warns him about how the Infantes seek to control the crown through council manipulation, information control, and physical custody.",
      "characters": [
        "juan_ii",
        "alvaro_de_luna",
        "pedro_fernandez_de_velasco",
        "inigo_lopez_de_mendoza",
        "archbishop_contreras",
        "infante_juan_de_aragon",
        "infante_enrique_de_aragon"
      ],
      "factions_affected": [
        "royal_court",
        "aragonese_faction"
      ],
      "location": "Valladolid, Royal Palace",
      "tags": [
        "politics",
        "intrigue",
        "opening"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "I stand in my palace and try to take stock of my kingdom. What is the current situation? Are there any threats to my realm? What about my neighbours?"
        },
        {
          "role": "gm",
          "text": "The Kingdom of Castile - Spring 1430\n\nYou stand in the royal chambers of your palace, perhaps in Valladolid or Segovia, as the spring light filters through narrow windows. Around you, the trappings of kingship: tapestries bearing the castle and lion of your realm, the weight of the crown you have worn since infancy but only now truly command.\n\nYour chamberlain, secretaries, and the ever-present Álvaro de Luna - your Constable and closest confidant - gather as you call for reports on the state of your kingdom.\n\nKINGDOM STATUS\n\nTreasury: Strained but functional\nYour revenues from royal taxes, customs duties, and crown lands provide approximately 30 million maravedís annually, but noble tax exemptions and the costs of maintaining royal authority drain much of this. The Hermandad (urban militias) and various towns contribute funds, but you lack the financial power of France or Aragon.\n\nMilitary Strength: Moderate and divided\nYour standing forces are limited - perhaps 3,000 royal men-at-arms and crossbowmen directly loyal to the crown. However, you can call upon feudal levies from nobles and military orders (Santiago, Calatrava, Alcántara), theoretically raising 15,000-20,000 troops... if the nobles comply. The frontier with Granada maintains permanent garrisons.\n\nNoble Loyalty: CRITICAL CONCERN\nThis is your greatest challenge, Your Majesty. The great noble houses are restless:\n\nThe Infantes de Aragón (Princes Juan and Enrique, your cousins from Aragon) hold vast estates in Castile and command fierce loyalty from many nobles. They resent Álvaro de Luna's influence over you and seek to control the crown themselves.\n\nThe Mendoza family - relatively loyal, for now\n\nThe Manrique, Estúñiga, and Velasco families - watching carefully, ready to side with whoever offers them more power\n\nThe Master of Santiago and other military orders - powerful and semi-autonomous\n\nMany nobles see you as young and untested, and they remember the regency conflicts of your minority. They test boundaries constantly.\n\nPopular Support: Cautiously positive\nThe common people know little of court intrigues. They care about bread prices, protection from bandits, and whether their lord is just. You are their anointed king, which grants you sacred authority in their eyes, but they suffer under noble exactions and pray for strong royal justice.\n\nForeign Relations:\n\nAragon: Your cousin, King Alfonso V (\"the Magnanimous\"), rules to the east. Relations are tense - his brothers, the Infantes, meddle constantly in your realm, and Aragon eyes Castilian weakness hungrily. The question of Navarra also complicates matters.\n\nGranada: The Nasrid Kingdom under Sultan Muhammad IX pays you parias (tribute) for peace, but the Reconquista simmers. Both war and peace factions exist in your court. A campaign could unite fractious nobles behind you... or expose weaknesses.\n\nPortugal: King João I is aging but his realm is stable. Relations are correct but cool. The Portuguese remember past Castilian claims.\n\nFrance: Distant but watching. The Hundred Years' War occupies them, but French diplomacy is always active.\n\nIMMEDIATE CONCERNS\n\n1. Álvaro de Luna's Position\nYour Constable has extraordinary power - he essentially governs in your name. He is capable, loyal to you personally, and has kept the realm from chaos during your minority. But the nobles despise him as a low-born upstart (his family is minor nobility at best). They demand you dismiss him and rule \"in consultation with your natural counselors\" - meaning them. This is the defining political question of your reign.\n\n2. The Infantes' Machinations\nWord reaches you that the Infantes de Aragón are gathering supporters, holding meetings at their estates. They whisper that you are a puppet of Luna, that true Castilian nobles should have their proper place. Some speak of forcing a regency council upon you \"for the kingdom's good.\"\n\n3. Economic Pressures\nSeveral towns petition for tax relief after poor harvests. The nobles resist any attempt to reduce their own privileges or contribute more to royal coffers.\n\n4. The Granada Question\nYour frontier commanders report skirmishes. Some hot-headed nobles want a grand campaign to seize more territory and win glory. The Archbishop of Toledo preaches crusade. But would this unite your nobles behind you, or create opportunities for betrayal?\n\nÁlvaro de Luna approaches, his dark eyes watchful. \"Your Majesty, the realm requires your hand on the tiller. The wolves circle, but you are no longer a child to be directed by regents. What is your pleasure? How shall we proceed?\"\n\nSeveral sealed letters await your attention on a table - reports from Seville, Toledo, the frontier, and one bearing the seal of the Infante Juan de Aragón himself.\n\nWhat do you do, Your Majesty?"
        },
        {
          "role": "player",
          "text": "I take a moment to read every letter sent to me. Starting with the reports from Seville. I read all of them."
        },
        {
          "role": "gm",
          "text": "You dismiss the others with a gesture, keeping only Álvaro de Luna nearby as you break the seals and unfold the parchments. The Constable stands at a respectful distance, hands clasped, watching your face as you read.\n\nLETTER FROM SEVILLE\n\nFrom Pedro Fernández de Velasco, your appointed corregidor (royal magistrate) in Seville\n\nThe letter is respectfully worded but carries an undercurrent of concern:\n\n\"Most Serene and Catholic Majesty,\n\nI write to inform Your Grace of matters requiring royal attention in this your loyal city of Seville.\n\nThe grain harvests of the Guadalquivir valley have proven adequate, thanks be to God, and trade through our port continues profitable. The customs revenues I have dispatched to Your Majesty's treasury amount to 420,000 maravedís for this quarter.\n\nHowever, I must report discord among the noble houses. The Guzmán family (Counts of Niebla) and the Ponce de León family continue their ancient feud with increasing boldness. Last month, armed retainers clashed in the streets near the Cathedral. Three men died, and the city watch proved insufficient to prevent it. Each family blames the other and appeals to Your Majesty for judgment.\n\nMore troubling still: I have evidence that Don Enrique, Infante of Aragón, has been corresponding with certain nobles of the city, and gold from Aragón has reached their coffers. They gather in the Alcázar district and speak of 'proper counsel' for Your Majesty and 'the natural order of the kingdom.' I cannot prove conspiracy, but the signs concern me.\n\nThe merchant guilds petition Your Majesty to reduce tariffs on wool exports to Flanders, claiming it would increase trade and thus your revenues. The nobles who own the sheep lands oppose this, desiring higher prices.\n\nI await Your Majesty's wisdom in these matters. The city remains yours, but a firm hand would reassure the loyal.\n\nYour Majesty's faithful servant,\nPedro Fernández de Velasco\"\n\nLETTER FROM TOLEDO\n\nFrom the Archbishop of Toledo, Juan Martínez de Contreras\n\nWritten in an elegant clerical hand with Latin phrases interspersed:\n\n\"To Our Most Catholic and Serene Lord, Juan II, by Grace of God King of Castile and León,\n\nDivine Providence has placed upon your shoulders the sacred duty of defending Holy Mother Church and extending Christian dominion over the lands held by the infidel. I write both as your Archbishop and as a voice for many of your realm who look to their King for leadership in righteousness.\n\nThe Kingdom of Granada festers on our southern border—a Mohammedan realm that should by rights be Christian soil. Sultan Muhammad gathers strength while we hesitate. The recent skirmishes on the frontier are signs that God calls us to action.\n\nI propose that Your Majesty proclaim a Crusade this very year. The Holy Father in Rome would surely grant indulgences. Such a campaign would:\n\nWin glory for the Crown and redemption for Christian souls\n\nUnite your nobles in common purpose under royal banner\n\nSeize tribute and territory from the Moors\n\nDemonstrate your kingship through decisive action\n\nHowever, I must also report matters of faith within your realm. The conversos (Jewish converts to Christianity) of Toledo grow wealthy and prominent, holding positions in city government and even Church offices. This causes resentment among Old Christians who question the sincerity of these conversions. I urge temperance and careful oversight.\n\nFurthermore, certain nobles have been less than diligent in their tithes to the Church. The faith requires the support of the faithful, particularly those of high station.\n\nI remain Your Majesty's most humble servant in Christ,\nArchbishop Juan Martínez de Contreras\"\n\nFRONTIER REPORT\n\nFrom the Adelantado (military governor) of the frontier, Íñigo López de Mendoza\n\nA soldier's brief, direct report:\n\n\"Your Majesty,\n\nThe frontier holds but grows restless. The Moors of Granada test our positions monthly with raiding parties. Last week they struck near Alcalá la Real, seizing cattle and burning two villages. We pursued and killed perhaps twenty of them, recovering some livestock.\n\nOur garrisons are adequate if we maintain defensive posture, but insufficient for offensive operations. The castles of Alcalá, Jaén, and the border fortresses require repairs and supplies that strain local resources.\n\nThe Military Orders (Santiago, Calatrava, Alcántara) maintain their own frontier positions and coordinate poorly with royal forces. Their Masters act as independent princes, acknowledging your authority in words but not always deeds.\n\nI hear rumors that certain nobles advocate for major campaign against Granada. With respect, Your Majesty, such an endeavor would require:\n\n15,000-20,000 troops maintained for months\n\nSiege equipment and supplies\n\nCoordination among nobles who currently mistrust each other\n\nSignificant treasury expenditure\n\nDone well, it could seize Málaga or even pressure Granada's capital. Done poorly, it could become a disaster that emboldens the Moors and embarrasses the Crown.\n\nThe frontier awaits your command.\n\nÍñigo López de Mendoza, Adelantado\"\n\nLETTER FROM INFANTE JUAN DE ARAGÓN\n\nThe seal shows the arms of Aragón with personal marks. The handwriting is confident, almost presumptuous:\n\n\"To Our Dearest Cousin, King Juan of Castile,\n\nGreetings from your kinsman and devoted cousin.\n\nI write with fraternal concern for your person and your realm. It brings me pain to hear whispers from Castile that all is not well—that the natural counselors of your kingdom, the great lords whose families have served the Crown for generations, find themselves excluded from your presence by the... ambitions of certain low-born individuals.\n\nYour Majesty, you are young still, and youth brings vigor but also requires the guidance of experienced men of noble blood. I fear that Álvaro de Luna, however capable he may be in small matters, lacks the breeding and wisdom to guide a kingdom. His monopoly on your favor creates resentment and instability.\n\nI offer, as your kinsman, to visit your court and provide counsel. My brother Enrique and I have only your interests at heart. Many of your nobles—good men, loyal to the Crown—have expressed to us their desire to see proper governance restored.\n\nConsider: would it not be wise to rule in consultation with a council of your greatest nobles? To show that you value their ancient rights and wisdom? This would strengthen your crown, not weaken it.\n\nI await your response and pray for your health and wisdom.\n\nYour devoted cousin,\nJuan, Infante of Aragón, King of Navarra\"\n\nÁlvaro de Luna clears his throat softly. You look up from the letters to find his expression dark.\n\n\"Your Majesty has read the Infante's letter, I presume?\" His voice is carefully controlled. \"Honeyed words wrapped around a dagger. He speaks of 'counsel' but means 'control.' He and his brother seek to make you a puppet king while they rule Castile through a noble council of their creatures.\"\n\nHe steps closer, his intensity breaking through his usual calculated demeanor. \"Sire, you must understand—if you yield to these demands, if you dismiss me and accept their 'counsel,' you will never rule this kingdom in truth. They will manage you as they managed you during the regency, making decisions in your name while you sign what they place before you.\"\n\nHe pauses, seeming to choose his next words carefully. \"But I am not blind to the danger. The Infantes gather support. Seville shows signs of their gold and influence. If we move carelessly, they could raise rebellion under the banner of 'rescuing the King from evil counsel.' We need a strategy, Your Majesty. But first, I must know—do you intend to rule, or to be ruled?\"\n\nWhat do you do?"
        },
        {
          "role": "player",
          "text": "Explain to me more about how they seek to control me. When they are my councillors, do they just think they can influence me by feeding me information they curate? Is there a physical element to this as well? How does this influence look like?"
        },
        {
          "role": "gm",
          "text": "\"Your Majesty asks the right question. Let me be blunt about how this works—I watched it happen throughout your minority, and the Infantes mean to recreate it now that you've come of age.\"\n\nHe counts off on his fingers:\n\nInformation Control\n\n\"First, they control what you know. A council of nobles would insist that all reports, letters, petitions—everything—pass through them first. They 'review' these documents, deciding what deserves Your Majesty's attention and what does not.\n\nThat letter from Seville mentioning Infante Enrique's gold? A noble council would ensure you never saw it. They would summarize: 'Seville is peaceful, minor noble disputes, nothing requiring Your Majesty's concern.'\n\nThey would control access to your person. Want to speak with the Adelantado from the frontier directly? 'No need to trouble Your Majesty—we have spoken with him and can provide counsel.' Want to hear from merchants or town representatives? 'Beneath your dignity, Sire—we'll handle such matters.'\n\nWithin months, you would only know what they want you to know. You'd be making decisions based on their curated version of reality.\"\n\nInstitutional Capture\n\nHe continues, his voice harder: \"Second, they demand control of appointments. The council would insist that corregidores in major cities, military governors, treasury officials—all require their 'advice and consent.'\n\nIn practice? Every position of power would go to their men, their relatives, their supporters. Pedro Fernández in Seville would be replaced by someone loyal to the Guzmáns or whoever supports the Infantes. The treasury officials would be their creatures, so they'd know—and control—every maravedí that moves.\n\nYour orders would pass through officials who owe their positions to the council, not to you. If you commanded something they dislike, it would be delayed, misunderstood, or simply ignored. 'Alas, Your Majesty, the situation proved more complex than anticipated...'\"\n\nMilitary Reality\n\n\"Third—and this is where it becomes dangerous—they control force. The great nobles command far more troops than the Crown directly controls. You saw the numbers: you have perhaps 3,000 men directly loyal to you. The Mendozas alone can field 2,000. The Infantes, through their supporters, could raise 10,000 or more.\n\nIf they establish a council and pack it with their supporters, they effectively command the realm's military power. Want to suppress a rebellion? You'd need to ask them for troops. Want to enforce a decision they dislike? With what army, Your Majesty?\n\nDuring your minority, the Infantes actually held castles and fortresses that belonged to the Crown. They claimed to be 'safeguarding' them. Getting those back required years and, in some cases, sieges.\"\n\nThe Physical Element\n\nHe stops pacing and faces you directly, his voice dropping:\n\n\"And yes, Your Majesty, there can be a physical element. During the worst of the regency conflicts, there were times when the Infantes and their allies essentially held you—always under the fiction of 'protecting' you or 'proper attendance on Your Majesty's person.'\n\nThey would control your household: your guards, your servants, your chamberlains—all their men. They would decide where you reside: 'For security, Your Majesty should stay at Madrigal' or wherever suits their purposes, in a castle where they control the garrison.\n\nThey would control who enters your presence. Want to meet with me? 'Álvaro de Luna is unavailable today, perhaps later.' Want to speak with a loyal noble? 'He has been called away on urgent business.' Meanwhile, their men would have constant access to you—advising, suggesting, framing every issue their way.\n\nIt wouldn't be a dungeon, Your Majesty. You would still be called King. You'd still wear the crown and sign documents. You'd live in comfort, surrounded by ceremony and respect. But every decision would be 'guided.' Every action would require their 'counsel.' Every initiative would be subject to their approval.\"\n\nThe Mechanism of Consent\n\nHe leans forward, intense: \"Here's the clever part—they would make you complicit in your own powerlessness. They would bring you documents to sign, decisions to approve, appointments to confirm. Each one, taken individually, would seem reasonable. Skilled advisors would explain why each choice is wise.\n\nYou'd sign. You'd approve. And each signature would deepen their control and make it harder to break free. 'But Your Majesty agreed to this council structure.' 'Your Majesty approved these appointments.' 'Your Majesty signed this charter limiting royal authority.'\n\nThey'd use your own royal authority to bind you.\"\n\nHistorical Example\n\nHe straightens: \"During your minority, there was a period—Your Majesty was perhaps twelve—when the Infante Enrique essentially controlled your household. You resided at Tordesillas, surrounded by his men. Your mother, Queen Catherine, was kept from you. I was barred from court.\n\nEvery day, Enrique would attend you at meals, during prayers, during recreation. Always respectful, always deferential, always calling you 'Your Majesty.' But when you expressed a desire contrary to his plans, there was always a reason why it couldn't be done, why you needed to wait, why his alternative was wiser.\n\nIt took a coalition of other nobles—ironically including some who now oppose me—to 'rescue' you from that situation. They didn't do it for love of you, but because they wanted control themselves.\"\n\nThe Current Threat\n\n\"Now the Infantes smell opportunity again. You've come of age and begun personal rule, but they see you as young, untested, and too reliant on me—one man they cannot control. Their plan is clear:\n\nPressure you to dismiss me or at least dilute my authority\n\nEstablish a formal council that must be consulted on major decisions\n\nPack that council with their supporters\n\nGradually expand the council's powers until it becomes the real government\n\nEventually, make these arrangements permanent through charters and laws you'll be pressured to grant\n\nThe letter from the Infante Juan is step one—a 'friendly' offer to help, painting me as the problem. If you accept, they'll have won without raising a single banner in rebellion.\"\n\nHe pauses, then adds quietly: \"Your Majesty, I am not arguing for my own position out of personal ambition. If you wish to rule directly, to build your own council of men you trust, to rely less on me—that is your right as King, and I would support it.\n\nBut that is different from surrendering power to the Infantes and their faction. One path leads to your authority. The other leads to becoming a ceremonial king who reigns but does not rule.\"\n\nHe falls silent, watching your face.\n\nThe question implicit in the air: How do you wish to respond to these threats? What is your strategy?"
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_1430_00002",
      "book": 1,
      "chapter": "1.01",
      "date": "1430-05-01",
      "end_date": null,
      "type": "decision",
      "summary": "Juan II declares his intention to rule independently, secures his immediate surroundings, and plans an advisory cabinet of trusted men including Lope de Barrientos, Íñigo López de Mendoza, and Rodrigo Manrique.",
      "characters": [
        "juan_ii",
        "alvaro_de_luna",
        "lope_de_barrientos",
        "inigo_lopez_de_mendoza",
        "pedro_manrique"
      ],
      "factions_affected": [
        "royal_court"
      ],
      "location": "Valladolid, Royal Palace",
      "tags": [
        "politics",
        "planning"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "I slam my fist on the table. This abuse ends now and forever. I will determine my own actions.\n\n\nThis starts now with just securing this room right now. Where are we? Are there any loyal men to the crown I can rely on?"
        },
        {
          "role": "gm",
          "text": "They're asking:\n1. Where exactly are they physically?\n2. Who is in the room right now?\n3. Who can they trust immediately?\n\nThis is about immediate security and understanding their position. I should provide concrete details about their current location, the people present, and assess who is reliable. This is not yet an action that needs a dice roll - it's gathering information about their current situation.\n\nÁlvaro de Luna would be pleased by this decisiveness and would immediately help secure the situation.\n\nÁlvaro de Luna's eyes flash with approval at your fury. He straightens immediately, his soldier's instincts engaging.\n\n\"Your Majesty speaks like a king,\" he says with fierce satisfaction. \"Now let us make you secure like one.\"\n\nYour Current Location\n\n\"We are in the Royal Palace of Valladolid, Your Majesty—your primary residence these past months. Specifically, we're in your private chambers in the eastern tower. There are three ways in: the main door to the presence chamber, a servant's entrance through the antechamber, and a stairway leading down to the royal apartments below.\"\n\nHe moves to the main door and opens it slightly, glancing out.\n\n\"In the presence chamber beyond, there are currently six people:\n\nTwo of your chamberlains\n\nA secretary\n\nThree petitioners waiting for audience\n\nYour guards at the outer doors\"\n\nYour Immediate Household - Who Can You Trust?\n\nÁlvaro closes the door and turns back to you, speaking rapidly but clearly:\n\nDEFINITELY LOYAL:\n\n\"Myself - Your Majesty knows my position. I rise or fall with you.\n\nFernán Alonso de Robles - Captain of your royal guard here in Valladolid. He's a minor knight from Extremadura, owes everything to the crown, no ties to the great houses. He commands thirty men-at-arms directly guarding this palace. I appointed him myself two years ago. He's solid.\n\nRodrigo de Luna - My nephew, yes, but more importantly your repostero mayor (head of your household). He controls access to your private chambers and manages your personal servants. He's in the apartments below right now.\n\nPedro de Estúñiga - Your justicia mayor (chief justice). Surprisingly, despite his family name, he's been loyal to royal authority. He's currently at the royal courts in the city, about fifteen minutes away by horse.\"\n\nPROBABLY LOYAL:\n\n\"Most of your household guards - The thirty men under Fernán Alonso. They're paid directly from the royal treasury, they eat your bread, and they've taken oaths to your person. That said, a few might have ties to greater lords—it's impossible to avoid entirely.\n\nYour household servants - The immediate ones who serve you daily. Minor people, but they know the palace and who comes and goes.\"\n\nQUESTIONABLE:\n\n\"The two chamberlains in the presence chamber - Both are from middling noble families. One, García Fernández de Manrique, has cousins who correspond with the Infantes. The other, Juan de Silva, seems devoted to ceremony and protocol above all else. Neither would likely act against you directly, but they gossip and might report to others.\n\nThe secretary - A cleric appointed by the Archbishop of Toledo. Probably reports everything to the Church, which means it gets to the Archbishop.\"\n\nPOTENTIAL THREATS:\n\n\"The garrison of Valladolid itself - About 200 men commanded by the Count of Benavente, who holds the castle. The Count is... cautious. He bends with the wind. Right now he pays you respect, but if the Infantes arrived with an army, I wouldn't wager my life on his loyalty.\n\nVarious nobles currently in Valladolid - At least a dozen are in the city with their retinues. Some are here for legitimate business, others are watching and waiting. Total armed men in the city not under your direct control: perhaps 400-500.\"\n\nImmediate Action Available\n\nÁlvaro steps closer, lowering his voice: \"Your Majesty, if you wish to secure your person right now, here's what we can do immediately:\n\nWithin the hour:\n\nI summon Captain Fernán Alonso here, confirm his loyalty personally with you, and order him to allow NO ONE into your private chambers without your explicit command or mine\n\nMy nephew Rodrigo locks down access from below\n\nWe dismiss the questionable chamberlains from immediate service—send them on 'missions' elsewhere\n\nWe move loyal guards to all three entrances to these chambers\n\nToday:\n\nSend fast riders to summon Pedro de Estúñiga and other loyal officials to the palace\n\nQuietly assess which of the palace garrison we can truly count on\n\nBegin identifying which nobles currently in Valladolid are reliable and which are watching for the Infantes\n\nThis week:\n\nWe can relocate you to a more secure location if needed—perhaps Segovia, where the fortress is directly controlled by royal appointees, or Madrid, which is smaller and easier to secure\n\nBuild up your personal guard with new recruits we vet carefully\n\nBegin replacing questionable officials systematically\"\n\nHe pauses: \"But Your Majesty, securing your person is only the first step. The Infantes won't attempt to take you by force while you're alert and protected—that would be open rebellion. Their method is subtler: pressure, influence, political isolation.\n\nThe real question is: what do you want to do with your security once you have it? Do we go on the offensive against the Infantes? Fortify and prepare for confrontation? Seek to divide their supporters? Build alliances?\n\nYour Majesty's anger is righteous, but anger must become strategy.\"\n\nHe looks at you expectantly. \"Shall I summon Captain Fernán Alonso immediately? And what broader strategy do you wish to pursue?\"\n\nWhat do you do?"
        },
        {
          "role": "player",
          "text": "No actions right now. We are safe enough and we are not being eavesdropped.\n\n\nI think we need to expand our cabinet with a few advisors or young nobles who can feel out where the allegiances lie with the nobles in the city for example. I need advisors who can gather information for me and that I am able to trust. Suggestions?"
        },
        {
          "role": "gm",
          "text": "Álvaro de Luna nods approvingly and settles into a chair at your gesture, his mind clearly working through possibilities.\n\n\"Your Majesty shows wisdom. Information is power, and you need eyes and ears beyond mine. Let me suggest several men who could serve this purpose—each brings different strengths.\"\n\nHe begins ticking off names, describing each carefully:\n\nFOR INTELLIGENCE GATHERING IN COURT\n\n\"Diego Gómez de Sandoval, Count of Castro\"\n\n\"Age thirty-two. Middling noble house, but clever as a serpent. He fought in the Granada campaigns and knows how to read men. More importantly, he's a converso—his grandfather was Jewish and converted. This means the great old families look down on him slightly, which makes him hungry to prove himself and dependent on royal favor rather than ancient bloodlines.\n\nStrengths: Excellent at reading social dynamics, has connections among the converso community (which includes many wealthy merchants and officials who could be useful), personally brave.\n\nRisks: Some Old Christians distrust conversos. The Archbishop mentioned them in his letter—there's always that tension. But that very vulnerability makes him reliable to you.\"\n\n\"Íñigo López de Mendoza\" (not the Adelantado, his younger cousin)\n\n\"Age twenty-three, about your age, Your Majesty. Younger son of the Mendoza family, which means he has the family name but won't inherit their main estates. He's a poet, actually—writes rather good verse—but don't let that fool you. He's sharp, educated, and observant.\n\nStrengths: The Mendoza connection gives him access to high noble circles, but as a younger son he needs to make his own way. He can move among the great families as one of them while actually serving you. Intelligent, cultured, could handle diplomatic missions.\n\nRisks: His family might pressure him if they turn against you. But right now the Mendozas are relatively loyal, and younger sons often become the crown's best servants—they have something to prove.\"\n\nFOR URBAN INTELLIGENCE & COMMON FOLK\n\n\"Juan de Daza\"\n\n\"Age forty. A commoner—son of a merchant from Burgos who became a lawyer and then entered royal service. Currently serves as a minor treasury official here in Valladolid. He knows how to listen, how to piece together information from customs records, merchant gossip, and city taverns.\n\nStrengths: No noble connections mean no divided loyalties. He understands commerce, money flows, and the concerns of towns and merchants. Could track where gold is moving—like that Aragonese money in Seville. Invisible to nobles who don't notice 'little people.'\n\nRisks: Nobles would sneer at your relying on a commoner for important matters. But that's exactly why he's useful—he operates below their notice.\"\n\nFOR THE CHURCH & CLERICAL NETWORKS\n\n\"Lope de Barrientos\"\n\n\"A Dominican friar, about forty-five, currently teaching at the University of Salamanca. Brilliant theologian, but more importantly, he has connections throughout the clerical network—priests, monks, bishops all over Castile. The Church is its own intelligence network; they hear confessions and travel everywhere.\n\nStrengths: Access to Church networks without being beholden to the Archbishop of Toledo. Educated, discreet, and frankly more interested in learning and royal service than ecclesiastical politics. Could counter the Archbishop's influence.\n\nRisks: He's not political by nature—would need guidance. But his loyalty would be to learning and order, which means royal authority.\"\n\nFOR MILITARY & FRONTIER MATTERS\n\n\"Rodrigo Manrique\"\n\n\"Age twenty-eight. From the Manrique family, yes, but hear me out—he's a younger son who's spent the last decade on the Granada frontier. He's a soldier first, political operative second. The frontier breeds practical men who value competence over court intrigue.\n\nStrengths: Understanding of military matters, connections along the entire frontier, respected by fighting men. The Manriques are a large clan—some support the Infantes, some don't. He could help you navigate which branches are reliable.\n\nRisks: His family name cuts both ways. But soldiers tend to be direct—easier to read than courtiers.\"\n\nÁlvaro's Summary\n\nHe leans back: \"Your Majesty, I would suggest starting with perhaps three or four of these men—enough for different perspectives, not so many that coordination becomes difficult.\n\nMy recommendation for an initial group:\n\n1. Diego Gómez de Sandoval - Your primary observer of court dynamics and noble factions here in Valladolid\n\n2. Juan de Daza - To track money, urban sentiment, and merchant networks. Information the nobles don't think about.\n\n3. One of the younger nobles - Either the Mendoza or the Manrique, depending on whether you want emphasis on diplomatic finesse or military/frontier intelligence.\n\nYou could add Lope de Barrientos later if we need to counter the Archbishop's ecclesiastical influence.\"\n\nHe pauses: \"These men would report directly to you—not through me, though I could help coordinate if you wish. The key is that you would know what they know, not receive it filtered through me or anyone else.\n\nWe'd need to approach each carefully. Make it clear you're offering them opportunity to serve the Crown directly, which is prestigious. Frame it as your expanding your direct governance—not as building a spy network, even though that's partly what it is.\"\n\nHe looks at you: \"Does this align with what Your Majesty had in mind? Should I arrange discreet meetings with any of these men? And how do you want to structure their roles—formal appointments or informal understanding?\"\n\nWhat do you think of these suggestions? How do you want to proceed?"
        },
        {
          "role": "player",
          "text": "Sounds great. Summon them all. I have plans for everyone already. I will have a talk with everyone individually to ensure their loyalty and to give them a first assignment."
        },
        {
          "role": "gm",
          "text": "Álvaro de Luna's face lights up with fierce satisfaction. \"Now this is kingship, Your Majesty.\" He stands immediately, already mentally organizing.\n\n\"I'll dispatch messengers within the hour. Let me outline the timing—some of these men can be here quickly, others will take days.\"\n\nHe counts on his fingers:\n\nSUMMONING TIMELINE\n\nJuan de Daza - \"He's here in Valladolid at the treasury offices. I can have him at the palace within two hours if Your Majesty wishes to begin today.\"\n\nDiego Gómez de Sandoval - \"The Count of Castro is at his estates about thirty miles northeast. A fast rider reaches him tonight, he could be here by tomorrow evening or the morning after.\"\n\nLope de Barrientos - \"Salamanca is perhaps sixty miles south. Two days' travel, possibly three depending on roads and weather. Call it three or four days until he arrives.\"\n\nÍñigo López de Mendoza - \"I believe he's currently at the Mendoza estates in Guadalajara. That's about a hundred miles—four or five days if he rides promptly upon receiving your summons.\"\n\nRodrigo Manrique - \"This one is uncertain. He could be on the frontier near Jaén, which is a week's journey, or at the Manrique family seat in Paredes de Nava, which is only two days. I'll send riders to both locations. Expect anywhere from three days to ten, depending on where we find him.\"\n\nHe begins drafting instructions in his mind: \"The summonses will be worded carefully—'His Majesty requests your counsel on urgent matters of the realm' or similar. Honorable, nothing that suggests suspicion or desperation, but clear that you expect prompt attendance.\n\nFor those who are further away, this also serves another purpose—we'll see how quickly they respond and what excuses, if any, they make. That itself tells us something about their eagerness to serve.\"\n\nHe pauses: \"Your Majesty, shall I have Juan de Daza brought here this very afternoon? You could begin your first meeting today, while we wait for the others to arrive. It would also let you practice reading a man's loyalty and giving assignments—he's the least politically dangerous to start with, since he's a commoner with no powerful family behind him.\"\n\nÁlvaro moves toward the door, then stops: \"One more thing, Your Majesty. How do you want these meetings structured?\n\nShould I be present to observe and provide context, or would you prefer to meet each man entirely alone to demonstrate your independence and encourage their candor?\n\nAnd should we bring them in through the public chambers where others will notice, or use the private stairway for discretion? The first shows you openly building a new council—bold but potentially alarming to the Infantes. The second keeps your plans hidden but might seem furtive.\"\n\nHe awaits your decision on these details before dispatching the messengers.\n\nWhat are your preferences for the meeting structure and timing?"
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_1430_00003",
      "book": 1,
      "chapter": "1.01",
      "date": "1430-05-02",
      "end_date": null,
      "type": "decision",
      "summary": "Juan II addresses the royal guard in the palace courtyard, attempting to inspire loyalty and morale with a speech. The dice roll results in status quo — the speech neither inspires nor alienates the guards.",
      "characters": [
        "juan_ii",
        "alvaro_de_luna",
        "fernan_alonso_de_robles"
      ],
      "factions_affected": [],
      "location": "Valladolid, Palace Courtyard",
      "tags": [
        "military",
        "speech",
        "roll"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "We will let them enter publicly, I trust or need to trust my own staff. For my meetings with the cabinet, I will do so alone, but I have nothing to hide from you.\n\n\nI walk out to the courtyard and seek out the captain of my personal guard and let him assemble everyone (the entire guard) in the courtyard."
        },
        {
          "role": "gm",
          "text": "Álvaro nods sharply. \"As Your Majesty commands. I'll begin dispatching the messengers immediately.\"\n\nHe moves to open the door for you, and you stride through into the presence chamber. The chamberlains and petitioners look up in surprise at your sudden emergence, bowing hastily. You ignore them, walking with purpose toward the outer doors.\n\nThe guards there—two men in partial armor bearing halberds—snap to attention. \"Your Majesty!\"\n\n\"Where is Captain Fernán Alonso?\" you demand.\n\n\"In the guard quarters, Your Majesty, just across the courtyard—\"\n\nYou're already moving. Behind you, you hear Álvaro de Luna following at a respectful distance, saying nothing but clearly intrigued by your sudden action.\n\nTHE COURTYARD\n\nYou emerge from the palace into the main courtyard of the Valladolid palace complex. It's mid-morning, and the spring sun illuminates the stone walls. The courtyard is perhaps fifty paces across, with the main palace building on one side, the guard barracks on another, stables on the third, and the main gate to the street on the fourth.\n\nA few servants pause in their tasks, surprised to see their king walking unannounced across the courtyard. They bow hurriedly.\n\nYou stride toward the guard barracks—a two-story stone building with narrow windows. Before you reach it, a man emerges, clearly having been alerted by the commotion of your passage.\n\nCAPTAIN FERNÁN ALONSO DE ROBLES\n\nHe's in his mid-thirties, lean and weathered, with the look of a man who's spent years on campaign. He wears a leather jerkin over a simple tunic, a sword at his hip. His face shows surprise but he drops to one knee immediately.\n\n\"Your Majesty! I was not informed you required—\"\n\n\"Captain,\" you interrupt, \"assemble your entire guard in this courtyard. Now. Every man under your command.\"\n\nHis eyes widen slightly, then he's on his feet. \"At once, Your Majesty!\" He turns and bellows into the barracks: \"GUARDS! FULL MUSTER IN THE COURTYARD! MOVE!\"\n\nThe response is immediate. You hear boots on stone, the clatter of equipment being grabbed. Men begin pouring from the barracks—some buckling sword belts as they run, others jamming helmets on their heads.\n\nFernán Alonso turns back to you: \"Your Majesty, it will take perhaps three minutes for the full company to assemble. Some are on gate duty, others at the palace entrances—\"\n\n\"Send runners. I want every man.\"\n\n\"Yes, Sire!\" He dispatches two guards at a run toward the palace and main gate.\n\nTHE ASSEMBLY\n\nOver the next few minutes, your royal guard assembles. They form up in rough ranks in the courtyard—some clearly roused from rest, others pulled from their posts. They're a mixed group: some in full mail and helmets, others in lighter gear, a few still buckling straps.\n\nCaptain Fernán organizes them with crisp commands, getting them into proper formation. You count them as they gather: twenty-eight, twenty-nine, thirty... the full complement Álvaro mentioned.\n\nThey're armed with swords, some with halberds or polearms, a few with crossbows. Most wear the royal livery—tabards bearing the castle and lion of Castile. They range in age from young men barely twenty to grizzled veterans in their forties.\n\nBehind you, Álvaro de Luna stands silent, watching. A few servants and palace officials have gathered at windows and doorways, clearly wondering what's happening. Word is spreading that the King has called out his guard.\n\nCaptain Fernán Alonso steps forward and salutes sharply. \"Your Majesty, the royal guard is assembled. Thirty men present and accounted for.\"\n\nThe guards stand at attention, eyes forward, clearly uncertain what this unprecedented muster means but maintaining discipline.\n\nThe courtyard is yours. Thirty armed men await your words.\n\nWhat do you say to them?"
        },
        {
          "role": "player",
          "text": "I am about to perform an action. I will give a speech aiming to increase morale and loyalty among the guards. It is essential that I can trust them in the days to come. Tell me how likely I am to succeed or fail.\n\n\nI straighten my back and walk to the assembled troops. I greet the captain and adress the gathered troops.\n\n\nMy name is Juan II, king of Castille. And I come to you, asking for your help. I am young and only starting my reign as king and I am determined not to repeat the mistakes of my predecessors. I do not seek personal wealth or glory. I serve a higher purpose. And in that higher purpose, I am as much a servant like you are. I am talking of course of serving God.\n\n\nAnd God has placed many tasks on me. He wants his faithful nation to be united. United so we can be good christians, drive out the heathens and build our kingdom to the heavens. I have committed my body and soul to this endeavour, but I know I cannot do this alone. I cannot do this without the best and most elite guard serving under God's gaze.\n\n\nWe all have our part to play in the years to come. Your part is to be more than just guards. Every single one of you is not here to fight! No, you are also diplomats, courtiers, messengers, spies and if needed I also require you to fight. I will be travelling around a lot and you will accompany me everywhere. You are my eyes and ears and I expect you will help me when I do diplomacy and politics. Everyone has his own talents and as I use all of mine, I expect everyone of you to do the same.\n\n\nYou are the best guard under Gods gaze, but you do not look like it yet. I will amend this immediately. The best guard deserves the best equipment. And not only that, you are the royal guard of the king and deserve every respect. Everyone of you will always have the right to have an audience with me whenever you feel it necessary. In fact, I expect you to!\n\n\nI am a young king and we do not know each other yet. \nBut I have a great task ahead of me. \nWe are all servants. \nWill you serve with me?"
        },
        {
          "role": "gm",
          "text": "3. **The speech's potential weaknesses**:\n   - Very idealistic and somewhat abstract\n   - The \"not here to fight\" line might confuse soldiers\n   - Promising everyone personal access could seem impractical\n   - Some might wonder what specific threat requires this speech now\n   - The \"we are all servants\" framing might seem too egalitarian for some\n\n4. **Current circumstances**:\n   - These men are paid by the crown and wear royal livery\n   - They've taken oaths already\n   - Captain Fernán is loyal (according to Álvaro)\n   - No immediate counter-pressure from nobles at this moment\n   - The dramatic personal appearance by the king is unprecedented and impressive\n\n5. **What success means**:\n   - These men becoming personally loyal to Juan, not just doing their jobs\n   - Them seeing themselves as elite/special\n   - Willingness to report information and act as more than guards\n   - Resistance to noble bribes or pressure\n\n**Assessment**: This should be **LIKELY TO SUCCEED** but not guaranteed.\n\nReasons for \"Likely to succeed\":\n- Strong religious appeal in deeply Catholic society\n\n- Compelling mix of tangible and intangible motivations strengthen Juan's approach\n- Existing institutional structures (crown employment, royal oaths) provide a foundation\n- Personal charisma and unprecedented royal engagement create a powerful psychological impact\n- Strategic use of status elevation and material incentives addresses multiple motivational layers\n\nPotential barriers include Juan's youth, the abstract nature of his promises, and underlying political complexities that might challenge his immediate credibility.\n\nA nuanced morale strategy with moderate probability of success, leveraging structural advantages while acknowledging inherent recruitment challenges.\n\nPROBABILITY ASSESSMENT\n\nÁlvaro de Luna watches you step forward, and though he says nothing, you can sense his attention sharpening as you begin to speak.\n\nLet me assess the likelihood of this speech achieving your goal of securing personal loyalty from these guards:\n\nLIKELY TO SUCCEED\n\nHere's why this action has good odds but isn't guaranteed:\n\nFactors Working In Your Favor:\n\nReligious Appeal - In 1430 Castile, invoking God and divine purpose is extraordinarily powerful. These men are Catholic, many are genuinely devout, and framing service to the king as service to God taps into their deepest beliefs. This is arguably your strongest point.\n\nMaterial Incentives - Promising better equipment is concrete and immediate. Soldiers understand this. The royal guard should have the best gear, and if they don't currently, this promise matters.\n\nUnprecedented Access - Offering personal audience rights to common soldiers is radical. It elevates them above their station in a way that would make them fiercely loyal. No noble can offer them this.\n\nPersonal Royal Attention - The very fact that you, the anointed king, came out personally to address them is dramatic and unusual. Kings don't typically do this. It signals they matter to you personally.\n\nExpanded Role - Telling them they're more than just guards—that they're diplomats, eyes and ears—makes them feel special and trusted. Men want to feel important.\n\nTheir Captain Is Loyal - Fernán Alonso's body language and response will influence the men. If he's clearly moved or approving, they'll follow his lead.\n\nCurrent Circumstances - They're already on the royal payroll, they've taken oaths, and there's no immediate counter-pressure from nobles trying to bribe them away.\n\nFactors Working Against You:\n\nYour Youth and Inexperience - You're 18 and just beginning personal rule. You haven't proven yourself yet in battle, politics, or crisis. Words are one thing; demonstrated competence is another. Some harder men might be skeptical.\n\nThe \"Not Here To Fight\" Phrasing - This might land oddly. Soldiers fundamentally understand their role as fighting men. Telling them they're \"not here to fight\" as the primary message could confuse or even insult some. The expanded roles should be in addition to fighting, not instead of it.\n\nGrand Promises - Medieval soldiers have heard lords make promises before. Some of the older veterans might wonder if this is just youthful idealism that will fade when reality hits. \"Will he really grant us audience whenever we want? That seems impractical...\"\n\nLack of Immediate Threat Context - You're giving an inspiring speech, but to what end? If you'd explained there are threats to the realm or to your person that require their special loyalty, it would feel more urgent and concrete. As is, some might wonder why now.\n\nPotential Noble Ties - Among thirty men, a few probably have cousins, brothers, or fathers in service to great noble houses. Those family ties might create conflicted loyalties, especially if those nobles pressure them later.\n\nThe Egalitarian Framing - \"We are all servants\" is humble and appealing to common men, but in a hierarchical medieval society, some might find it almost too egalitarian. The social order is divinely ordained; are you undermining it?\n\nOVERALL ASSESSMENT: LIKELY TO SUCCEED\n\nThis speech should work for most of these men, probably securing genuine personal loyalty from 20-25 of the 30. The religious framing is powerful, the material and status incentives are real, and your personal attention is unprecedented.\n\nHowever, you're unlikely to get all thirty as completely devoted followers. A handful might remain merely professional (doing their jobs for pay but not personally devoted), and one or two might have divided loyalties due to family ties or skepticism about your youth.\n\nThe greatest risk is if you roll badly—a catastrophic failure could make you seem like a naive boy playing at kingship, which would undermine your authority with these men and word would spread.\n\nBut the odds are in your favor. This is a good action at a good time with a reasonably compelling message.\n\nÁlvaro de Luna stands silent behind you, clearly waiting to see how your words land. Captain Fernán Alonso's eyes haven't left you—his expression is intense, almost hungry, as if he wants desperately to believe in what you're saying.\n\nThe thirty guards stand at attention, listening to their king speak directly to them for perhaps the first time in their service.\n\nNow you must roll to see how successful your speech is. What is your result?"
        },
        {
          "role": "player",
          "text": "Ok, so I rolled low, meaning that although it was likely to succeed, the speech did not achieve any raising of morale or loyalty, not did I fail. The result of the action is: Status quo.\n\n\nNow describe the outcome of the action as I give the speech, keeping the result in mind."
        },
        {
          "role": "gm",
          "text": "You straighten your back and stride forward to address the assembled troops. Captain Fernán Alonso steps aside, giving you the floor.\n\nTHE SPEECH\n\nYour voice rings out across the courtyard: \"My name is Juan II, King of Castile. And I come to you, asking for your help.\"\n\nThe guards stand at attention, eyes forward. Their faces are professionally neutral—the trained blankness of soldiers listening to a superior officer.\n\nYou continue, speaking of God's purpose, of unity, of driving out heathens and building the kingdom to the heavens. The religious language is proper, expected even. The guards listen respectfully. A few nod slightly at appropriate moments—the automatic acknowledgment of piety.\n\n\"Every single one of you is not here to fight! No, you are also diplomats, courtiers, messengers, spies...\"\n\nYou see a few guards exchange the briefest of glances. It's hard to read—confusion? Skepticism? The moment passes quickly as discipline reasserts itself.\n\nAs you promise better equipment and the right to personal audience, there's a subtle shift in posture. Not enthusiasm exactly, but... attention. That part landed. Men understand equipment and access. But their expressions remain guarded, professional.\n\n\"We are all servants. Will you serve with me?\"\n\nTHE RESPONSE\n\nThere's a pause. Not an uncomfortable one, but not electric either.\n\nCaptain Fernán Alonso, reading the moment, steps forward sharply. \"THREE CHEERS FOR HIS MAJESTY KING JUAN!\"\n\n\"HUZZAH!\" the guards shout in unison. Professional, well-trained, proper.\n\n\"HUZZAH!\"\n\n\"HUZZAH!\"\n\nIt's dutiful rather than passionate. They're doing what guards are supposed to do when their king addresses them. The sound echoes off the courtyard walls and dies away.\n\nFernán salutes crisply. \"Your Majesty honors us with your words and your presence. The royal guard stands ready to serve the Crown, as always.\"\n\nAs always. The words hang in the air. Not now more than ever or with renewed devotion. Just... as always.\n\nThe guards maintain their formation, awaiting dismissal. Their faces show respect—the respect soldiers show their anointed king. But there's no fire in their eyes, no visible transformation. They look exactly as they did five minutes ago: professional soldiers doing their duty.\n\nOne of the older veterans in the back rank has a slight frown—not of disapproval exactly, but perhaps of confusion. A younger guard near the front looks earnest enough, but uncertain what's expected of him now.\n\nThey're waiting. Waiting for orders, for dismissal, for whatever comes next in the daily routine.\n\nTHE REALITY\n\nBehind you, Álvaro de Luna remains silent. When you glance back, his expression is carefully neutral—neither disappointed nor pleased. Just... observing.\n\nCaptain Fernán Alonso maintains his salute, professional and correct. \"Does Your Majesty have further orders for the guard?\"\n\nThe courtyard has that peculiar quality of a moment that should have been significant but somehow... wasn't. The servants at the windows are already drifting away, their curiosity satisfied. The king addressed his guards. The guards responded appropriately. Life continues.\n\nYou realize with a sinking feeling that while you haven't lost anything—the guards aren't less loyal than they were—you haven't gained anything either. They'll continue to do their jobs professionally. They'll guard you because that's what they're paid to do, what their oaths require, what their captain orders.\n\nBut that spark of personal devotion, that transformation from hired soldiers into committed followers willing to do anything for you specifically? It didn't ignite.\n\nPerhaps it was the framing. Perhaps they needed more context about threats to understand why this mattered. Perhaps your youth showed through despite your best efforts. Perhaps they've simply heard too many noble speeches in their careers to be moved by words alone, no matter how well-intentioned.\n\nOr perhaps—and this is the hardest lesson—becoming a king whom men follow with personal loyalty isn't achieved in a single speech. It's earned through time, through demonstrated competence, through shared hardship.\n\nThe guards continue to stand at attention, awaiting your command.\n\nWhat do you do?"
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_1430_00004",
      "book": 1,
      "chapter": "1.01",
      "date": "1430-05-02",
      "end_date": null,
      "type": "decision",
      "summary": "Juan II reviews the royal treasury with Álvaro and authorizes 150,000 maravedís for guard equipment. They discuss the kingdom's financial situation: ~30 million annual revenue with ~240,000 surplus. Juan begins formulating his grand strategy: papal crusade bull, noble council, and Granada campaign.",
      "characters": [
        "juan_ii",
        "alvaro_de_luna",
        "fernan_alonso_de_robles"
      ],
      "factions_affected": [
        "royal_court"
      ],
      "location": "Valladolid, Royal Palace",
      "tags": [
        "economy",
        "military",
        "planning"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "I adress the troops before dismissing them.\n\n\nThank you captain. I am reminded that I am only a mortal and have much to learn.\n\n\nI walk past the troops with the captain and discuss what type of equipment should be aquired to give the guard a better uniform outfit and better equipment."
        },
        {
          "role": "gm",
          "text": "The captain would likely appreciate this practical focus and the king's willingness to listen and learn.\n\nYou keep your voice steady and clear as you address them again.\n\n\"Thank you, Captain. I am reminded that I am only a mortal and have much to learn.\"\n\nThere's a subtle shift in the guards' demeanor. Not dramatic, but present. A few of the older soldiers' expressions soften slightly. One veteran near the middle actually nods—almost imperceptibly, but you catch it. Acknowledging failure isn't what they expected from a young king.\n\nCaptain Fernán Alonso's eyes show something like respect. \"Your Majesty shows wisdom,\" he says quietly.\n\nYou turn to him: \"Dismiss the men, Captain. But walk with me first—I want to discuss their equipment.\"\n\n\"Royal Guard—DISMISSED!\" Fernán barks. The formation breaks with practiced efficiency, men returning to their posts or quarters. A few glance back at you as they go, their expressions thoughtful rather than dismissive.\n\nWALKING THE RANKS\n\nBefore they fully disperse, you walk slowly along the reforming column with Fernán at your side. Up close, you can see the reality of your guard's equipment more clearly.\n\nThe captain speaks in a low, professional tone: \"Your Majesty wishes to improve our outfitting? I appreciate this. The men deserve better than they have.\"\n\nAs you pass the guards, you notice:\n\nMail shirts of varying quality—some well-maintained, others with rust spots or missing links\n\nTabards bearing your heraldry, but several are faded or poorly fitted\n\nWeapons that are functional but not uniform—different sword styles, some blades showing wear\n\nA few men have good helmets, but others have simple caps or nothing at all\n\nBoots and leather gear in various states of repair\n\nOne young guard you pass has a sword that's clearly been resharpened so many times the blade is noticeably narrower than it should be.\n\nFernán follows your gaze. \"That's young Martín. Good lad, but he inherited his father's blade and we haven't had budget to replace it.\"\n\nAs the last guards file away, Fernán turns to face you fully. \"Your Majesty, if you truly wish to outfit us properly, let me tell you what we need versus what we have.\"\n\nHe counts on his fingers:\n\nCURRENT STATE & NEEDS\n\n\"Armor\"\n\"Currently: A mix. About half have decent mail shirts, the rest have partial mail or just leather and padding. None have plate components.\n\nWhat we should have: Full mail hauberks for every man, minimum. Ideally, breastplates for the senior guards. For the royal guard to look like elite troops, we should gleam.\"\n\n\"Weapons\"\n\"Currently: Every man has a sword and most have a secondary weapon—polearms, axes, crossbows. But quality varies wildly, and they're not uniform.\n\nWhat we should have: Matching, high-quality swords for every man. Good steel, properly balanced. And proper polearms—halberds or bills—that match. When we form up, we should look like one unit, not a collection of individuals.\"\n\n\"Livery\"\n\"Currently: Everyone has a tabard with your arms, but they're different ages, different makers, different fits.\n\nWhat we should have: New tabards in rich colors—red and gold for Castile. Quality cloth that doesn't fade. Maybe even embroidered rather than painted. And matching cloaks for formal occasions. Your guard should be immediately recognizable and impressive.\"\n\n\"Helmets\"\n\"Currently: Maybe twenty men have proper helmets, the rest make do.\n\nWhat we should have: Matching sallets or kettle hats for everyone. Nothing fancy, but solid and uniform.\"\n\n\"Other Considerations\"\n\"Better boots—marching destroys cheap leather. Quality belts and scabbards. Perhaps even matching horse tack if we're to accompany you on progress around the realm.\"\n\nHe pauses, then adds carefully: \"Your Majesty, I must speak plainly about cost. To outfit thirty men properly as I've described... we're speaking of perhaps 150,000 to 200,000 maravedís, depending on quality and whether we commission custom work or buy from armories.\"\n\nHe watches your face. \"That's... not an insignificant sum from the treasury. Don Álvaro would know the current state of royal finances better than I. But if Your Majesty is serious about this, I can provide detailed specifications and seek quotes from master armorsmiths in Valladolid, Toledo, or Burgos.\"\n\nBehind you, Álvaro de Luna has followed at a discrete distance. He clears his throat softly, reminding you of his presence.\n\nCaptain Fernán continues: \"I'll say this, Your Majesty—the speech may not have stirred them to passion, but if you follow through on the promise of equipment? That they'll remember. Soldiers respect actions more than words. Show them you meant what you said, and you'll earn something speeches cannot give.\"\n\nHe meets your eyes directly. \"What would Your Majesty have me do? Shall I draw up specifications and cost estimates?\"\n\nWhat do you respond?"
        },
        {
          "role": "player",
          "text": "Yes captain, draw up an itemized bill of everything you need.\n\n\nAlvaro? We need to have a look at out treasury now."
        },
        {
          "role": "gm",
          "text": "Captain Fernán Alonso salutes sharply, and this time there's genuine warmth in his expression. \"Yes, Your Majesty. I'll have detailed specifications and cost estimates on your desk within two days. I'll consult with the best armorsmiths in the city.\"\n\nHe hesitates, then adds: \"Your Majesty... thank you. The men may not have shown it properly, but this matters. You'll see.\"\n\nHe salutes again and strides off toward the barracks, already calling for his senior sergeant to begin the assessment.\n\nÁlvaro de Luna steps forward as the captain departs. \"Your Majesty handles disappointment well. That will serve you in the years ahead—there will be many.\" He says it without condescension, almost gently.\n\n\"As for the treasury... yes, we should discuss this privately. Follow me.\"\n\nHe leads you back into the palace, through the presence chamber where the petitioners still wait (they bow deeply as you pass), and down a corridor to a smaller, windowless room that serves as a counting house. Heavy ledgers line the shelves, and a large table dominates the center.\n\nÁlvaro closes the door firmly and pulls out several leather-bound account books, opening them on the table.\n\nTHE ROYAL TREASURY - DETAILED SITUATION\n\n\"Your Majesty, let me be honest about our financial position. It's... manageable, but constrained.\"\n\nHe runs his finger down columns of figures:\n\nANNUAL REVENUE: Approximately 30 million maravedís\n\nThis comes from:\n\nRoyal domain taxes: Towns and lands directly controlled by the crown (~12 million)\n\nCustoms and trade duties: Especially from Seville, Burgos, and northern ports (~6 million)\n\nSales taxes (alcabalas): Levied on transactions throughout the realm (~8 million)\n\nEcclesiastical contributions: Certain Church revenues the Pope allows you to collect (~2 million)\n\nJewish and Muslim community taxes: Special levies on religious minorities (~1.5 million)\n\nMiscellaneous: Fines, fees, confiscations (~500,000)\n\nANNUAL EXPENSES: Approximately 28 million maravedís\n\nRoyal household: Your court, servants, officials, palaces (~8 million)\n\nMilitary: The standing royal guard, frontier garrisons, castle maintenance (~7 million)\n\nAdministrative costs: Corregidores, officials, messengers, legal system (~4 million)\n\nDebt service: Interest on loans from Italian and Jewish bankers (~3 million)\n\nChurch donations and obligations: Expected royal piety (~2 million)\n\nDiplomatic expenses: Embassies, gifts, bribes (~1.5 million)\n\nMiscellaneous: Emergencies, construction, unexpected needs (~2.5 million)\n\n\"So theoretically, Your Majesty, we run a small surplus of about 2 million maravedís annually. Theoretically.\"\n\nHe looks up from the ledgers, his expression wry.\n\nTHE REALITY\n\n\"In practice, several problems constrain us:\n\nFirst, the nobles pay almost nothing. The great houses claim vast tax exemptions based on ancient privileges. They control perhaps 60% of Castile's wealth but contribute maybe 5% of royal revenue. Every attempt to tax them properly triggers rebellion threats.\n\nSecond, collection is inefficient. We're supposed to get 30 million, but perhaps 20% never makes it to the royal coffers. Local officials skim, nobles intimidate tax collectors, towns claim poverty and negotiate reductions. Our actual liquid revenue is closer to 24 million.\n\nThird, unexpected expenses are constant. A noble rebellion costs millions. A bad harvest requires grain purchases to prevent starvation. A diplomatic crisis needs sudden gifts of gold. The 'miscellaneous' category always exceeds estimates.\n\nFourth, the debt. We owe approximately 15 million maravedís to various creditors—mostly Italian banking families and wealthy Jewish financiers in Castile. That debt service of 3 million annually just keeps us even; we're not paying down the principal.\n\nCurrent liquid assets—meaning gold and silver actually in the treasury right now—amount to perhaps 1.2 million maravedís. Enough for a few months of operations if revenues stopped, but not a comfortable cushion.\"\n\nTHE GUARD EQUIPMENT IN CONTEXT\n\nÁlvaro taps the ledger: \"The Captain's estimate of 150,000-200,000 maravedís for guard equipment represents about 7-8 months of our theoretical surplus, or about 16% of our current liquid reserves.\n\nCan we afford it? Yes, technically. The treasury won't collapse.\n\nShould we spend it? That depends on Your Majesty's priorities.\"\n\nHe leans back, counting options:\n\n\"Option One: Authorize the full expenditure immediately. It shows you keep promises and value your guards. But it drains liquid reserves significantly, leaving less cushion for emergencies.\n\nOption Two: Authorize it but spread the purchases over 6-12 months, buying equipment in batches. Less dramatic impact on reserves, but the guards don't see immediate results.\n\nOption Three: Authorize a partial upgrade now—say 80,000-100,000—focusing on the most visible improvements like new tabards, helmets, and replacing the worst equipment. Complete the rest later when finances improve.\n\nOption Four: Find alternative funding. Perhaps levy a special contribution from loyal nobles 'for the enhancement of royal dignity,' or negotiate with the towns for additional funds in exchange for some minor privilege.\"\n\nHe closes the ledger and looks at you directly:\n\n\"Your Majesty, I must also point out that if you're building a new advisory cabinet and expanding royal activities as you intend, there will be additional costs. Stipends for new advisors, travel expenses, perhaps bribes for information networks. These men won't serve for free, even if they're loyal.\n\nAnd if the situation with the Infantes escalates—if we need to raise troops, fortify positions, or prepare for confrontation—military expenses could double or triple.\"\n\nHe spreads his hands: \"I'm not saying don't equip your guards. Frankly, it's good governance and they need it. But Your Majesty should understand the trade-offs. Every 100,000 maravedís spent on equipment is 100,000 not available for bribing a wavering noble, funding an informant network, or hiring mercenaries if things go badly.\"\n\nÁlvaro watches you, gauging your reaction to this financial reality.\n\n\"What are Your Majesty's thoughts? How do you wish to balance these considerations?\"\n\nWhat do you decide about the guard equipment expenditure, and are there other financial matters you want to discuss?"
        },
        {
          "role": "player",
          "text": "I authorize 150.000 for the captain immediately. Prioritize function over beauty. Maybe no golden insignia yet, but this should enable us to be uniformly presentable and have clear and nice insignia on it.\n\n\nFurther on, I want to do the following. We have a dysfunctional taxation system and we rely overly much on nobles. We face internal threats from Aragon and our expenses are out of control. I want to fix everything.\n\n\nI want to install a council of sorts, a means to give the nobles access to me, a way for them to be heard. But I want to remain in control, that's why the guard is so important. I want to recieve every important message myself and keep to my own council. The council we are now assembling.\n\n\nI think I will call a crusade on Grenada and I want to mobilize the kingdom against them. I want to make it clear that we need an efficient tax system if we are to succeed, maybe start making a dent in that 20% of tax that keeps getting lost now everyone knows WHY we are taxing them. We tax them so we can fund the war. The war instituted by the pope and everyone not paying tax, is he not against the crusade? Is he not a good christian?\n\n\nI want to call this council of nobles together for the first time. We should send letters out explaining what this council is, how it functions and when the first council is being held. Then during this council, I will reveal that the pope has granted us crusade against Grenada and that we will take it upon ourselves to finally finish the reconquista.\n\n\nThen in order to prepare the nation for war, I will introduce a bill to make sure our army is organized into a single force, making sure all nobles contribute. And we will also introduce a bill to streamline taxation so we can pay for the war. Hopefully, the war with Grenada creates enough impulse for this law to get enough support and not rebellion.\n\n\nI will hopefully have gained support from the pope himself, also him blessing my rule and supporting my new taxation plan, indicating that a kingdom that collects lots of taxes can contribute more to the church as well. I am willing to make more concessions to his holy father in order to gain his support.\n\n\nWhat do you think of this plan?"
        },
        {
          "role": "gm",
          "text": "Álvaro de Luna goes completely still as you lay out your plan. His eyes widen slightly—the first time you've seen him genuinely surprised. He stares at you for a long moment, then slowly a smile spreads across his face. Not a polite smile, but something fierce and delighted.\n\n\"Por Dios, Your Majesty... you truly mean to rule.\"\n\nHe paces to the window, then back, his mind clearly racing through implications. When he speaks again, his voice carries an intensity you haven't heard before:\n\n\"This is brilliant. Genuinely brilliant. Use external war to justify internal reform, wrap it all in religious legitimacy, give the nobles a council so they feel heard while you keep real power... Your Majesty, this could work. This could actually work.\"\n\nThen his expression becomes serious, almost grave:\n\n\"But let me be absolutely clear—this is extraordinarily dangerous. You're attempting to transform Castilian governance, centralize royal authority, and launch a major war simultaneously. Any one of these could trigger noble rebellion. All three together?\"\n\nHe sits down heavily and begins ticking through the plan systematically:\n\nASSESSMENT OF YOUR STRATEGY\n\nTHE NOBLE COUNCIL - CLEVER BUT RISKY\n\n\"Creating a formal council is smart. It gives the nobles what they think they want—access and voice—while you control the substance. The key is in the details:\n\nWhat Works:\n\nSatisfies their demand to be 'consulted'\n\nCreates a forum where you can observe them, see who aligns with whom\n\nAllows you to play factions against each other\n\nIf structured right, lets you seem to grant power while retaining it\n\nThe Dangers:\n\nOnce established, a council can develop its own momentum and expectations\n\nThe Infantes will try to dominate it and use it against you\n\nIf you overrule the council too often, you'll look like you're ignoring them—defeating the purpose\n\nNobles might demand the council have binding authority, not just advisory\n\nCritical Details We Must Get Right:\n\nComposition: Who gets a seat? If it's too small, excluded nobles rebel. Too large, it's unmanageable.\n\nPowers: Purely advisory? Or do certain decisions require their consent? We must define this carefully.\n\nFrequency: Monthly meetings? Quarterly? Too often and they're always in your face. Too rare and it seems meaningless.\n\nYour control: You must chair it personally, set the agenda, and control what gets discussed.\n\nI suggest we call it the Royal Council or Council of the Realm, emphasize it's an honor to be included, and make membership something you grant—not a right nobles can claim.\"\n\nTHE GRANADA CRUSADE - YOUR STRONGEST CARD\n\n\"This is the centerpiece, and it's genuinely inspired. A crusade solves multiple problems at once:\n\nWhat It Accomplishes:\n\nUnites nobles behind a common cause instead of plotting against each other\n\nProvides religious legitimacy for everything else you do\n\nJustifies taxation as you said—who can oppose funding a Holy War?\n\nDemonstrates your kingship through decisive martial action\n\nWins glory and prestige for the Crown\n\nPotentially enriches the treasury through plunder and conquered territory\n\nGives restless nobles an outlet for their energy and ambition\n\nThe Challenges:\n\nGetting papal approval: This is not automatic. Pope Martin V is dealing with councils and schisms. You'll need to petition formally and wait for response—could take 3-6 months.\n\nGranada is not weak: Sultan Muhammad IX has a real army. This won't be easy.\n\nCost: Even with special war taxes, campaigns are expensive—could cost 5-10 million maravedís depending on scale and duration\n\nMilitary coordination: Getting fractious nobles to actually cooperate in the field is nightmarishly difficult\n\nRisk of failure: If the campaign goes badly, you'll look weak and incompetent. Failed crusades have destroyed kings.\n\nWhat You Need Before Launching:\n\nPapal bull declaring this a crusade and granting indulgences\n\nAgreement from major nobles to contribute troops\n\n6-12 months to prepare logistics, supplies, siege equipment\n\nIntelligence on Granada's current military state\n\nA clear, achievable objective (take Málaga? Besiege Granada city? Raid and withdraw?)\"\n\nTAX REFORM - THE MOST DANGEROUS PART\n\nÁlvaro's expression becomes very serious:\n\n\"Your Majesty, this is where you could lose everything. Tax reform means taking wealth and privileges from nobles who have the power to resist with armies.\n\nThe Theory Is Sound:\n\nFrame it as temporary war taxation for the crusade\n\nMake it about efficiency (fixing that 20% loss) not increasing rates\n\nTie it to Christian duty—opposing the tax is opposing the crusade\n\nUse papal support to make resistance seem impious\n\nThe Reality Is Brutal:\n\nNobles will see through this immediately. They know 'temporary' war taxes become permanent.\n\nTheir tax privileges are ancient rights, some dating back centuries. You're attacking the fundamental social contract.\n\nThey have more soldiers than you do. If enough unite against this, you cannot enforce it militarily.\n\nThe Infantes will seize on this as proof you're a tyrant destroying traditional liberties.\n\nThe Only Way This Might Work:\n\nStart small: Don't demand full taxation of nobles immediately. Ask for 'voluntary contributions' to the crusade from those who cannot fight personally. Make it about honor.\n\nTarget the efficiency issue first: The 20% lost to corruption—this everyone can agree is bad. Go after corrupt local officials, not noble privileges. Show you're a reformer, not a revolutionary.\n\nCreate gradations: Small nobles who can't afford exemptions? Tax them lightly. Great nobles who claim vast exemptions? Pressure them for 'donations' to the crusade. Make it voluntary in name, coerced in fact.\n\nUse success to justify more: If the crusade starts winning, if the new system works, if the realm prospers—then you can propose making changes permanent. Not before.\n\nBuy off key nobles: The Mendozas, for example—give them a role, a title, a captured estate in Granada. Make sure the powerful profit from the new order.\n\nAbsolutely Do Not:\n\nAnnounce sweeping tax reform before the crusade has even begun\n\nTry to abolish noble tax exemptions outright\n\nImplement reforms without the Council's 'advice' (even if you ignore it)\n\nMove faster than your military strength allows\"\n\nMILITARY CENTRALIZATION - NECESSARY BUT CONTENTIOUS\n\n\"Creating a unified royal army under your command is essential if you're to actually lead a crusade rather than just coordinate independent noble contingents.\n\nThe Argument That Might Work:\n\nFor a crusade to succeed, we need unified command\n\nThis is temporary, for the duration of the war\n\nFamous crusades succeeded because of unified leadership (invoke Richard the Lionheart, Louis IX, etc.)\n\nEach noble still commands his own men, but coordinates under your overall strategy\n\nWhat You're Actually Creating:\n\nThe framework for a permanent standing army\n\nRoyal control over military mobilization\n\nA precedent that the king commands in war, not each noble independently\n\nHow To Frame It:\n\nCall it the Army of the Cross or Host of the Crusade—religious terminology\n\nEmphasize this is about coordination, not taking away noble command\n\nGive major nobles prestigious titles: Captain of the Vanguard, Marshal of the Right Wing, etc.\n\nPromise that captured territories will be distributed according to contribution\n\nThe Infantes' Response:\n\nThey'll demand major command positions\n\nIf you give them armies to command, they could use them against you\n\nIf you don't, they'll claim you're excluding the realm's natural military leaders\"\n\nPAPAL SUPPORT - ESSENTIAL BUT NOT GUARANTEED\n\n\"Your instinct to secure Pope Martin V's blessing is exactly right. Without it, this falls apart.\n\nWhat You Need From Rome:\n\nCrusade Bull: Officially declaring war on Granada a crusade with indulgences for participants\n\nEndorsement of your rule: Confirming you as rightful king against any who might challenge you\n\nSupport for reforms: Framing efficient royal government as serving the Church's interests\n\nFinancial support: The Church has vast wealth—could they contribute to crusade costs?\n\nWhat You Can Offer:\n\nIncreased Church donations from a wealthier, better-governed realm\n\nVigorous persecution of heresy (if that interests him)\n\nExpansion of Christian territory in Iberia\n\nSupport for papal policies in wider European politics\n\nChurch positions for papal nominees in Castile\n\nThe Process:\n\nWe draft a formal petition to the Pope\n\nSend a high-ranking embassy to Rome (this should be someone impressive—perhaps a bishop allied to you)\n\nThis takes 3-6 months minimum for the round trip and negotiations\n\nMeanwhile, we cultivate Archbishop of Toledo and other Spanish prelates to support your petition\n\nRisk:\n\nThe Pope might say no, or attach conditions you don't like\n\nDuring the 3-6 month wait, the Infantes will hear about your plans and prepare countermoves\n\nPapal politics are complex—Martin V has his own concerns, and Castilian affairs may not be his priority\"\n\nÁLVARO'S OVERALL ASSESSMENT\n\nHe stands and faces you directly:\n\n\"Your Majesty, this plan could make you the strongest Castilian king in a century. Or it could trigger a civil war that destroys your reign before it truly begins.\n\nThe elements are sound: Use crusade for legitimacy, create institutions that seem to grant power while retaining it, reform gradually under cover of emergency, secure external validation from Pope.\n\nThe execution is everything: Order of moves, timing, whom you trust with what role, how you handle inevitable opposition.\n\nMy Recommendation for Sequence:\n\nPhase One (Next 2-3 Months):\n\nEquip your guard—150,000 authorized as you commanded\n\nBegin assembling your advisory cabinet quietly\n\nSend secret feelers to Rome about crusade and papal support\n\nSound out which nobles might support a crusade\n\nPhase Two (Months 3-6):\n\nAnnounce formation of Royal Council—invite major nobles\n\nAt first Council meeting, reveal you're considering a crusade and seek their counsel\n\nLet them debate it, feel involved\n\nMeanwhile, formal embassy to Rome requesting crusade bull\n\nPhase Three (Months 6-9):\n\nReceive papal approval (hopefully)\n\nAnnounce the Crusade with maximum ceremony\n\nRequest 'voluntary contributions' from nobles for the holy cause\n\nBegin military preparations and coordination\n\nPhase Four (Months 9-12):\n\nImplement 'temporary' efficiency reforms to stop corruption and fund crusade\n\nEstablish unified crusade command structure\n\nBuild up supplies, intelligence on Granada\n\nContinue solidifying your advisory network\n\nPhase Five (Year 2):\n\nLaunch the actual military campaign\n\nIf successful, use momentum to make temporary reforms permanent\n\nIf unsuccessful... we'll need contingency plans\n\nCritical Throughout:\n\nKeep the Infantes off-balance—never give them time to organize opposition\n\nNever announce reforms before you have the political strength to enforce them\n\nEvery move should seem reasonable, pious, and in the realm's interest\n\nBuild your personal power base (guards, advisors, loyal officials) continuously\"\n\nHe leans forward intently:\n\n\"Your Majesty, do you want to proceed with this plan? It will define your entire reign. Once we begin, there's no going back to being a passive king managed by nobles.\n\nAnd we must accept that this could fail. The Infantes might rebel. The nobles might refuse the crusade. The Pope might say no. Granada might defeat us. Any of these could end with you deposed or dead.\n\nBut if we succeed? You'll have transformed Castile into a realm where the king truly rules.\"\n\nHis eyes burn with intensity: \"Is Your Majesty prepared for this? Because once I send those first letters announcing the Royal Council, the game begins and everyone will know you're playing for keeps.\"\n\nWhat is your decision? Do you want to proceed with this plan, and if so, do you agree with Álvaro's phased approach or want to modify it?"
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_1430_00005",
      "book": 1,
      "chapter": "1.01",
      "date": "1430-05-02",
      "end_date": null,
      "type": "decision",
      "summary": "Juan II reveals his bold plan to personally travel to Rome to secure a papal crusade bull, using a pilgrimage to Santiago de Compostela as cover. Álvaro is alarmed by the risks but impressed by the political instinct. They develop a deception strategy: meet the Infantes first, play the pliant young king, let them propose a council (which Juan already planned), then depart on 'pilgrimage' while secretly continuing to Rome.",
      "characters": [
        "juan_ii",
        "alvaro_de_luna"
      ],
      "factions_affected": [
        "royal_court",
        "aragonese_faction"
      ],
      "location": "Valladolid, Royal Palace",
      "tags": [
        "strategy",
        "diplomacy",
        "deception"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "It all hinges on our papal support. Without crusade, no war and no war, no unity. We must gamble that we get Roman support and to increase our chances, I must go myself. Going to Rome will also give me the chance to meet with the pope himself and build a relationship, show him I am a sincere and devout christian, ready to set my rule into the image of God.\n\n\nI want to send out the invitations for this council before I leave. Let them think and scheme, everything changes anyway as soon as I present the papal bull and the crusade. And by timing the council the moment I arrive back in Castille, news will hopefully not have spread yet about the crusade, allowing me to announce it in the council first.\n\n\nI want to take the coming weeks to make sure the guard is properly equipped and trained up where necessary, to establish my own council. We should also assemble those from our kingdom to accompany us on our journey to Rome. The highest ranking officials of the church perhaps?\n\n\nI also want to prepare the exact format of the council. I am thinking the following: It is a gathering of nobles on the kings invitation so I can consult the realm on important matters of state. It will be held yearly and everyone who is invited has the right of audience with me. It should become the most important political event of the year.\n\n\nWhat do you think?"
        },
        {
          "role": "gm",
          "text": "Cons:\n- Leaving the kingdom for months (3-4 months minimum for the journey there and back, plus time in Rome)\n- The Infantes could act while he's gone\n- Dangerous journey - bandits, weather, politics\n- Could look like he's abandoning the realm\n- No guarantee the Pope will even grant audience quickly\n\nThe council structure sounds reasonable - yearly meetings, consultative but not binding.\n\nÁlvaro would see both the genius and the extreme danger here. This is gambling everything on one move.\n\nÁlvaro de Luna goes pale. For a moment he simply stares at you, and you see something rare in his eyes: genuine fear.\n\n\"Your Majesty intends to... travel to Rome. Personally.\"\n\nHe sits down heavily, then stands again, pacing. When he speaks, his voice is tight with controlled urgency:\n\n\"Sire, I must speak with absolute candor, even if it displeases you. This idea is either brilliant or catastrophic, and I genuinely cannot tell which.\"\n\nHe takes a breath and begins analyzing systematically:\n\nTHE ROME JOURNEY - ASSESSMENT\n\nWhy This Could Be Genius:\n\n\"Personal diplomacy is powerful. You're right that meeting Pope Martin V face-to-face, showing your youth, your sincerity, your devotion—this could accomplish what no letter ever would. The Pope is an old man; he might be moved by a young king's crusading zeal in a way that wouldn't happen through intermediaries.\n\nIt demonstrates courage. Kings who travel personally to petition the Pope are remembered. It shows you're willing to act, not just send envoys. This would impress people—both in Rome and at home.\n\nYou control the narrative. With letters, things get distorted, delayed, misunderstood. Face to face, you can negotiate directly, adjust your approach based on the Pope's reactions, make promises and concessions in real time.\n\nThe timing scheme is clever. Send council invitations now, depart for Rome, return with the crusade bull just in time for the first council meeting. Maximum dramatic impact. The nobles gather expecting one thing, you arrive with papal authority and a holy war. Masterful theater.\"\n\nWhy This Could Be Catastrophic:\n\nHis expression darkens:\n\n\"You will be gone for at least four months. Valladolid to Rome is roughly 1,400 miles. Even traveling fast with good weather, that's 6-8 weeks each way. Then time in Rome for audiences, negotiations, waiting on papal bureaucracy. We're looking at late summer or early autumn before you return, assuming everything goes smoothly.\n\nFour months is an eternity in politics. Your Majesty, the moment you leave Castilian territory, the Infantes will know. And they will act. They could:\n\nConvene the nobles you've invited to council and claim to speak for it in your absence\n\nSpread rumors that you've abandoned the realm or been captured\n\nPressure officials and towns to acknowledge their 'regency' until you return\n\nMove troops to secure strategic positions\n\nEven attempt to have you declared unfit and establish a regency council\n\nThe journey itself is dangerous:\n\nYou'd travel through Aragon—King Alfonso's territory, and he's the Infantes' brother\n\nBandits, weather, disease on the roads\n\nItalian politics are treacherous—city-states, mercenary companies, rival factions\n\nWhat if something happens to you? No heir, the realm plunges into succession crisis\n\nThere's no guarantee of success:\n\nPope Martin V is old and ill. He might not grant you immediate audience\n\nPapal bureaucracy moves slowly. You could wait weeks in Rome\n\nHe might say no, or attach conditions you cannot accept\n\nWhile you're gone, the Infantes could send their own embassy poisoning your case\n\nYour supporters will be horrified:\n\nEvery loyal noble will beg you not to go\n\nIt looks reckless, abandoning your kingdom when you've only just begun personal rule\n\nI cannot protect you in Rome. Neither can your guard.\"\n\nÁLVARO'S COUNTER-PROPOSALS\n\nHe holds up his hands:\n\n\"Before Your Majesty decides, let me offer alternatives:\n\nOption A: Send Me\n\nI go to Rome as your personal representative with full plenipotentiary authority. I can negotiate everything you would negotiate. I know papal politics, I speak fluent Italian, and frankly, the realm can afford to lose me more than it can afford to lose you. If I fail or am delayed or worse, you're still here ruling.\n\nOption B: Send a Powerful Embassy\n\nA delegation: Archbishop of Toledo or another high prelate, myself or another noble, perhaps a learned theologian. Impressive enough to show seriousness, but not risking your person.\n\nOption C: Go, But With Massive Security\n\nIf you insist on going personally, we make it a royal progress. Take 200+ armed men, your full court, make it a diplomatic tour through Aragon (forcing King Alfonso to receive you with honor or look like a villain). This turns it into a demonstration of strength, not a risky journey.\n\nOption D: Secret Journey\n\nGo, but quietly. Small group, travel fast, don't announce it publicly. You 'tour the realm' but actually go to Rome. The Infantes don't know you're gone until you return. Risky but keeps initiative.\"\n\nTHE COUNCIL STRUCTURE - THIS PART IS GOOD\n\nHe nods approvingly at your proposed format:\n\n\"Yearly meeting - Perfect. Often enough to seem meaningful, rare enough that it's a special event and doesn't bog you down in constant sessions.\n\nKing's invitation - Critical. You control who attends. Make it an honor, not a right.\n\nConsultative on 'important matters of state' - Good phrasing. Vague enough that you define what's 'important.'\n\nRight of audience - This is generous but smart. Nobles will value this highly.\n\nMost important political event of the year - Yes. Make it grand, ceremonial, important. The opening should be magnificent.\n\nAdditional Suggestions:\n\nCall it the Cortes of Castile or Royal Cortes - traditional name that sounds prestigious\n\nInclude representatives from major cities - burgesses from Burgos, Seville, Toledo, etc. This dilutes pure noble dominance and gives you allies among urban elites\n\nSpecify that it advises, does not bind - make this clear from the start\n\nCreate ceremonial roles - who speaks first, who sits where. Use protocol to reinforce your supremacy\n\nKeep the first meeting focused - Don't try to solve everything at once. The crusade announcement should be the centerpiece.\n\nI can begin drafting invitations immediately. They should arrive about two weeks before the actual meeting, giving nobles time to travel but not months to conspire.\"\n\nTHE PREPARATION PERIOD\n\n\"If we have a few weeks before departure—whether you go or send an embassy—here's what we accomplish:\n\nGuard Equipment: Captain Fernán is already working on this. With 150,000 maravedís and focus on function, we can have them outfitted in 3-4 weeks.\n\nAdvisory Cabinet: We've already summoned:\n\nJuan de Daza (arrives today)\n\nDiego Gómez de Sandoval (2 days)\n\nLope de Barrientos (3-4 days)\n\nÍñigo López de Mendoza (4-5 days)\n\nRodrigo Manrique (3-10 days depending on location)\n\nYou can begin meeting with them individually, assigning initial tasks, building those relationships.\n\nChurch Officials for Rome Journey:\n\nIf you or an embassy goes, the ideal delegation includes:\n\nA high prelate - Archbishop of Toledo would be most prestigious, but he's mentioned in that letter as pushing the crusade already. Could work with us or could have his own agenda. Alternative: Bishop of Burgos or Bishop of Segovia, if they're more clearly loyal.\n\nA learned theologian - To handle doctrinal and canonical arguments. Perhaps someone from Salamanca.\n\nExperienced diplomat - Someone who knows Italian courts and papal politics.\n\nMyself or another high noble - To show this is taken seriously at the highest level.\n\nWe'd need 4-6 weeks to assemble a proper embassy and prepare them.\"\n\nTHE TIMING PROBLEM\n\nÁlvaro spreads his hands:\n\n\"Here's the sequence if you go personally:\n\nWeek 1-3: Equip guard, meet with advisory cabinet, prepare for journey\n\nWeek 4: Depart for Rome, council invitations go out\n\nWeeks 5-10: Travel to Rome (6 weeks with good conditions)\n\nWeeks 11-14: In Rome, audiences with Pope, negotiations (optimistic timeline)\n\nWeeks 15-20: Travel back (6 weeks)\n\nWeek 21: Arrive just before first council meeting\n\nThat's five months minimum, Your Majesty. More realistically, six. You'd be gone from spring through summer into early autumn.\n\nThe invitations say 'Council will convene in [autumn]' without being too specific, giving you flexibility. But that's a long time for the Infantes to work against you.\"\n\nÁLVARO'S FINAL COUNSEL\n\nHe looks at you with an expression that mixes respect, concern, and something like paternal worry:\n\n\"Your Majesty, you have the soul of a gambler. This plan—going to Rome, timing the council reveal, gambling everything on papal support—it's audacious beyond measure.\n\nI will support whatever you decide. If you command me to prepare for your personal journey to Rome, I will do so and manage the realm as best I can in your absence. If you allow me to go in your stead, I will secure that crusade bull or die trying.\n\nBut I must tell you: the safe play is sending an embassy. The bold play is going yourself. And I genuinely do not know which is right.\n\nWhat I do know is this: if you go and succeed—if you return with papal blessing, crusade authority, and catch the nobles by surprise at that first council—you will have won a tremendous victory before a single sword is drawn.\n\nBut if you go and the Infantes seize control in your absence, or if the Pope refuses you, or if something goes wrong on the journey... the game ends before it begins.\"\n\nHe meets your eyes:\n\n\"So I ask Your Majesty directly:\n\nDo you go to Rome personally, send me, send a different embassy, or reconsider the approach entirely?\n\nAnd if you go personally, how do we protect the realm in your absence? What authority do I have to act? What are my orders if the Infantes move against your interests while you're away?\"\n\nThe room falls silent. This is perhaps the most important decision of your young reign.\n\nWhat do you decide?"
        },
        {
          "role": "player",
          "text": "We dont have to decide right now. You keep mentioning the infantes as our main rivals, but I have yet to meet them. I feel we should do so before making a decision. Also, you mention my supporters would beg me not to go. Who are my supporters anyway? I feel like I am not the king at all if everyone is against me.\n\n\nI must say that I still feel like going to Rome is the best choice, but that does not mean we dont have to make it less risky. You fear that the infantes will dethrone me as soon as they learn I am in Rome. Lets walk through how this would work. Why would they noty do so right now? What actions would we take if they were to try?\n\n\nGoing in secret sounds like the best option. I announce I go on a tour of the kingdom in preparation for the council meeting. We travel with our court and after a few high visibility vitits, I sneak off with a few followers to take a boat from Sevilla to Rome. There I will meet up with our official delegation sent to Rome, there on a mission to shore up relationships with the pope. They can vouch for my identity if I arrive as a travelling merchant and help with our diplomacy there. If we miss them for whatever reason we proceed on our own. You meanwhile will travel somewhere remote in Castille. Maybe the Basque region? Away from prying eyes where you will keep up the act. We can disguise someone to look like me? When I return from Rome, we convene the council.\n\n\nThoughts?"
        },
        {
          "role": "gm",
          "text": "**Who are the supporters**: The user is right to feel uncertain. I should clarify that while they don't have many *proven* passionate supporters, they have:\n- People dependent on royal authority (officials, corregidores, some clergy)\n- Towns and cities that prefer strong crown vs. noble chaos\n- Smaller nobles who fear the great houses\n- Personal loyalists (Álvaro, potentially the cabinet being assembled)\nBut the user is correct that their support base is thin, which is WHY they need to build it.\n\n**Why don't the Infantes move now**: This is a crucial question. The answer is:\n- Open rebellion against an anointed king is a big step (legitimacy matters)\n- Not all nobles support them yet\n- The king is present and alert, not absent/weak\n- Civil war is costly and risky\n- They prefer to control through \"counsel\" rather than open usurpation\nBUT if the king leaves for months, that changes the calculation significantly.\n\n**The secret journey plan**: This is actually clever and creative! But it has problems:\n- Very hard to keep secret in medieval court (servants, guards, everyone would know)\n- If discovered, looks incredibly weak/suspicious\n- A merchant traveling to Rome would still take months\n\n- The \"disguised double\" idea is pure fantasy, completely impractical in medieval political reality\n- Such a ruse would destroy any remaining credibility if discovered\n\nThe proposed plan reveals more risks than potential benefits. Medieval courts were intricate networks where secrets rarely remained hidden, and any attempt at deception would likely backfire catastrophically.\n\nÁlvaro de Luna's expression shifts—surprise, then respect, then deep thought. He sits back down, considering your questions carefully.\n\n\"Your Majesty asks the right questions. Let me address each properly, because these go to the heart of your position.\"\n\nWHO ARE YOUR ACTUAL SUPPORTERS?\n\nHe spreads his hands, his voice becoming frank:\n\n\"Your Majesty feels isolated, and with good reason. The truth is your support base is thin but real. Let me be honest about who actually supports you versus who merely obeys:\n\nDEFINITELY LOYAL:\n\nMyself - Obviously. My fate is bound to yours. If you fall, I fall.\n\nRoyal officials appointed by the Crown - Men like Pedro Fernández de Velasco in Seville, various corregidores in major cities, treasury officials. They owe their positions to royal authority, not noble patronage. Perhaps 30-40 such men throughout Castile in important posts.\n\nCaptain Fernán Alonso and the core royal guard - Not all thirty, perhaps, but certainly Fernán and maybe 15-20 others who are true royal servants.\n\nThe advisors we're assembling - Juan de Daza, Diego Gómez de Sandoval, and others. We're choosing them specifically because they need you more than they need the great nobles.\n\nCertain smaller nobles - Knights and minor lords who fear the great houses and see a strong crown as protection. Not organized, not numerous, but they exist scattered throughout the realm.\n\nPROBABLY SUPPORTIVE:\n\nMajor cities and towns - Burgos, Seville, Toledo, Valladolid. Not the nobles in those cities, but the merchant guilds, artisan corporations, and urban governments. They generally prefer royal authority to noble chaos because it's better for trade and order. But they won't fight for you unless their immediate interests are threatened.\n\nMuch of the Church hierarchy - Not all, and the Archbishop of Toledo has his own agenda, but many bishops and abbots prefer a strong, pious king to fractious nobles. The Church benefits from order.\n\nThe Mendoza family - Cautiously, conditionally loyal. They're powerful enough not to need the Infantes, and currently see value in supporting the crown. But if the wind shifts, they might too.\n\nNEUTRAL/WATCHING:\n\nMost middling nobles - The Manriques, Estúñigas, Velascos, and dozens of other families. They're not actively plotting against you, but they're waiting to see who comes out on top. They'll join the winning side.\n\nThe Military Orders (Santiago, Calatrava, Alcántara) - Theoretically loyal to the crown, practically semi-independent. They'll cooperate if it serves their interests.\n\nACTIVELY OPPOSED:\n\nThe Infantes de Aragón and their faction - Perhaps 8-10 major noble houses firmly in their camp, representing maybe a quarter of Castile's military power.\n\nVarious discontented nobles - Those who lost power or privileges during your minority, those who simply hate me, those ambitious for more.\n\nTHE REALITY:\n\nYour Majesty is right to feel you lack a solid base. Most of the realm is neutral rather than loyal. They acknowledge you as legitimate king, but that doesn't mean they'd fight for you against a strong challenger.\n\nThis is why your plan to build institutional power, create a loyal advisory council, professionalize the guard, and launch a crusade makes sense. You're building support from scratch because you inherited a throne without a faction.\"\n\nWHY DON'T THE INFANTES MOVE NOW?\n\nÁlvaro leans forward intently:\n\n\"Excellent question, Your Majesty. Understanding this is crucial. Here's why they haven't already deposed you:\n\nLegitimacy Matters Enormously:\n\nYou are the anointed King of Castile. Crowned as an infant, blessed by the Church, recognized by all of Christendom. This isn't a minor thing in 1430—it's fundamental to the entire social order.\n\nTo openly rebel against an anointed king is to rebel against God's chosen ruler. It invites:\n\nExcommunication from the Church\n\nCondemnation from other Christian monarchs\n\nLoss of support even from nobles who dislike you\n\nCivil war that could destroy the realm\n\nThe Infantes don't want to overthrow you—that's too radical, too destabilizing. They want to control you. Keep you as king in name while they govern in fact. This is why they push for a 'council of natural advisors' rather than simply seizing the throne.\n\nThey're Not United (Yet):\n\nThe Infantes have supporters, but not overwhelming force. If they moved openly now, you could rally:\n\nThe Mendozas and other powerful families who don't want them in charge\n\nThe cities and towns\n\nRoyal officials and garrisons\n\nChurch support\n\nEven foreign support (Portugal, France don't want Aragon dominating Castile)\n\nThe resulting civil war would be genuinely uncertain. They'd rather win without fighting.\n\nYou're Present and Alert:\n\nRight now, you're here, in your palace, with guards, issuing orders, clearly in charge. Hard to claim you need 'rescue' or 'guidance' when you're visibly ruling.\n\nThey Still Have a Legal Path:\n\nThe Infantes can pressure you politically. Send letters, gather supporters, intimidate through shows of force, demand a council. If you concede to their demands, they win without rebellion. Why risk war when political pressure might work?\n\nTiming Isn't Right:\n\nThey need to build more support first, coordinate their allies, maybe wait for a crisis they can exploit. Rebellions succeed when they can claim to be 'saving the realm' from some urgent threat.\n\nWHAT CHANGES IF YOU LEAVE:\n\nNow, here's the critical part—if you're gone for four to six months:\n\nThe Legitimacy Argument Shifts:\n\nThey can say: 'The King has abandoned the realm in its hour of need. The kingdom requires governance. We must form a regency council to manage affairs until His Majesty returns.'\n\nThey're not overthrowing you—they're 'temporarily managing' in your absence. Much easier to justify.\n\nYour Supporters Can't Rally to You:\n\nIf you're in Valladolid and they make a move, loyal officials can come to you, the guard protects you, messages go out in your name. If you're in Italy? Your supporters are leaderless, confused, don't know what you want them to do.\n\nThey Control the Narrative:\n\nWhile you're gone, they control what people hear. 'The King is lost.' 'The King has been captured.' 'The King has fallen ill in Rome and may not return.' 'Affairs cannot wait—we must act.'\n\nForce Becomes More Viable:\n\nThey could seize key castles and fortresses without fighting you personally. By the time you return, they control the strategic positions and you have to retake your own kingdom.\n\nWhat Would We Do If They Moved Now?\n\nIf the Infantes attempted to seize control today, here's what would happen:\n\nImmediate military response: I'd summon loyal garrisons, hire mercenaries if needed, call on cities to close their gates to the rebels.\n\nPolitical countermeasures: Messages to all corregidores and officials, reminding them their authority comes from you. Appeals to the Mendozas and neutral nobles.\n\nChurch appeals: Seek condemnation from bishops, threaten excommunication for rebels.\n\nYou personally lead: Your presence matters. Even without a huge army, you as the legitimate king leading loyal forces changes everything.\n\nFortify your person: Move you to a secure location—Segovia's alcázar, Madrid, somewhere defensible.\n\nForeign appeals: Contact Portugal, even France, suggesting intervention if Aragon's princes usurp Castile.\n\nIt would be messy, possibly bloody, but winnable because you're here and legitimate.\n\nIf you're in Rome? I do all the same things, but without you. I claim to act in your name, but they claim you've abandoned the realm. Much, much harder.\"\n\nYOUR SECRET JOURNEY PROPOSAL\n\nÁlvaro's face shows he's genuinely considering this. He paces, thinking aloud:\n\n\"A tour of the kingdom as cover for a secret journey to Rome... Your Majesty, this shows real strategic creativity. Let me analyze it:\n\nWhat Could Work:\n\nInitial cover is plausible: A new king touring his realm before a major council makes perfect sense\n\nHigh-visibility visits: Burgos, Valladolid, Segovia—you're seen publicly, seeming to be in Castile\n\nSneaking off from Seville: That city is far south, busy port, easier to disappear from than landlocked Valladolid\n\nSea voyage is faster: Seville to Rome by ship, then up the coast and overland, cuts travel time versus going entirely by land through Aragon\n\nMeeting the official delegation: Having them vouch for you provides cover and diplomatic support\n\nMe creating the illusion: I could indeed move to the periphery, issue orders in your name, maintain the fiction\n\nThe Fatal Problems:\n\nYou Cannot Keep This Secret.\n\nYour Majesty, medieval courts are villages. Everyone knows everything. To travel from Valladolid to Seville requires:\n\nYour personal servants, who dress you, attend you constantly\n\nGuards who accompany you everywhere\n\nGrooms for your horses\n\nCooks for your meals\n\nClerks and secretaries\n\nPossibly dozens of people who see you daily\n\nThen to 'disappear' from Seville and get on a ship requires:\n\nBribing or trusting ship captains\n\nAvoiding port officials\n\nExplaining to your entourage why you're suddenly not there\n\nEvery single person who knows is a potential leak. One servant mentions it to a lover, one guard tells his brother, one clerk writes a letter... and suddenly the Infantes know.\n\nThe 'Double' Problem:\n\nYour Majesty suggests disguising someone to look like you. This is... extremely difficult. You're the king. People know your face, your voice, your mannerisms, your height, your way of moving.\n\nA distant glimpse might fool people, but:\n\nYour household staff would know immediately\n\nAnyone who speaks with 'you' would realize something's wrong\n\nMedieval people are suspicious and observant—their lives depend on reading people\n\nIf discovered, it's humiliating and destroys all credibility\n\nTime Still Required:\n\nEven by sea, Seville to Rome is still 6-8 weeks round trip minimum, plus time in Rome. You're talking about 3-4 months, possibly more. Very hard to maintain a deception that long.\n\nIf the Ruse Is Discovered:\n\nThis is perhaps the worst outcome. If people learn you:\n\nDeceived your own court and officials\n\nSnuck out of your kingdom in disguise\n\nLeft a fraud in your place\n\nYou look weak, untrustworthy, and afraid. The Infantes would have a field day: 'Our king abandoned us in secret, leaving a puppet! This proves he cannot rule!'\n\nIt would be worse than openly leaving, because it suggests you knew you couldn't leave openly—that you're not strong enough to do so.\n\nA Modified Version That Might Work Better:\n\nSemi-Public Departure:\n\nAnnounce you're going on pilgrimage to various shrines (Santiago de Compostela is in northwest Spain, very prestigious pilgrimage site)\n\nMake this religious and public—pious kings go on pilgrimage\n\nTravel with appropriate entourage to Santiago\n\nFrom there, the coast is close—ship to Rome 'to pray at St. Peter's tomb'\n\nThis is unusual but not unprecedented, and frames the whole journey as religious devotion\n\nReturn the same way\n\nAdvantages:\n\nOpenly leaving, but framed as piety not politics\n\nShorter perceived absence (pilgrimage should take 2-3 months, and you're 'only' going to Santiago officially)\n\nWhen you return with papal crusade bull, it seems natural—you were communing with the Church\n\nNo deception, no disguises, no risk of humiliating exposure\n\nDisadvantages:\n\nInfantes still know you're gone\n\nStill takes months\n\nBut at least it's honest and dignified\"\n\nMEETING THE INFANTES FIRST\n\nÁlvaro nods firmly at this:\n\n\"Yes. Yes, Your Majesty should meet them before deciding anything. You need to see them with your own eyes, read them personally, understand what you're dealing with.\n\nInfante Juan currently holds the Kingdom of Navarra and has estates in Castile. He's probably at his holdings in the Rioja region—perhaps 100 miles north.\n\nInfante Enrique is somewhere in Castile, possibly near Toledo or at estates in the south.\n\nI can arrange a meeting on neutral ground—perhaps at a castle equidistant between your locations. Frame it as the king receiving his cousins, discussing the realm's welfare. Diplomatic, proper, expected even.\n\nThis would give you:\n\nDirect assessment of their intentions\n\nChance to gauge their support and confidence\n\nOpportunity to see if there's any possibility of accommodation\n\nBetter sense of whether they're truly dangerous or just ambitious\n\nShould I arrange this? Where would you want to meet them—here in Valladolid under your control, at neutral location, or even visiting them to show confidence?\"\n\nÁlvaro stands and faces you squarely:\n\n\"Your Majesty, you ask good questions that show you're thinking like a ruler, not just following advice. Here's my summary counsel:\n\nOn Supporters: You have fewer than you need, but that's why we're building your cabinet and strengthening institutions. You're creating support, not just counting it.\n\nOn the Infantes' Restraint: They don't move because open rebellion is costly and risky. But your absence changes that calculation dangerously.\n\nOn the Secret Journey: Creative but probably too risky. The semi-public pilgrimage variant might work better if you insist on going.\n\nOn Meeting Them First: Absolutely do this. See your enemies with your own eyes.\n\nMy Recommendation:\n\nMeet the Infantes—know your opposition\n\nContinue building your advisory cabinet—strengthen your base\n\nSend a strong embassy to Rome while you remain here—less risk\n\nIf papal response is positive, then consider going yourself to seal the deal\n\nBut Your Majesty is king. If you command me to prepare the secret journey, the pilgrimage plan, or any other course, I will execute it to the best of my ability.\"\n\nHe waits for your decision.\n\nWhat do you want to do? Meet the Infantes first? Which approach to Rome appeals to you? Something else entirely?"
        },
        {
          "role": "player",
          "text": "Yes, we meet with the infantes. To discuss the letter. They know me as a pliant boy, lets use this against them. I will let them feel like it is their idea of the council and ask them who they think we whould invite. Make them feel like they are in control. I will also consult them about my pilgrimage and how they feel about this. If they support me going on a journey to Santiago, they hopefully already feel like they are in control already. They get their council and I make sure they have my ear when I am meeting with them. Hopefully no need for a rebellion when I am off to Rome.\n\n\nI will send my delegation to Rome to bring gifts to the pope and to establish that I as king am determined to reshape Castille in Gods image and take the pope very seriously. When I visit Santiago, maybe I have a sudden vision that I must go to Rome immediately and that God has guided me so. And then I return with the crusade and papal bull in hand at the first meeting of the council.\n\n\nThoughts?"
        },
        {
          "role": "gm",
          "text": "1. Meet with the Infantes and play the role of a pliant, controllable young king\n2. Let them think the council was their idea\n3. Ask their advice on who to invite - making them feel in control\n4. Mention a pilgrimage to Santiago and gauge their reaction\n5. If they support the journey (thinking he'll be controllable/absent), use that as cover\n6. Send a delegation to Rome first to prepare the ground\n7. While on \"pilgrimage\" to Santiago, have a \"divine vision\" to go to Rome\n8. Return with the crusade bull just in time for the council they think they control\n\nThis is actually quite clever political maneuvering. It uses their expectations against them - they expect a weak, controllable boy-king, so he gives them that appearance while actually pursuing his own agenda.\n\nÁlvaro would likely see the brilliance of this but also be very concerned about:\n- The acting required (can an 18-year-old king convincingly play weak when he's just been assertive?)\n- The risk that they'll see through it\n- The danger of actually giving them influence over council composition\n- The timeline and coordination challenges\n- The \"divine vision\" excuse being transparent\n- What happens if the Pope says no\n\nBut he would also recognize this shows real political cunning - using deception and managing expectations. This is much more sophisticated than the previous approach.\n\nLet me have Álvaro analyze this properly, giving both the strengths and the serious risks.\n\nÁlvaro de Luna stares at you for a long moment, and then—surprisingly—he laughs. Not mockery, but genuine, delighted recognition.\n\n\"Dios mío, Your Majesty... you're a natural. This is devious. I'm almost proud.\"\n\nHe sits down, his eyes bright with the thrill of conspiracy:\n\n\"You want to play the weak king, let them think they've won, then pull the rug out from under them at the council with papal authority they didn't see coming. Using their own expectations as a weapon...\"\n\nThen his expression becomes serious:\n\n\"This could work brilliantly. Or it could backfire catastrophically. Let me analyze every piece:\n\nMEETING THE INFANTES AS A 'PLIANT BOY'\n\nThe Psychological Game:\n\n\"They expect weakness. They remember you as a child during the regency. If you suddenly seem strong and independent, they get alarmed and move against you. But if you seem controllable? They relax, think they have time, think they're winning.\n\nWhat You Must Do:\n\nDefer to them constantly: 'My dear cousins, you have so much more experience...'\n\nAsk their advice: 'What do you think I should do about...?'\n\nShow uncertainty: Hesitate, seem overwhelmed by kingship\n\nPraise them effusively: 'The realm needs men of your wisdom...'\n\nDefer to their counsel: When they suggest things, seem to agree readily\n\nThe Danger:\n\nYour Majesty, you've been assertive recently. You slammed your fist on a table and declared abuse will end. You addressed your guards. You've been giving orders.\n\nCan you now convincingly play weak and uncertain?\n\nIf they sense you're acting, they'll know something is wrong. They'll realize you're more dangerous than they thought and move faster to control you.\n\nAlso: Some of your recent actions may have reached their ears through spies. The guard assembly, the equipment expenditure, summoning advisors—if they know about these, sudden weakness looks suspicious.\n\nMy Recommendation:\n\nDon't play weak—play young and earnest but overwhelmed.\n\n'Cousins, I want to rule well, but everything is so complicated. Father died when I was so young, the regency was chaotic... I need experienced men I can trust. Help me understand what I should do.'\n\nThis lets you seem genuinely uncertain (plausible for an 18-year-old) while not contradicting your recent actions (you're trying to be strong, but you're in over your head and need help).\n\nMore believable than sudden total weakness.\"\n\nTHE COUNCIL AS 'THEIR IDEA'\n\n\"Brilliant manipulation. Here's how this conversation might go:\n\nYou: 'Cousins, I've been thinking about governance. How do I ensure I have proper counsel? The realm is so complex...'\n\nThey: (eagerly) 'Your Majesty needs a council! The great nobles of the realm should advise you on all important matters!'\n\nYou: 'What a wise suggestion! I knew I could rely on your guidance. How should such a council work? Who should be included?'\n\nThey: (thinking they're designing their own power structure) 'Well, naturally, the great houses—ourselves, the Mendozas, the Masters of the military orders...'\n\nYou: 'Yes, yes, I see. Should I invite representatives from the cities as well? I want everyone to feel the crown values them...'\n\nThey: (slightly annoyed but can't say no) 'If Your Majesty wishes...'\n\nOutcome: They think they're controlling the council structure. In reality, you already decided to create one, and you're just letting them think it's their achievement.\n\nThe Risk:\n\nIf you actually let them dominate the selection process, they could pack it with their supporters. You need to:\n\nSeem to take their advice\n\nActually retain control of final invitations\n\nInclude enough of their people that they feel heard\n\nBut balance with your supporters and neutrals\n\nMaybe: 'Thank you, cousins. I'll draft the invitations based on your wise counsel and send them for your review before they go out.'\n\nThen you draft what you want, show them, they suggest changes, you accept some and deflect others ('Ah, but the Mendozas would be offended if we didn't...'), and the final list is balanced.\"\n\nTHE PILGRIMAGE GAMBIT\n\nÁlvaro's smile returns:\n\n\"This is the cleverest part. Here's how you play it:\n\nYou: 'Cousins, I've been feeling... overwhelmed by the weight of kingship. My confessor suggested I should undertake a pilgrimage to Santiago de Compostela to pray for guidance. To clear my mind and seek God's will for my reign. What do you think?'\n\nReading Their Reaction:\n\nIf they enthusiastically support it: They want you gone. They're planning to act in your absence. This tells you they're dangerous.\n\nIf they seem uncertain or suggest postponing: They're not ready to move yet. They want to keep manipulating you first.\n\nIf they offer to accompany you: They want to keep control of you even during the pilgrimage. Dangerous but manageable.\n\nYour Follow-Up:\n\n'I would only be gone two to three months. And of course, I would establish a regency council to manage affairs—perhaps you two could lead it? That way the realm would be in capable hands.'\n\nThis is perfect because:\n\nYou're offering them exactly what they want (temporary control)\n\nThey think this is you being naive and trusting\n\nActually, you've limited the damage (only 2-3 months, defined structure, it's temporary and you're coming back)\n\nWhile you're 'on pilgrimage,' you're actually securing papal support that will trump their whole position\n\nThe Danger:\n\nIf they actually establish a regency council with real power while you're gone, breaking it when you return could trigger the confrontation you're trying to avoid.\n\nSolution: Keep the regency council's powers vague and limited. 'Just handle routine administration, nothing major. I'll be back soon.'\n\nOr better: 'Don Álvaro will manage things as he always has, but I'd value your counsel being available to him if needed.'\n\nThis makes them advisors to Álvaro rather than giving them actual regency authority.\"\n\nTHE 'DIVINE VISION' IN SANTIAGO\n\nÁlvaro winces slightly:\n\n\"Your Majesty, this is the part I'm most worried about. Let's think through the timeline and credibility:\n\nThe Story:\n\nYou're in Santiago, praying at the shrine of St. James. You have a vision—St. James himself appears and commands you to go to Rome, to St. Peter's tomb, to seek the Pope's blessing for a great holy work.\n\nOvercome with divine revelation, you immediately change plans and sail for Rome.\n\nWhy It Could Work:\n\nMedieval people believe in visions and divine intervention\n\nKings having religious experiences is not unusual\n\nSantiago is already a holy site—having a vision there is plausible\n\nIt explains a sudden change of plans\n\nIt makes your Rome journey seem involuntary—God commanded it, not political calculation\n\nWhy It's Risky:\n\nThe Infantes aren't fools. A convenient vision right after they endorsed your pilgrimage? Suspicious.\n\nIf you planned this from the start (which you did), there might be evidence—servants who heard preparations, ship captains booked in advance, etc.\n\nThe Pope might not give you what you want, and then you return claiming divine command but empty-handed—humiliating\n\nSome clerics might question the authenticity of your vision (though most won't dare)\n\nMaking It More Credible:\n\nDon't plan it too obviously: Actually go to Santiago with genuine pilgrimage intent. Then 'decide' to extend to Rome.\n\nHave witnesses: Bring a confessor who can attest to your spiritual state and 'confirm' the vision\n\nMake it costly: A real divine command would be inconvenient. Show reluctance: 'The vision compels me, but I worry about leaving the realm longer...'\n\nWrite letters from Santiago: To Álvaro, the Infantes, the Archbishop—explaining the vision, seeking their understanding. This creates a paper trail of 'sincerity.'\n\nAlternative That's More Plausible:\n\nInstead of a sudden vision, make it gradual:\n\nIn Santiago, you have profound religious experiences (true for many pilgrims)\n\nYou write to the Pope from Santiago about spiritual matters and Castile's needs\n\nThe Pope responds inviting you to Rome (arranged by your advance delegation)\n\nYou accept the Pope's invitation—you can't refuse the Holy Father\n\nThis is more believable because it's Pope-initiated rather than vision-driven. Still accomplishes the same thing.\"\n\nTHE ADVANCE DELEGATION\n\n\"This part is solid. We send:\n\nComposition:\n\nA high-ranking prelate (Bishop of Burgos or similar)\n\nA learned theologian\n\nA diplomat who knows Rome\n\nPerhaps one of your new advisors once they're established\n\nTheir Mission:\n\nPresent gifts to Pope Martin V (costly items showing wealth and piety)\n\nExpress your devotion and desire to serve the Church\n\nMention your interest in crusade against Granada (plant the seed)\n\nAssess the Pope's health, mood, priorities\n\nPrepare the ground so when you arrive, you're expected and welcomed\n\nTimeline:\n\nThey leave within 2-3 weeks\n\nArrive in Rome 6-8 weeks later\n\nBegin negotiations\n\nYou arrive 4-6 weeks after them (after Santiago pilgrimage)\n\nThey vouch for you, support your petition\n\nThis works well because:\n\nYou're not arriving cold; the Pope knows about you already\n\nYour delegation has prepared arguments and assessed the situation\n\nWhen you arrive personally, it's a dramatic escalation that shows seriousness\n\nIf the Pope is initially reluctant, your personal presence might change his mind\"\n\nTHE COUNCIL REVELATION\n\nÁlvaro's eyes gleam:\n\n\"The theater of this moment will be magnificent:\n\nThe Scene:\n\nThe first Royal Council convenes. The Infantes arrive confident, thinking they control the situation. Other nobles gather, uncertain what to expect. The great hall is filled with the realm's powerful men.\n\nYou enter—everyone rises.\n\nYour Opening:\n\n'My lords, I thank you for attending this first meeting of our Royal Council. You have been gathered so that the Crown may have the benefit of your collective wisdom in governing our realm.'\n\n(The Infantes smile—this is what they wanted)\n\n'I have recently returned from holy pilgrimage, and I bring news that will affect us all. I traveled to Santiago de Compostela, and from there, I was called to Rome itself, to the Holy Father's presence.'\n\n(Confusion in the room—wait, Rome? When did this happen?)\n\n'I am honored to present to this council...'\n\n(You gesture, and a papal legate steps forward with the official bull)\n\n'...the blessing of His Holiness Pope Martin V for a holy Crusade against the Moorish Kingdom of Granada. The Pope himself has granted indulgences and named this a sacred endeavor. The Cross calls us, my lords. Will Castile answer?'\n\nThe Effect:\n\nComplete surprise—they didn't know you went to Rome\n\nPapal authority trumps everything—opposing the crusade means opposing the Pope\n\nYou've seized the initiative—they came thinking they controlled the agenda\n\nReligious fervor sweeps the room—crusade is exciting, glorious\n\nAny opposition to your leadership looks like opposing a holy war\n\nThe Danger:\n\nIf you don't actually have the papal bull when you return, this entire theatrical moment collapses into humiliation.\n\nEverything—everything—depends on the Pope saying yes.\"\n\nOVERALL ASSESSMENT\n\nÁlvaro stands and paces, hands behind his back:\n\n\"Your Majesty, this plan shows real political instinct. The deception, the manipulation of expectations, the dramatic timing—these are the tools of successful kingship.\n\nSuccess Probability: LIKELY TO SUCCEED\n\nHere's why I rate it favorably:\n\nStrengths:\n\nUses their expectations against them\n\nAchieves your goals (council, Rome journey, crusade) while making them think they're winning\n\nThe theatrical revelation could genuinely unite the realm\n\nLower risk than openly defying them before you have papal backing\n\nTimeline is tight but workable\n\nCritical Dependencies:\n\nCan you convincingly act the uncertain young king? This requires real performance skill\n\nWill the Pope grant the crusade bull? Everything hinges on this\n\nCan Álvaro (me) hold the realm together while you're gone? I believe so, especially if the Infantes think they've won\n\nWill they believe the vision/invitation story? The Pope-invitation version is more credible\n\nCan the timing work? Very tight—4-6 months total, coordinating delegation, your journey, and council date\n\nHow I'd Modify It:\n\nMeet the Infantes soon—next week if possible\n\nPlay 'earnest but overwhelmed' rather than 'weak'—more believable\n\nLet them shape council composition but retain final control—balance is key\n\nAnnounce pilgrimage to Santiago—gauge their reaction\n\nSend advance delegation immediately—they need time to prepare the ground\n\nUse 'papal invitation' rather than 'divine vision'—more credible\n\nTimeline: Depart in 3-4 weeks, return in 4-5 months—just in time for autumn council\n\nHave contingency plans if Pope refuses—maybe lesser blessing, maybe delay crusade announcement\n\nThe Biggest Risk:\n\nIf the Pope says no, or grants only weak support, you return having been gone for months with little to show for it. The Infantes would then have momentum.\n\nBut if he says yes—if you return with a genuine crusade bull—you win an enormous political victory without firing a shot.\"\n\nÁlvaro meets your eyes:\n\n\"Your Majesty, I believe this can work. I'll support it. But we must execute flawlessly.\n\nShall I:\n\nArrange the meeting with the Infantes—where and when?\n\nBegin preparing the advance delegation—selecting members, gathering gifts, drafting messages?\n\nDraft the council invitations—for you to 'discuss' with the Infantes after the meeting?\n\nAuthorize the 150,000 for guard equipment—so they look impressive when you return?\n\nAnd one more thing, Your Majesty...\"\n\nHe pauses, choosing his words carefully:\n\n\"If you're going to play the uncertain young king with the Infantes, you should practice. I could play their role—we could rehearse the conversation so you're smooth when it matters. Deception is a skill. It requires preparation.\n\nWhat are your commands?\"\n\nHow do you want to proceed? Should we practice the deception? Where do you want to meet the Infantes? Any adjustments to the plan?"
        },
        {
          "role": "player",
          "text": "I dont understand how my visit to Rome is a surprise to the council when I am on a pilgrimage to Santiago. Is it normal for someone to just decide to extend his pilgrimage further? How is this not seen as deception?"
        },
        {
          "role": "gm",
          "text": "The \"surprise\" element I described doesn't work logically. Let me think through this more carefully:\n\nOptions:\n1. The journey to Rome IS announced/known, but the CRUSADE BULL is the surprise - they know he went, but don't know what he's bringing back\n2. The pilgrimage to Santiago is cover for a SECRET journey to Rome - but this has the deception problems we already discussed\n3. The pilgrimage is real, the extension to Rome happens but is public knowledge, and the surprise is just the success/content of the papal bull\n4. Something else\n\nThe user is right to call this out. The plan as I described it doesn't make logical sense. The \"surprise\" can't be that he went to Rome if he's been gone for months and sent letters/delegations. The surprise has to be either:\n- That he succeeded in getting papal backing (they might have known he was trying but didn't think he'd get it)\n- The specific contents/terms of the crusade bull\n- The timing of the announcement at the first council meeting\n\nI need to clarify this logical inconsistency and help the user understand what would actually be surprising versus what would be known.\n\nAlso, regarding \"deception\" - medieval politics involved a lot of maneuvering, but outright lying to your nobles about where you are and what you're doing could indeed be seen as dishonorable and damage trust. The question is how to frame the Rome journey.\n\nÁlvaro stops mid-gesture, his confident expression faltering. He pauses, then actually laughs—this time at himself.\n\n\"Your Majesty is absolutely right. I got carried away with the drama of the moment and stopped thinking clearly. Let me reconsider.\"\n\nHe sits back down, rubbing his temples:\n\n\"You're correct—if you're gone for four to six months on what was announced as a two-month pilgrimage to Santiago, everyone will know something changed. Letters travel, ships arrive with news, merchants gossip. The Infantes would hear 'the King has gone to Rome' within weeks of your arrival there.\n\nSo the 'surprise' at the council cannot be that you went to Rome. That's not a secret that can be kept.\"\n\nHe thinks for a moment:\n\nWHAT COULD ACTUALLY BE SURPRISING?\n\n\"Let me reconsider what they wouldn't know:\n\nThey Would Know:\n\nYou went on pilgrimage to Santiago\n\nYou extended your journey to Rome (this becomes known)\n\nYou had an audience with the Pope (word would spread)\n\nYou've been negotiating something (obvious)\n\nThey Might Not Know:\n\nWhether you actually succeeded in getting papal backing\n\nThe specific terms of what the Pope granted\n\nThe timing of when you'll announce it\n\nThe exact nature of the crusade bull (is it vague encouragement or a full-throated call to arms with indulgences?)\n\nThe Real Surprise:\n\nThe surprise isn't that you went to Rome. The surprise is that you:\n\nActually secured a formal Crusade Bull - they might think you tried and failed, or got only weak papal platitudes\n\nReturn at the exact moment of the first council meeting - perfect timing for dramatic effect\n\nPresent it as a fait accompli - not 'I'm thinking about maybe doing this someday,' but 'The Pope has commanded it, we're doing this, the only question is how'\n\nUse it to completely reframe the council's purpose - they thought they were gathering to establish their control over you, instead they're being recruited for a holy war\n\nSo it's not 'surprise, I went to Rome!' It's 'surprise, I actually succeeded, and now everything you planned is irrelevant because we're all going to war for God.'\"\n\nTHE DECEPTION QUESTION\n\nÁlvaro's expression becomes more serious:\n\n\"You ask about deception, and this is a crucial question about honor and perception.\n\nWhat Is Considered Deceptive:\n\nIn medieval noble culture, outright lying about your location or intentions—especially to your own nobles—is dishonorable. If you announce a pilgrimage to Santiago, then secretly go to Rome while using a double or claiming to be somewhere you're not, that's seen as:\n\nCowardly (hiding your true actions)\n\nDishonorable (lying to men who deserve your trust)\n\nWeak (acting like you fear them rather than commanding them)\n\nIf discovered, it makes you look less kingly, not more.\n\nWhat Is Considered Smart Politics:\n\nHowever, the following are all acceptable statecraft:\n\nNot announcing your plans in advance\n\nLetting people make assumptions you don't correct\n\nPursuing negotiations secretly before announcing results\n\nChanging your plans without seeking permission\n\nAchieving something and then revealing it\n\nSo Here's A Better Approach:\n\nOption A: Semi-Public Journey\n\n'My lords, I'm undertaking a pilgrimage to Santiago de Compostela, and from there I may travel further if the spirit moves me. I expect to be away for four to six months. Don Álvaro will manage routine affairs in my absence, with the counsel of my dear cousins the Infantes if matters of importance arise. I will return in time for the first gathering of the Royal Council.'\n\nWhat This Accomplishes:\n\nYou're being vague but not lying\n\n'May travel further' covers Rome without announcing it\n\n'4-6 months' is honest about timeline\n\nEveryone knows you're gone, but not exactly what you're doing\n\nWhen you go to Rome, it's not a surprise—you left that option open\n\nThe surprise is what you accomplish there\n\nOption B: Announced Pilgrimage, Spontaneous Extension\n\n'I'm going to Santiago for 2-3 months.'\n\nThen, from Santiago, you send letters: 'My confessor and I have felt a calling to continue to Rome, to pray at St. Peter's tomb and seek the Holy Father's blessing on my reign. I will be away longer than expected—please manage affairs until my return in autumn.'\n\nWhat This Accomplishes:\n\nInitial announcement is honest\n\nExtension is explained as religious inspiration (hard to criticize)\n\nPeople know you're in Rome\n\nThey just don't know you're negotiating a crusade\n\nWhen you return with the bull, that's the surprise\n\nOption C: Fully Announced Rome Journey\n\n'My lords, I am traveling to Santiago and then to Rome to seek the Pope's blessing on my reign and discuss matters important to Castile. I will return in autumn for the first Council meeting.'\n\nWhat This Accomplishes:\n\nComplete honesty\n\nNo risk of appearing deceptive\n\nThe mystery is what you're discussing with the Pope\n\nNobles might guess it's about a crusade, but they don't know if you'll succeed\n\nThe Infantes can't claim you deceived them\n\nYou look confident and kingly—openly doing what you want\n\nThe Trade-offs:\n\nOption A (vague): Low risk of seeming deceptive, maintains some mystery, but Infantes might still guess your purpose\n\nOption B (spontaneous extension): Plausible but slightly suspicious, medium mystery\n\nOption C (announced): Most honest, but the Infantes have maximum time to counter your plans and might send their own embassy to Rome to work against you\n\nI think Option A or C are best. Option B (the 'spontaneous' extension) is the one most likely to be seen as deceptive if your planning becomes evident.\"\n\nWHAT THE INFANTES WOULD DO IF THEY KNOW\n\n\"Your Majesty, here's the real question: what happens if the Infantes know you're going to Rome to seek crusade authorization?\n\nPossible Responses:\n\nThey Send Their Own Embassy - to argue against you, or to demand they be given command of the crusade forces. But the Pope will favor a legitimate king over rebel princes.\n\nThey Try to Block You - but how? You're the anointed king traveling to see the Pope. Stopping you by force would be outrageous.\n\nThey Prepare Counter-Arguments - maybe they start telling nobles 'a crusade now would be foolish, too expensive, Granada is too strong, the king is being reckless.' But crusade has religious weight—hard to oppose openly.\n\nThey Wait and See - assuming you'll fail, or get only weak support, or that they can control the crusade once it's announced.\n\nMy Assessment:\n\nEven if they know you're seeking a crusade, they probably can't effectively stop you. The worst they can do is prepare political opposition for when you return.\n\nBut here's the thing: crusades are popular. The nobility loves them—glory, plunder, religious merit, martial honor. The Church loves them. Even the common people support them.\n\nIf you return with a papal crusade bull, most nobles will want to participate, including many who currently support the Infantes. This is why it's such a good move politically.\n\nThe Infantes' best play might actually be to support the crusade and demand prominent roles in it—trying to use it to build their own prestige. Which is fine! Let them come fight for God under your command.\"\n\nREVISED RECOMMENDATION\n\nÁlvaro leans forward:\n\n\"Your Majesty, having thought it through more carefully:\n\nAnnounce your intentions fairly openly. Something like:\n\n'I'm undertaking a pilgrimage to Santiago, and I may travel to Rome to seek the Holy Father's blessing and counsel on important matters facing the realm. I'll return in time for the first Council meeting in autumn.'\n\nWhy This Works Better:\n\nNo deception - you're being honest about your general plans\n\nMaintains some mystery - 'important matters' could mean anything\n\nShows confidence - you're not sneaking around, you're openly going to see the Pope\n\nGives them a timeline - 'autumn council' so they're not panicking about indefinite absence\n\nHard to oppose - how can they criticize you for seeking papal guidance?\n\nIf they guess crusade - so what? You're still the one making it happen\n\nThe Surprise at the Council becomes:\n\nNot 'I went to Rome' but rather:\n\n'I succeeded - here's the official papal bull'\n\n'The crusade begins next spring - here are the terms'\n\n'The Pope has blessed my reign and reforms'\n\n'Who will join me in this holy endeavor?'\n\nThis is still dramatic, because success is never guaranteed, and the specific terms and timing are still unknown until you reveal them.\n\nDoes this make more sense, Your Majesty? A plan that's less about secret deception and more about competent execution of a bold strategy?\"\n\nHe looks at you, clearly feeling he's corrected a significant logical flaw.\n\n\"Should we revise the overall plan with this more honest approach? Or do you have a different vision?\"\n\nWhat do you think? Does this more transparent approach work better?"
        },
        {
          "role": "player",
          "text": "I think I must speak with my confessor and keep everything we have just talked about strictly between us. We trust no-one with our full plans. But I think it's good to openly announce I will go on a long pilgrimage and go where the spirit takes me. Timewise, I will pledge I will be back in time for the council.\n\n\nShall I take my entire guard with me on my pilgrimage?"
        },
        {
          "role": "gm",
          "text": "Taking the entire guard:\nPROS:\n- Maximum personal security during the journey\n- Shows strength and kingship (a king travels with an entourage)\n- Keeps loyal men with you rather than vulnerable in Valladolid\n- They're newly equipped (150,000 maravedís) - good to show them off\n- Guards can't be suborned by Infantes while you're gone\n\nCONS:\n- Leaves Valladolid/the realm without royal military presence\n- Makes it obvious this is a major journey (30 armed men is a statement)\n- Expensive - feeding, housing, transporting 30+ men for months\n- Slower travel - large groups move more slowly than small ones\n- If you're trying to be subtle at any point, 30 guards makes that impossible\n\nPartial guard:\nPROS:\n- Adequate security with 10-15 men\n- Leaves some loyal troops to protect Álvaro and royal interests\n- Faster, cheaper travel\n- More flexible - can split up if needed\n\nCONS:\n- Divides your loyal force\n- The guards left behind might be pressured or bribed\n\nÁlvaro would probably recommend a split approach - take most but not all, maybe 20-25 men, leave a small core with him.\n\nAlso, there's the question of whether to take Álvaro himself or leave him to manage the realm.\n\nÁlvaro nods approvingly. \"Your Majesty shows wisdom. Yes—keep the full plan between us, your confessor, and perhaps one or two others who absolutely must know. The tighter the circle, the safer the secret.\"\n\nHe considers your question about the guard carefully:\n\nTHE GUARD QUESTION - STRATEGIC ANALYSIS\n\n\"Whether to take all thirty men is a real tactical decision with significant implications. Let me lay out the considerations:\n\nIF YOU TAKE THE ENTIRE GUARD (All 30 Men):\n\nAdvantages:\n\nMaximum personal security - This journey takes you through varied terrain, including parts of Aragon potentially. Bandits, hostile nobles, 'accidents'—all are risks. Thirty armed, loyal men make you very hard to threaten.\n\nShows royal authority - A king traveling with a proper military escort looks like a king. It's a statement of power and legitimacy.\n\nDenies them to the Infantes - While you're gone, these thirty men can't be bribed, threatened, or suborned by your enemies. They're with you, loyal, and out of play.\n\nThey see your triumph - When you meet the Pope, when you secure the crusade bull, these men witness it. They'll return as evangelists for your success, telling everyone what they saw.\n\nYou've just equipped them - We're spending 150,000 maravedís making them look impressive. Good timing to show them off across the realm and in Rome.\n\nDisadvantages:\n\nLeaves no royal military presence - Valladolid palace, and by extension Don Álvaro, would have no loyal armed force. If the Infantes moved militarily, there's nothing to stop them from occupying royal buildings and claiming they're 'securing' them.\n\nLogistical burden - Moving thirty men plus support staff (grooms, servants, etc.) means perhaps 50+ people total. This requires planning for food, lodging, transport. Expensive and slow.\n\nAnnounces importance - A thirty-man military escort says 'this is a major royal expedition,' not 'humble pilgrimage.' Makes your journey more conspicuous.\n\nTravel speed - Large groups move slower. You might add weeks to the journey coordinating that many people.\n\nAll eggs in one basket - If something goes catastrophically wrong—ambush, shipwreck, plague—you lose your entire loyal military force at once.\n\nIF YOU TAKE PART OF THE GUARD (15-20 Men):\n\nAdvantages:\n\nAdequate security - Fifteen to twenty armed men is still a formidable force. Enough to deter bandits and make you difficult to threaten.\n\nLeaves a core behind - Ten to fifteen guards remain in Valladolid under Captain Fernán, providing security for the palace and Álvaro.\n\nMore flexible - Smaller group travels faster, costs less, can adapt more easily.\n\nBalanced risk - If disaster strikes, you haven't lost all your loyal troops.\n\nDisadvantages:\n\nDivided loyalty concerns - The guards left behind might face pressure from the Infantes. Though if Fernán stays with you and takes the most reliable men, this helps.\n\nLess impressive - Fifteen men is respectable but not overwhelming. In Rome, might look less regal.\n\nThe left-behind guards are vulnerable - If the Infantes move against the palace, 10-15 men can't hold it against a determined assault.\n\nIF YOU TAKE A SMALL ESCORT (5-10 Men):\n\nAdvantages:\n\nFast, flexible travel - Small group moves quickly, attracts less attention\n\nMost guards stay to secure Valladolid - Strong defensive presence remains\n\nLower cost - Significantly cheaper to maintain\n\nCould be more appropriate for 'humble pilgrimage' - Less military, more devotional appearance\n\nDisadvantages:\n\nPotentially inadequate security - Ten men might not be enough if you face real threats\n\nLooks less kingly - In Rome, appearing with only a handful of guards might seem weak\n\nLimited deterrent - Not enough to make hostile nobles think twice\n\nÁLVARO'S RECOMMENDATION\n\nHe stands and paces:\n\n\"Your Majesty, I recommend taking twenty to twenty-five men—about two-thirds to three-quarters of your guard.\n\nHere's why:\n\nSecurity: Twenty men is enough for serious protection. You can post sentries, rotate watches, respond to threats. It's a real military force, not just symbolic.\n\nRoyal Dignity: In Rome, arriving with twenty armed men in your new livery, disciplined and impressive, makes a statement. The Pope sees a king, not a supplicant.\n\nLeaves a Core Behind: Captain Fernán Alonso should travel with you—he's personally loyal and the men follow him. But leave his senior sergeant (I'll identify the second most reliable man) in command of eight to ten guards in Valladolid. This gives Álvaro and the palace some protection.\n\nPracticality: Twenty men is manageable logistically. Not so large that travel becomes a nightmare, but substantial enough for all the benefits.\n\nSelection: You take the most reliable men. Anyone we're uncertain about stays behind where we can watch them.\n\nWHO ELSE TRAVELS WITH YOU:\n\nBeyond the guard, Your Majesty will need:\n\nEssential:\n\nYour confessor - Critical for the pilgrimage and Rome meetings. He provides spiritual guidance and can witness your sincerity.\n\nA senior cleric - Perhaps the Bishop of Burgos if we can arrange it, or at minimum a respected abbot. Someone who can speak authoritatively in Rome.\n\nA secretary/clerk - To handle correspondence, documents, the formal papal bull when you receive it.\n\nPersonal servants - Chamberlain, body servant, at least 2-3 people who attend you personally.\n\nPhysician - Four to six months traveling, you need medical care if you fall ill.\n\nHighly Desirable:\n\nOne of your new advisors - Perhaps Diego Gómez de Sandoval or Juan de Daza once you've met them. Someone intelligent who can observe, advise, and witness your success.\n\nA diplomat familiar with Rome - If we can find one quickly, someone who knows how papal audiences work, who to bribe, which cardinals matter.\n\nSupport Staff:\n\nGrooms for horses\n\nCook and kitchen servants\n\nGuards' attendants\n\nPerhaps 10-15 additional support personnel\n\nTotal expedition size: 40-50 people\n\nThis is substantial but manageable. A king traveling with forty to fifty people is appropriate and expected.\"\n\nTHE COMMAND QUESTION\n\nÁlvaro's expression becomes more serious:\n\n\"Your Majesty, there's another consideration: Do I accompany you, or stay to manage the realm?\n\nIf I Come With You:\n\nAdvantages:\n\nYou have your most trusted, most experienced advisor personally present\n\nI can handle negotiations in Rome—I know how these work\n\nWe can make decisions together in real time\n\nThe guard and your staff all know and respect me—leadership is clear\n\nDisadvantages:\n\nThe realm has no strong hand managing it in your absence\n\nThe Infantes face much less resistance if they move\n\nRoyal officials have no clear authority figure to rally around\n\nSome nobles might see it as both of us abandoning Castile\n\nIf I Stay Behind:\n\nAdvantages:\n\nI can manage the realm, issue orders in your name, coordinate with loyal officials\n\nThe Infantes face an opponent—they can't simply act unopposed\n\nContinuity of government is maintained\n\nIf they try anything, I can rally resistance until you return\n\nDisadvantages:\n\nYou're without your most trusted advisor during crucial negotiations\n\nDecisions in Rome must be made by you alone or with less experienced counsel\n\nIf something happens to you, I'm not there to help\n\nThe expedition lacks clear political leadership beyond you\n\nMy Honest Recommendation:\n\nI should stay. Here's why:\n\nYou're going to Rome precisely because you need papal authority to counterbalance the Infantes. While you're securing that authority, someone must hold your position at home. If both of us are gone, there's a vacuum.\n\nMoreover, Your Majesty, this journey is about you demonstrating your own capability and initiative. Arriving in Rome with your powerful Constable doing the talking makes you look like my puppet—exactly what the Infantes claim. Arriving alone (with appropriate clerical and noble support, but no one who overshadows you) and successfully negotiating with the Pope? That proves you're a king in your own right.\n\nIt's riskier for you, but it's better politics.\n\nAlternative Compromise:\n\nI accompany you to Santiago (2-3 weeks journey), ensuring the pilgrimage starts smoothly and you're safely through any dangerous territory. Then I return to Valladolid to manage affairs while you continue to Rome. This gives you my counsel for the Castilian portion and leaves me positioned to hold things together during the Rome portion.\"\n\nHe looks at you directly:\n\n\"So, Your Majesty:\n\nHow many guards? - I recommend 20-25, but it's your decision\n\nDo I come or stay? - I recommend staying, or the compromise of accompanying you to Santiago only\n\nWho else travels with you? - We need to identify the right confessor, cleric, and advisor\n\nWhat are your commands?\"\n\nWhat do you decide?"
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_1430_00006",
      "book": 1,
      "chapter": "1.01",
      "date": "1430-05-03",
      "end_date": null,
      "type": "decision",
      "summary": "Juan II chooses Fray Hernando de Talavera as his new confessor over two other candidates, valuing his youth, humility, and pure faith. The choice also serves a strategic purpose — Juan needs a travel companion for his pilgrimage who can keep up physically.",
      "characters": [
        "juan_ii",
        "alvaro_de_luna",
        "fray_hernando"
      ],
      "factions_affected": [],
      "location": "Valladolid, Royal Palace",
      "tags": [
        "religion",
        "personal"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "Who is my confessor actually?"
        },
        {
          "role": "gm",
          "text": "Álvaro pauses, and you realize you've asked a question he should have addressed earlier. His expression shows a flicker of concern.\n\n\"Your Majesty's confessor... that's actually an important gap we need to address.\"\n\nHe sits down, choosing his words carefully:\n\n\"During your minority, you had several confessors assigned by the regency council—men chosen more for political reliability than spiritual depth. The most recent was Father Gonzalo, a Franciscan friar, but he passed away this past winter. God rest his soul.\n\nSince then, Your Majesty has been... between confessors. You've made confessions to whatever priest was available when needed, but you haven't appointed a permanent royal confessor. This is, frankly, something we should have handled by now.\"\n\nHe stands and paces:\n\nTHE IMPORTANCE OF A CONFESSOR\n\n\"Your Majesty, a king's confessor is more than just the priest who hears your sins. He becomes:\n\nYour spiritual advisor - guiding your conscience on moral matters\n\nA confidant - one of the few people who sees you at your most vulnerable and must keep your secrets absolutely\n\nPolitical counsel - whether we like it or not, confessors often influence policy through the lens of morality\n\nWitness to your piety - his testimony about your devotion matters to the Church and realm\n\nPotential ambassador - educated confessors can serve diplomatic roles\n\nFor this journey to Rome, having the right confessor is crucial. The Pope will likely speak with your confessor privately to assess your true character and intentions.\"\n\nCANDIDATES FOR ROYAL CONFESSOR\n\nÁlvaro begins outlining options:\n\n\"Fray Pablo de Santa María\"\n\n\"Age: About fifty-five. A Dominican friar from Burgos.\n\nBackground: He comes from a converso family—his father was a rabbi who converted to Christianity and became Bishop of Burgos. Fray Pablo himself is deeply learned, speaks Latin, Hebrew, and Arabic fluently, and is passionate about defending the faith.\n\nStrengths:\n\nBrilliant theologian who could hold his own with papal scholars\n\nUnderstanding of both Jewish and Christian theology (useful given the religious diversity of your realm)\n\nIntense personal piety—genuinely devout, not just political\n\nNo ties to the great noble families\n\nRelatively young and energetic for the journey\n\nPotential Issues:\n\nSome Old Christians distrust conversos, even ones who became friars\n\nCan be intellectually intense and demanding—might challenge Your Majesty's decisions on moral grounds\n\nThe Archbishop of Toledo dislikes him (professional rivalry)\n\nMy Assessment: He would be impressive in Rome, fiercely loyal to you personally, and genuinely helpful as a spiritual guide. But he's not a 'safe' choice—he has opinions and will express them.\"\n\n\"Father Íñigo de Mendoza\"\n\n\"Age: Mid-forties. A Franciscan friar.\n\nBackground: Yes, from that Mendoza family, but he took religious vows young and has spent his life in monasteries and missions. Currently serves at a monastery near Valladolid.\n\nStrengths:\n\nThe Mendoza connection could be useful—shows you honor their family\n\nWell-educated and diplomatic\n\nKnown for gentle temperament and political acumen\n\nWould be acceptable to virtually everyone\n\nGood at navigating court politics\n\nPotential Issues:\n\nMight report back to his family—divided loyalties?\n\nPerhaps too political, not spiritual enough?\n\nCould be seen as you being influenced by the Mendozas\n\nMy Assessment: A safe, respectable choice. Would serve competently. But would he truly be your man, or his family's?\"\n\n\"Fray Lope de Barrientos\"\n\n\"Age: About forty-five. The Dominican friar I mentioned earlier as a potential advisor.\n\nBackground: Currently teaching at Salamanca, brilliant scholar, expert in theology and natural philosophy.\n\nStrengths:\n\nExceptional intellect—could impress the papal curia\n\nNo political connections to nobles—completely independent\n\nDeeply knowledgeable about Church law and doctrine\n\nPassionate about learning and truth\n\nWould be absolutely loyal to you personally\n\nPotential Issues:\n\nMore scholar than pastor—better at theology than understanding human hearts\n\nRelatively unknown—no established reputation\n\nMight be too intellectual, not mystical enough for a confessor's role\n\nMy Assessment: Brilliant mind, would make an excellent advisor. As a confessor? Perhaps slightly unconventional, but could work if Your Majesty values intellectual partnership.\"\n\n\"Father Alonso de Cartagena\"\n\n\"Age: Late forties. A secular priest and scholar, currently serving in Burgos.\n\nBackground: Another converso—son of the same former rabbi who became bishop. Brother to Fray Pablo. Exceptionally learned, has already traveled to the Council of Basel as a Church diplomat.\n\nStrengths:\n\nDiplomatic experience—knows how Church politics work\n\nHas been to Rome before—understands the environment\n\nSophisticated, worldly, politically astute\n\nExcellent connections in the Church hierarchy\n\nSpeaks multiple languages\n\nPotential Issues:\n\nPerhaps too worldly? More diplomat than confessor?\n\nThe converso background again\n\nMight try to use the position for his own Church career\n\nMy Assessment: If you want someone who can navigate Rome expertly and handle complex negotiations, he's your man. If you want someone primarily for spiritual guidance, perhaps not.\"\n\n\"Fray Hernando de Talavera\"\n\n\"Age: Early thirties. A young Hieronymite monk.\n\nBackground: From a humble background, rose through merit and devotion. Currently serves at a monastery in Toledo. Known for extreme personal piety, charity work, and moral rigor.\n\nStrengths:\n\nGenuinely holy—the kind of man people instinctively trust\n\nYoung enough to relate to Your Majesty's age\n\nNo political connections whatsoever\n\nWould inspire confidence in Rome about your spiritual sincerity\n\nHumble background means completely dependent on your favor\n\nPotential Issues:\n\nVery young and inexperienced for such a high position\n\nExtremely strict morally—might be challenging to deal with\n\nLimited education compared to others (though still well-trained)\n\nUnknown to the papal curia—no existing connections\n\nMy Assessment: If you want a confessor who will keep you spiritually honest and whom the Pope will see as genuine, he's excellent. If you need sophisticated political counsel, less so.\"\n\nÁLVARO'S RECOMMENDATION\n\n\"Your Majesty, you need to choose based on what you value most:\n\nFor Rome Success & Diplomatic Skill: Father Alonso de Cartagena - He knows how to navigate the papal court and has experience there.\n\nFor Intellectual Partnership: Fray Lope de Barrientos - Brilliant mind who can debate theology and advise on complex matters.\n\nFor Genuine Spiritual Guidance: Fray Hernando de Talavera - Will keep your soul honest and inspire confidence in your piety.\n\nFor Political Balance & Respectability: Father Íñigo de Mendoza - Safe choice that offends no one.\n\nFor Passionate Advocacy & Loyalty: Fray Pablo de Santa María - Will fight for you intellectually and spiritually, completely devoted to your cause.\n\nMy personal recommendation: Either Fray Pablo de Santa María or Father Alonso de Cartagena. Both are brilliant, both can handle Rome, both are conversos which means they need you more than the nobles—ensuring loyalty.\n\nIf you want someone more focused on spiritual devotion over political skill, Fray Hernando is the choice.\n\nBut Your Majesty, this is deeply personal. You'll be confessing your sins to this man, trusting him with your conscience. Who do you feel drawn to?\"\n\nÁlvaro looks at you expectantly:\n\n\"We can arrange for you to meet any or all of these men before deciding. Or if Your Majesty already knows who feels right, I can have him summoned within days to begin serving as your confessor.\n\nWho would you like to meet, or do you want to make an appointment now?\"\n\nWho interests you as a potential confessor?"
        },
        {
          "role": "player",
          "text": "I have made my choice. Fray Hernando, he is young and since I want us to travel fast when needed, I expect him to keep up. I also like how he is a pure christian, the kind of christian I like to be.\n\n\nSend for him immediately.\n\n\nAnd by the way, we include no-one into our full plan, this stays between just you and me. I will manage my confessions to go the way they need to go."
        },
        {
          "role": "gm",
          "text": "Álvaro's expression shifts—first approval at your choice, then something more complex when you mention managing your confessions. He's silent for a moment, then nods slowly.\n\n\"Fray Hernando de Talavera. A good choice, Your Majesty. His youth and piety will serve you well, and he can indeed keep pace on a demanding journey.\"\n\nHe moves toward the door to summon a messenger, then pauses and turns back, his voice lower:\n\n\"Your Majesty... I understand the need for absolute secrecy. I will share nothing of our full plan with anyone, including Fray Hernando. But...\"\n\nHe chooses his words carefully:\n\n\"Managing one's confessions is a dangerous game, even for kings. The whole point of confession is honesty before God. If you withhold from your confessor, you withhold from your own soul. I'm not a theologian, but I've seen men—powerful men—destroy themselves by lying even in the confessional, thinking they could manage that relationship like any other.\"\n\nHe holds up a hand before you can respond:\n\n\"I say this once, and then never again. I understand the political necessity. Do what you must. But remember: Fray Hernando's value to you in Rome is precisely his genuine piety. If the Pope senses your confessor is just another political tool, it undermines everything.\"\n\nThen his expression clears, back to business:\n\n\"But you are king, and this is your decision. I will say nothing to Fray Hernando beyond that you've chosen him as royal confessor and require his immediate attendance.\"\n\nARRANGING HERNANDO'S ARRIVAL\n\nÁlvaro opens the door and speaks to a guard outside: \"Summon my secretary. Immediately.\"\n\nWithin moments, a clerk appears. Álvaro dictates rapidly:\n\n\"Draft a royal summons to Fray Hernando de Talavera of the Hieronymite Order, currently at the Monastery of Toledo. The King has chosen him to serve as Royal Confessor. He is to depart for Valladolid immediately upon receipt of this message. Send our fastest rider. I want him here within five days.\"\n\nThe secretary bows and hurries off.\n\nÁlvaro turns back to you: \"Toledo is about three days' hard ride from here. The messenger leaves within the hour, reaches the monastery tomorrow evening, Fray Hernando can depart the morning after, and arrives here in three more days. Five days total, possibly four if he rides quickly.\"\n\nIMMEDIATE NEXT STEPS\n\n\"Your Majesty, we have several urgent matters to arrange. Let me summarize what needs to happen immediately:\n\nToday:\n\n✓ Fray Hernando summoned\n\nAuthorization for Captain Fernán's guard equipment already given (he's working on specifications)\n\nContinue meeting with your arriving advisors (Juan de Daza should arrive this afternoon)\n\nThis Week:\n\nArrange the meeting with the Infantes (most critical)\n\nContinue receiving your advisory cabinet as they arrive\n\nBegin planning the pilgrimage logistics\n\nDraft the Royal Council invitations (to discuss with the Infantes)\n\nWithin Two Weeks:\n\nAssemble and dispatch the advance delegation to Rome\n\nFinalize guard equipment orders\n\nMeet with potential bishops/clerics for the Rome journey\n\nTHE INFANTES MEETING - URGENT\n\n\"Your Majesty, we need to arrange this meeting soon. The letter from Infante Juan is waiting for a response, and delay will make them suspicious.\n\nOptions for the meeting:\n\n1. Here in Valladolid\n\nShows confidence—you're receiving them on your ground\n\nYour guards, your palace, your control\n\nBut they might refuse, claiming it's too much like being summoned by a subordinate\n\n2. Neutral Location\n\nPerhaps Medina del Campo (30 miles south—important market town, neutral ground)\n\nShows respect for their position\n\nNeither side has military advantage\n\nTakes 1-2 days to arrange\n\n3. You visit them\n\nShows remarkable confidence or could be seen as weakness\n\nRisky—you're on their territory\n\nBut might flatter them and make them overconfident\n\nMy recommendation: Neutral ground at Medina del Campo. Dignified, appropriate for peers meeting to discuss the realm, neither presumptuous nor weak.\n\nTiming: As soon as possible. I can send a message today proposing we meet in five to seven days—gives them time to travel, gives you time to prepare, and shows you're taking their letter seriously.\n\nWho attends:\n\nYou and perhaps 2-3 attendants (show you're not afraid, not bringing an army)\n\nI should probably attend as Constable (expected) but remain mostly silent—this is your meeting\n\nThey'll bring their own retinue\n\nDoes Your Majesty want me to send that invitation today?\"\n\nHe waits, clearly eager to keep momentum going while you have the initiative.\n\nWhat are your orders? Should we arrange the Infantes meeting? Any other immediate concerns?"
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_1430_00007",
      "book": 1,
      "chapter": "1.01",
      "date": "1430-05-10",
      "end_date": null,
      "type": "decision",
      "summary": "Juan II spends a week in preparation: training in combat with Captain Fernán (sword, mounted combat, physical conditioning), rehearsing his role for the upcoming meeting with the Infantes, and assembling his advisory cabinet.",
      "characters": [
        "juan_ii",
        "fernan_alonso_de_robles",
        "alvaro_de_luna"
      ],
      "factions_affected": [],
      "location": "Valladolid, Palace Courtyard",
      "tags": [
        "military",
        "training",
        "preparation"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "Great. Keep summoning my cabinet. I want to have them installed as soon as possible. And set up a meet with the infantes. This is our important next move."
        },
        {
          "role": "gm",
          "text": "Álvaro nods with satisfaction. \"Excellent, Your Majesty. Clear priorities. Let me execute both immediately.\"\n\nHe strides to the door and calls for messengers and secretaries. Within minutes, the room fills with purposeful activity as clerks arrive with writing materials.\n\nADVISORY CABINET - STATUS UPDATE\n\n\"The summons I sent earlier are already en route, Your Majesty. Current status:\n\nJuan de Daza - Should arrive from the treasury offices here in Valladolid within the hour. You can meet with him this very afternoon.\n\nDiego Gómez de Sandoval, Count of Castro - Messenger reached his estates this morning. He should arrive tomorrow evening or the morning after. Two days maximum.\n\nLope de Barrientos - Rider departed for Salamanca at dawn. He'll arrive in three to four days.\n\nÍñigo López de Mendoza - Message sent to Guadalajara. Four to five days.\n\nRodrigo Manrique - Riders sent to both his possible locations. Three to ten days depending on where we find him.\n\nWithin a week, you'll have at least three of them here. All five within ten days.\"\n\nTHE INFANTES MEETING - ARRANGEMENTS\n\nÁlvaro begins dictating to a secretary:\n\n\"Draft a letter to Infante Juan de Aragón, King of Navarra, and his brother Infante Enrique de Aragón.\n\n'My dear cousins,\n\nI have received your letter with gratitude and have given deep thought to your counsel regarding the governance of our realm. Your wisdom and experience are invaluable to me as I undertake the responsibilities of personal rule.\n\nI would be honored to meet with both of you to discuss matters of importance to Castile. I propose we gather at Medina del Campo in seven days' time, on [specific date]. This market town offers neutral ground appropriate for kinsmen to counsel together.\n\nI look forward to benefiting from your guidance on the establishment of proper governance and other matters affecting the realm.\n\nYour devoted cousin,\nJuan II, by the grace of God King of Castile and León'\"\n\nHe looks up at you: \"Properly deferential, suggests you're taking their advice seriously, but sets you as the one proposing terms. The seven-day timeline gives them adequate notice but not so much time they can coordinate extensively with other nobles first.\"\n\nHe continues to the secretary: \"Send this by fast courier within the hour. I want their response within three days.\"\n\nThe secretary bows and hurries off to prepare the letter for your seal.\n\nMEETING PREPARATION\n\nÁlvaro turns back to you, his voice becoming more instructive:\n\n\"Your Majesty, we have seven days to prepare for what may be the most important conversation of your reign so far. Here's what we need to do:\n\n1. Practice Your Performance\n\nYou need to convincingly play the 'young, earnest king seeking guidance' role. This isn't natural for you—you've been giving orders, showing determination. Now you must seem uncertain, deferential, even a bit overwhelmed.\n\nI suggest we rehearse. I'll play the Infantes—aggressive, condescending, testing you. You practice your responses until they're smooth and believable.\n\n2. Prepare Your Talking Points\n\nWe need to work out exactly what you'll say about:\n\nThe Royal Council (letting them think it's their idea while actually keeping control)\n\nThe pilgrimage to Santiago (gauging their reaction)\n\nYour reliance on me (you need to seem willing to consider reducing my role, but not immediately)\n\nTheir role in governance (showing them respect while not surrendering power)\n\n3. Know Your Limits\n\nWhat will you not concede, even in appearance? We need to establish your red lines so in the moment, you don't accidentally promise something we can't walk back.\n\n4. Read Them\n\nDuring the meeting, observe everything:\n\nDo they seem confident or uncertain?\n\nAre they coordinated or do they disagree on anything?\n\nWho defers to whom?\n\nWhat do they want most desperately?\n\nAre they testing you or trying to make a genuine arrangement?\n\n5. Arrange the Setting\n\nEven at neutral ground, details matter:\n\nWhere you sit relative to them\n\nWho speaks first\n\nHow many attendants each side brings\n\nWhether it's private (just us and them) or with witnesses\n\nMy recommendation: Private meeting, just the four of us initially. More honest conversation, easier for you to play your role, and they'll feel they're getting special access.\"\n\nIMMEDIATE INTERRUPTION\n\nA knock at the door. One of your chamberlains enters and bows:\n\n\"Your Majesty, Juan de Daza has arrived from the treasury offices. He awaits your pleasure.\"\n\nÁlvaro glances at you: \"Your first advisor, Your Majesty. Shall I bring him in now, or would you prefer to prepare first? This is your chance to practice reading a man, assessing loyalty, and giving a first assignment.\"\n\nHe adds quietly: \"Remember—he knows nothing of the full plan. You're simply meeting a treasury official you're considering for a more prominent role. See what he's made of.\"\n\nYou have several immediate choices:\n\nMeet with Juan de Daza now - Begin building your cabinet immediately\n\nPrepare more for the Infantes meeting first - Perhaps practice the deception with Álvaro\n\nReview the Royal Council structure - Finalize details before discussing with the Infantes\n\nSomething else entirely\n\nWhat do you want to do?"
        },
        {
          "role": "player",
          "text": "I spend the next few days practicing my role for the meeting with the infantes and also train myself in fighting, letting the captain of the guard train me in a manner appropriate for a king. I train myself in wearing armour and bearing weapons.\n\n\nThen the meeting with the infantes approaches. We leave for the meeting. Who is in our company?"
        },
        {
          "role": "gm",
          "text": "Each morning before dawn, you meet Captain Fernán Alonso in the palace courtyard. He's arranged a private space away from prying eyes—just you, him, and perhaps one trusted guard to assist.\n\nThe first morning, he assesses you frankly: \"Your Majesty has the build of a rider, not yet a warrior. We'll change that.\"\n\nHe starts you with basics:\n\nWearing armor: How to move in mail, how to mount a horse in half-armor, how to stand and balance with weight distributed properly\n\nSword work: Not fancy techniques, but practical cuts and guards. \"A king doesn't need to be the best swordsman, Your Majesty, but you must not embarrass yourself or be helpless if attacked.\"\n\nMounted combat: Managing a lance, controlling a warhorse, the basics of a cavalry charge\n\nEndurance: Running in armor, building strength and stamina\n\nFernán is a patient but demanding teacher. \"Again, Your Majesty. Your stance is too narrow—you'll be knocked over.\" He doesn't coddle you.\n\nBy the end of the week, you're sore, bruised, and exhausted each day. But you can wear armor without looking awkward, you can draw and cut with a sword competently, and you're beginning to understand the physical reality of warfare.\n\nFernán seems quietly impressed: \"Your Majesty learns quickly. Keep training like this, and by the time of any campaign, you'll be able to lead from horseback without nobles whispering that you're a boy playing at war.\"\n\nRehearsing with Álvaro\n\nThe afternoons are spent in your private chambers with Álvaro, rehearsing the upcoming meeting.\n\nHe plays the Infantes with cruel accuracy—condescending, testing, subtly aggressive:\n\n\"My dear young cousin, you must understand that kingship requires more than a crown. Your father, God rest him, had the benefit of experienced counselors. You seem to rely so heavily on this... Constable of yours. Is that wise?\"\n\nYou practice responses:\n\nLooking uncertain: \"I... I value Don Álvaro's service, but you're right that I need broader counsel...\"\n\nAsking for their advice: \"What would you suggest, cousin? How should I structure my governance?\"\n\nSeeming overwhelmed: \"Sometimes I feel the weight of so many competing demands...\"\n\nÁlvaro corrects you: \"No, Your Majesty, that was too strong. You sounded confident. Try it again with more hesitation. Pause mid-sentence. Look to me as if seeking support.\"\n\nIt's harder than you expected. Playing weak when you feel strong, uncertain when you're planning several moves ahead. But gradually, you learn the performance.\n\nÁlvaro also teaches you to read them: \"Watch their eyes when you mention the pilgrimage. If they light up, they want you gone. If they look concerned, they're not ready. Watch their hands—if they clench when you talk about me, I'm their primary target.\"\n\nBy the seventh day, you're ready. Or as ready as you can be.\n\nMeeting Your First Advisors\n\nBetween training sessions, you also begin meeting the arriving members of your cabinet:\n\nJuan de Daza arrives first—a careful, observant man in his forties with ink-stained fingers and intelligent eyes. You assign him to quietly track financial flows in Valladolid: \"I want to know where money moves, who's spending unusually, any signs of foreign gold.\" He bows deeply, clearly honored by the attention.\n\nDiego Gómez de Sandoval, Count of Castro arrives on the third day—a sharp-featured man with a soldier's bearing and a courtier's smooth manner. You assign him to observe the noble factions in the city: \"Who meets with whom, who's corresponding with Aragon, the mood among the great houses.\" He understands immediately: \"Your Majesty, I will be your eyes.\"\n\nThese meetings are brief—you're focused on the Infantes. But you're building your network.\n\nDEPARTURE FOR MEDINA DEL CAMPO\n\nOn the seventh day, a response arrives from the Infantes: they will meet you at Medina del Campo as proposed. The meeting is set for tomorrow.\n\nYou depart that afternoon to arrive by evening, allowing you to rest before the morning meeting.\n\nYOUR TRAVELING COMPANY\n\nStanding in the courtyard as horses are prepared, you survey who will accompany you to this crucial meeting:\n\nÁlvaro de Luna - Of course. As Constable, his presence is expected. He wears traveling clothes but his sword is at his hip, his expression watchful.\n\nCaptain Fernán Alonso - Leading your escort. He's transformed over the past week from instructor to something like a personal guard. Clearly takes his responsibility for your safety seriously.\n\nTen Royal Guards - Fernán selected them personally. These are the most reliable men, now wearing their new equipment. They look genuinely impressive—matching mail hauberks, new tabards in red and gold bearing the castle and lion of Castile, good helmets, well-maintained weapons. Not the full thirty, but enough to make a statement without appearing aggressive.\n\nTwo Chamberlains - For protocol and service. One is García Fernández de Manrique, the one Álvaro mentioned has cousins who correspond with the Infantes. You're bringing him deliberately—if he reports back to them, let him report that you seem appropriately respectful and cautious.\n\nA Secretary - To record anything that needs recording, though the main meeting will likely be private.\n\nServants - Four men to handle horses, baggage, and camp if needed.\n\nTotal: About twenty people in your company.\n\nNot an army, but respectable. Not so small you look weak, not so large you look aggressive.\n\nÁlvaro approaches as you're about to mount: \"Your Majesty, remember—uncertain but earnest. You're seeking their guidance, not confronting them. Let them talk, encourage them to reveal their plans, agree to consider their suggestions.\"\n\nHe glances around to ensure no one's listening: \"And observe everything. This meeting tells us how dangerous they truly are.\"\n\nCaptain Fernán helps you check your horse's tack: \"Your Majesty rides in the center of the column. I'll have outriders ahead and behind. If anything seems wrong, we withdraw immediately.\"\n\nTHE JOURNEY\n\nYou ride out through Valladolid's gates in the late afternoon sun. The journey to Medina del Campo is about thirty miles southwest—a good road, well-traveled, through the Castilian plains.\n\nThe spring countryside is beautiful: fields greening, rivers full from winter rains, villages preparing for summer. Your guards ride in formation around you, their new equipment drawing appreciative glances from peasants along the road.\n\nYou arrive at Medina del Campo as the sun is setting. It's a prosperous market town, famous throughout Castile for its fairs. The town officials greet you at the gates with proper ceremony—they've prepared accommodations in the best inn near the main plaza.\n\nThat night, you sleep fitfully. Tomorrow you meet the men who may be your greatest enemies, and you must convince them you're harmless.\n\nTHE MORNING OF THE MEETING\n\nYou wake before dawn. Fernán has guards posted around your lodgings. Álvaro is already awake, reviewing his notes.\n\nThe meeting is set for mid-morning at a private chamber in the town hall—neutral ground arranged by the local magistrate.\n\nAs you dress (your chamberlain helping you into fine but not ostentatious clothing—you want to look kingly but not vain), Álvaro briefs you one final time:\n\n\"The Infantes arrived last night with about fifteen men. Not an army, which is good—they're here to talk. Infante Juan is older, more experienced, more politically sophisticated. Infante Enrique is the warrior, more direct, possibly more dangerous in a different way. Both are proud, both are ambitious.\"\n\nHe pauses: \"Your Majesty, once we're in that room, I can advise but I cannot control what happens. This is your performance. Trust your preparation.\"\n\nAPPROACHING THE MEETING\n\nAt mid-morning, you walk from your inn to the town hall. Your ten guards form up around you—an honor guard, not a threat. The townspeople watch curiously: their king, walking through their streets.\n\nThe town hall is a solid stone building. Officials bow as you enter.\n\nYou're led to a private chamber on the second floor—a room with a large table, windows overlooking the plaza, tapestries on the walls. Chairs are arranged carefully: neither side has a superior position.\n\nAnd there, already waiting, are the Infantes de Aragón.\n\nInfante Juan - Perhaps thirty-five years old, dark-haired and handsome, wearing rich clothing that shows his status as King of Navarra. His eyes are intelligent and measuring. He rises with a smile that doesn't quite reach his eyes.\n\nInfante Enrique - Younger, early thirties, more martial in bearing. He's built like a soldier, and there's something more direct and dangerous in his gaze. He rises with less ceremony.\n\nBehind them stand two advisors and a few attendants.\n\nInfante Juan speaks first, his voice smooth and courteous:\n\n\"Cousin! How good of you to meet with us. Please, sit. We have much to discuss about the welfare of our beloved Castile.\"\n\nÁlvaro stands slightly behind and to your right. Captain Fernán remains by the door with two guards.\n\nThe chamber door closes.\n\nThe Infantes look at you expectantly.\n\nThis is the moment. What do you say? How do you begin?"
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_1430_00008",
      "book": 1,
      "chapter": "1.01",
      "date": "1430-05-15",
      "end_date": null,
      "type": "diplomacy",
      "summary": "Juan II meets the Infantes de Aragón at Medina del Campo, executing his deception plan. He plays the earnest but overwhelmed young king, lets them propose a noble council (which he already planned), negotiates regency arrangements for his 'pilgrimage', and directly confronts them about Álvaro de Luna — ultimately striking a deal where Álvaro is constrained but not removed, the Infantes get a regency council with real power during his absence, and Juan can depart on pilgrimage.",
      "characters": [
        "juan_ii",
        "infante_juan_de_aragon",
        "infante_enrique_de_aragon",
        "alvaro_de_luna"
      ],
      "factions_affected": [
        "royal_court",
        "aragonese_faction"
      ],
      "location": "Medina del Campo",
      "tags": [
        "diplomacy",
        "negotiation",
        "deception"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "Ha! I must say I am a bit relieved to meet you again. Now that Im king, I feel like I should do everything at once and even then it never seems to be enough.\n\n\nI shake their hands enthusiastically.\n\n\nYou know...one of the first things I did was rally the troops with an inspiring speech. Or so I thought, but I feel like the soldiers just did not care."
        },
        {
          "role": "gm",
          "text": "This is excellent roleplay from the user. They're playing the \"young, earnest, somewhat overwhelmed king\" perfectly - admitting vulnerability, sharing a recent \"failure\" (the guard speech that didn't inspire), showing enthusiasm but also insecurity. This is exactly the kind of performance that would make the Infantes think they can control him.\n\nLet me show how the Infantes react to this. They should:\n1. Be pleased by this apparent weakness\n2. Exchange subtle glances of satisfaction\n3. Play into it by being sympathetic but subtly condescending\n4. Start probing to see how much they can manipulate him\n5. Begin steering the conversation toward their goals\n\nThis is a critical scene where the user's deception strategy begins. I should make it tense and detailed, showing all the subtle social dynamics at play.\n\nYou shake their hands with genuine-seeming enthusiasm, and you catch the briefest flicker of reaction between the two brothers—a glance, almost imperceptible, that says this is going to be easier than we thought.\n\nInfante Juan's smile warms, becoming almost paternal. \"My dear cousin, please, sit, sit!\" He gestures to a chair. \"You're quite right to feel overwhelmed. Kingship is a tremendous burden, especially when taken up so young.\"\n\nInfante Enrique, the more direct one, actually laughs—not unkindly, but with the tone of an older brother humoring a younger sibling. \"You tried to inspire your guards with a speech? And they just... stood there?\" He shakes his head, grinning. \"I've made that mistake myself, cousin. Soldiers are practical creatures. They care more about their pay and equipment than fine words.\"\n\nJuan shoots his brother a look—let me handle this—then turns back to you with sympathy in his eyes: \"But you see, Your Majesty, this is precisely why we wrote to you. You have the desire to rule well, anyone can see that. But desire isn't enough. You need experienced men around you who can guide you through these... complications.\"\n\nHe settles into his chair, leaning forward slightly, his voice becoming more confidential:\n\n\"Tell me, cousin—when you made this speech to your guards, who advised you on it? Did Don Álvaro suggest this approach?\"\n\nThere's a subtle emphasis on Álvaro's name. Not quite hostile, but... testing.\n\nBehind you, you sense rather than see Álvaro's stillness. He's watching, saying nothing, playing his role.\n\nInfante Enrique adds, less subtly: \"The problem, Your Majesty, is that common soldiers don't really understand what kingship means. They see you as... well, as young as you are.\" He spreads his hands as if this is simply obvious. \"They need to see strength. Decisive action. Not speeches, but results.\"\n\nJuan shoots his brother another look—you're being too blunt—then recovers smoothly:\n\n\"What my brother means is that perhaps your household needs... restructuring. Your guards, your advisors, the men who have your ear daily. These things matter enormously. A king is only as effective as those who serve him.\"\n\nHe pauses, then asks with apparent casualness: \"Tell us, cousin—how are you making decisions these days? When matters of state arise, who do you consult? Just Don Álvaro, or...?\"\n\nThey're probing. Testing how dependent you seem on Álvaro, how isolated you might be, how open you are to their \"guidance.\"\n\nEnrique leans back in his chair, one hand resting on his sword hilt (not threateningly, just habitually), watching your face with those direct, dangerous eyes.\n\nThe chamber feels suddenly smaller. These are not ceremonial courtiers—these are men who've commanded armies, negotiated with kings, survived the vicious politics of the regency. They're assessing you like hunters assessing prey.\n\nHow do you respond? Do you play up your reliance on Álvaro, or distance yourself from him? Do you seem eager for their guidance, or show some independence?"
        },
        {
          "role": "player",
          "text": "Well cousins, like I said, I feel like there is so much to do. So much that is expected of me. I aim to be a good king but also a pious one. My tutors have always expressed how important it is to be a good Christian and how important the church is for the stability of the Realm. I have not sent anything to his holyness the pope yet and I feel like I have failed already by not sending him a gift."
        },
        {
          "role": "gm",
          "text": "The Infantes would likely see this as:\n- Confirmation he's overwhelmed and unfocused\n- Good news (he's thinking about religion, not consolidating power)\n- Maybe slightly annoying (they asked a direct question and he wandered off topic)\n- An opening to offer \"guidance\" on papal relations\n\nLet me play the Infantes responding to this deflection, showing they're both slightly encouraged by his seeming weakness and trying to steer him back to their agenda while also potentially revealing their thoughts on the Pope/Church.\n\nInfante Juan blinks, clearly not expecting that particular deflection. There's a microsecond of recalibration behind his eyes, then his expression becomes even more sympathetic.\n\n\"Your piety does you credit, cousin,\" he says smoothly. \"The Church is indeed the foundation of any Christian realm. But...\"\n\nHe exchanges a glance with his brother, and you catch something—perhaps mild annoyance that you've changed the subject, or maybe satisfaction that you seem so scattered and anxious.\n\nInfante Enrique is more direct, as usual: \"The Pope has many concerns beyond Castile, Your Majesty. I wouldn't worry overmuch about gifts to Rome when your own kingdom requires such urgent attention.\"\n\nBut Juan raises a hand slightly, silencing his brother. His eyes have narrowed thoughtfully:\n\n\"Actually, Enrique, our cousin raises an interesting point. Tell me, Your Majesty—have you been in correspondence with Rome at all? Has the Holy Father reached out to you since you began your personal rule?\"\n\nThere's genuine curiosity there now, mixed with something else. Political calculation.\n\nHe continues, his voice taking on an advisory tone: \"The relationship between Crown and Church is delicate. The Archbishop of Toledo, for instance, has considerable influence. And Rome... well, Rome can be helpful or troublesome depending on how one manages those relationships.\"\n\nEnrique leans forward: \"What makes you think about the Pope suddenly, cousin? Has someone been advising you to cultivate Rome? The Archbishop perhaps?\"\n\nThey're now probing in a different direction—trying to understand if you have ambitions involving the Church, if someone's been pushing you toward papal politics, if there are alliances being formed they don't know about.\n\nJuan's expression remains warm, but his voice carries a subtle warning: \"I only mention this because securing papal favor often requires... careful navigation. The wrong approach, the wrong messenger, could do more harm than good. If Your Majesty is considering reaching out to Rome, perhaps we could offer guidance on how such things are properly done?\"\n\nBehind you, Álvaro remains silent, but you can almost feel his approval. You've successfully deflected their initial probe and planted the seed about Rome without revealing your actual plans.\n\nEnrique, growing impatient with the indirect conversation, speaks more bluntly: \"Look, cousin, let's be honest. You said yourself you're overwhelmed. You tried to rally your guards and failed. You're worried about the Pope. These are all signs you need proper counsel.\"\n\nHe gestures broadly: \"What you need is a council of the realm's natural leaders—men who've actually governed, fought wars, managed diplomacy. Not just one man, no matter how capable Don Álvaro might be in his way, but a proper council of the great houses of Castile.\"\n\nJuan shoots his brother a look—too fast, too obvious—but Enrique continues: \"Your father and grandfather ruled with such councils. It's the traditional way. The King listens to his nobles, makes decisions with their counsel. That's how Castile has always worked best.\"\n\nJuan recovers smoothly: \"What my brother means is simply that shared wisdom leads to better governance. No one man—no one young man, if you'll forgive me—should bear all these burdens alone.\"\n\nHe leans forward, his voice becoming almost intimate: \"Your Majesty, we're family. We only want to help. Tell us honestly—what do you need most right now? Guidance on governance? Help managing the nobles? Military leadership? Surely there's something we can assist with?\"\n\nThey're making their pitch now, trying to position themselves as indispensable helpers.\n\nHow do you respond? Do you take the bait about needing their help? Do you return to the Pope topic? Do you bring up the idea of a council?"
        },
        {
          "role": "player",
          "text": "Well... I have recieved a letter from the archbishop stressing how important Papal relations are. But that's just it, everyone seems to want something for themseves while the realm suffers.\n\n\nI like the idea of a council. Who should we invite you think?"
        },
        {
          "role": "gm",
          "text": "\"There! You see, Juan? Our cousin understands!\" Enrique says enthusiastically. \"A council is exactly what's needed!\"\n\nJuan shoots his brother a warning look—don't show too much eagerness—then turns back to you with warm approval:\n\n\"Your Majesty shows wisdom beyond your years. Yes, everyone has their own interests—that's the nature of power. The Archbishop wants Church influence, Don Álvaro wants...\" he pauses delicately, \"...to maintain his position, the great houses want their traditional privileges. This is precisely why a council balances these competing interests.\"\n\nHe pulls his chair closer, becoming almost conspiratorial:\n\n\"Now, as for composition, this is crucial. A council must have weight—men who command real authority in the realm, not just ceremonial appointments. Let me suggest...\"\n\nHe begins counting on his fingers:\n\n\"First, the royal family itself. My brother and I, naturally—we have blood ties to the throne, estates throughout Castile, and experience in governance and war. This shows the Crown values family counsel.\"\n\nEnrique nods vigorously: \"And it sends a message to Aragon that Castile is united, that there's no conflict between our kingdoms.\"\n\nJuan continues: \"Second, the great military orders. The Masters of Santiago, Calatrava, and Alcántara. They command significant military force and their support is essential. Leaving them out would be... unwise.\"\n\n\"Third, the highest Church authority—the Archbishop of Toledo, of course. Since he's already writing to you about papal relations,\" Juan's voice carries a slight edge here, \"he'll expect to be included. Besides, Church backing legitimizes the council's decisions.\"\n\nEnrique interjects: \"Though we should be careful the Archbishop doesn't dominate. Clerics have their place, but this is about governing the realm, not just spiritual matters.\"\n\nJuan nods agreement: \"Fourth, representatives from the greatest noble houses. The Mendozas—they're powerful and must be accommodated. Perhaps the head of the Mendoza family?\"\n\nHe pauses thoughtfully: \"The Estúñigas, the Velascos... these families control vast territories. If they're excluded, they'll resent it and cause problems.\"\n\nEnrique adds: \"We want men who are already powerful, cousin. That way, when the council makes decisions, those decisions actually matter. If you just appoint minor nobles or favorites, the great houses will ignore it.\"\n\nJuan continues: \"Fifth—and this is delicate—some representation from the cities. Burgos, Seville, Toledo, perhaps Valladolid. The merchant classes and urban militias have real power. A purely noble council might alienate them.\"\n\n\"Though not too many city representatives,\" Enrique warns. \"This is still a council of the realm's natural leaders, not a merchants' guild.\"\n\nJuan leans back, calculating: \"So we're talking about... perhaps fifteen to twenty men total? Large enough to represent the realm's major powers, small enough to actually function.\"\n\nThen he looks at you directly, his voice becoming more pointed:\n\n\"Now, Your Majesty, here's the critical question: how does this council function? Is it purely advisory—you listen and then decide? Or does it have actual authority—certain decisions require the council's consent?\"\n\nEnrique leans forward eagerly: \"In my view, major decisions should require the council's agreement. Declaring war, raising extraordinary taxes, making treaties with foreign powers, appointing high officials—these things shouldn't be done by royal decree alone.\"\n\nJuan gives his brother a sharp look—too much, too fast—then moderates: \"What my brother means is that the council should have meaningful input. Not that it binds Your Majesty's hands entirely, but that on truly important matters, you have the benefit of collective wisdom before acting.\"\n\nHe pauses, then adds carefully: \"And of course, the council should meet regularly. Monthly? Quarterly? Often enough to be relevant, not so often it becomes burdensome.\"\n\nEnrique, warming to the topic: \"And Your Majesty, perhaps the council could also... advise on your personal household? The men who have your daily ear, who manage the treasury, who command your guards? After all, these positions affect the whole realm.\"\n\nThere it is—the real goal. Control over your appointments.\n\nJuan shoots his brother an irritated look, then tries to soften it: \"What Enrique means is simply that transparency about royal household appointments reassures the nobility that positions of power aren't being monopolized by any one faction.\"\n\nHe meets your eyes: \"For instance, Don Álvaro currently holds multiple crucial positions—Constable, chief advisor, essentially first minister. This... concentration of power in one man's hands creates anxiety among other nobles. Not that Don Álvaro is incompetent, but the appearance matters.\"\n\nBehind you, Álvaro remains perfectly still. You can almost feel his tension.\n\nEnrique presses: \"With a proper council, that power could be distributed. Different men handling different responsibilities. More balanced, more stable.\"\n\nJuan adds smoothly: \"And it would actually strengthen your position, Your Majesty, because you'd no longer be seen as dependent on any one man. You'd be seen as ruling with the realm's collective wisdom.\"\n\nThey're both watching you intently now, trying to gauge your reaction to this suggestion that you should dilute or remove Álvaro's power.\n\nHow do you respond? Do you seem open to limiting Álvaro's role? Do you ask more questions? Do you express concerns?"
        },
        {
          "role": "player",
          "text": "Cousins...you are proposing sweeping changes to how the crown operates. Like I said, everyone seems to want something else and I can already hear the other nobles complaining about this new structure. Shall we not take it slow? Surely, such important changes to the realm require input from all the mentioned houses.\n\n\nBut cousins, there is another reason why I wanted to meet with you. I am a pious soul, or at least I try to be and I would like to start my rule by going on a pilgrimage. My advisors -I glance backwards - have advised me not to go, but I feel the pull of the almighty. Hopefully I will return a wiser man. Would you be willing to keep council and keep the administration running in my absence? It will only be temporary of course, but it will allow me to go on pilgrimage and be back in time for the first council."
        },
        {
          "role": "gm",
          "text": "Infante Enrique speaks first, unable to contain himself: \"A pilgrimage? Where would Your Majesty—\"\n\nJuan cuts him off with a subtle gesture, his voice carefully measured: \"Cousin, your piety is admirable. Truly. But...\" he pauses, choosing words carefully, \"a pilgrimage at this moment? With the realm requiring your attention? Your advisors are right to counsel caution.\"\n\nBut there's something in his eyes—interest, possibility, hunger barely concealed.\n\nEnrique can't help himself: \"Where were you thinking of going? Santiago de Compostela? That's a worthy pilgrimage, and not too far—\"\n\nJuan shoots his brother a sharp look—let me handle this—then turns back to you with an expression of concerned sympathy:\n\n\"Your Majesty, forgive me, but I must ask: whose idea was this pilgrimage? Did someone suggest this to you?\"\n\nThere's suspicion there now. They're wondering if this is a trick, if someone is trying to get you away from them, if Álvaro or another faction is manipulating you.\n\nBehind you, you sense Álvaro's complete stillness. This is the crucial moment.\n\nJuan continues, his voice soft but probing: \"And you mentioned returning 'in time for the first council'—are you saying you wish to establish the council, then depart on pilgrimage? Or depart first, and convene the council upon your return?\"\n\nEnrique leans forward: \"How long would you be gone, cousin? A few weeks? Months?\"\n\nJuan adds, his tone becoming more pointed: \"And you mentioned we would 'keep council and keep the administration running'—what exactly does that mean? Would you be establishing a formal regency? With what powers? For how long?\"\n\nThey're simultaneously intrigued and suspicious. The opportunity is tantalizing—you gone, them in charge—but it seems too convenient. They're trying to figure out if this is genuine naivety or a trap.\n\nEnrique, more direct as always: \"Your Majesty, no offense, but this seems sudden. Just moments ago we were discussing a council structure, and now you want to leave on pilgrimage? What's really driving this?\"\n\nJuan's expression becomes almost paternal, but his eyes are sharp: \"Cousin, I wonder if this impulse comes from feeling overwhelmed? You mentioned it yourself—everyone wants something, the weight of kingship is tremendous. Perhaps you're thinking of pilgrimage as an escape?\"\n\nHe leans forward, his voice becoming more intimate: \"But running away—and forgive me, but that's what pilgrimage now would look like to many nobles—would only make things worse. It would make you seem weak, uncertain, unable to handle royal responsibility.\"\n\nEnrique nods vigorously: \"The realm needs a king present, cousin. Not wandering on distant roads while nobles squabble over who's really in charge.\"\n\nBut Juan is still calculating. You can see him weighing possibilities. Finally, he asks carefully:\n\n\"Tell me more about this pilgrimage. Where specifically? For how long? And most importantly—what authority would my brother and I have in your absence? Would we simply advise Don Álvaro, or would you establish a proper regency council with actual governing power?\"\n\nHis voice hardens slightly: \"Because if you're proposing to leave Don Álvaro in charge while merely consulting us, that accomplishes nothing. But if you're proposing a genuine regency council, with authority to make decisions, issue orders, manage the realm... that's different.\"\n\nEnrique adds bluntly: \"And what about military authority? Command of royal forces and fortifications? Control of the treasury? These things matter, cousin.\"\n\nThey're negotiating now, trying to figure out exactly what they'd get out of this arrangement. The bait is tempting, but they're not fools—they want specifics.\n\nJuan sits back, studying your face: \"Your Majesty, I appreciate your trust in us. But help me understand: why propose this now? Why not wait until you're more established, until the council structure is in place, until the realm is more stable? What drives this sudden desire for pilgrimage?\"\n\nHis eyes search yours, looking for deception, for manipulation, for any sign that you're not as guileless as you seem.\n\nBehind you, Álvaro maintains his silence, but the tension in the room has ratcheted up considerably.\n\nHow do you answer their questions? What details do you provide about the pilgrimage? How much authority do you offer them?"
        },
        {
          "role": "player",
          "text": "Lets step back for a moment. In this interaction, lots of questions are being asked of me that I want to answer. From now on, when someone asks me something, stop the dialogue and give me the possibility to respond. This does not feel like a conversation. Keep your responses very short if needed.\n\n\n\"Your Majesty, forgive me, but I must ask: whose idea was this pilgrimage? Did someone suggest this to you?\"\n\n\nI respond: \nI have always taken my theological studies very seriously and I want to be remembered as a pious king. Going on a pilgrimage is something I have thought about for a long time. I have discussed this with my confessor but he has passed away this winter. There is so much going on, I feel like going on a pilgrimage will give me space to get closer to God. To find my purpose. Is that so strange?"
        },
        {
          "role": "gm",
          "text": "Juan's expression softens noticeably. The mention of your confessor's death seems to strike a chord—it's a detail that rings true, explains timing, makes the impulse more believable.\n\n\"Ah,\" he says quietly. \"I didn't know about Father Gonzalo's passing. My condolences, cousin.\"\n\nEnrique's suspicion visibly eases. \"Losing one's confessor is no small thing. The soul requires guidance.\"\n\nJuan nods slowly: \"Your desire for spiritual clarity is... understandable. And admirable.\" He pauses, then asks more gently: \"Have you appointed a new confessor yet? Perhaps that should come first, before undertaking a pilgrimage?\"\n\nEnrique adds: \"And you still haven't said where you'd go. Santiago? How long would you be away?\"\n\nThey seem less suspicious now, more willing to believe this is genuine religious impulse rather than political maneuvering. But they still want specifics.\n\nWhat do you say?"
        },
        {
          "role": "player",
          "text": "To be fair, I have not made a decision yet for my destination. I hope that when the moment comes, the destination will be revealed to me. I have already sent for a new confessor, a humble monk. I will confer with him as soon as he arrives and will let you know my destination. And I must say that Santiago seems like an obvious choice."
        },
        {
          "role": "gm",
          "text": "\"A humble monk,\" Juan repeats, nodding approval. \"Good. The greatest spiritual guides often come from simple backgrounds, uncorrupted by court politics.\"\n\nEnrique seems almost pleased: \"Santiago would be fitting. Saint James the Moorslayer—appropriate for a king of Castile. Two, perhaps three months for the journey and proper devotion there?\"\n\nJuan leans forward: \"Cousin, if you're serious about this—and I believe you are—then yes, my brother and I would be honored to help manage affairs in your absence. But we must establish clear arrangements.\"\n\nHe becomes more businesslike: \"You mentioned we would 'keep council and keep the administration running.' Let's be specific: would you formally establish a regency council before you depart? With defined powers and authority? Or would this be informal?\"\n\nWhat do you answer?"
        },
        {
          "role": "player",
          "text": "Lets keep it simple for now. You can advise me and help me share the burden like we discussed. We will send out invitations for the council, again like we discussed, I think your suggestions are a nice balance between nobles and other interests. Lets plan the council in 6 months or so, plenty of time to get ready and for me to go on pilgrimage. I promise you that I will be back in time for the council. When I am away, don Alvaro will take my place. During the council, we can discuss the roles and responsibilities of the council further."
        },
        {
          "role": "gm",
          "text": "Infante Enrique's face darkens. \"Wait—Don Álvaro would still be in charge while you're gone? Then what's the point of—\"\n\nJuan cuts him off sharply: \"Enrique.\" Then he turns to you, his voice carefully controlled but with an edge: \"Cousin, forgive me, but I'm confused. You speak of sharing the burden, of us helping to manage affairs, yet you say Don Álvaro 'will take your place.' Those seem contradictory.\"\n\nHe leans forward, his diplomatic mask slipping slightly: \"If Don Álvaro remains in full control during your absence, then we're not sharing anything. We're simply... watching him govern, as always. That's not a council, that's just the current arrangement with you physically absent.\"\n\nEnrique adds bluntly: \"You're asking us to endorse you leaving while your Constable rules in your name. How is that different from what's happening now?\"\n\nJuan raises a hand to calm his brother, then speaks more carefully: \"Your Majesty, perhaps I wasn't clear. When we speak of a regency council during your pilgrimage, we mean a council with actual authority—the ability to make decisions, issue orders, manage the realm collectively. Not Don Álvaro making decisions while occasionally asking our opinion.\"\n\nHow do you respond?"
        },
        {
          "role": "player",
          "text": "Cousins, now is my turn to be blunt I think. I know very well of the animosity between you and my advisor Alvaro. He advised me not to have this meeting in the first place. You say that leaving Alvaro in charge is not different than what is happening now and that is exactly the point. The realm is strained enough as it is without me wanting to risk civil war. I may be young and not know what to do, but I do know that much. Am I not offering you more than you have right now? I came here to seek genuine help from you. Please tell me you do not want to depose me and rule as de-facto king in my stead while I am away."
        },
        {
          "role": "gm",
          "text": "Oh, this is a strong move from the player. They're directly challenging the Infantes, calling out the power grab, putting them on the defensive while still maintaining the \"young and uncertain\" persona. This is actually quite clever - it forces the Infantes to either:\n\n1. Admit they want power (which makes them look like usurpers)\n2. Back down and accept less than they wanted\n3. Try to negotiate middle ground\n\nThe player is also creating a false binary - either they help on his terms, or they're trying to depose him. This puts pressure on them.\n\nThe Infantes would be caught off-guard by this directness. They've been treating him like a naive boy, and suddenly he's speaking plainly about civil war and deposing. They need to recalibrate.\n\nJuan would likely try to recover diplomatically, denying any intent to depose while still pressing for concessions. Enrique might be more flustered. Behind them, Álvaro would be impressed but also concerned - this is riskier than the planned approach.\n\nLet me write their reaction.\n\nThe room goes completely silent.\n\nThe Infantes stare at you, clearly not expecting this directness. For a moment, the masks slip entirely.\n\nInfante Enrique actually flushes, his hand moving instinctively toward his sword hilt before he catches himself. \"Depose you? Cousin, that's—\"\n\nJuan holds up a hand, silencing his brother. His expression has gone very cold, very calculating. When he speaks, his voice is quiet and measured:\n\n\"Your Majesty, no one has spoken of deposing anyone.\" Each word is careful, controlled. \"But let's not pretend at naivety now—you just demonstrated you understand politics better than you've been letting on.\"\n\nHe stands slowly, walking to the window, his back to you for a moment. When he turns back, his diplomatic warmth is gone, replaced by something harder:\n\n\"You're right. We don't trust Don Álvaro. And frankly, cousin, you shouldn't either—not completely. A man who holds that much power over a young king is dangerous, whether his intentions are good or not.\"\n\nEnrique leans forward, his voice rougher: \"And you're also right that we want more than we have now. Why shouldn't we? We're of royal blood, we have armies, estates, experience. We don't want to depose you—we want to help govern. There's a difference.\"\n\nJuan returns to his seat, his eyes locked on yours: \"So let me be equally blunt, cousin. You came here asking for help. We're offering it. But help means actual authority, not ceremonial positions. If you go on pilgrimage and leave Don Álvaro in complete control, you're not sharing power—you're consolidating his.\"\n\nHe pauses, then speaks more softly: \"Here's what concerns me: you speak of preventing civil war. Good. That shows wisdom. But civil war comes when legitimate powers feel excluded, when the realm's natural leaders are shut out by a single man's monopoly on the king.\"\n\nEnrique adds: \"Right now, cousin, dozens of nobles are watching. They see you, young and untested, seemingly controlled by one man. That breeds resentment. If you continue down that path—especially if you leave him in charge while you're gone—that resentment will grow.\"\n\nJuan leans forward: \"So yes, you're offering us more than we have now. You're acknowledging we should have a voice. But how much of a voice? That's the question. Because an advisory council that Álvaro ignores accomplishes nothing except making us complicit in his rule.\"\n\nHe meets your eyes directly: \"Here's a compromise. You want Álvaro to manage day-to-day administration—fine. He's competent, I'll grant him that. But establish a regency council—the three of us, perhaps one or two others—that must approve major decisions. Not routine matters, but significant ones: military deployments, major expenditures, diplomatic treaties, appointments to high office.\"\n\nEnrique nods: \"That way, the realm sees shared governance. Álvaro runs things day-to-day, but the council provides oversight and approval for important matters. Everyone has a stake.\"\n\nJuan adds quietly: \"And when you return from pilgrimage, we convene your larger council and discuss permanent arrangements. But in the interim, this prevents any one man—Don Álvaro or anyone else—from having unchecked power.\"\n\nBehind you, you hear Álvaro shift slightly. This is the first sound he's made since the meeting began.\n\nJuan watches you carefully: \"That's our offer, cousin. Real partnership, not ceremonial window dressing. Can you accept that?\"\n\nWhat do you say?"
        },
        {
          "role": "player",
          "text": "I hold out my hand.\n\n\nDone."
        },
        {
          "role": "gm",
          "text": "He grasps your hand firmly. \"Done.\"\n\nInfante Enrique grins broadly and stands, clasping your hand after his brother. \"Well struck, cousin! You see? When we speak plainly, we can accomplish much.\"\n\nJuan releases your hand, his expression warm: \"Your Majesty shows wisdom. This arrangement serves everyone—you get your pilgrimage and spiritual guidance, we ensure the realm is properly governed in your absence, Don Álvaro keeps his administrative role. Balance.\"\n\nBehind you, Álvaro finally speaks, his voice carefully neutral: \"Your Majesty is generous.\" There's something complex in his tone—approval of the performance you're giving, but also awareness that this will constrain him significantly for the next several months.\n\nJuan turns businesslike: \"We should formalize this arrangement. A written charter before you depart, specifying the regency council's composition and powers. Clear, so there's no confusion.\"\n\nEnrique nods: \"The council should be you two, myself, and perhaps one other—someone respected and neutral. The head of the Mendoza family? They're powerful enough to balance us.\"\n\nJuan considers: \"Agreed. Four members—my brother, myself, one Mendoza, and perhaps a Church representative? The Archbishop of Toledo or a bishop?\"\n\nHe looks at you: \"And to be clear on powers—the council approves or rejects major military deployments, expenditures over a certain amount, diplomatic treaties, and appointments to positions like corregidores in major cities or military governorships. Day-to-day administration remains with Don Álvaro and the existing bureaucracy.\"\n\nEnrique adds: \"We'll meet weekly while you're gone, keep records, ensure transparency.\"\n\nJuan extends his hand again: \"Partners in governing Castile, cousin. When you return, we'll establish the larger council and permanent arrangements. But this gets us started properly.\"\n\nHis eyes are bright with satisfaction. They think they've won.\n\nWhat do you do next? Do you discuss details? Set a timeline? Say anything to Álvaro?"
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_1430_00009",
      "book": 1,
      "chapter": "1.01",
      "date": "1430-05-15",
      "end_date": "1430-05-20",
      "type": "diplomacy",
      "summary": "Juan II and the Infantes finalize the council arrangements: drafting invitations for 18-20 members (great houses, military orders, church, city representatives), setting the council date for December 1430 in Seville, formally establishing the regency council's powers, and preparing royal sealed invitations. Juan schedules a formal regency declaration ceremony with the Infantes for the following week.",
      "characters": [
        "juan_ii",
        "infante_juan_de_aragon",
        "infante_enrique_de_aragon",
        "archbishop_cerezuela"
      ],
      "factions_affected": [
        "royal_court",
        "aragonese_faction"
      ],
      "location": "Medina del Campo",
      "tags": [
        "diplomacy",
        "administration",
        "council"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "I think the Archbishop will do nicely as well.\n\n\nCousins, you have granted me a great wish and I cannot thank you enough. Being able to go on a pilgrimage means a lot to me.\n\n\nIndeed, lets draft the contract of the regency council for when I am away."
        },
        {
          "role": "gm",
          "text": "The Infantes think they've won. They're satisfied, even pleased with this \"naive\" young king who just handed them power. This is exactly what the player wanted.\n\nNow they'll discuss the details of the charter. This should be relatively straightforward - the Infantes will want to codify their powers, set timelines, etc. Álvaro will be silent but observant, playing his role.\n\nThe player wants to draft the contract. Let's have the Infantes be cooperative and satisfied, working out the details. This scene should conclude soon with them feeling victorious and the player having successfully deceived them.\n\nJuan's smile widens. \"The Archbishop of Toledo—excellent. He'll lend ecclesiastical weight to the council's decisions.\" He glances at his brother. \"Four members then: Enrique and myself, Archbishop of Toledo, and Íñigo López de Mendoza as head of the Mendoza family.\"\n\nEnrique nods approvingly: \"A good balance. Two of us, one Church, one of the realm's greatest houses.\"\n\nJuan calls toward the door: \"Bring writing materials!\"\n\nWithin moments, a secretary enters with parchment, ink, and quills. Juan pulls his chair closer to the table, suddenly energized and businesslike.\n\n\"Let's be clear and specific, so there's no confusion later,\" Juan says, beginning to outline aloud as the secretary prepares to write:\n\n\"Charter of the Regency Council during His Majesty's Pilgrimage:\n\nComposition: Infante Juan de Aragón, King of Navarra; Infante Enrique de Aragón; His Eminence the Archbishop of Toledo; Don Íñigo López de Mendoza, head of the House of Mendoza.\n\nDuration: From His Majesty's departure on pilgrimage until his return, anticipated within six months.\n\nPowers: The Council shall have authority to approve or reject:\n\nMilitary deployments exceeding one thousand men\n\nTreasury expenditures exceeding 100,000 maravedís\n\nDiplomatic treaties or agreements with foreign powers\n\nAppointments to positions of corregidor in major cities, military governorships, and similar high offices\n\nDeclaration of war or negotiation of peace\n\nAdministration: Don Álvaro de Luna, Constable of Castile, shall manage day-to-day governance and present matters requiring Council approval at weekly meetings.\"\n\nEnrique interjects: \"And the Council's decisions require a majority vote—three of four members.\"\n\nJuan nods: \"Agreed. Prevents deadlock.\" He continues dictating: \"Decisions require majority approval of three Council members.\"\n\nHe looks up at you: \"Does this accord with Your Majesty's understanding?\"\n\nBehind you, Álvaro speaks quietly: \"Your Majesty, if I may—the treasury expenditure limit. 100,000 maravedís is quite low for certain necessary expenses. Military supplies for frontier garrisons alone can exceed that. Perhaps 200,000 would be more practical?\"\n\nJuan considers: \"A reasonable point. We don't want to micromanage every transaction. 200,000 maravedís then.\"\n\nEnrique adds: \"And the military deployment threshold—one thousand men seems right. Large enough to matter, not so small we're approving every border patrol.\"\n\nJuan looks at you: \"Any other provisions Your Majesty wishes to include? Time limits on Council sessions? Requirements for documentation?\"\n\nThe secretary's quill scratches on parchment, recording everything.\n\nDo you want to add anything, or are you satisfied with these terms?"
        },
        {
          "role": "player",
          "text": "No, I think that covers everything. Im excited already!\n\n\nNow, lets draft the invitation to all the participants of the council in six months. \nIt should be a royal invitation to a meeting to adress the realm's concerns. \nCousins, who are we inviting again? We should write to the immediately"
        },
        {
          "role": "gm",
          "text": "Juan looks pleased by your enthusiasm. \"Excellent! Let's draft the invitations immediately—the sooner they go out, the more time everyone has to prepare.\"\n\nHe begins counting on his fingers:\n\n\"From the Royal Family and Aragón:\n\nMyself and my brother Enrique, obviously\n\nThe Military Orders:\n\nThe Master of the Order of Santiago\n\nThe Master of the Order of Calatrava\n\nThe Master of the Order of Alcántara\n\nThe Church:\n\nArchbishop of Toledo\n\nPerhaps also the Bishop of Burgos or Seville?\n\nThe Great Noble Houses:\n\nÍñigo López de Mendoza, head of House Mendoza\n\nPedro Fernández de Velasco, head of House Velasco\n\nDiego López de Estúñiga, head of House Estúñiga\n\nRodrigo Alonso Pimentel, Count of Benavente\n\nCity Representatives:\n\nTwo representatives from Burgos\n\nTwo from Seville\n\nTwo from Toledo\n\nOne from Valladolid\"\n\nHe counts mentally: \"That's roughly... eighteen to twenty members. Large enough to be representative, small enough to function.\"\n\nEnrique adds: \"And of course Don Álvaro as Constable—he should attend, though perhaps without a vote since he's your personal appointee?\"\n\nJuan nods: \"Yes, he attends and advises but doesn't vote. The council decides collectively.\"\n\nHe looks at you: \"Does this composition suit Your Majesty? Anyone you'd add or remove?\"\n\nWhat do you say?"
        },
        {
          "role": "player",
          "text": "I have no particular preference regarding the suggestions still in there. But you mention votes, the council does not vote on anything. We can establish a body or a permanent council with powers, but that's what we are there to figure out. Right now it's just an invitation for a political meeting to discuss the realm's concerns."
        },
        {
          "role": "gm",
          "text": "Juan and Enrique might be slightly confused or disappointed by this clarification, since they thought they were establishing something more formal. But the user is correctly keeping his options open.\n\nJuan pauses, his quill hovering over the parchment. He exchanges a quick glance with Enrique, and you see a flicker of recalculation.\n\n\"Ah,\" Juan says carefully. \"So this first gathering is... consultative? To discuss what form a permanent council might take?\"\n\nEnrique frowns slightly: \"But cousin, I thought we were establishing—\"\n\nJuan cuts him off with a gesture, his mind working: \"No, no, Enrique. His Majesty is right to be cautious. We're inviting the realm's leaders to discuss how best to structure governance going forward. The meeting itself isn't the council—it's where we decide what the council should be.\"\n\nHe looks at you with something like respect: \"Clever, cousin. You don't want to commit to a specific structure before hearing from everyone. The actual powers and composition get decided at the gathering, with everyone's input.\"\n\nEnrique looks less pleased: \"But the regency council while you're on pilgrimage—that's still agreed?\"\n\nJuan nods: \"Yes, that's separate. A temporary arrangement during His Majesty's absence. This larger gathering in six months is about permanent structures.\"\n\nHe adjusts his approach: \"So the invitation should read something like: 'His Majesty summons the realm's leaders to counsel together on matters of governance and the kingdom's welfare. The purpose is to establish how the Crown may best benefit from the wisdom of the realm's natural leaders.'\"\n\nHe looks at you: \"Vague enough to be flexible, formal enough to be taken seriously. Does that capture Your Majesty's intent?\"\n\nIs this what you wanted?"
        },
        {
          "role": "player",
          "text": "Indeed, I dont want to take any rash decisions. I want to consult everyone and then move forward. And yes cousin, dont worry, the regency arrangements stand. Ha!"
        },
        {
          "role": "gm",
          "text": "Juan and Enrique should feel satisfied - they got what they wanted (the regency council with real power while the king is away) and the king seems appropriately deferential and eager to please. They think they're winning.\n\nLet me show their satisfaction and have them help draft the invitation language.\n\nEnrique visibly relaxes, grinning. \"Good! For a moment I thought—well, never mind. Yes, this works.\"\n\nJuan actually chuckles, the tension breaking. \"Your Majesty, you had us worried there for a moment. But you're quite right—consult broadly first, then decide. That's wise governance.\"\n\nHe begins dictating to the secretary:\n\n\"Royal Summons to Council\n\nTo [Name and Title],\n\nHis Majesty Juan II, by the Grace of God King of Castile and León, greets you and requests your honored presence.\n\nWe summon the realm's distinguished leaders to gather at [Valladolid?] on [date - six months hence] to counsel together on matters of governance and the welfare of our kingdom.\n\nThe purpose of this gathering is to hear the wisdom of the realm's natural leaders and to discuss how the Crown may best benefit from such counsel in establishing just and effective rule.\n\nYour attendance and guidance are valued and expected.\n\nGiven under Our hand, etc.\"\n\nJuan looks up: \"Where should we hold it, Your Majesty? Valladolid, since you're based here? Or somewhere more central like Toledo or Burgos?\"\n\nEnrique adds: \"And the exact date—six months from now would be... autumn? Late September or early October?\"\n\nJuan nods: \"That gives everyone time to travel, and gives you time for your pilgrimage. You depart in, what, two or three weeks? Gone for perhaps four months? Return a month or so before the gathering?\"\n\nHe seems to be calculating the timeline, ensuring it all fits together.\n\nWhat location do you want? And does the timeline work for you?"
        },
        {
          "role": "player",
          "text": "What date is today?"
        },
        {
          "role": "gm",
          "text": "Álvaro speaks up from behind you: \"It's the 6th of May, Your Majesty. Year of Our Lord 1430.\"\n\nJuan nods: \"So six months from now would be early November. The roads should still be passable before winter sets in fully.\"\n\nEnrique considers: \"That gives Your Majesty until late May or early June to depart on pilgrimage, four months away—returning by late September or early October—then a month to prepare before the council gathering in early November.\"\n\nJuan looks at you: \"Does early November suit Your Majesty? Say, the 8th of November? And what city—Valladolid, Toledo, or Burgos?\"\n\nWhat do you decide?"
        },
        {
          "role": "player",
          "text": "Why not Sevilla? In wintertime it's not as cold there.\n\n\nOh, I can't wait."
        },
        {
          "role": "gm",
          "text": "Juan pauses, considering. \"Seville...\" He exchanges a glance with Enrique.\n\nEnrique shrugs: \"Warmer, certainly. And it's a major city—prestigious, wealthy, good accommodations.\"\n\nBut Juan's eyes narrow slightly with thought: \"It's quite far south, though. Makes travel harder for northern nobles—Burgos, the Basque regions. They'd have to journey for weeks.\"\n\nHe considers further: \"Though I suppose that's true for any location—someone always travels farthest. And Seville does have advantages. The cathedral would be magnificent for the opening ceremonies. The city's wealth would allow for proper hospitality.\"\n\nEnrique adds: \"And it sends a message—showing royal authority in the south, near the Granada frontier. Reminds everyone we're still a crusading kingdom.\"\n\nJuan seems to be warming to the idea: \"Actually, yes. Seville works well. The Archbishop of Seville would be honored to host, the city's merchants and guilds would ensure everything is properly arranged.\"\n\nHe nods decisively: \"Very well—Seville, 8th of November. We'll note in the invitation that the milder climate makes it suitable for a gathering of this importance.\"\n\nThe secretary makes the notation.\n\nJuan looks at you with something like approval: \"Your Majesty thinks practically. Good. Now, shall we have these invitations prepared for your seal? They should go out within days.\"\n\nDo you want to review the final invitation text, or authorize sending them immediately?"
        },
        {
          "role": "player",
          "text": "Yes, let them be prepared. I want to sign and seal everyone personally."
        },
        {
          "role": "gm",
          "text": "Juan nods approvingly. \"Personal seals on each invitation—that shows proper respect and seriousness. The recipients will appreciate it.\"\n\nEnrique stands, stretching. \"We should provide you with the complete list of names and proper titles. Some of these appointments can be... particular about their full dignities being acknowledged.\"\n\nJuan gestures to his own secretary who's been standing quietly by the door: \"I'll have a complete list prepared with correct titles and current locations. We'll send it to you within two days, then you can have the invitations drafted and sealed.\"\n\nHe extends his hand again to you: \"Cousin, this has been a productive meeting. Far more than I hoped for, honestly. You've shown real wisdom today—seeking counsel, accepting help, thinking about the realm's stability.\"\n\nEnrique clasps your shoulder warmly: \"And your pilgrimage—I understand it better now. A young king needs spiritual grounding. Come back strengthened in faith, and we'll govern this kingdom together properly.\"\n\nJuan adds: \"We should formalize the regency council charter as well—have it drawn up, signed and witnessed before you depart. Perhaps in two weeks? That gives you time to meet with your new confessor, prepare for the journey, and ensures everything is legally established.\"\n\nHe glances at Álvaro, who has remained largely silent throughout: \"Don Álvaro, I trust you understand the arrangements? You'll manage daily administration, we'll provide oversight on major decisions. Partnership.\"\n\nHis tone is respectful but firm—establishing the new reality.\n\nWhat do you say as the meeting concludes? And do you want to return to Valladolid now?"
        },
        {
          "role": "player",
          "text": "I feel I am quite eager to depart, now that everything seems to be made in order.\n\n\nCan you visit me next week? We can sign and declare the regency in the presence of the nobles in town and other witnesses."
        },
        {
          "role": "gm",
          "text": "This makes sense from the character's perspective - they want to get going on their Rome plan. The Infantes should be pleased with this eagerness, as it suggests the king is genuine and not having second thoughts.\n\nLet me have Juan respond positively but maybe add some practical details about what needs to happen.\n\nJuan smiles broadly. \"Next week? Your eagerness does you credit, cousin. Yes, we can come to Valladolid.\"\n\nEnrique nods enthusiastically: \"A public declaration—good. Shows the realm that this is legitimate, formal, that we're all acting in concert.\"\n\nJuan becomes more businesslike: \"Let's say... a week from today? The 13th of May? That gives us time to notify the Archbishop of Toledo—he should be present as a witness and council member. And we should invite the Mendozas as well, since Don Íñigo will be on the council.\"\n\nHe counts on his fingers: \"We'll need the formal charter prepared and copied—multiple copies for records. Witnesses from the major noble houses currently in Valladolid. Perhaps make it a ceremonial occasion in your throne room?\"\n\nEnrique adds: \"And then you could depart shortly after? Within days? The weather's good for travel now, and the sooner you go, the sooner you return.\"\n\nJuan looks at you appraisingly: \"Your Majesty, you've changed my opinion today. I came here thinking... well, never mind what I thought. But you've shown you can be decisive when needed. This arrangement will serve Castile well.\"\n\nBehind you, Álvaro finally speaks, his voice carefully neutral: \"Shall we return to Valladolid, Your Majesty? Much to prepare.\"\n\nDo you want to conclude the meeting and head back? Anything else to discuss with the Infantes?"
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_1430_00010",
      "book": 1,
      "chapter": "1.01",
      "date": "1430-05-20",
      "end_date": null,
      "type": "crisis",
      "summary": "Juan II's plan to prevent the Infantes from revolting during his pilgrimage is put to the dice. Despite careful negotiation and giving the Infantes real power, the roll comes up badly — a revolt WILL take place during Juan's absence. The chapter ends with the dice's cruel verdict hanging over all the young king's careful planning.",
      "characters": [
        "juan_ii",
        "infante_juan_de_aragon",
        "infante_enrique_de_aragon",
        "alvaro_de_luna"
      ],
      "factions_affected": [
        "royal_court",
        "aragonese_faction"
      ],
      "location": "Medina del Campo",
      "tags": [
        "crisis",
        "roll",
        "revolt",
        "cliffhanger"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "I will now complete the action. My aim was to not have the infantes revolt while I am away on pilgrimage. How likely is this?"
        },
        {
          "role": "gm",
          "text": "FACTORS WORKING IN YOUR FAVOR\n\n1. They Think They've Won\n\nThis is your greatest protection. The Infantes came to this meeting expecting to pressure a weak young king. Instead, you:\n\nAcknowledged their concerns about Álvaro\n\nAgreed to create exactly the council structure they wanted\n\nGave them REAL power through the regency council\n\nMade them feel like wise elder statesmen guiding a grateful nephew\n\nThey're leaving this meeting satisfied, even triumphant. Men who think they're winning don't rebel.\n\n2. They Have a Legal Path to Power\n\nWhy risk rebellion when they just secured:\n\nAuthority over major military deployments\n\nControl over large expenditures\n\nVeto power on important appointments\n\nWeekly meetings where they can block Álvaro\n\nA larger council in 6 months they expect to dominate\n\nRebellion is bloody, expensive, and uncertain. They now have a bloodless path to controlling Castile's governance.\n\n3. Open Rebellion Would Destroy Their Gains\n\nIf they rebel now, they:\n\nBreak an agreement they just made publicly\n\nLook dishonorable and treacherous\n\nLose the legitimacy of the regency council\n\nUnite other nobles against them (who would fear similar treatment)\n\nRisk everything in civil war\n\n4. You Played Your Role Well\n\nYou convinced them you're:\n\nGenuinely overwhelmed and seeking help\n\nPious and earnest (the pilgrimage desire seemed authentic)\n\nWilling to share power (not trying to be an autocrat)\n\nManageable (they think they can continue to guide/control you)\n\nThis makes them confident they don't need violence—political manipulation will suffice.\n\n5. Time Is On Their Side (They Think)\n\nFrom their perspective:\n\nYou'll be gone 4 months—they govern during that time\n\nYou return for a council they expect to control\n\nYour \"permanent\" arrangements will favor them\n\nWhy rush when the trajectory is already in their favor?\n\nREMAINING RISKS\n\n1. If They Discover Your True Plans\n\nIf they learn about:\n\nYour advance delegation to Rome\n\nThe crusade negotiations\n\nYour intention to use papal authority to override them\n\nThat the pilgrimage is cover for political maneuvering\n\nThen they'd feel deceived and might act preemptively. But you've kept this tight—only you and Álvaro know.\n\n2. If Álvaro Overplays His Hand\n\nIf Álvaro tries to circumvent the regency council, ignores their authority, or makes major decisions without consulting them, they could claim he's violating the agreement and move to \"enforce\" it with troops.\n\nThis is actually a real risk—Álvaro will hate being constrained, and he might try to work around them.\n\n3. If Other Nobles Push Them\n\nSome of their supporters might argue: \"Why wait? The king is gone, you have a council, just declare a permanent regency and be done with it.\"\n\nBut Juan seems politically sophisticated enough to resist this. He knows patience often wins what haste loses.\n\n4. If Something Goes Wrong With Your Journey\n\nIf you're delayed, captured, fall seriously ill, or don't return when promised, the situation becomes unstable. They might claim regency needs to become permanent \"until His Majesty recovers/returns.\"\n\n5. The Mendoza Variable\n\nYou're putting Íñigo López de Mendoza on the regency council. If the Mendozas decide to side more firmly with the Infantes, that's three of four council members against Álvaro. They could effectively govern without rebellion.\n\nBut if the Mendozas stay neutral or lean toward the crown, they balance the Infantes.\n\nTHE VERDICT: LIKELY TO SUCCEED\n\nProbability they DON'T revolt during your pilgrimage: 70-75%\n\nHere's why it's not higher:\n\nYou gave them real power, which satisfies them, but you also constrained yourself significantly. The regency council isn't just theater—it actually limits what Álvaro can do while you're gone.\n\nThe Infantes will spend your absence:\n\nTesting the limits of the regency council\n\nConsolidating their position\n\nMaking appointments favorable to them\n\nBuilding support for the November gathering\n\nTrying to win over neutral nobles\n\nThey're playing the long game now because you gave them a path to win it.\n\nHowever, this means:\n\nYou'll return to a realm where they've strengthened their position\n\nThe November council will be more challenging than if you'd kept them weaker\n\nÁlvaro will be frustrated and possibly undermined\n\nYou'll need that papal crusade bull to be VERY impressive to override their momentum\n\nCRITICAL SUCCESS FACTORS\n\nFor this to work as planned:\n\nKeep the Rome plan absolutely secret - Any leak and they move immediately\n\nReturn on time - Being late creates dangerous uncertainty\n\nGet that crusade bull - Without it, you return to a stronger Infantes faction\n\nÁlvaro must respect the regency council - Even while hating it, or they'll claim violation\n\nKeep the Mendozas neutral - Don't let them fully align with the Infantes\n\nThe Gamble: You've traded 4 months of increased Infantes power for freedom to secure papal backing. If you return with that crusade bull and papal authority, the temporary concessions become irrelevant. If you return empty-handed, you've weakened your position significantly.\n\nYour performance was convincing, your concessions were substantial enough to be believed, and you left them feeling victorious. This should buy you the time you need.\n\nBut you're now racing against time—secure that papal backing and return before they consolidate too much power."
        },
        {
          "role": "player",
          "text": "Ok, So I just made the dice roll and BAD LUCK. I rolled very low, meaning that during my pilgrimage, a revolt takes place. How and why this happens will be determined later, for now, we just remember that they will revolt while I am on pilgrimage.\n\n\nAnd with that, lets wrap up the chapter here. Privide an extensive summary of everything that happened and put it in a document and call it \"chapter 1\""
        },
        {
          "role": "gm",
          "text": "# Chapter 1: The Young King's Gambit\n## Kingdom of Castile, Spring 1430\n\n### Opening Situation\n\n**Date**: Early May 1430  \n**Location**: Royal Palace, Valladolid\n\nJuan II of Castile, age 18, stands at the beginning of his personal rule after years of regency. He surveys a kingdom in precarious balance:\n\n**Kingdom Status:**\n- **Treasury**: Strained but functional (~30 million maravedís annual revenue, ~28 million expenses)\n- **Military Strength**: Moderate and divided (3,000 royal troops, ~15,000-20,000 potential feudal levies)\n- **Noble Loyalty**: CRITICAL CONCERN - fractious nobility, power struggles\n- **Popular Support**: Cautiously positive but distant\n- **Foreign Relations**: Tense with Aragon, uneasy peace with Granada, correct relations with Portugal\n\n**Primary Threats:**\n- The **Infantes de Aragón** (Juan and Enrique) - powerful princes with estates in Castile, commanding noble factions, seeking to control the young king\n- **Álvaro de Luna** - the King's Constable and closest advisor, deeply hated by nobles who see him as a low-born upstart monopolizing power\n- Fractious nobility ready to exploit any weakness\n- Economic pressures and inefficient taxation (20% revenue lost to corruption)\n\n### The Decision to Act\n\nAfter reading urgent letters from Seville (noble feuds, Infantes' influence, foreign gold), Toledo (Archbishop urging crusade), the frontier (Granada skirmishes, need for supplies), and a letter from Infante Juan himself (offering \"counsel\" that thinly veils demands for control), Juan II makes a fateful declaration:\n\n**\"This abuse ends now and forever. I will determine my own actions.\"**\n\nWith Álvaro de Luna, he begins planning not just survival, but transformation of Castilian governance.\n\n### Building the Foundation\n\n**Securing the Palace:**\n- Assessment of loyal forces: Captain Fernán Alonso de Robles and ~20-25 truly loyal royal guards\n- Review of treasury and financial situation\n- Understanding the mechanisms of noble control: information monopoly, institutional capture, military reality, physical control of the king's person\n\n**The Guard Assembly** (FAILED ACTION):\nJuan attempts to inspire personal loyalty in his 30-man royal guard with a speech about divine purpose, expanded roles, and promises of better equipment. The attempt falls flat - the guards respond professionally but without passion. The king learns that words alone don't create devotion.\n\nRecovery: Juan acknowledges his mortality and inexperience, earning grudging respect. He authorizes 150,000 maravedís for guard equipment (mail hauberks, matching weapons, proper livery) and begins working with Captain Fernán on practical matters.\n\n**Assembling an Advisory Cabinet:**\nJuan decides to build his own intelligence network, summoning:\n- **Juan de Daza** - Treasury official, commoner, to track money flows and urban intelligence\n- **Diego Gómez de Sandoval** (Count of Castro) - Converso noble, to observe court factions\n- **Lope de Barrientos** - Dominican scholar from Salamanca, for Church networks\n- **Íñigo López de Mendoza** - Young Mendoza family member, poet and observer\n- **Rodrigo Manrique** - Frontier soldier, for military intelligence\n\n### The Grand Strategy\n\nIn private counsel with Álvaro de Luna, Juan develops an audacious multi-part plan:\n\n**1. Create a Royal Council** - Give nobles formal access while retaining real control\n\n**2. Secure Papal Backing** - Travel to Rome personally to obtain:\n- Crusade bull against Granada\n- Papal endorsement of his rule\n- Support for governance reforms\n\n**3. Launch Crusade Against Granada** - Use holy war to:\n- Unite fractious nobles behind common cause\n- Provide religious justification for taxation\n- Demonstrate royal leadership\n- Win glory and prestige\n\n**4. Reform Taxation** - Under cover of crusade necessity, fix the inefficient system where 20% of revenue is lost to corruption and nobles pay almost nothing\n\n**5. Centralize Military Authority** - Create unified royal command for the crusade, establishing precedent for permanent standing army\n\n**The Rome Journey Debate:**\nÁlvaro warns that a 4-6 month absence is extremely dangerous - the Infantes could seize control, establish a regency, or move against royal interests. Multiple approaches debated:\n- Send Álvaro instead (safer but less impactful)\n- Send a powerful embassy (respectable but lacks personal touch)\n- Go with massive security (expensive, slow, conspicuous)\n- Go in secret (risky if discovered, looks weak)\n- Semi-public pilgrimage (honest but still dangerous)\n\nJuan insists on going personally - the Pope needs to see his sincerity and youth. Personal diplomacy could accomplish what no letter could achieve.\n\n### Understanding the Enemy\n\n**Why Don't the Infantes Act Now?**\n- **Legitimacy matters**: Juan is anointed king; open rebellion invites excommunication and condemnation\n- **They prefer control to overthrow**: Keep Juan as figurehead while governing in fact\n- **They're not united enough yet**: Civil war outcome is uncertain\n- **Juan is present and alert**: Hard to claim he needs \"rescue\" when visibly ruling\n- **They have a legal path**: Political pressure might work without violence\n\n**What Changes If Juan Leaves:**\n- Legitimacy argument shifts to \"abandoned realm needs temporary governance\"\n- Royal supporters can't rally to an absent king\n- Infantes control the narrative\n- They can seize strategic positions without fighting Juan personally\n\n**Álvaro's Supporters Assessment:**\n- **Definitely Loyal**: Álvaro himself, ~30-40 royal officials, Captain Fernán and core guards, the new advisory cabinet\n- **Probably Supportive**: Major cities/merchants, much of Church hierarchy, Mendoza family (conditionally)\n- **Neutral/Watching**: Most middling nobles, Military Orders\n- **Actively Opposed**: Infantes' faction (~8-10 major houses, 25% of military power)\n\n**Reality**: Most of Castile is neutral rather than loyal. Juan inherits a throne without a faction - he must build support from nothing.\n\n### Choosing a Confessor\n\nJuan learns his previous confessor, Father Gonzalo, died last winter. He has been between confessors. This becomes crucial for the Rome journey.\n\n**Choice**: **Fray Hernando de Talavera**\n- Age ~32, young Hieronymite monk\n- Humble background, extreme personal piety\n- Genuinely holy, morally rigorous\n- Young enough to keep pace on demanding journey\n- No political connections - completely dependent on royal favor\n- Would inspire confidence in Rome about Juan's spiritual sincerity\n\nSummoned immediately from Toledo monastery.\n\n**Critical Decision**: Juan tells Álvaro that only they two will know the full plan. Juan will \"manage his confessions\" as needed - a dangerous game that Álvaro warns against.\n\n### Week of Preparation\n\n**Combat Training with Captain Fernán:**\nDaily dawn sessions learning:\n- How to move and fight in armor\n- Practical sword work (cuts and guards)\n- Mounted combat and lance work\n- Building endurance and strength\n\nBy week's end: sore, bruised, exhausted, but competent. Can wear armor without looking awkward and handle weapons credibly.\n\n**Rehearsing Deception with Álvaro:**\nPracticing the role of \"young, earnest king seeking guidance\" - appearing uncertain, overwhelmed, deferential. Harder than expected to play weak when feeling strong. Learning to read the Infantes' reactions.\n\n**Meeting First Advisors:**\n- **Juan de Daza**: Assigned to track financial flows in Valladolid\n- **Diego Gómez de Sandoval**: Assigned to observe noble factions\n\nBuilding the intelligence network begins.\n\n### The Meeting at Medina del Campo\n\n**Date**: May 6, 1430 (one week after initial planning)  \n**Location**: Medina del Campo, neutral market town 30 miles from Valladolid\n\n**Juan's Company:**\n- Álvaro de Luna (Constable)\n- Captain Fernán Alonso de Robles\n- 10 royal guards (in new equipment - impressive)\n- 2 chamberlains (including one with Infantes connections)\n- Secretary and 4 servants\n- Total: ~20 people\n\n**The Infantes:**\n- **Infante Juan de Aragón**: ~35, King of Navarra, intelligent, politically sophisticated\n- **Infante Enrique de Aragón**: Early 30s, martial, direct, more dangerous in different way\n- ~15-man retinue\n\n### The Negotiation\n\n**Opening Gambit** (Juan's Performance):\nJuan plays the overwhelmed young king - shaking hands enthusiastically, admitting his failed guard speech, showing relief at meeting them. The Infantes visibly relax, thinking this will be easy.\n\n**The Infantes' Initial Probe:**\n- Who advised the failed speech? (Testing Juan's reliance on Álvaro)\n- Who does Juan consult on decisions? (Assessing isolation)\n- Suggesting Juan needs \"experienced men of noble blood\"\n\n**Juan's Deflection:**\nShifts to discussing piety, church importance, not having sent gift to Pope yet. This unexpected turn confuses them briefly - is he scattered and anxious, or changing subject deliberately?\n\n**The Infantes Pivot:**\n- Ask about correspondence with Rome\n- Warn about Archbishop of Toledo's influence\n- Offer to guide proper papal relations\n- Push for formal council of \"realm's natural leaders\"\n\n**Juan's Counter:**\nAdmits feeling overwhelmed by competing demands: \"everyone seems to want something for themselves while the realm suffers.\"\n\nThen: **\"I like the idea of a council. Who should we invite you think?\"**\n\n**The Infantes Take the Bait:**\nEnthusiastically outline council structure:\n- Royal family (themselves)\n- Military Orders (Masters of Santiago, Calatrava, Alcántara)\n- Archbishop of Toledo\n- Great noble houses (Mendozas, Estúñigas, Velascos, etc.)\n- City representatives (Burgos, Seville, Toledo, Valladolid)\n- 15-20 members total\n- Should have \"meaningful input\" on major decisions\n- Meet regularly\n- Should \"advise\" on royal household appointments (targeting Álvaro)\n\nThey argue for binding authority, monthly meetings, power over appointments.\n\n**Juan's Critical Pivot:**\nSuggests going on **pilgrimage** - wants to find spiritual clarity, just lost his confessor. Offers: \"Would you be willing to keep council and keep the administration running in my absence?\"\n\n**The Infantes' Response:**\nInitial surprise and suspicion (whose idea? how long? what authority?), but clear interest in the opportunity. They probe for details while trying not to seem too eager.\n\n**The Confrontation:**\nWhen Juan says Álvaro would \"take his place\" during absence, Infantes push back hard:\n- That's not sharing power, just current arrangement with Juan absent\n- Want actual regency authority, not advisory role\n- Accuse Álvaro of monopolizing power\n\n**Juan's Bold Move:**\n\"Cousins, now is my turn to be blunt... Please tell me you do not want to depose me and rule as de-facto king in my stead while I am away.\"\n\nShocked silence. Masks drop. Then careful responses:\n- Deny deposing, but admit wanting real authority\n- Argue concentration of power in Álvaro creates instability\n- Warn that excluded nobles breed resentment leading to civil war\n\n**The Compromise:**\nInfantes propose: Álvaro manages day-to-day administration, but regency council (the two Infantes + Archbishop + one Mendoza) must approve major decisions:\n- Military deployments over 1,000 men\n- Expenditures over 200,000 maravedís\n- Diplomatic treaties\n- High office appointments\n- War/peace declarations\n\nWeekly meetings, majority vote (3 of 4), documented decisions.\n\n**Juan's Response:**\nHolds out his hand: **\"Done.\"**\n\n### The Agreement\n\n**Regency Council During Pilgrimage:**\n- **Members**: Infante Juan, Infante Enrique, Archbishop of Toledo, Íñigo López de Mendoza\n- **Duration**: Juan's departure until return (~4-6 months)\n- **Powers**: Approve/reject major military, financial, diplomatic, and appointment decisions\n- **Administration**: Álvaro de Luna handles day-to-day governance\n\n**Royal Council Meeting:**\n- **Date**: November 8, 1430 (6 months hence)\n- **Location**: Seville (Juan's choice - warmer, prestigious, near Granada frontier)\n- **Purpose**: Consultative gathering to discuss permanent governance structures\n- **Invitations**: ~18-20 members (royal family, military orders, church, great houses, city representatives)\n- **Format**: Discussion and counsel, not voting body - structure to be decided at the gathering itself\n\n**Timeline:**\n- May 13: Public ceremony in Valladolid to formalize regency council\n- Late May: Juan departs on pilgrimage\n- ~4 months: Pilgrimage/Rome journey\n- Late September/Early October: Juan returns\n- November 8: First Royal Council convenes in Seville\n\n**The Infantes' Perspective:**\nThey leave satisfied, even triumphant:\n- Gained real authority through regency council\n- Secured major council gathering they expect to dominate\n- Think they've outmaneuvered the young king\n- Believe they have legal path to control without rebellion\n- See Juan as manageable and grateful for guidance\n\n**Juan's Hidden Reality:**\n- Secured freedom to travel to Rome for papal backing\n- Gave real concessions to buy time and prevent immediate revolt\n- Plans to return with crusade bull that will override their political maneuvering\n- Hopes religious fervor and papal authority will trump their position\n- Betting 4 months of increased Infantes power against securing unassailable legitimacy\n\n### Chapter Conclusion\n\nThe meeting concludes with handshakes, warm words, and mutual satisfaction. Plans are made to formalize everything publicly in a week.\n\nBut as Juan and his company prepare to return to Valladolid, a cruel twist of fate awaits.\n\n**The dice have spoken.**\n\nDespite careful planning, despite the successful negotiation, despite giving the Infantes what they wanted - **something will go wrong during Juan's pilgrimage.**\n\n**The Infantes will revolt.**\n\n*How and why this catastrophe unfolds will be revealed in Chapter 2...*\n\n---\n\n## Key Characters Introduced\n\n**Juan II of Castile** - Age 18, anointed king beginning personal rule. Intelligent, strategic, pious. Learning to balance genuine devotion with political necessity. Willing to take enormous risks.\n\n**Álvaro de Luna** - Royal Constable, Juan's closest advisor. Brilliant, loyal, hated by nobles. From minor nobility but wields extraordinary power. Politically sophisticated but will be constrained by regency council.\n\n**Infante Juan de Aragón** - ~35, King of Navarra, elder Infante. Sophisticated political operator, patient, calculating. Sees long game.\n\n**Infante Enrique de Aragón** - Early 30s, warrior prince, more direct and dangerous. Less subtle than his brother but perhaps more genuinely threatening.\n\n**Captain Fernán Alonso de Robles** - Mid-30s, commander of royal guard. Minor knight from Extremadura, loyal to crown. Practical soldier, competent teacher, personally devoted to Juan.\n\n**Fray Hernando de Talavera** - ~32, Hieronymite monk. Humble background, extreme piety, morally rigorous. Chosen as royal confessor for Rome journey.\n\n**Juan de Daza** - ~40, commoner, treasury official. Careful observer, intelligent, tracking financial intelligence.\n\n**Diego Gómez de Sandoval (Count of Castro)** - 32, converso noble. Sharp, soldier and courtier, observing court factions.\n\n---\n\n## Themes Established\n\n- **Youth vs. Experience**: 18-year-old king facing seasoned political operators\n- **Legitimacy vs. Power**: Anointed authority vs. actual military/political control\n- **Deception as Statecraft**: Playing roles, managing perceptions, strategic weakness\n- **Faith and Politics**: Genuine piety intertwined with political calculation\n- **The Price of Time**: Trading short-term concessions for long-term gains\n- **Loyalty and Isolation**: Building support from nothing in a hostile environment\n\n---\n\n## Status at Chapter End\n\n**Juan's Position:**\n- Secured time and freedom for Rome journey\n- Made significant concessions to Infantes\n- Building advisory cabinet and intelligence network\n- Royal guard being properly equipped\n- Combat training begun\n- New confessor summoned\n\n**Immediate Future:**\n- May 13: Public ceremony formalizing regency council\n- Late May: Departure on \"pilgrimage\" (actually to Rome via Santiago)\n- 4 months away while Infantes exercise real power\n- Unknown: The revolt that will occur during absence\n\n**The Gamble:**\nEverything depends on securing that papal crusade bull. Return with papal authority and religious fervor, and the Infantes' political gains become irrelevant. Return empty-handed or delayed, and the kingdom may be lost.\n\n**The Dice Have Spoken:**\nDespite a \"likely to succeed\" probability assessment, fate has decreed otherwise. The Infantes will revolt during Juan's pilgrimage. The young king's careful planning, his convincing performance, his strategic concessions - none of it will prevent the coming storm.\n\n*Chapter 2 will reveal how disaster unfolds...*\n\n1. The opening situation and kingdom status\n2. Juan's decision to act and initial planning\n3. The failed guard assembly and equipment authorization\n4. Building the advisory cabinet\n5. The grand strategy (Rome, crusade, reforms)\n6. Understanding the Infantes and why they haven't moved yet\n7. Choosing Fray Hernando as confessor\n8. Week of preparation (combat training, rehearsals)\n9. The crucial meeting at Medina del Campo\n10. The detailed negotiation with the Infantes\n11. The agreements reached (regency council, royal council in Seville)\n12. The final outcome: despite everything, the dice decreed the Infantes will revolt\n\nThis is a good stopping point for the chapter, and sets up the next chapter where we'll discover how and why the revolt happens despite Juan's careful planning.\n\nThe document captures all the key events, decisions, characters, and themes established in this opening chapter.\n\nI've created a comprehensive summary of Chapter 1 in the artifact above.\n\nThis first chapter established Juan II's precarious position as a young king surrounded by powerful rivals, his ambitious plan to transform Castilian governance through papal backing and a crusade against Granada, and the high-stakes negotiation with the Infantes de Aragón.\n\nDespite a masterful performance convincing the Infantes that they had won, despite giving them real power through the regency council to prevent revolt, the dice have decreed otherwise.\n\nJuan will depart on his pilgrimage to Rome in late May 1430, leaving behind a regency council he hopes will keep the Infantes satisfied. But something will go wrong during those crucial months. The revolt will come.\n\nChapter 2 will reveal how this catastrophe unfolds - what triggers the Infantes to break their agreement, how Álvaro de Luna responds, what Juan discovers when news reaches him in distant lands, and whether the young king's gambit can be salvaged from disaster.\n\nThe game is afoot, and the dice have spoken their first cruel verdict."
        }
      ],
      "roll": null
    }
  ]
}
