{
  "chapter": "1.12",
  "book": 1,
  "event_count": 6,
  "date_range": "1431-01-29 / 1431-01-31",
  "events": [
    {
      "event_id": "evt_1431_00072",
      "book": 1,
      "chapter": "1.12",
      "date": "1431-01-29",
      "end_date": null,
      "type": "diplomacy",
      "summary": "Three crucial noble audiences in one day at Toledo's Royal Alcázar. (1) Don Íñigo López de Mendoza the Elder brings son Pedro González de Mendoza (age 30, Salamanca-educated). House Mendoza commits 1,800 levies; Pedro volunteers to take crusader oath at the wedding. Juan clarifies papal bull gives him total command authority — positions assigned on merit, not bloodline. Pedro honest about limited experience, accepts chance to prove himself. Don Íñigo leaves as advocate for the crown. (2) Don Enrique Enríquez, Admiral of Castile, nervous about maritime-based wealth assessment. Juan reassures: assessments valid 10 years, re-assessment if revenue changes. Detailed naval discussion — Castile's fleet is ~30 ships (mostly merchant), compared to Aragon's 60-80 war galleys. Enríquez advocates for long-term fleet development, describes pirate threat from Barbary Coast, offers 4 carracks and 6 caravels for crusade logistics. Juan promises future naval expansion consultation. (3) Don Luis de Guzmán, Master of Santiago — arrived expecting punishment for backing the Infantes. Instead, Juan invites him for wine, shows relics (Guzmán kneels in genuine devotion: 'This is what Santiago was founded for'). Juan explains taxation funds crusade infrastructure under Vatican oversight. Offers choice: field command or honored advisory role. Roll: 56 (Grateful Acceptance) — Guzmán deeply moved, steps down from field command voluntarily, commits Santiago's 2,000 knights fully, pledges to mentor younger commanders. Assigned to eastern army as advisor. Immediately contacts Master of Calatrava to share his experience.",
      "characters": [
        "juan_ii",
        "alvaro_de_luna",
        "inigo_lopez_de_mendoza",
        "pedro_gonzalez_de_mendoza",
        "enrique_enriquez",
        "luis_de_guzman",
        "isabel_of_portugal",
        "dona_beatriz"
      ],
      "factions_affected": [
        "royal_court",
        "aragonese_faction"
      ],
      "location": "Toledo",
      "tags": [
        "diplomacy",
        "politics",
        "military",
        "taxation",
        "naval",
        "roll"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "We have established that some nobles seek out an audience with Juan before the wedding. That is where we pick up. Who seeks an audience with me?"
        },
        {
          "role": "gm",
          "text": "1. We're at the end of Chapter 11, dated January 28, 1431 in Toledo\n2. The royal wedding is planned for February 15, 1431 (18 days away)\n3. Key nobles are arriving in Toledo for the wedding\n4. Some great houses (specifically Mendoza and Guzmán mentioned) have requested private audiences to seek \"clarity\" on tax details\n5. The taxation plan has been approved by the oversight committee\n6. The wedding will also serve as a major crusade recruitment event and the taxation will be announced\n7. The budget/taxation framework has been established - ecclesiastical assessors will evaluate property, and the crusade taxation will be implemented\n\nGiven that the user asks who seeks an audience, I should identify specific nobles from major houses who would want to meet with Juan before the wedding. Based on the historical context and the documents, the likely candidates would be:\n\n- House of Mendoza (one of the most powerful families)\n- House of Guzmán (mentioned specifically as seeking clarity)\n- Possibly other great houses like Enríquez, Álvarez de Toledo, etc.\n\nThese nobles would want private audiences to:\n1. Understand the taxation details before public announcement\n2. Negotiate or seek exemptions\n3. Express concerns about the crusade\n4. Secure favorable positions or arrangements\n5. Test Juan's resolve before the public commitment\n\nI should present this narratively, identifying 2-3 specific nobles who request audiences, their motivations, and set up the scene for Juan to engage with them. I'll keep it focused and not suggest what Juan should do, just present the situation.\n\nPerfect, now I have a comprehensive understanding of the situation. Let me identify which nobles would seek an audience with Juan before the wedding on February 15, 1431. Based on the documents:\n\n1. The major houses mentioned are: Mendoza, Guzmán, Álvarez de Toledo, Enríquez\n2. Specifically mentioned as seeking \"clarity\" on tax details: Mendoza and Guzmán\n3. The taxation is 5% on noble estates with a 2,000 maravedí exemption for those serving personally in the crusade\n4. Assessment teams will prioritize the wealthiest estates (Mendoza, Álvarez de Toledo, Guzmán named specifically)\n5. The taxation will be announced publicly at the wedding on February 15\n\nGiven this, I should identify 2-3 specific nobles from major houses who would request private audiences. These would likely be:\n\n1. **Íñigo López de Mendoza** (the Elder) - Head of House Mendoza, one of the most powerful families. The younger Íñigo López de Mendoza is in Juan's cabinet, which creates an interesting dynamic.\n\n2. **Luis de Guzmán** - Master of Santiago (Military Order), allied with the Infantes in the past but now the Infantes have sworn crusade oaths. He'd be very concerned about the taxation and his position.\n\n3. Possibly someone from House Enríquez or another major house\n\nLet me set the scene properly - it's January 28, 1431 in Toledo, 18 days before the wedding. Nobles are arriving. Some have requested private audiences. I'll present who seeks audiences and why, setting up the scene for Juan to engage.\n\nCHAPTER 12: THE RECKONING\n\nDate: January 29, 1431\nLocation: Royal Alcázar, Toledo\n\nThe morning sun filtered through the high windows of Juan's private study, casting long shadows across the floor. Outside, Toledo hummed with activity—noble households arriving daily for the wedding, their banners adding splashes of color to the city's ancient stone. But inside these walls, the air held a different tension.\n\nÁlvaro stood by the window, arms crossed, watching the courtyard below. \"Three requests came in last night,\" he said quietly. \"All from houses who've heard the whispers about what you'll announce at the wedding.\"\n\nJuan looked up from the pile of correspondence on his desk. Letters from across Castile—some congratulatory about the marriage, others more carefully worded, probing for details about the \"matters of crusade administration\" to be discussed.\n\n\"Tell me.\"\n\nÁlvaro turned, his expression unreadable. \"First: Don Íñigo López de Mendoza the Elder. Head of House Mendoza. He arrived yesterday with forty retainers and his son Pedro. He's requesting a private audience 'to better understand His Majesty's vision for the nobility's participation in the holy crusade.'\" A slight pause. \"His phrasing was very careful.\"\n\nJuan nodded slowly. The Mendozas—one of the wealthiest and most powerful families in Castile. The younger Íñigo, the poet, served in Juan's own cabinet. But the elder Íñigo was a different matter entirely: pragmatic, calculating, immensely influential among the great houses.\n\n\"Second,\" Álvaro continued, \"Don Enrique Enríquez, Admiral of Castile. He's concerned about how the papal taxation will affect the coastal holdings and wants to discuss 'clarification of certain provisions regarding service in lieu of payment.' He emphasized his family's long military service to the crown.\"\n\nThe Enríquez family—powerful in the north, with extensive estates and traditional claims to naval authority. Enrique himself was about forty, a competent administrator but no warrior. His concern would be protecting family wealth while appearing appropriately loyal.\n\n\"And third?\" Juan asked, though he suspected he knew.\n\nÁlvaro's jaw tightened slightly. \"Don Luis de Guzmán, Master of Santiago.\" He let that hang in the air for a moment. \"He requests an audience to discuss 'the Military Orders' role in the coming campaign and matters of crusade administration affecting the Order's properties.'\"\n\nJuan leaned back in his chair. Luis de Guzmán—the man who had sided with the Infantes during their rebellion, who commanded two thousand Santiago knights, whose Order controlled vast estates across Castile. The same man whose political calculation had led him to support the wrong side of that conflict.\n\n\"He has considerable courage,\" Juan observed dryly, \"requesting a private audience after supporting those who tried to undermine the crown.\"\n\n\"Or considerable desperation,\" Álvaro replied. \"The Santiago properties are extensive. The ten percent church tax plus the five percent noble tax—if they assess his personal holdings alongside the Order's estates...\" He shrugged. \"It could be crushing. And the personal service exemption doesn't help him much—he's in his fifties, not exactly crusade material anymore.\"\n\nJuan stood and walked to the window, looking out over Toledo. The city where his father had ruled, where the weight of Castilian history pressed down like the stones of the cathedral itself.\n\n\"What's your assessment?\" he asked.\n\n\"Mendoza will be reasonable—he's always played the long game. He'll want clarity, perhaps some reassurance that the assessment will be fair, maybe hint at generous voluntary contributions beyond the tax if treated respectfully.\" Álvaro paused. \"Enríquez will try to negotiate the details, find loopholes, perhaps offer naval service as a substitute. He's a bureaucrat at heart.\"\n\n\"And Guzmán?\"\n\n\"Guzmán is cornered. The Order's estates are massive, and he can't claim poverty. He can't join the crusade personally without looking ridiculous—everyone knows he's past his prime. And he's politically isolated after backing the Infantes.\" Álvaro's expression hardened. \"He'll either grovel and seek mercy, or he'll try to rally the other Masters to resist the church taxation as an affront to the Orders' privileges.\"\n\nJuan turned back to face his Constable. \"You think he'd risk open resistance?\"\n\n\"I think he's frightened enough to be dangerous. But not strong enough to be effective.\" Álvaro moved closer, lowering his voice. \"The question is what you want to accomplish with these meetings. They're testing you, Your Majesty. Every great house in Castile is watching to see if the king who returns from Rome is the same boy who left, or something... different.\"\n\nThe room fell silent save for the distant sounds of the city. Somewhere in the Alcázar, Isabel would be at her prayers in the Portuguese chapel, finding peace in the familiar rhythms of devotion. The banner and relics waited in their chamber, ready for the wedding ceremony. And in eighteen days, all of these nobles would gather in the cathedral to witness not just a marriage but an announcement that would define the next decade of Castilian history.\n\nJuan looked at the three names Álvaro had mentioned. Three different approaches, three different pressures, three different tests of how he would wield the authority he'd fought so hard to claim.\n\n\"Schedule them,\" Juan said finally. \"Mendoza first—this afternoon if he's available. Then Enríquez tomorrow morning. Guzmán...\" He paused, considering. \"Guzmán can wait until the day after. Let him think about it for a while longer.\"\n\nÁlvaro nodded, a slight smile touching his lips. \"As you command, Your Majesty.\"\n\nHe turned to leave, but Juan called him back. \"Álvaro. Your honest assessment—how many of the great houses will truly resist the taxation?\"\n\nThe Constable was quiet for a long moment. \"In private? All of them will hate it. In public?\" He shrugged. \"Perhaps five or six will make noise, seek special treatment, drag their feet on assessments. But open resistance? With the papal legate here, the banner unveiled, the crusade proclaimed at your wedding with all Castile watching?\" He shook his head. \"They're not stupid. They know the costs of being seen to oppose a holy crusade. They'll grumble, negotiate where they can, and ultimately comply.\"\n\n\"And if they don't?\"\n\nÁlvaro met his gaze steadily. \"Then you'll need to demonstrate that the crown's authority—and the Pope's—is not negotiable. But I don't think it will come to that. Not if you handle these meetings well.\"\n\nAfter Álvaro left, Juan remained by the window. Below in the courtyard, servants unloaded chests from a newly arrived wagon—another noble household taking up residence for the wedding. In the streets beyond, pilgrims continued to arrive to see the banner, to pray before the relics, to offer themselves for the crusade.\n\nThree audiences. Three tests. And behind them, scores of watching eyes from every great house in Castile, waiting to see how their young king would balance papal authority, noble privilege, and the demands of holy war.\n\nWhich audience does Juan wish to take first—Don Íñigo López de Mendoza the Elder, arriving this afternoon?"
        },
        {
          "role": "player",
          "text": "I want to adress how you generate responses. NEVER generate actions or dialogue for Juan, I will write what he does myself. Keep your responses short, especially during dialogues, stop when Juan is asked a question or when a response from him is natural.\n\n\nNow, Juan will have all three audiences after one another on the same day. We start with the Mendoza's, so let them in."
        },
        {
          "role": "gm",
          "text": "They also want all three audiences on the same day, starting with Mendoza. I should just describe Mendoza entering and the initial setup, then stop for Juan to act.\n\nLet me set the scene briefly and stop.\n\nCHAPTER 12: THE RECKONING (Continued)\n\nThe study had been prepared for formal audiences. Juan's chair positioned with his father's sword mounted on the wall behind him, visible to anyone who entered. Álvaro stood to the right, a silent presence. Through the window, the sounds of Toledo's preparation for the royal wedding continued.\n\nA knock at the door.\n\n\"Don Íñigo López de Mendoza, Your Majesty,\" the chamberlain announced.\n\nThe man who entered was in his late fifties, gray-bearded and dignified. He wore dark, expensive clothing without ostentation—the confidence of a man whose wealth and power required no advertisement. Behind him came a younger man, perhaps thirty, bearing a strong family resemblance: his son Pedro.\n\nDon Íñigo the Elder bowed deeply, his son following suit. \"Your Majesty. You honor me with this audience.\" His voice was measured, cultured. \"I have brought my son, Don Pedro González de Mendoza, if Your Majesty permits. He will inherit our house's responsibilities, and I thought it appropriate he witness our discussion.\"\n\nHe straightened, meeting Juan's eyes with the steady gaze of a man accustomed to speaking with kings. Not challenging, but not servile either.\n\n\"I come to offer House Mendoza's congratulations on Your Majesty's forthcoming marriage, and to better understand how we may best serve the holy crusade against Granada.\""
        },
        {
          "role": "player",
          "text": "Of course! Welcome and great to meet your son and heir. He may learn that there is always time to recieve the Mendoza family in my court.\n\n\nDuring the wedding festivities, I will make use of the occasion to adress the realm and announce that we will march on Grenada. I call levies in order to complete the reconquista. How many levies can the noble house Mendoza raise?"
        },
        {
          "role": "gm",
          "text": "Juan has welcomed them warmly and asked about their military levies. Don Íñigo the Elder would respond to this direct question. He's a pragmatic, calculating man - one of the wealthiest houses in Castile. He'd be pleased by the warm reception and the acknowledgment that his house always has access. The question about levies is straightforward military/administrative.\n\nI need to research what kind of forces a great noble house like the Mendozas could raise in 15th century Castile. Let me search the project knowledge first for any information about noble levies and the Mendoza house specifically.\n\nThe Mendoza family is described as one of the wealthiest and most powerful families in Castile. They would be a major house, so they should be able to raise a significant levy. Looking at the campaign budget, if 26,800 total levies are raised from the nobility, and there are about 30-35 major houses plus many lesser nobles, a top-tier house like Mendoza might contribute perhaps 1,500-2,500 troops.\n\nI should have Don Íñigo respond directly to Juan's question about levies, being practical and straightforward.\n\nFor a house of Mendoza's stature (one of the richest and most powerful), they should be able to raise a significant force. Given that they're a top-tier house and there are 26,800 total levies expected, a major house like Mendoza might contribute somewhere in the range of 1,500-2,000 troops. This would represent a substantial but realistic contribution for one of the greatest houses.\n\nDon Íñigo the Elder would answer this straightforwardly and honestly - he's a pragmatic man who understands military realities.\n\nDon Íñigo inclined his head at Juan's warm welcome. \"Your Majesty's graciousness honors House Mendoza.\"\n\nHe considered the question of levies with the bearing of a man who'd spent decades managing estates and military obligations. \"House Mendoza can field eighteen hundred men-at-arms and foot soldiers for a sustained campaign, Your Majesty. Perhaps two thousand if we strip our estates dangerously thin, but that would be... unwise.\"\n\nHe paused, choosing his words with care. \"Our household maintains four hundred men under permanent arms. The remainder would be levied from our lands—well-equipped, properly trained men. Not rabble.\" A slight emphasis on that last word, making clear the quality he was offering.\n\n\"And if I may speak plainly, Your Majesty—\" He glanced at his son Pedro, then back to Juan. \"House Mendoza has always understood that great privilege carries great responsibility. When the crown calls for a holy crusade against Granada, we do not count coins or measure our obligations to the last man.\"\n\nHis eyes held Juan's steadily. \"But we also believe that such service should be... appropriately recognized. Both in how obligations are assessed, and in how rewards are distributed when God grants us victory.\""
        },
        {
          "role": "player",
          "text": "We shall all share in the spoils of war when we have won, apart from the eternal glory we gain in the eyes of our lord saviour. As you know, I have promised acres of land to any crusader who has taken up the oath before the banner, with more rewards given to nobles who take up more responsibilities and command in the crusade. Estates and lands that are not distributed after the crusaders have recieved their rewards will be distributed among nobles who contributed to the crusade's success.\n\n\nThose who step forward most shall recieve reward first. Maybe your son sees fit to join the white banner himself and add to the prestige and honour of your house?"
        },
        {
          "role": "gm",
          "text": "Juan is making an interesting move here. He's:\n1. Affirming the reward system for crusaders\n2. Offering a clear hierarchy: crusaders get first pick, then contributors\n3. Subtly suggesting that Pedro joining as a crusader would put the Mendoza family in a prime position\n4. Appealing to honor and prestige\n5. Not directly addressing the \"appropriately recognized\" comment about assessments - deflecting to rewards instead\n\nDon Íñigo is a shrewd political operator. He'll recognize what Juan is doing - both the opportunity and the fact that Juan didn't engage with the taxation assessment concern directly. Let me have him respond thoughtfully.\n\nThe son Pedro is present, so this puts him on the spot in a clever way. If he agrees, it commits the family. If he hesitates, it could look bad.\n\nDon Íñigo's expression shifted subtly—a flicker of respect, perhaps even surprise, at how deftly Juan had turned the conversation. He glanced at his son Pedro, who straightened slightly under both his father's gaze and the king's attention.\n\nPedro González de Mendoza was thirty years old, dark-haired and strong-built, with his father's intelligent eyes. He met Juan's gaze directly and spoke without hesitation. \"Your Majesty, I would be honored to take the crusader's oath before the blessed banner. House Mendoza has fought Moors for generations—my grandfather fell at the siege of Antequera. To complete the Reconquista in our lifetime...\" He paused, genuine fervor entering his voice. \"That is a glory worth any price.\"\n\nDon Íñigo's face revealed nothing, but his hand rested briefly on his son's shoulder—approval, or perhaps acknowledgment of a commitment now publicly made.\n\n\"Your Majesty offers generous terms,\" the elder Mendoza said carefully. \"And Pedro speaks true—our house has always stood foremost in the fight against Granada.\" He paused, then continued with measured precision. \"If I may inquire—the assessment teams that will determine each house's contribution to the crusade taxation. Will there be... transparency in that process? House Mendoza keeps meticulous records, as befits our station. We would wish to ensure that all great houses are assessed with equal rigor.\"\n\nA diplomatic phrasing—he wasn't objecting to being taxed, but making clear he expected others to carry their fair share. And perhaps probing whether the assessment would be open to negotiation or appeal.\n\n\"And will there be positions of command in the crusade armies for those who bring substantial levies? Pedro has military experience, and if he takes the crusader's oath...\""
        },
        {
          "role": "player",
          "text": "Have you met the papal legate? I have never met a more meticulous man in my life. He has insisted on protocol and oversight in such a manner it has almost driven my advisors mad. But we have perservered and developed procedures to fairly assess everyone. We will be sending representatives from both the crown and the church. The holy pope has tasked me to raises taxes fairly and justly and for me that includes no favoritism. Doing so would betray the trust and good grace of our holy charge.\n\n\nIf your concern is if the assessments will be conducted correctly among every estate, I can confidently say that we have taken every precaution and measure to make it so.\n\n\nAs for your son's commitment, I would gladly welcome you among our ranks on my wedding day. We have an official procedure for joining, you will be tested both fysically and spiritually, but I have no doubt you will succeed."
        },
        {
          "role": "gm",
          "text": "Juan has answered Don Íñigo's concerns about fairness and assessment by invoking Cardinal Capranica's oversight, which is clever - it signals that the process is being conducted with papal authority and meticulous procedure, making it harder to challenge. He's also made clear there will be no favoritism, which both reassures the Mendozas they won't be unfairly burdened AND makes clear they won't get special treatment.\n\nRegarding Pedro joining as a crusader - Juan welcomed this but didn't yet answer the question about command positions. Don Íñigo asked specifically about command roles for those bringing substantial levies. This is an important question that Juan needs to address.\n\nDon Íñigo should respond to both points - accepting the assessment answer (with some satisfaction that it will be rigorous for everyone), and perhaps pressing a bit more on the command question, or asking about how commanders will be chosen. He might also want to clarify the relationship between being a crusader (which requires the oath) and being a commander of the levies.\n\nDon Íñigo nodded slowly, a slight smile touching his lips. \"Cardinal Capranica's reputation precedes him, Your Majesty. If he has designed the oversight procedures, then I am... satisfied.\" He paused meaningfully. \"And I confess, there is some comfort in knowing that all great houses will face the same scrutiny. House Mendoza has nothing to hide in our accounts.\"\n\nThere was a subtle edge to that last statement—a quiet warning to his peers that hiding wealth would be discovered.\n\n\"As for Pedro—\" The elder Mendoza looked at his son with something approaching pride. \"He will present himself for testing at the wedding. The spiritual examination will be no difficulty; he attended the Dominican college at Salamanca for two years before returning to manage our estates.\"\n\nPedro inclined his head to Juan. \"I will be honored to serve under the blessed banner, Your Majesty.\"\n\nDon Íñigo cleared his throat delicately. \"Your Majesty, if I may—there is the matter of command structure for the campaign itself. Pedro will take the crusader's oath as an individual act of devotion. But House Mendoza will also be bringing eighteen hundred levied troops to the crusade. Traditionally, nobles who levy forces retain command over them in the field...\"\n\nHe let the statement hang, not quite a question, not quite a demand. The issue was clear: would Pedro command the Mendoza levies as a crusader-noble, or would command pass to someone else? And more broadly, how would Juan structure the relationship between noble levies and crusader warriors?\n\n\"I ask not from pride, Your Majesty, but from practicality. Men fight better under commanders they know and trust.\""
        },
        {
          "role": "player",
          "text": "Your son would be the first noble who's family would also contribute levies. \nThe pope is very specific in his bull, all forces fall under my direct command and any nobles who commit them to the crusade do not automatically retain command. \nI will structure my army based on merit and effectiveness. It may very well be that I decide that him commanding his family's troops serves me best. Or I could have an even more important task for him. \nBut I will not forget the Mendoza's faithful contribution. If it is the personal wish of your son to gain a certain command, than I will be very inclined to grant it. \nIs that your desire Pedro? To command an army or force of your own in the field? Do you have experience?"
        },
        {
          "role": "gm",
          "text": "Juan is handling this well - he's not making promises, but he's being respectful and open. He's establishing that command is his prerogative based on the papal bull, but also showing flexibility and consideration for Pedro's wishes.\n\nNow I need to have Pedro respond. He's 30, educated at Salamanca (Dominican college), from a military family (grandfather died at Antequera siege). He would have some military experience given his background, but probably not extensive campaign command experience. He's earnest and has just committed to taking the crusader oath.\n\nThis is a moment where Pedro needs to show both ambition and humility - he wants to serve, but he also recognizes his limitations. His father is watching carefully.\n\nPedro met Juan's gaze directly, and for a moment the younger man seemed to weigh his words carefully. When he spoke, there was genuine thoughtfulness in his voice.\n\n\"Your Majesty, I would be lying if I said commanding troops held no appeal. What man of martial training doesn't dream of leading forces in the field?\" He paused. \"But I must be honest about my experience. I have commanded our household guard in frontier skirmishes—small actions against raiding parties, defense of our estates. Perhaps three hundred men at most, and never in a major engagement.\"\n\nHe glanced at his father, then back to Juan. \"My grandfather fought at Antequera. My father has managed the political and military obligations of our house for thirty years. I have studied warfare, I have trained, I have led small forces. But I have never commanded eighteen hundred men in a campaign season, nor participated in a major siege.\"\n\nPedro straightened. \"If Your Majesty judges that I am best suited to command the Mendoza levies, I will do so to the utmost of my ability and seek counsel from more experienced commanders. If Your Majesty has other duties for me where I might serve the crusade better—whether as a subordinate officer learning from veterans, or in some other capacity—I will serve there with equal devotion.\"\n\nHe placed his hand over his heart. \"My desire is to serve the crusade effectively, Your Majesty. Not to claim honors I have not yet earned.\"\n\nDon Íñigo's expression revealed the barest flicker of approval at his son's answer."
        },
        {
          "role": "player",
          "text": "Pedro, you have my word that I will give you the opportunity to rise through the ranks to command not just eighteen hundred men, but many more should your abilities allow for it. And that you will get the chance to avenge your grandfather in a manner to cement your contribution to the reconquista. Welcome Pedro.\n\n\nI pour myself some wine and offer the Mendoza's a glass as well."
        },
        {
          "role": "gm",
          "text": "Pedro bowed deeply, genuine emotion in his voice. \"Your Majesty honors me beyond measure. I will prove worthy of your trust.\"\n\nDon Íñigo accepted the wine with a graceful nod, his weathered features relaxing slightly. He raised his cup in a small salute. \"To the completion of the Reconquista, Your Majesty. And to the wisdom of kings who lead with both faith and justice.\"\n\nHe sipped, then set down his cup with the air of a man satisfied with the outcome of a delicate negotiation. \"Your Majesty has put House Mendoza's concerns to rest. Fair assessment overseen by the Church, rewards based on service and merit, and opportunity for my son to prove himself in the holiest of causes.\"\n\nThe elder Mendoza glanced at Pedro, then back to Juan. \"House Mendoza will muster our full eighteen hundred by the time Your Majesty calls the levies. Our stewards will cooperate fully with the assessment teams. And Pedro will present himself for testing at your wedding.\"\n\nHe paused, choosing his final words with care. \"When the other great houses ask me—and they will ask—what I learned in this audience, I will tell them that the King of Castile judges all men by the same measure, rewards service over privilege, and leads a crusade blessed by Rome with proper oversight.\" A slight smile. \"That should... clarify matters for those still uncertain about how to respond.\"\n\nIt was as close to an endorsement as a pragmatic nobleman would offer—and an implicit promise to help manage the other great houses' reactions."
        },
        {
          "role": "player",
          "text": "I take some time to chat and get to know the Mendoza's better. I introduce them to Isabel personally and show them around the Palace."
        },
        {
          "role": "gm",
          "text": "Juan wants to spend some time building a personal relationship with the Mendozas, showing them hospitality and introducing them to Isabel. This is good political instinct - turning a formal negotiation into a warmer relationship. I should narrate this briefly and naturally, showing:\n\n1. The transition from formal audience to more relaxed hospitality\n2. Introduction to Isabel (who is now more confident, especially in her role as pious queen)\n3. Tour of the palace, perhaps showing them the banner/relics\n4. Building genuine rapport\n\nKeep it concise and move toward the natural conclusion of their visit, then transition to the next audience (Enríquez).\n\nThe remainder of the afternoon passed in a far more relaxed atmosphere. Juan led the Mendozas through the royal apartments, pointing out the renovations and discussing the history of Toledo's Alcázar. Don Íñigo proved surprisingly knowledgeable about architecture, noting details of Moorish craftsmanship that had been preserved in the Christian renovations.\n\nWhen they found Isabel in the Portuguese chapel—now nearly complete with its blue azulejo tiles—she rose gracefully and received the Mendozas with quiet dignity. Pedro bowed low, offering congratulations on the coming marriage in courtly Castilian.\n\n\"House Mendoza has always been devoted to the Church,\" Isabel said softly, her confidence growing as she spoke of familiar territory. \"I am told your family endowed the monastery at Guadalajara?\"\n\nDon Íñigo's eyebrows rose slightly—she had done her research, or someone had briefed her well. \"Indeed, Your Majesty. My grandfather's work.\"\n\n\"Then we share an understanding,\" Isabel replied, glancing at the half-finished chapel around them. \"That faith requires not just words, but walls. Places where prayers can echo.\"\n\nIt was perhaps the most assured Juan had ever seen her in a political interaction. Pedro looked genuinely impressed.\n\nJuan then brought them to the chamber where the banner and relics were kept. Both Mendozas fell silent upon entering, Don Íñigo crossing himself slowly as he gazed at the pure white silk.\n\n\"I have heard the stories from those who saw it on your journey from Seville,\" the elder Mendoza said quietly. \"But seeing it...\" He trailed off. \"This is no political banner, Your Majesty. This is real.\"\n\nPedro knelt before the relics, his lips moving in silent prayer. When he rose, his eyes were bright. \"I understand now why men are taking the oath.\"\n\nAs the Mendozas departed an hour later, Don Íñigo clasped Juan's hand firmly. \"Your Majesty has given me much to consider—and much to be grateful for. House Mendoza will not forget this day.\"\n\nThe sun was lower now, mid-afternoon shadows stretching across the courtyard. Álvaro appeared at Juan's elbow as the Mendozas' retinue departed.\n\n\"Don Enrique Enríquez is ready whenever Your Majesty wishes to receive him,\" the Constable said quietly. \"He's been waiting in the antechamber for the past half hour, growing progressively more nervous.\""
        },
        {
          "role": "player",
          "text": "Oh, show him in!"
        },
        {
          "role": "gm",
          "text": "Alright, now we move to the second audience - Don Enrique Enríquez, Admiral of Castile. From the earlier description, he's:\n- About forty years old\n- A competent administrator but no warrior\n- Concerned about how papal taxation will affect coastal holdings\n- Wants \"clarification of certain provisions regarding service in lieu of payment\"\n- Emphasized his family's long military service to the crown\n- He's described as \"a bureaucrat at heart\"\n\nThis is a different personality than the Mendozas. Don Íñigo was pragmatic, calculating, and respected. Enríquez seems more nervous, more focused on finding loopholes or ways to minimize his obligations while maintaining appearances.\n\nThe Admiral of Castile is an important naval position, which could be useful for the crusade's western army campaign (which involves naval operations). But he's likely more concerned about protecting family wealth than about military glory.\n\nI need to keep this interaction distinct from the Mendoza meeting. The GM should introduce him, describe his demeanor, and let him present his concerns. Then stop for Juan's response.\n\nÁlvaro nodded and withdrew. Moments later, the chamberlain announced: \"Don Enrique Enríquez, Admiral of Castile, Your Majesty.\"\n\nThe man who entered was perhaps forty years old, well-dressed in dark velvets with the chain of his office—a golden anchor on a heavy链. He had the soft hands of an administrator and the slightly nervous bearing of someone who preferred ledgers to audiences. His bow was deep and correct.\n\n\"Your Majesty.\" He straightened, offering a carefully prepared smile. \"I am honored beyond measure by this audience. And may I congratulate Your Majesty on the coming marriage—the union with Portugal strengthens both kingdoms greatly.\"\n\nHe clasped his hands in front of him, the gesture betraying his nervousness. \"I come before Your Majesty to express House Enríquez's wholehearted support for the holy crusade against Granada. My family has served the crown with distinction for generations. My grandfather commanded the fleet at—\" He caught himself, realizing he was rambling slightly.\n\n\"Forgive me, Your Majesty. I am... eager to understand how House Enríquez might best contribute to the crusade.\" A pause. \"Specifically, I have heard that assessment teams will be evaluating estates for the crusade taxation. Our holdings are primarily coastal—ports, fishing rights, some vineyards. The papal bull mentions service in lieu of payment, and I wondered...\"\n\nHe trailed off, looking at Juan expectantly. The unspoken question hung in the air: could naval service substitute for the taxation? And if so, how much service would be required?"
        },
        {
          "role": "player",
          "text": "I am glad to meet you. I would like to get to know you. But you seem a bit worried or nervous. Please tell me, what is on your mind. I cant help you if I dont know what is wrong."
        },
        {
          "role": "gm",
          "text": "Juan is taking a very direct, almost disarming approach here - cutting through the formality to get Enríquez to speak plainly about his concerns. This is smart - it puts Enríquez in a position where he has to be honest rather than dancing around the issue.\n\nEnríquez is nervous because:\n1. He's worried about the taxation hitting his coastal estates hard\n2. He wants to negotiate for naval service to replace the tax\n3. He's not sure how Juan will react\n4. He's probably heard about the Mendoza meeting and is wondering what precedents were set\n\nJuan's approach here is disarming - it invites honesty and shows he's willing to listen. Enríquez should respond by being more direct about his concerns, probably a bit relieved that he can speak plainly.\n\nDon Enrique hesitated, then seemed to make a decision. His shoulders relaxed slightly and he let out a breath.\n\n\"Your Majesty is perceptive.\" He managed a rueful smile. \"Very well. I will speak plainly, if Your Majesty permits.\"\n\nHe took a moment to organize his thoughts. \"House Enríquez's wealth is... unusual compared to most great houses. We hold the admiralty, yes, but our estates are coastal—ports, fishing rights, salt works, some shipping interests. Our income is substantial, but it comes from commerce and maritime activities, not primarily from agricultural lands.\"\n\nHe shifted his weight. \"When I heard about the crusade taxation—five percent on estates—my stewards began calculating. And the truth is, Your Majesty, I'm not entirely certain how to assess our holdings fairly. Do fishing rights count the same as farmland? What about port revenues that fluctuate with trade winds and foreign commerce?\"\n\nDon Enrique met Juan's eyes directly now, his nervousness giving way to genuine concern. \"I'm not trying to evade the tax, Your Majesty. House Enríquez will pay what is owed—we support the crusade. But I worry that an assessor unfamiliar with maritime commerce might either overvalue our holdings based on good years, or undervalue them and make us appear as if we're shirking our duty.\"\n\nHe paused. \"And... frankly, Your Majesty, I wondered whether naval service to the crusade might be counted as part of our contribution. We have ships. We have men who know the southern coast. If the crusade needs transport or supply vessels...\""
        },
        {
          "role": "player",
          "text": "Ah, I understand that worry. Indeed, a lot hinges on this assessment, I completely understand. And thank you for speaking frankly, it allows me to be frank as well. You are not the only one who has this worry. Nobody minds paying taxes, but paying more than is owed is something I want to prevent for everyone.\n\n\nI have taken every precaution to not only have the assessors trained, but your estates will be assessed by both the crown and the vatican. Every assessment includes the moment of assessment and we rule that every assessment is only valid for a maximum of ten years. If there is reason to believe that the revenue of an estate has changed significantly since the last assessment, we shall do a new one, overruling the old assessment. Should you have a bad year, or something happens that reduces your revenue, we will re-assess.\n\n\nYou mention you can supply the crusade with ships. How many can you provide? And what is their type and shape?"
        },
        {
          "role": "gm",
          "text": "Don Enrique's concerns are legitimate - maritime commerce is indeed harder to assess than farmland, and his offer of naval service is practical. Juan is being very reasonable and transparent, which should help ease Enrique's concerns.\n\nNow Enrique needs to respond to:\n1. Juan's reassurance about fair assessment and the 10-year validity period with re-assessment provisions\n2. The direct question about what ships he can provide\n\nEnrique would be:\n- Relieved by the fairness of the assessment process\n- Appreciative of the transparency\n- Ready to discuss his naval capabilities (this is his expertise area)\n- Probably still cautious about committing too much without understanding how it affects his tax obligation\n\nI should have him give specific information about ships, but also continue probing about how naval service relates to the taxation.\n\nDon Enrique's relief was visible. \"Your Majesty, that... that addresses my primary concern. A system that accounts for fluctuations in maritime trade, with regular re-assessment—that is fair. More than fair.\" He nodded firmly. \"House Enríquez will cooperate fully with the assessment teams. We keep detailed ledgers of all port revenues and commercial activities.\"\n\nHis posture straightened as the conversation shifted to ships—clearly his area of expertise and comfort.\n\n\"As for vessels, Your Majesty—House Enríquez directly controls four carracks suitable for transport and supply. Each can carry perhaps sixty tons of cargo or one hundred men with their equipment. They're sturdy vessels, built for Atlantic waters.\" He warmed to the subject. \"We also have interests in six smaller caravels through partnership with Basque merchants—faster, good for coastal work and patrol.\"\n\nHe paused, calculating. \"Beyond our direct holdings, I maintain relationships with shipowners throughout the northern ports. If Your Majesty needs additional vessels, I could contract perhaps another eight to twelve ships of various sizes, depending on duration and terms.\"\n\nDon Enrique's eyes brightened slightly. \"The campaign will need supply lines, especially if Your Majesty intends to take coastal fortresses in Granada. Ships can deliver provisions far more efficiently than overland wagons. And Granada's coast is vulnerable—their fleet is minimal.\"\n\nHe hesitated, then asked carefully: \"Would such service—providing transport and supply vessels for the crusade—be considered... part of House Enríquez's contribution? Or separate from the taxation assessment?\""
        },
        {
          "role": "player",
          "text": "An excellent point. We are hiring Genoese ships for this year, but I like the idea that our kingdom expands it's own naval strength. \nHow can Carracks hold up against a galley in combat?"
        },
        {
          "role": "gm",
          "text": "Don Enrique is the Admiral of Castile, so he should know this well. He'd give an honest assessment of capabilities.\n\nI should keep this concise and let Juan respond, not generate dialogue or actions for Juan.\n\nDon Enrique's expression grew more serious, the look of a man discussing his profession.\n\n\"In open water with good wind, a carrack has advantages, Your Majesty. Higher sides make boarding difficult, and we can rain arrows and crossbow bolts down on galley crews. A carrack is also more stable as an archery platform.\" He paused. \"But in calm conditions or close to shore—where galleys can use their oars—they have the advantage. They're faster, more maneuverable, and can ram or position themselves to board.\"\n\nHe gestured as if sketching a naval engagement. \"Granada's galleys are few, perhaps a dozen at most, but they know their own coastline intimately. In a direct fight in calm Mediterranean waters, a galley fleet would likely defeat carracks of equal number.\"\n\nDon Enrique met Juan's eyes. \"Which is why Your Majesty's decision to hire Genoese galleys is sound. They understand galley warfare, they have the crews trained for it, and they can match Granada's tactics.\" A slight smile. \"My carracks are not warships, Your Majesty. They are workhorses—supply, transport, logistics. We can defend ourselves if attacked, but we are not meant to seek battle with enemy galleys.\"\n\nHe added carefully: \"Though if Your Majesty wishes to build Castile's naval strength for the future, I would be honored to advise on developing a proper war fleet. We have shipyards in the north that could build galleys or larger fighting vessels, given time and investment.\""
        },
        {
          "role": "player",
          "text": "What is the size of our kingdom's navy right now if we assemble everything we have in one fleet? In a theoretical scenario we would have to fight a naval engagement?"
        },
        {
          "role": "gm",
          "text": "1. From the Barcelona chapter - Juan hired 3 galleys to transport from Barcelona to Seville (5,000-6,000 florins for the voyage)\n2. From the campaign budget - Portugal is providing 8 galleys as part of the dowry\n3. Don Enrique mentioned he controls 4 carracks and has interests in 6 caravels\n4. He can contract 8-12 additional ships\n\nBut I need to give Don Enrique's answer about the total assembled Castilian fleet. This would be knowledge he has as Admiral of Castile. In 1430, Castile's navy was relatively modest compared to major naval powers. Let me craft his response based on historical context and what makes sense.\n\nDon Enrique's expression grew somewhat uncomfortable. He shifted his weight before answering honestly.\n\n\"Your Majesty, if we assembled everything Castile could muster for a major naval engagement...\" He paused, clearly reluctant to deliver unwelcome news. \"Perhaps thirty vessels total. And I must emphasize—most would be merchant ships pressed into service, not warships.\"\n\nHe began counting on his fingers. \"The crown directly owns three war galleys—though one needs significant repairs. Various coastal cities maintain perhaps eight to ten galleys between them for local defense. Then we have the merchant vessels: my four carracks, perhaps fifteen to twenty other carracks and caravels from various ports that we could requisition in emergency.\"\n\nDon Enrique met Juan's eyes. \"But Your Majesty, this would not be a fleet in the sense that Venice or Genoa understands the word. It would be a collection of ships with different capabilities, different crews, minimal experience fighting together. Against a determined enemy fleet...\" He shook his head slightly.\n\n\"For comparison, Your Majesty, the Crown of Aragon maintains perhaps sixty to eighty war galleys. Venice commands hundreds. Even Granada, small as it is, has a dozen purpose-built war galleys with crews who've trained together for years.\"\n\nHe straightened slightly. \"This is why the Portuguese dowry ships are so valuable—eight war galleys, properly crewed, significantly increases our Mediterranean capability. And why hiring Genoese galleys for the crusade is wise. We simply lack the infrastructure for sustained naval warfare.\"\n\nHe paused. \"May I speak frankly about why this is, Your Majesty?\""
        },
        {
          "role": "player",
          "text": "please do admiral"
        },
        {
          "role": "gm",
          "text": "Don Enrique is being asked to speak frankly about why Castile's navy is so weak. This is a chance for him to provide historical context and explain the structural reasons. Let me think about what would be realistic for 15th century Castile:\n\n1. Castile has been focused on land warfare against Granada for centuries\n2. The Atlantic coast is different from Mediterranean - different ship types, different naval traditions\n3. Naval power requires sustained investment and infrastructure\n4. The great noble houses don't have naval interests like they do land estates\n5. Crown revenue has been limited by noble tax evasion\n6. Aragon has monopolized Mediterranean naval power in Iberia\n7. Shipbuilding, maintaining crews, and naval operations are expensive\n\nDon Enrique would be knowledgeable about this and probably passionate about it since it's his domain. He might be relieved to finally have a king who asks about these things.\n\nDon Enrique's relief was visible—finally someone asking the right questions. He leaned forward slightly, his administrative nervousness replaced by professional expertise.\n\n\"Your Majesty, Castile has always been a land power. For three centuries, our wars have been against Granada—fought on horseback and on foot, siege by siege, fortress by fortress. Our great nobles built their wealth and power on estates, not ships. They think in terms of levies and cavalry, not galleys and sailors.\"\n\nHe gestured toward the window, toward the direction of the coast. \"Meanwhile, the Crown of Aragon—they built an empire on sea power. Sicily, Sardinia, Naples, trading posts across the Mediterranean. King Alfonso's grandfather understood that controlling the sea meant controlling trade, projections of force, wealth. They invested for generations.\"\n\nDon Enrique's voice grew more animated. \"A war galley costs perhaps 15,000 maravedís to build, Your Majesty. Then you need a crew of 150-200 men who must be paid—you cannot levy oarsmen the way you levy farmers for a land campaign. A galley crew costs 8,000-10,000 maravedís per month just in wages. Then maintenance, provisions, harbor fees...\"\n\nHe spread his hands. \"To build and maintain a proper fleet of fifty war galleys would cost the crown perhaps 400,000 maravedís annually—more than ten percent of royal revenue. And that revenue has been... limited... because the great houses pay so little in taxes.\"\n\nA pause, choosing his words carefully. \"The nobles who control most of Castile's wealth have no interest in naval power, Your Majesty. Ships don't help them protect their estates or press their feudal claims. So they've never supported crown investment in a fleet.\""
        },
        {
          "role": "player",
          "text": "I see. Interesting. But it does raise the question; why do we need a fleet? What can we achieve with a fleet that we cannot achieve now?"
        },
        {
          "role": "gm",
          "text": "Enrique would be passionate about this but also realistic - he knows building a fleet requires massive investment and political will that hasn't existed. But with a king who's asking these questions and has demonstrated he can impose taxes on the nobility...\n\nDon Enrique's eyes lit up—this was clearly a question he'd spent years hoping a king would ask.\n\n\"Your Majesty, a fleet transforms what Castile can be.\" He stood and began pacing slightly, his earlier nervousness completely gone. \"Right now, we are trapped by our geography. We have hundreds of miles of Atlantic coastline, but we cannot truly use it.\"\n\nHe ticked off points on his fingers. \"First, trade and revenue. Every year, merchant ships from Flanders, England, France—they sail past our coasts carrying wool, wine, iron, salt. Some stop at our ports, most don't. Why? Because we cannot guarantee their safety. Barbary corsairs raid our shipping with impunity. Granada's galleys strike our coastal towns. Without a fleet to patrol and protect, merchants avoid us or demand higher prices to compensate for risk.\"\n\n\"Second, defense. Granada raids our southern coast regularly—burning villages, taking slaves, disrupting commerce. Last year they hit Tarifa. The year before, settlements near Gibraltar. We can do nothing but chase them on land after they've already struck and sailed away. A fleet could intercept these raids, pursue them back to their ports.\"\n\nDon Enrique's voice grew more intense. \"Third, Your Majesty—power projection. Right now, if Granada fortifies a coastal town, we must besiege it from land, which takes months and costs enormous resources. With a fleet, we could blockade their ports, cut off resupply, land troops wherever we choose. The entire character of the war changes.\"\n\nHe paused, then continued. \"Fourth—and Your Majesty may not have considered this—the Atlantic itself. Portuguese ships are pushing down the African coast every year, discovering new trade routes, new lands. They're building an empire on those voyages. Meanwhile, there are whispers of lands far to the west, beyond the known ocean. Whoever controls Atlantic waters in the next century will control unimaginable wealth.\"\n\nDon Enrique met Juan's eyes directly. \"And finally, Your Majesty—independence. Right now, for this crusade, we hire Genoese galleys and rely on Portuguese dowry ships. What happens if Genoa's priorities change? What if Portugal decides their interests lie elsewhere? A true fleet means Castile answers to no one, depends on no one.\"\n\nHe spread his hands. \"But building such a fleet would require... exactly what Your Majesty is doing now. Reformed taxation, centralized authority, long-term investment. Things that have been impossible—until now.\""
        },
        {
          "role": "player",
          "text": "Say we want a fleet just to defend against pirates to optimize trade, how many would we need?"
        },
        {
          "role": "gm",
          "text": "For defensive patrol and anti-piracy:\n- Need to cover Castile's Atlantic coast (from Galicia to Gibraltar) plus southern coast facing Granada\n- Can't be everywhere at once, so need multiple patrol zones\n- Galleys for Mediterranean-style operations, but also need ocean-going vessels for Atlantic\n- Consider seasonal patterns, harbor bases, response times\n\nA realistic medieval answer would probably involve:\n- 15-20 war galleys for Mediterranean/southern coast operations\n- 10-15 patrol vessels (lighter galleys or armed carracks) for Atlantic coast\n- Total maybe 25-35 ships for effective coverage\n- Plus infrastructure (harbors, supply bases, repair facilities)\n\nDon Enrique would break this down practically and probably mention this is still modest compared to major naval powers.\n\nDon Enrique considered this carefully, his administrative mind clearly calculating.\n\n\"For effective defensive operations, Your Majesty—patrolling our coasts, responding to raids, protecting merchant shipping—I would estimate...\" He paused, thinking through the logistics. \"Perhaps twenty-five to thirty-five vessels, properly distributed.\"\n\nHe began breaking it down. \"Our coastline divides into distinct zones. The southern coast facing Granada and the Strait—that needs the heaviest concentration. Perhaps fifteen war galleys based between Cádiz and Gibraltar. Mediterranean-style vessels with experienced crews, fast enough to intercept raiders, strong enough to fight Granada's galleys.\"\n\n\"The Atlantic coast—from Gibraltar north to Galicia—that's different water. Rougher seas, different threats. There we'd need perhaps ten to fifteen ocean-going patrol vessels. Some could be armed carracks, some lighter galleys. Based at strategic ports: Cádiz, Sanlúcar, Seville's river access, perhaps La Coruña in the north.\"\n\nDon Enrique warmed to the subject. \"The key is coverage, Your Majesty. Ships must patrol regularly enough that pirates know they risk interception. That requires multiple patrol zones, vessels in rotation—some at sea, some in port for maintenance, crews resting. With thirty ships properly organized, we could maintain perhaps ten to twelve on active patrol at any given time.\"\n\nHe paused. \"This wouldn't make us a major naval power, Your Majesty. But it would make our coasts defended. Merchants would know Castilian waters are patrolled. Pirates would seek easier prey. Granada would think twice before raiding.\"\n\n\"The annual cost?\" He calculated quickly. \"Perhaps 300,000 to 350,000 maravedís. That's maintaining the fleet, paying crews, provisions, repairs. The initial construction would cost more—perhaps 500,000 maravedís to build thirty ships.\""
        },
        {
          "role": "player",
          "text": "I would need to examine if this investment will yield more  income in trade.\n\n\nCan we not attack these pirates at their own bases? Where do they operate from?"
        },
        {
          "role": "gm",
          "text": "Juan is asking about offensive operations against pirate bases. This is a smart strategic question. Let me have Don Enrique explain where the pirates operate from and the challenges of attacking their bases.\n\nThe main pirate threats would be:\n1. Barbary corsairs operating from North African ports (Morocco, Algeria, Tunisia)\n2. Granada's own coastal raiders\n3. Possibly some Christian pirates/privateers\n\nDon Enrique should explain:\n- Where the bases are located\n- The challenges of attacking them\n- What it would require militarily\n- Political complications\n\nThis connects to the broader strategic picture of Mediterranean power and the crusade against Granada.\n\nDon Enrique's expression shifted—from administrator to strategist.\n\n\"An excellent question, Your Majesty. Attack the source rather than merely defend.\" He nodded approvingly. \"The pirates operate from several bases, each with different challenges.\"\n\nHe began outlining the situation. \"Granada itself has perhaps three or four ports that harbor raiders—Almería, Málaga, smaller harbors along the coast. These we will deal with through Your Majesty's crusade. Once we control Granada's coastline, that threat ends.\"\n\n\"But the larger problem is the Barbary Coast—North Africa. The primary bases are across the Strait of Gibraltar: Ceuta, Tangier, and further east toward Oran and Algiers. These are Muslim ports, many technically under Moroccan or local sultanate control, but they operate with considerable independence. They've been raiding Christian shipping for centuries.\"\n\nDon Enrique's tone grew more serious. \"To attack these bases, Your Majesty, would require... significant force. We're not talking about a few galleys making a raid. These are fortified ports with their own fleets, often ten to twenty galleys each. Some have substantial shore defenses.\"\n\nHe paused. \"Ceuta, for instance—it's directly across from Gibraltar, perhaps fourteen miles. Heavily fortified, good harbor, surrounded by hostile territory. To take and hold it would require landing several thousand troops, supplying them by sea, maintaining a garrison indefinitely. It becomes a permanent military commitment.\"\n\n\"Portugal has coveted Ceuta for years, Your Majesty. They understand that controlling both sides of the Strait means controlling all Mediterranean-Atlantic trade. But even they haven't attempted it—the cost and risk are substantial.\"\n\nDon Enrique met Juan's eyes. \"That said, Your Majesty—if Castile did possess a proper fleet, say sixty to eighty war galleys... we could potentially launch such expeditions. Raid their ports, disrupt their operations, perhaps even seize a strategic location. But that's a major campaign, not simply defensive patrols.\""
        },
        {
          "role": "player",
          "text": "Do we posess the required expertise to  expand our fleet so?"
        },
        {
          "role": "gm",
          "text": "Don Enrique would be honest - this is his area of expertise and he wants to be useful to Juan.\n\nDon Enrique hesitated, then gave an honest answer.\n\n\"Yes and no, Your Majesty. We have some expertise, but significant gaps.\"\n\nHe began outlining the situation. \"Shipbuilding—we have adequate shipyards in the north. Santander, Bilbao, La Coruña—they build merchant vessels regularly, some quite large. The Basque shipwrights are skilled, among the best in Europe for Atlantic vessels. They could build carracks, patrol ships, even war galleys if directed.\"\n\n\"But,\" he emphasized, \"building thirty ships of mixed types over, say, three years? That would strain our capacity. We'd need to expand the shipyards, hire more master craftsmen, secure steady timber supplies. It's doable, but requires planning and investment.\"\n\nDon Enrique's expression grew more concerned on the next point. \"The greater problem, Your Majesty, is naval expertise. We have merchant captains who know Atlantic waters well. We have some experienced sailors. But professional naval commanders? Men who've fought galley actions, coordinated fleet movements, conducted amphibious landings?\" He shook his head. \"Very few.\"\n\n\"We could hire them, Your Majesty. Genoese captains, Venetian navigators, even Portuguese officers—many would serve for good wages. But this creates dependency on foreign expertise, at least initially. We'd need perhaps five to ten years of operations to train our own Castilian officers properly.\"\n\nHe paused thoughtfully. \"There's another option—hire foreign experts not just as captains, but as instructors. Bring them to Castile, have them train our men, establish a naval academy of sorts. Over time, we develop native expertise. Portugal did exactly this two generations ago.\"\n\nDon Enrique met Juan's eyes. \"The capability can be built, Your Majesty. But it's a decade-long project, not something achieved in a year or two. Initial fleet operations would rely heavily on hired expertise. Gradually, we develop our own.\""
        },
        {
          "role": "player",
          "text": "Taking Grenada will eliminate many problems where pirates are concerned. We can then think about taking ports in Africa. Building our naval capacity makes a lot more sense after we have taken Grenada, but it would be wise to start the preparations now already.\n\n\nYou have given me a lot to think about admiral.\n\n\nOne last thing, the portugese ships that are part of the dowry; are they individually superior to those of Grenada, or are they of the same quality?"
        },
        {
          "role": "gm",
          "text": "Don Enrique brightened at the strategic wisdom Juan displayed. \"Your Majesty sees the matter clearly. Granada first, then build from that foundation. Very sound.\"\n\nOn the question of ship quality, he nodded thoughtfully. \"The Portuguese galleys are superior, Your Majesty—individually, at least. Portugal has been a maritime power for generations. Their shipwrights understand galley construction thoroughly, their crews are professional and well-drilled.\"\n\nHe elaborated: \"Granada's galleys are competent vessels, well-maintained, but their crews are... mixed quality. Some are excellent—families who've been sailors for generations, men who know every current and harbor along their coast. But Granada also relies heavily on conscripted oarsmen and less experienced fighters. Their commanders are skilled in raid-and-retreat tactics, but less experienced in sustained fleet actions.\"\n\n\"The Portuguese ships, by contrast, are crewed by professional sailors. Better discipline, better coordination. In a one-on-one engagement, I would favor a Portuguese galley over a Granada galley decisively.\"\n\nDon Enrique paused. \"However, Your Majesty should understand—numbers still matter greatly in galley warfare. Granada's dozen galleys operating in their own waters, knowing every cove and current, remain dangerous even against superior individual vessels. But eight Portuguese galleys plus the Genoese we're hiring? That gives us comfortable superiority for the crusade's naval operations.\"\n\nHe bowed slightly. \"Thank you for this audience, Your Majesty. You have eased my concerns considerably, and given me much to consider regarding Castile's maritime future.\""
        },
        {
          "role": "player",
          "text": "I will summon you again when we need to start expanding our fleets for the next few seasons.\n\n\nGo with god."
        },
        {
          "role": "gm",
          "text": "Don Enrique would be grateful and relieved. He got what he came for - clarity on taxation assessment, understanding that his concerns were heard, and even got to discuss his passion (naval development) with a king who actually listened and understood strategic implications.\n\nNow I need to transition to the final audience - Don Luis de Guzmán, Master of Santiago. This will be the most difficult and tense of the three audiences. He:\n1. Sided with the Infantes during their rebellion\n2. Is politically isolated now\n3. Controls Santiago's vast estates which will be heavily taxed\n4. Is in his 50s, can't realistically join the crusade personally\n5. The personal service exemption doesn't help him much\n6. He's cornered and potentially dangerous\n\nI should set the scene for late afternoon/early evening, with Juan having already handled two successful audiences. Álvaro would brief him on Guzmán's situation and mental state before the meeting.\n\nKeep response short, stop at natural interaction points. No suggestions for Juan's actions.\n\nDon Enrique bowed deeply, genuine gratitude in his expression. \"Your Majesty's wisdom gives me great hope for Castile's future. I will cooperate fully with the assessment teams, and I look forward to serving the crusade—and discussing our maritime future when Your Majesty calls.\"\n\nHe placed his hand over his heart. \"God grant Your Majesty victory in the holy crusade. House Enríquez stands ready to serve.\"\n\nThe Admiral departed, his earlier nervousness entirely gone, replaced by the bearing of a man who felt heard and respected.\n\nÁlvaro returned as the shadows lengthened toward evening. \"Don Luis de Guzmán has been waiting for two hours now, Your Majesty. He's asked three times if perhaps the audience should be rescheduled for tomorrow.\"\n\nThe Constable's expression was unreadable. \"He knows this is the most difficult position of anyone. Sided with the Infantes, commands Santiago's wealth, cannot realistically join the crusade himself at his age. The personal service exemption is worthless to him, and Santiago's estates are enormous—the assessment will be brutal.\"\n\nÁlvaro paused. \"He's either here to grovel and beg for mercy, or to try one last political maneuver. Either way, he's desperate. And desperate men are unpredictable.\"\n\nHe looked at Juan directly. \"How do you wish to receive him, Your Majesty?\""
        },
        {
          "role": "player",
          "text": "Show him in and appologize for the wait."
        },
        {
          "role": "gm",
          "text": "Don Luis de Guzmán, Master of Santiago - this is the most challenging of the three audiences. He:\n1. Sided with the Infantes during their rebellion\n2. Commands the Military Order of Santiago (2,000 troops)\n3. Is in his fifties, too old to realistically join the crusade personally\n4. Controls enormous estates through Santiago\n5. Would face both the 5% noble tax on personal holdings AND 10% church tax on Order properties\n6. Cannot benefit from the 2,000 maravedí personal service exemption\n7. Is politically isolated after backing the wrong side\n\nHe's cornered. The question is whether he'll:\n- Grovel and seek mercy\n- Try to negotiate/find loopholes\n- Rally other Military Orders to resist church taxation\n- Offer something valuable in exchange for consideration\n- Accept his fate and try to salvage what he can\n\nJuan should be respectful but firm. Guzmán made his choice with the Infantes, but the crusade offers a path forward. The key is that Juan holds all the cards here.\n\nThe GM should show Guzmán as a proud man in a difficult position, trying to maintain dignity while recognizing his weakness. He might try various approaches to seek relief from the taxation burden.\n\nÁlvaro nodded and withdrew. A few moments later, the chamberlain's voice: \"Don Luis de Guzmán, Master of the Order of Santiago, Your Majesty.\"\n\nThe man who entered was perhaps fifty-five, graying but still carrying himself with military bearing. He wore the white robes of Santiago with the red sword-cross prominent on his chest—the symbol of an order founded to fight exactly the war Juan was now proclaiming. His face was weathered, his hands showed the calluses of a lifetime of sword work, but there was tightness around his eyes that spoke of strain.\n\nHe bowed—correctly, but perhaps not quite as deeply as the previous nobles.\n\n\"Your Majesty. I apologize for any inconvenience my late arrival may have caused. The roads from our chapter house were...\" He trailed off, recognizing the excuse for what it was.\n\nDon Luis straightened, meeting Juan's eyes. There was pride there, but also calculation—a man trying to assess his position. \"I must first apologize for keeping Your Majesty waiting. And second...\" He paused, choosing words carefully. \"I come before Your Majesty to pledge the Order of Santiago's full support for the holy crusade against Granada. This is the work we were founded to do. Whatever past... complications... may have existed, the crusade transcends all earthly disputes.\"\n\nHis jaw was set, but there was a question in his eyes: would Juan accept this opening, or would past allegiances matter?"
        },
        {
          "role": "player",
          "text": "Come with me don Luis. I have no further audiences for today. Lets share a glass of wine and enjoy the end of the day together.\n\n\nI show him around and introduce him to Isabel. We stay a while and chat before meeting with some members of my crusade, curious about how his military order is organized and how we may learn from this. I want to make him feel included and at ease. I am grateful for his and his orders support. We have much work ahead of us.\n\n\nDoes he have any worries that we should adress?"
        },
        {
          "role": "gm",
          "text": "This approach:\n1. Disarms Guzmán's defensiveness\n2. Makes it harder for him to object to anything later\n3. Shows magnanimity from a position of strength\n4. Brings Santiago fully into the crusade fold\n5. Treats past allegiances as irrelevant now\n\nJuan is being genuinely interested in Santiago's organization, treating Guzmán as a valuable military resource rather than a political problem. This is mature kingship.\n\nI should show Guzmán's surprise and gradual relaxation, his professional pride when discussing Santiago's structure, and then eventually—when comfortable—raising his actual concerns. These would likely be:\n1. The assessment of Santiago's properties (enormous)\n2. His personal inability to serve due to age\n3. How to maintain Santiago's honor and relevance\n4. Whether younger Santiago knights can take crusader oaths\n5. Command structure for Santiago forces\n\nLet me write this warmly, showing the relationship building, then have Guzmán carefully raise concerns once he's at ease.\n\nDon Luis's surprise was evident—this was clearly not what he'd expected. But he recovered quickly, bowing with genuine gratitude. \"Your Majesty honors me.\"\n\nThe tour of the Alcázar transformed the atmosphere entirely. Juan showed him the Portuguese chapel, where Isabel received them with quiet grace. Don Luis complimented the azulejo work with the eye of someone who'd seen Moorish craftsmanship for decades on the frontier.\n\n\"Your Majesty,\" Isabel said softly, \"the Order of Santiago has protected pilgrims to Compostela for generations. My own grandmother made that journey under their protection.\"\n\nDon Luis bowed deeply to her. \"We are honored to have served your family, Your Majesty.\"\n\nWhen Juan brought him to see the banner and relics, Don Luis went completely still. His hand went to the sword-cross on his chest, and he knelt without hesitation. His lips moved in silent prayer—the prayer of a man who'd spent thirty years fighting Moors, who understood exactly what this banner represented.\n\nRising, his voice was thick. \"Your Majesty... this is what Santiago was founded for. Everything else—politics, disputes, factions—it's all dust compared to this.\"\n\nLater, in a more comfortable chamber with wine and some of Juan's sworn crusaders present, Don Luis relaxed considerably. He discussed Santiago's organization with professional pride:\n\n\"We maintain permanent garrisons at key frontier fortresses, Your Majesty. Each commanded by a comendador—a knight-brother who manages both military operations and the estates that support that garrison. It creates accountability. The man commanding the fortress also depends on the surrounding lands being productive and well-defended.\"\n\nHe traced patterns on the table as he explained. \"Our knights take religious vows—obedience, chastity in some cases, poverty in terms of personal wealth. But the Order itself is wealthy, because we need resources to maintain permanent frontier defense. A knight may own nothing personally, but commands troops and manages estates on behalf of Santiago.\"\n\nThe crusaders listened intently—this was exactly the kind of permanent military structure many of them aspired to create.\n\nAs evening deepened and they moved to a quieter corner, Don Luis's demeanor shifted slightly. He set down his wine cup and looked at Juan directly.\n\n\"Your Majesty has been extraordinarily gracious today. More than I...\" He paused. \"More than I perhaps deserved, given past choices.\"\n\nHe took a breath. \"But I would be dishonest if I didn't raise certain concerns. Not objections—concerns that I hope Your Majesty can help me address.\"\n\nDon Luis chose his words carefully. \"The Order of Santiago controls extensive properties across Castile. Estates, fortresses, churches, villages. These were granted over centuries to support our mission. The assessments...\" He met Juan's eyes. \"They will be substantial. I understand this. The crusade requires resources.\"\n\n\"But I worry, Your Majesty, about how this appears. Santiago was founded for exactly this crusade. Yet now we must pay heavily to participate in our own founding purpose?\" He raised a hand. \"I'm not refusing. I'm asking how we frame this so Santiago's honor—and our ability to recruit young knights in the future—remains intact.\"\n\nHe continued. \"Second concern: I am fifty-six years old. I've fought Moors for thirty-three years. My knees ache, my sword arm isn't what it was. The personal service exemption...\" He smiled ruefully. \"Your Majesty understands my difficulty. I want to lead Santiago in this crusade, but I'm too old for sustained campaign. How do I maintain the Order's honor when its Master cannot take the field personally?\"\n\nDon Luis leaned forward slightly. \"And finally—my younger knights. Many wish to take crusader oaths as individuals, beyond their service to Santiago. Is this... acceptable? Does it weaken the Order if our best knights pledge directly to Your Majesty's banner rather than serving under Santiago's command structure?\"\n\nHe spread his hands. \"These are my worries, Your Majesty. Not resistance—genuine concerns about how to serve this crusade most effectively while preserving Santiago's identity and purpose.\""
        },
        {
          "role": "player",
          "text": "I completely understand. These extra funds will go into the crusade coffers to cover for example the hiring of extra genoese ships. If I would not use these taxes, the crusade would only have many very motivated, pious but ill-supplied fighters. We need ships and provisions to make the crusade a success and that is what these taxes are for. Witout them, I could not succeed.\n\n\nNote that these funds are not my property but are allocated and overseen by the vatican to be allocated to the crusade. These taxes will be fair.\n\n\nIf knights of your order want to take the crusader vows before the banner, they are free to do so from my end. If serving the white banner breaks existing obligations is not something I can determine, but I will make sure that we will screen if everyone we accept are indeed free to do so and refuse those who are charged with another sacred charge. If they become crusaders of the white banner, they will serve in a different way, but from another angle nothing changes. I command everyone who serves in the crusade anyway. I could choose to put knights of any order under command of other comanders or even replace the masters of any holy order at my discretion. The papal bull grants me total control over the command and make-up of the crusade. Keep in mind that after the crusade is complete, every crusader is released from their vows and may revert back to other professions or dedications.\n\n\nRegarding your own capability to serve personally...this is something between you and God. I will not use my powers to have you replaced. But there is no disgrace to step down and hand command over to someone who can perhaps better perform the duties of a commander in the field. No-one doubts your martial accomplishments and there are many ways to serve, even in other capacities other than on a battlefield. Normally I do let let my commanders choose their position or mission, but in your case, I will make an exception. You can command the troops of your order in the field should you choose to do so. If you choose to step down, and let someone else take over, I would be honoured if you would serve the crusade as an honoured advisor . This would be a prestigeous position where perhaps you can serve God in an even greater capacity than while wielding a sword. But this choice I leave in your hands.\n\n\nThe above is my response to the master's concern. Given his position and considerations, how would the master respond? Draft a d100 table so I can make a roll."
        },
        {
          "role": "gm",
          "text": "Luis is in a difficult position:\n- He backed the Infantes (wrong side)\n- He's too old to campaign effectively\n- Santiago's wealth means huge tax burden\n- But Juan is offering him dignity and choices\n\nLet me think about Luis's character and motivations:\n- Career military man, 33 years fighting Moors\n- Master of Santiago - prestigious position\n- Pride matters, but he's also pragmatic\n- He's been graciously received today\n- Juan's explanation makes sense\n- The offer to be honored advisor vs. field command gives him an out\n\nFactors favoring positive response:\n- Juan's been incredibly gracious\n- The taxation explanation is reasonable\n- Vatican oversight removes corruption concerns\n- Option to step down with honor\n- Santiago can still participate fully\n- Individual knights can take crusader oaths\n- This IS Santiago's founding purpose\n- Luis knows he's too old really\n- Better to align with winning side\n\nFactors against:\n- Pride - admitting he's too old\n- Loss of control over Santiago knights\n- Heavy taxation burden\n- Past support for Infantes still a mark against him\n- Uncertainty about his future role\n\nGiven the interaction, I think Luis will respond very positively. Juan has given him everything he could reasonably want - respect, options, clarity, and dignity. This should be weighted heavily toward acceptance and cooperation.\n\nLet me create a d100 table:\n\n1-5: Bitter acceptance - agrees but resentful, feels forced\n6-15: Cautious acceptance - agrees but reserved, still worried\n16-35: Pragmatic acceptance - recognizes wisdom, accepts terms\n36-60: Grateful acceptance - appreciates Juan's grace, commits fully\n\n61-80: Enthusiastic acceptance reveals Luis's deeper spiritual motivations. The crusade's sacred purpose resonates with his lifelong military commitment. He sees an opportunity to transform his legacy from political maneuvering to divine mission. His 33 years of fighting Moors suddenly feel like preparation for this moment of spiritual redemption.\n\n81-95: Complete transformation occurs as Luis recognizes this is more than a political negotiation. The banner's spiritual power and Juan's masterful approach crack his defensive posture. He becomes a true believer, seeing his entire military career as a path leading to this crusade. His pride transforms into passionate dedication.\n\n96-100: Extraordinary response emerges from profound spiritual awakening. Luis not only commits fully but offers additional resources, personal connections, and his entire remaining life to the cause. He becomes an unexpected champion, turning his previous political liability into a powerful asset for the crusade.\n\nThe high probability of positive outcomes reflects the perfect alignment of political strategy, personal dignity, and spiritual calling.\n\nDon Luis listened intently to every word, his weathered face revealing the internal calculation of a man weighing his position carefully. When Juan finished, he was silent for a long moment, staring into his wine cup.\n\nHere is the d100 table for Don Luis de Guzmán's response:\n\n1-5: Bitter Compliance\n\nAccepts terms because he has no choice, but resentment shows\n\n\"Very well, Your Majesty. Santiago will comply.\"\n\nAgrees but minimal enthusiasm, will do exactly what's required and no more\n\nMay cause subtle problems later through lack of cooperation\n\n6-15: Cautious Acceptance\n\nAccepts but remains guarded and uncertain\n\nThanks Juan but tone is formal, distant\n\nCommits Santiago's forces but holds back personal enthusiasm\n\nWorry about Order's future position still dominates his thinking\n\n16-35: Pragmatic Acceptance\n\nRecognizes Juan's terms are fair and reasonable\n\nAppreciates the clarity and options provided\n\nProfessional military man respecting clear command structure\n\nWill fulfill obligations competently but without particular passion\n\n36-60: Grateful Acceptance\n\nGenuinely moved by Juan's grace and respect\n\nRecognizes he's been given more consideration than he deserved\n\nCommits Santiago fully and personally to crusade success\n\nRelief that his concerns have been addressed so thoughtfully\n\n61-80: Enthusiastic Acceptance\n\nDeeply appreciates being treated with dignity despite past errors\n\nEnergized by the crusade's sacred purpose\n\nSees opportunity for Santiago to reclaim its founding mission\n\nOffers active support and genuine partnership\n\n81-95: Complete Transformation\n\nProfoundly moved by Juan's wisdom and the crusade's call\n\nSees this as redemption for past political mistakes\n\nCommits not just Santiago's resources but his own legacy\n\nBecomes active advocate among other hesitant nobles\n\nMay choose advisory role, focusing energy on crusade success\n\n96-100: Extraordinary Devotion\n\nSpiritual awakening moment - fully grasps sacred nature\n\nOffers beyond what's required - personal wealth, connections, everything\n\nPledges to spend remaining years ensuring crusade succeeds\n\nBecomes one of Juan's most valuable and unexpected allies\n\nWill actively work to bring other Military Orders into full cooperation\n\nRoll 1d100 to determine Don Luis de Guzmán's response."
        },
        {
          "role": "player",
          "text": "Grateful acceptance. (I rolled 56)\n\n\nNow draft the master's response given this response."
        },
        {
          "role": "gm",
          "text": "Don Luis rolled a 56 - \"Grateful Acceptance.\" This means:\n- Genuinely moved by Juan's grace and respect\n- Recognizes he's been given more consideration than he deserved\n- Commits Santiago fully and personally to crusade success\n- Relief that his concerns have been addressed so thoughtfully\n\nI need to write Don Luis's response that captures:\n1. His genuine emotional reaction - he came expecting difficulty, got grace instead\n2. Recognition that Juan treated him far better than his past actions warranted\n3. Relief that his concerns were addressed directly and fairly\n4. Commitment to making this work, both for Santiago and personally\n5. Probably some reflection on what choice he'll make regarding command\n6. A sense of redemption - being brought back into the fold despite backing the Infantes\n\nThe response should feel authentic to a 56-year-old military veteran who's been doing politics for decades but who still has genuine faith underneath. He should be moved but not overly emotional - still maintaining dignity befitting a Master of a Military Order.\n\nDon Luis set down his wine cup slowly, and when he looked up at Juan, there was genuine emotion in his weathered face.\n\n\"Your Majesty...\" He paused, gathering his words. \"I came here today expecting... well. I expected justice, perhaps. What I deserved for the choices I made during the Infantes' rebellion. I did not expect grace.\"\n\nHe stood and moved to the window, looking out over Toledo as the sun set. His hand went unconsciously to the sword-cross on his chest.\n\n\"You speak of the taxes being fair, overseen by Rome, necessary for the crusade's success. Your Majesty is right. Santiago has vast estates because we were founded to fight exactly this war. It would be... obscene... to hoard those resources when the work we were created for finally begins.\" He turned back to face Juan. \"We will cooperate fully with the assessments. No resistance, no hiding of assets. Santiago's books will be open.\"\n\nDon Luis returned to his seat, leaning forward earnestly. \"And your words about command—about giving me the choice—Your Majesty shows wisdom beyond your years.\" He smiled ruefully. \"My pride wanted to command in the field. To prove I can still lead men into battle, that age hasn't made me useless. But...\"\n\nHe looked at his hands—scarred, weathered, the hands of a man who'd gripped sword hilts for three decades. \"The truth is, Your Majesty, I am slower than I was. My knowledge is still sharp, my strategic understanding sound. But in the chaos of battle, when everything depends on split-second decisions and physical endurance...\" He met Juan's eyes. \"I would be risking Santiago's men to protect my own pride. That's not leadership. That's vanity.\"\n\nDon Luis straightened in his chair. \"I will step down from field command, Your Majesty. I will recommend to you my ablest younger commanders—men in their thirties and forties who can ride all day and fight all night. Men who've trained their entire lives for this.\" He paused. \"And if Your Majesty will have me, I will serve as advisor. I know every fortress on the Granada frontier, every water source, every approach. I know how the Moors fight, how they think. That knowledge can serve the crusade better than my aging sword arm.\"\n\nHe took a breath, and there was relief in it—as if a weight had lifted. \"As for my knights taking crusader vows before your banner—Santiago exists to serve the Reconquista. If my best men wish to pledge directly to this holy cause, I will not stand in their way. They can serve under your banner and Santiago's honor is enhanced, not diminished. We fulfill our founding purpose.\"\n\nDon Luis stood and placed his hand over his heart. \"Your Majesty, I will be honest. I came here frightened. Frightened of financial ruin, of humiliation, of Santiago being diminished. Instead, you've shown me how Santiago can be restored—not as a political faction playing kingdom politics, but as what we were always meant to be: warriors of Christ completing the Reconquista.\"\n\nHis voice grew thick with emotion. \"I backed the wrong side in the rebellion, Your Majesty. I thought... I thought the Infantes understood governance, that the kingdom needed their experience. I was wrong. And I feared that mistake would cost Santiago everything.\" He looked directly at Juan. \"Instead, you've given me—given us—redemption. A chance to serve our true purpose.\"\n\nHe bowed deeply. \"The Order of Santiago commits fully to this crusade, Your Majesty. Our two thousand knights, our fortresses, our resources, our knowledge—all of it at your disposal. And I personally pledge to serve as advisor for as long as God grants me breath and Your Majesty finds me useful.\"\n\nWhen he straightened, there were tears at the corners of his eyes, but his voice was steady. \"Thank you, Your Majesty. For your wisdom, your grace, and for reminding an old soldier what we're really supposed to be fighting for.\""
        },
        {
          "role": "player",
          "text": "Come master. Let's pray with me for a moment. It are these moments we find god's grace that we must remind ourselves of our purpose and of our christianity.\n\n\nAfter we finish a short prayer I adress him again.\n\n\nDon Luis, I will send you to the eastern army as commander officially, but your task will be to mentor and help the other commanders there. When the season starts, I will send you there along with a letter describing your role so everyone understands your authority in the crusade. We will need your knowledge at this border.\n\n\nNow, lets both walk with god Don. I will see you again soon.\n\n\nAfter this last audience, I go to Isabel."
        },
        {
          "role": "gm",
          "text": "Then Juan gives Don Luis a specific, honorable role - officially a commander but really a mentor/advisor for the eastern army commanders. This lets Don Luis save face (still has a command position) while using his frontier knowledge where it's most valuable and not requiring him to be in the thick of battle.\n\nThen Juan will go to Isabel at the end of the day.\n\nI should narrate:\n1. The prayer moment - brief but meaningful\n2. Don Luis's response to his assignment\n3. His departure\n4. Brief transition to finding Isabel\n\nKeep it short and natural. Don't overwrite.\n\nDon Luis nodded, his throat tight with emotion. The two men knelt together before the window, the last rays of sunset streaming across them.\n\nJuan led them in a simple prayer—no elaborate words, just a soldier-king and an aging warrior asking God to guide them in the work ahead. When they finished, Don Luis's weathered face was wet with tears he didn't bother to hide.\n\n\"The eastern army,\" Don Luis said quietly after Juan explained his role. \"The frontier I've defended for thirty years.\" He stood slowly, his voice steadier now. \"Your Majesty, I know every commander there, every fortress, every wadi and mountain pass. I can teach them things that took me decades to learn. This is...\" He searched for words. \"This is exactly where I can serve best.\"\n\nHe clasped Juan's hand firmly. \"I will not fail you, Your Majesty. Or God. Not this time.\"\n\nAfter Don Luis departed—walking straighter than when he'd arrived—Juan made his way through the Alcázar's corridors. The day had been long, three audiences that each required different approaches, different wisdom.\n\nHe found Isabel in the Portuguese chapel, kneeling before the half-finished altar as the evening shadows lengthened. She looked up as he entered, and a small smile touched her lips.\n\n\"The Portuguese ladies told me your meetings went well,\" she said softly. \"That the nobles seemed... satisfied when they left.\""
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_1431_00073",
      "book": 1,
      "chapter": "1.12",
      "date": "1431-01-29",
      "end_date": null,
      "type": "personal",
      "summary": "Evening with Isabel and her Portuguese ladies-in-waiting. Juan joins Isabel in prayer in the Portuguese chapel, shares his vision of God's kingdom on earth — Isabel deeply moved, leads an assured prayer for their sacred partnership. They discuss children, Isabel's mother's letter of support, plans to invite her mother to visit in autumn. Dinner with Dona Beatriz, Dona Inês, and Dona Catarina — Portuguese court stories, Isabel's herbcraft skill revealed (learned from monastery nuns), personal warmth growing. Álvaro reports Master of Calatrava requesting audience, influenced by Guzmán's transformation.",
      "characters": [
        "juan_ii",
        "isabel_of_portugal",
        "dona_beatriz",
        "alvaro_de_luna"
      ],
      "factions_affected": [],
      "location": "Toledo",
      "tags": [
        "personal",
        "marriage",
        "religion"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "Yes love. Today went really well. It is important I get their support. \nI kneel down beside her.\n\n\nWhat do you pray for Isabel?"
        },
        {
          "role": "gm",
          "text": "Given her character:\n- Conventionally pious and dutiful\n- Comfortable with religious matters\n- Has been praying for specific things related to her anxieties\n- The wedding is approaching (18 days away)\n- She's found some confidence but still has worries\n- She would pray about her duties, her fears, her family\n\nHer answer should be genuine, simple, and reveal her inner concerns while showing she's found some peace.\n\nIsabel looked at him with those gentle eyes, and for a moment seemed to consider whether to share something so personal. Then she glanced back at the altar, her hands folded in her lap.\n\n\"I pray for my mother,\" she said quietly. \"That she is well in Portugal, that she doesn't worry too much about me.\" A pause. \"I know she must be anxious—her daughter so far away, in a foreign kingdom.\"\n\nShe traced a finger along the wooden prayer rail. \"I pray for you, Juan. For wisdom in your decisions, for God's protection in the crusade. For...\" She hesitated. \"For our marriage. That I can be the wife and queen you need. That I won't fail in my duties.\"\n\nIsabel's voice grew softer. \"And I pray for... for when we have children. That God grants us healthy sons and daughters. That I can be a good mother.\" There was vulnerability in that admission—the weight of dynastic expectation, the fear of failing at something so important.\n\nShe turned to look at him directly. \"What do you pray for, Juan? When you kneel here alone?\""
        },
        {
          "role": "player",
          "text": "I have a vision Isabel. A vision of the world how it should be. A world that stands far away from greed, from poverty and disease. But a world that is united in it's service to God. I catch glimpses of it when I see two brothers working together in their father's field. I see it when I see children playing in the street. I feel it when you tell me about your mother and your love for each other. And then I fight for it Isabel. I fight for it with everything I have. When I pray, that is all I think about.\n\n\nAnd sometimes I catch a glimpse of this world. A glimpse of God's kingdom on earth and then I know what I must do. I knew for sure that I had to go to Rome, to go back to fetch my father's sword and to lay myself at the pope's feet. I knew what I had to do because I had seen it in God's kingdom. I have only felt this certainty a few times but when I do, I know I must do it. Most of the times because one time, I saw something but later found out I was wrong and narrowly avoided disaster. I am not perfect Isabel, but I try to be.\n\n\nWhen I think about us and how we fit into God's kingdom on earth, I see us together. Me as a king spreading the gospel with you faithfully by my side. Doing all the duties gracefully that are required of a queen. And being a good mother as well.\n\n\nWill you pray with me Isabel. Pray to our lord to grant us this small piece of God's kingdom in this world?"
        },
        {
          "role": "gm",
          "text": "Isabel would be deeply moved by this. This is the language she understands - faith, devotion, service to God. Juan is inviting her into his spiritual vision, making her a partner in something sacred rather than just a political arrangement.\n\nI should show:\n1. Isabel's emotional response - this touches her deeply\n2. Her acceptance and commitment\n3. A genuine prayer moment between them\n4. The strengthening of their bond through shared faith\n\nThis is a tender, spiritual moment. I should write it with appropriate reverence and emotion, showing how this deepens their relationship in a way that politics never could.\n\nIsabel's eyes glistened with tears. Her hand found his, squeezing tightly.\n\n\"Juan...\" Her voice trembled. \"I—I have never heard anyone speak like that. My tutors taught me about duty, about obedience, about being a proper queen. But you speak of vision. Of seeing God's kingdom and fighting to make it real.\"\n\nShe turned fully to face him, both hands now holding his. \"When you came to my chambers that first night, when you took me to see the banner—I felt it too. That glimpse. Like for just a moment, I could see what you see. A world that could be better, holier, more aligned with God's will.\"\n\nA tear rolled down her cheek. \"I was so frightened, Juan. Frightened that I would fail you, that I wouldn't be enough. But what you just said—that you see us together in God's kingdom, me doing my duties faithfully while you spread the gospel...\" She smiled through her tears. \"That, I can do. That, I want to do.\"\n\nIsabel knelt more formally, pulling him down beside her. She kept one hand in his and raised the other toward the unfinished altar.\n\n\"Yes,\" she whispered. \"Let us pray together.\"\n\nThey bowed their heads, and Isabel's voice—usually so quiet and uncertain—grew clear and steady:\n\n\"Heavenly Father, we come before You as Your servants. Grant us the grace to see Your kingdom as Juan sees it. Give us strength to build it here, in this world, in this kingdom. Let our marriage be not just political alliance but sacred partnership in Your work.\"\n\nHer hand tightened in Juan's. \"Protect Juan in the crusade ahead. Guide his decisions. When he catches those glimpses of Your will, make them clear. When he doubts, strengthen him. And grant me—\" her voice wavered slightly, \"—grant me the wisdom and grace to stand beside him faithfully. To be the queen, the wife, the mother that Your kingdom requires.\"\n\nShe fell silent, and in that silence Juan could feel her trembling slightly—not from fear, but from the intensity of genuine devotion.\n\nWhen she finally whispered \"Amen,\" she looked at him with an expression he'd never seen before. Not duty. Not obedience. But purpose.\n\n\"I see it now too, Juan,\" she said softly. \"God's kingdom. And us in it, together.\""
        },
        {
          "role": "player",
          "text": "I can't wait until we get married Isabel. I want us to start a family. Have you written to your mother yet?"
        },
        {
          "role": "gm",
          "text": "Isabel's character:\n- Conventionally pious and dutiful\n- Sheltered upbringing in Portuguese convents\n- Misses her mother and family\n- Finding her place and confidence through shared faith with Juan\n- Comfortable with clear expectations and duties\n\nShe would likely:\n- Be touched by his eagerness for family\n- A bit nervous/shy about the intimacy implied\n- Definitely have written to her mother (that's very important to her)\n- Be comforted by talking about her mother\n- Perhaps share what she wrote\n\nI should keep this response relatively short since it's during dialogue and Isabel should answer his questions naturally.\n\nIsabel blushed slightly at the mention of starting a family, but her smile was genuine. \"I wrote to her three days ago,\" she said softly. \"A long letter. I told her about the journey from Seville, about seeing the banner for the first time, about...\" She glanced at him shyly. \"About you.\"\n\nShe looked down at their joined hands. \"I told her that you're kind to me. That you pray with me. That I'm not as frightened anymore.\" A pause. \"I told her about the chapel you're building in the Portuguese style, so I'll have a place that feels like home. She'll be happy to know that.\"\n\nIsabel's voice grew quieter. \"And I told her... that the wedding is in eighteen days. That I'll be a married woman soon. That you and I will...\" She trailed off, the blush deepening. Even mentioning the reality of marriage made her shy.\n\nShe looked up at him then, vulnerability and trust mingled in her expression. \"I want to make you happy, Juan. To give you children, to be a good wife. I'm—\" she hesitated, \"—I'm nervous. But when we pray together like this, when you share your vision with me, I feel... ready. Like God is preparing me for this.\"\n\nHer hand squeezed his gently. \"Eighteen more days.\""
        },
        {
          "role": "player",
          "text": "Lets enjoy the evening together.\n\n\nWe have dinner and spend the evening with Dona Beatriz and her other ladies in waiting, telling me about Portugal and life there."
        },
        {
          "role": "gm",
          "text": "The evening meal was intimate—just Juan, Isabel, and her three Portuguese ladies in one of the smaller chambers overlooking the city. Dona Beatriz proved to be an excellent storyteller, her initial reserve melting away as wine was poured and the conversation turned to Portugal.\n\n\"Your Majesty should understand,\" Dona Beatriz said with a sly smile, \"that Portuguese court is very different from Castilian. We are... how do I say... less formal in some ways, more careful in others.\"\n\nDona Inês, younger and more animated, laughed. \"What she means, Your Majesty, is that in Lisbon, the Queen Mother would sometimes walk through the market herself. Just with two guards! Can you imagine?\"\n\nIsabel nodded, her face lighting up with memory. \"My mother loved the fish markets. She said you could tell the health of the kingdom by the quality of the morning catch.\"\n\nThe women shared stories—of royal festivals where commoners and nobles danced together, of Portuguese navigators returning with tales of African coasts, of the way the Atlantic storms would batter the palace windows in winter. Dona Catarina described the Jerónimos Monastery where Isabel had spent much of her girlhood.\n\n\"The sisters taught Her Majesty everything,\" Catarina said fondly. \"Latin, Portuguese, proper devotions. But also—\" she glanced at Isabel with affection, \"—how to grow herbs. Isabel has the finest hand with medicinal plants I've ever seen.\"\n\nJuan turned to Isabel with surprise. \"You know herbcraft?\"\n\nIsabel ducked her head shyly. \"A little. Sister Maria taught me. Lavender for calming nerves, chamomile for digestion, comfrey for bruises...\" She glanced up. \"The infirmary gardens at the monastery were beautiful. I thought... perhaps I could start one here? At the chapel?\"\n\nDona Beatriz refilled wine cups. \"Your Majesty, you should know—our Princess is much loved in Portugal. When word came of the betrothal, there was genuine sadness to see her leave. But also pride. The people said, 'Our Isabel will be Queen of Castile, and she'll show them Portuguese grace.'\"\n\nThe evening wore on with such talk—gentle, warm, domestic. Isabel grew more animated than Juan had ever seen her, laughing at stories, correcting details, sharing her own memories. This was her world, her comfort.\n\nAs the candles burned low, Isabel stifled a yawn. \"Forgive me,\" she said. \"It's been a long day.\"\n\nJuan stood, offering his hand. \"For both of us. But a good day.\"\n\nIsabel took his hand and rose, then impulsively—perhaps emboldened by wine and comfort—she squeezed it. \"Eighteen more days,\" she whispered, echoing her earlier words. Then, blushing at her own boldness, she released his hand and curtsied. \"Goodnight, Juan.\"\n\nThe Portuguese ladies rose as well, curtsying to Juan before following their mistress. Dona Beatriz caught his eye as she passed and gave a small, approving nod—a blessing of sorts from the woman who'd helped raise Isabel.\n\nÁlvaro found Juan shortly after, as servants cleared the chamber. \"A successful day, Your Majesty. The Mendozas are already spreading favorable word among the other houses. Enríquez seems satisfied. And Don Luis...\" He shook his head in wonder. \"I thought that meeting would be a disaster. Instead, he left looking ten years younger and genuinely devoted.\"\n\nThe Constable handed Juan a small stack of correspondence. \"Tomorrow's concerns. Nothing urgent—mostly confirmations of noble arrivals for the wedding. But there's one letter that might interest you.\" He pointed to a sealed document with an elaborate seal. \"From the Master of Calatrava. He requests audience at Your Majesty's convenience, 'to discuss the Military Orders' united participation in the holy crusade.'\"\n\nÁlvaro's eyebrow raised slightly. \"Don Luis works fast. He must have sent word immediately after leaving your presence.\"\n\nStatus Summary\n\nDate: January 29, 1431, Evening\nLocation: Toledo, Royal Alcázar\n\nPolitical Situation:\n\nThree successful noble audiences completed\n\nHouse Mendoza: Committed (1,800 levies), Pedro taking crusader oath\n\nHouse Enríquez: Satisfied with assessment terms, offering naval expertise\n\nOrder of Santiago: Fully committed (2,000 knights), Master accepting advisory role\n\nMaster of Calatrava requesting audience (likely following Santiago's lead)\n\nWedding Countdown: 17 days (February 15, 1431)\n\nPersonal:\n\nIsabel growing more confident and comfortable\n\nMarriage relationship developing genuine warmth\n\nPortuguese ladies integrated successfully\n\nCrusade Status:\n\n~200 sworn crusaders\n\nAssessment teams ready\n\nGreat houses responding favorably to taxation\n\nMilitary Orders potentially aligning"
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_1431_00074",
      "book": 1,
      "chapter": "1.12",
      "date": "1431-01-30",
      "end_date": null,
      "type": "military_action",
      "summary": "Morning: Juan commissions personal battle armor from Master Gonzalo de Burgos. Design: all-white Milan plate, tall white plume, white tabard, two lightweight ash banner poles (8 feet) attached to saddle streaming white silk banners. White caparison for horse, white shield and lance. Álvaro warns visibility means becoming primary target for every enemy. Master Gonzalo suggests two helmets: show helm for ceremonies, protected helm for intense fighting. Juan requests armor ready for wedding arrival in 17 days — tight deadline but achievable for ceremonial pieces. Immediate fitting session conducted. Midday: Juan assembles all 50 crusaders in the banner chamber. Addresses them on sacred responsibility of guarding relics and banner. Establishes exclusive authority: only these 50 may handle relics, only they guard banner. Warns of battlefield dangers — enemy will target relics and king. Tasks them with developing operational procedures: travel protocols, banner-relic separation in battle, guard rotation, chain of command, passwords. Leads unified prayer. Fray Hernando formally names them the 'Guardian Company.' Veterans and newcomers alike respond with absolute devotion, immediately begin practical planning.",
      "characters": [
        "juan_ii",
        "alvaro_de_luna",
        "master_gonzalo_de_burgos",
        "fray_hernando"
      ],
      "factions_affected": [],
      "location": "Toledo",
      "tags": [
        "military",
        "armor",
        "crusade",
        "religion",
        "guardian_company"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "Tomorrow, I want to fit my personal armour and battle outfit. I want to look distinct on the battlefield.\n\n\nI also want to visit the 50 crusaders who guard the banner and impress onto them the responsibility to keep the relics safe.\n\n\nI will recieve the master who want to speak with me."
        },
        {
          "role": "gm",
          "text": "This is Chapter 12, continuing the day after the three audiences. The date would be January 30, 1431. 16 days until the wedding.\n\nI should:\n- Not write Juan's actions or dialogue\n- Keep responses short and stop when Juan needs to respond\n- Narrate the world's reactions to Juan's presence/actions\n- Allow the scenes to unfold naturally\n\nLet me start with the morning of January 30 and present the armor fitting first, then move to visiting the crusaders, then the audience with Calatrava's Master.\n\nCHAPTER 12: THE RECKONING (Continued)\n\nDate: January 30, 1431, Morning\nLocation: Royal Alcázar, Toledo\n\nThe armorer's workshop had been set up in one of the Alcázar's lower chambers, where the clanging of hammers wouldn't disturb the noble households above. Master Gonzalo de Burgos, a stocky man in his fifties with burn-scarred forearms, bowed as Juan entered with Álvaro.\n\n\"Your Majesty honors my workshop.\" He gestured to a cloth-covered form on the workbench. \"I've prepared initial pieces based on measurements from your household guard, but we must fit properly.\"\n\nHe pulled back the cloth, revealing polished steel. \"Milan work, Your Majesty. The finest plate available. But before we proceed—\" He looked at Juan carefully. \"You mentioned wanting to appear distinct on the battlefield. There are... considerations.\"\n\nMaster Gonzalo picked up a helmet, turning it in his hands. \"A king must be seen by his troops—for morale, for command. But also recognized by the enemy—which brings danger.\" He set down the helmet. \"We can make you magnificent, Your Majesty, but magnificence draws arrows. How visible does Your Majesty wish to be?\"\n\nBehind him on the bench lay various options: crests, plumes, different helmet styles, colored enamel work. Álvaro stood quietly, clearly having discussed this already with the armorer.\n\n\"Sir Thomas also left specifications,\" Master Gonzalo added, producing a parchment. \"Weight distribution, mobility requirements, sight lines. He's very... thorough.\""
        },
        {
          "role": "player",
          "text": "It is my job to inspire troops so I will be visible. I am dressed all in white and when Mounted I want banners to flutter behind me as I ride, maybe supported by light wooden poles if you can manage. I want my horse to have a plain white cloth covering him. In regards to my armour, I want it to be made fit for fighting. I wear my white tabard over it. Feel free to decorate my helmet in a way that accentuates the theme. Do you think a white plume on top could be fitted?\n\n\nI want everyone to know who I am when I ride in front of my cavalry dressed all in white, wearing a white shield and a white lance with a white banner attached to it. And behind me, the long white banners fluttering in the wind.\n\n\nCan you do this?"
        },
        {
          "role": "gm",
          "text": "Juan is going for maximum visibility and dramatic effect - a white knight king leading crusades. This is bold and inspiring but also very dangerous on a medieval battlefield. The armorer would need to address:\n\n1. Practical concerns about being such an obvious target\n2. Technical challenges of the banner system\n3. Horse armor/covering practicalities\n4. Whether this is achievable\n\nThe armorer is a professional who's seen combat, so he'd be honest about the risks while also respecting the strategic thinking behind it. He'd want to make it work but also ensure Juan understands what he's committing to.\n\nThis fits Juan's character - he's been building this white crusader king image throughout the campaign, and now he's taking it to its logical battlefield conclusion.\n\nMaster Gonzalo was silent for a long moment, studying Juan with the eyes of a man who'd armed warriors for three decades. Then a slow smile spread across his scarred face.\n\n\"Your Majesty, I can do this. But first—\" He turned to Álvaro. \"Don Álvaro, you've seen battle. Tell His Majesty what happens to the most visible man on the field.\"\n\nÁlvaro's expression was grim. \"He becomes the primary target for every archer, crossbowman, and knight seeking glory. Every enemy commander will order: 'Kill the white king.' Your Majesty, this is...\" He paused, choosing words carefully. \"Bold. Strategically sound for morale. Extraordinarily dangerous personally.\"\n\nMaster Gonzalo nodded. \"Exactly. So if Your Majesty insists on being that visible—and I understand why—then we make the armor exceptional.\" He moved to the workbench, gesturing enthusiastically now that he understood the vision.\n\n\"Full Milan plate, perfectly fitted. The finest steel I can source. Not just protection—mobility. You'll need to fight in this, not just parade.\" He picked up a breastplate. \"We'll fit it so you can move freely, mount and dismount easily. The white tabard goes over everything, but the armor beneath must be flawless.\"\n\nHe reached for a helmet—an elegant armet with a visor. \"For the helmet—a tall white plume, secured with a brass fitting so it won't fall in combat. Visible from a distance. The helmet itself, polished steel with white enamel accents along the edges. Practical visibility through the visor, but unmistakably yours.\"\n\nMaster Gonzalo warmed to the challenge. \"The banner poles behind you—lightweight ash wood, fitted into sockets we'll attach to your saddle. Two poles, perhaps eight feet tall, with white silk banners that catch the wind. When you ride, they'll stream behind you like wings.\"\n\nHe moved to sketch on parchment. \"Your horse—white caparison over the body, but we'll armor the head and chest beneath in case of attack. White lance, white shield—we can paint them or use white-enameled steel. The shield will bear... what device, Your Majesty? Your personal arms? The red cross? Something else?\"\n\nÁlvaro interjected quietly. \"Your Majesty should know—Sir Thomas will be horrified by this plan. He'll want to surround you with heavily armored guards at all times.\"\n\nMaster Gonzalo nodded. \"Which is wise. You'll be magnificent, Your Majesty, and every Moor in Granada will want your head. Can I suggest one concession to safety? A backup helm—identical in appearance but with better face protection for when arrows start flying? You can start battles in the show helm, switch to the protected one when fighting intensifies.\"\n\nHe looked at Juan directly. \"Your Majesty, I will create what you ask. It will be spectacular. Men will write songs about the White King. But please—please—listen to your guards when they tell you to fall back. Even the finest armor has gaps, and you'll be the target every enemy dreams of striking.\""
        },
        {
          "role": "player",
          "text": "Do it. And two helmets sound prudent. But I do not fear battle good master. Make it magnificent.\n\n\nDo you think I will be able to wear it during the wedding? I would like to arrive wearing my armour. It would just be for show so some details need not be perfect yet. But it would be a great moment to introduce this great work of yours to the public."
        },
        {
          "role": "gm",
          "text": "The armorer would likely:\n1. Be honored by the commission and the public display\n2. Be concerned about the tight timeline - 17 days to create custom fitted armor is very tight\n3. Recognize that if it's just for show at the wedding (not actual combat), some elements could be prioritized\n4. Want to make sure key pieces are ready but acknowledge some finishing work might come later\n\nThis is actually a great way to unveil the \"White King\" image at the wedding alongside the banner, the taxation announcement, etc. Very theatrical.\n\nThe armorer would probably be excited but realistic about what can be done in 17 days.\n\nMaster Gonzalo's eyes widened, then gleamed with professional pride and ambition. He glanced at Álvaro, then back to Juan.\n\n\"Seventeen days, Your Majesty.\" He sucked air through his teeth, calculating. \"To create a full harness of Milan plate, properly fitted and finished...\" He paused. \"Under normal circumstances, I would say impossible. But—\" He moved to the workbench, touching the pieces already laid out.\n\n\"I've been preparing based on the measurements, so we're not starting from nothing. And if it's for ceremonial appearance at the wedding, not combat readiness...\" His mind was clearly racing through logistics. \"We can prioritize what will be seen. The cuirass, the helmet with plume, gauntlets, greaves. The pieces that matter for visual impact.\"\n\nHe turned back to Juan, speaking rapidly now. \"I'll need to work day and night. I'll need my three best apprentices pulled from all other work. And—\" he glanced at Álvaro, \"—I'll need access to the cathedral for measurements. The armor must fit you mounted, walking up the cathedral steps, kneeling, standing for hours during the ceremony.\"\n\nMaster Gonzalo's enthusiasm was building. \"Your Majesty, if you wear this at the wedding—the White King in shining armor, before the blessed banner—\" He shook his head in wonder. \"Every noble in Castile will see it. Every crusader. The image will spread across the kingdom.\"\n\nHe bowed deeply. \"I will do it, Your Majesty. The full harness will take longer to perfect for actual battle, but for the wedding? I will create something magnificent. You will look like an angel of war descended from Heaven itself.\"\n\nÁlvaro spoke quietly. \"The symbolism is powerful, Your Majesty. The papal legate officiating, the banner unveiled, you in white armor taking your marriage vows and announcing the crusade. It will be... unforgettable.\"\n\nMaster Gonzalo was already calling for his apprentices. \"We begin immediately. Your Majesty, I'll need you for fittings—tomorrow morning, then every three days. And—\" he added with a craftsman's pride, \"—when the nobles see this at your wedding, every one of them will want me to make their armor for the crusade. You're about to make me the busiest armorer in Castile, Your Majesty.\""
        },
        {
          "role": "player",
          "text": "Get to it master armourer. I am at your disposal if you want my measurements.\n\n\nDo you want to take measurements or do a fitting now?"
        },
        {
          "role": "gm",
          "text": "The armorer would absolutely want to start immediately - he has 17 days to create something spectacular. He needs measurements and initial fittings to begin work. This is his craft and his moment. Let me have him respond professionally and enthusiastically.\n\nMaster Gonzalo's face lit up. \"Now would be ideal, Your Majesty. Every hour counts.\"\n\nHe snapped his fingers and two apprentices appeared—young men who'd clearly been waiting nearby. \"Clear the bench. Bring the measuring cords, the wax tablets, and the sample plates.\"\n\nWithin moments, the workshop transformed into organized chaos. Master Gonzalo circled Juan like a hawk, pulling a measuring cord taut across his shoulders, calling out numbers that an apprentice scratched onto wax tablets.\n\n\"Arms up, Your Majesty... Good. Now bend at the waist—yes, as if drawing a sword from horseback.\" He muttered measurements under his breath. \"Chest thirty-eight fingers, shoulders broad but not overly so... Your Majesty is lean. Good. Armor works better on a lean frame—less weight to carry, better mobility.\"\n\nHe had Juan don some of the sample plates—a breastplate that didn't quite fit, gauntlets slightly too large. \"Move, Your Majesty. Raise your arms, twist your torso. Where does it pinch? Where does it bind?\"\n\nJuan moved through the motions while Master Gonzalo watched with intense focus, occasionally adjusting a strap or making notes.\n\n\"Your sword arm—the right. You need extra clearance here—\" He touched Juan's right shoulder. \"When you strike downward from horseback, the pauldron can't restrict. And your left arm holding the shield needs perfect balance...\"\n\nAfter perhaps half an hour of this meticulous process, Master Gonzalo stepped back, satisfied. \"I have what I need, Your Majesty. The apprentices will begin work on the base pieces immediately. I'll personally handle the helmet and the visible elements.\"\n\nHe paused, wiping sweat from his brow despite the cool morning. \"Your Majesty, in three days—come back for the first true fitting. By then, I'll have the breastplate and helmet roughed out. We'll refine from there.\"\n\nHis eyes gleamed with craftsman's pride. \"Seventeen days. The White King will have his armor.\""
        },
        {
          "role": "player",
          "text": "Great. I go to the banner and the relics and summon every crusader to adress them al at once."
        },
        {
          "role": "gm",
          "text": "Juan wants to address all the crusaders who are guarding the banner and relics. According to the documents, there are 50 crusaders in Toledo guarding the banner, while 101 are with Rodrigo in Seville. Juan wants to impress upon them the responsibility of keeping the relics safe.\n\nI should narrate the gathering of these crusaders and set up the scene for Juan's address. This is an important moment - Juan reinforcing the sacred duty of these men. I should make it solemn and meaningful, with the banner and relics as the focal point.\n\nLet me set the scene appropriately.\n\nThe banner chamber had been transformed into a makeshift chapel—candles burning before the relics, the white silk banner mounted prominently on the wall. Word spread quickly through the Alcázar: the King summons all crusaders.\n\nWithin the hour, fifty men crowded into the chamber and the corridor beyond. These were the sworn crusaders who had taken their oaths in Seville or during the journey to Toledo—men of varying ages and stations, but all wearing the white tabards with red crosses. Some bore the weathered look of frontier veterans, others the younger faces of knights seeking glory, a few were clearly common-born men who'd left farms and workshops for this calling.\n\nFray Hernando stood near the relics, his Franciscan robes dark against the white banner. He'd helped organize the gathering, ensuring proper reverence.\n\nWhen Juan entered, the men immediately fell to their knees—not just in royal obeisance, but in genuine devotion. Many crossed themselves, gazing at the banner and relics with the same awe they'd shown when first taking their oaths.\n\nJuan moved to stand before the banner, the fragment of the True Cross visible in its crystal reliquary to his left, Santiago's bone in silver to his right. Behind him, the pure white silk seemed to glow in the candlelight.\n\nThe chamber fell absolutely silent. Fifty pairs of eyes fixed on their king."
        },
        {
          "role": "player",
          "text": "Brothers, Thank you for taking the time to come here. I want to adress something important.\n\n\nI walk over to the relics, but stay a few respectable feet away.\n\n\nWhen these relics were given to me by the pope, I touched them for a moment and experienced the same grace you all felt yourself. Recieving these relics have been a great blessing but also weigh on me. The responsibility to guard and protect them keeps me up at night. And I depend on you for the most part to keep them safe.\n\n\nWe will move around a lot the coming years, with both the relics and the banner. The banner we carry into battle, the relics we keep safe and use them together with the banner to accept more crusaders.\n\n\nYou are only allowed to touch the relics once, and only those who are gifted this opportunity may do so. I also depend on you to guard access to the banner and the relics. And if you are charged with touching them, to do so with the care and reverence required. From now on, I only allow you fifty to protect and handle the relics and the banner. No-one other than you can claim this responsibility.\n\n\nWe will travel and carry this into battle as well. These relics and the banner will surely attract the attention of the enemy. The enemy will try to kill me, trample our banner and steal or desecrate our relics. It is your sacred task to prevent this.\n\n\nDepend on one another brothers. Make sure there are always guards near these relics. And when we ride into battle together, guard me, defend the banner and give your life in the defence of the relics. Our lives mean nothing next to these relics, including my own.\n\n\nAfter the wedding and when the campain starts, we will move towards the enemy. Prepare and steel yourself for the times ahead. We will need to travel with the banner and relics.\n\n\nWhen we ride into battle, I think we seperate the banner from the relics. This seems to me the best way to keep them safe. I want you to think about how to operate when we travel, when we seperate our banner from the relics and how we operate in battle. Know that I do not trust anyone else with this sacred task.\n\n\nAfter the wedding, I will reveal my strategy and we will move out soon after that. In the mean time, prepare. Train and be ready.\n\n\nNow, join me in prayer for us to achieve these goals my friends.\n\n\nI kneel down and say a prayer aloud, leading them in prayer."
        },
        {
          "role": "gm",
          "text": "1. Emphasizing the sacred responsibility\n2. Establishing exclusive access rules (only these 50 can handle the relics/banner)\n3. Warning them of the dangers ahead\n4. Asking them to think about operational procedures\n5. Leading them in prayer\n\nThis is a moment that will solidify their identity as an elite sacred guard. I should show their emotional response, their commitment, and the weight of this moment. Then Juan will lead them in prayer.\n\nAfter this, he'll receive the Master of Calatrava who requested audience.\n\nJuan's words hung in the candlelit chamber. As he spoke of the responsibility, of the dangers ahead, of the sacred trust placed upon these fifty men, the atmosphere grew almost unbearably heavy. Some of the crusaders had tears streaming down their faces. Others gripped their sword hilts or the crosses at their necks.\n\nWhen Juan mentioned that the enemy would try to kill him, trample the banner, steal the relics—the faces of these men hardened with fierce determination. One older crusader, a scarred veteran, whispered audibly: \"Over my dead body.\"\n\nAs Juan knelt before the relics, all fifty men immediately dropped to their knees as well. The sound of mail and leather, of fifty warriors kneeling in unison, echoed in the stone chamber.\n\nJuan's voice rose clear and strong:\n\n\"Heavenly Father, we kneel before You as servants of Your holy purpose. These relics—touched by Your Son's suffering, blessed by Your apostle Santiago—are not ours to possess but ours to protect. Grant us strength, courage, and vigilance in this sacred charge.\"\n\nThe crusaders murmured \"Amen,\" their voices unified.\n\n\"Lord, when the enemy comes—and he will come—steel our arms and harden our resolve. Let no man among us falter. Let no fear turn us from our duty. We pledge our lives not for glory, not for reward, but for the protection of these holy objects and the sacred banner that leads us.\"\n\n\"Amen,\" stronger now, more fervent.\n\n\"And when battle rages, when arrows fall like rain and the clash of steel deafens us—let us remember why we fight. Not for land or gold, but for You. For the completion of Your work in these lands. For the souls still trapped in darkness who await liberation.\"\n\nJuan paused, letting the weight of the moment settle. \"Grant us wisdom in how we guard these treasures. Grant us brotherhood with one another. And grant us the privilege of fulfilling this sacred trust, even unto death. Through Christ our Lord.\"\n\n\"AMEN!\"\n\nThe response was thunderous, fifty voices as one. Several crusaders had their eyes closed, tears streaming. Others gazed at the banner with expressions of absolute devotion.\n\nFray Hernando stepped forward, his voice carrying quiet authority. \"Brothers, you have heard your king and your commander. You are no longer simply crusaders—you are the Guardian Company. The sacred few entrusted with Christendom's holiest treasures in this war.\"\n\nHe looked at each man in turn. \"Think on what His Majesty said. How do we travel safely? How do we separate banner from relics in battle? How do we coordinate when under attack? You are warriors, but also stewards of the sacred. Both require discipline and thought.\"\n\nAn older crusader—the scarred veteran who'd spoken earlier—stood slowly. \"Your Majesty, with your permission?\"\n\nJuan nodded.\n\nThe man's voice was rough from years of frontier fighting. \"We need clear chains of command. Who leads us when Your Majesty isn't present? How do we rotate watch duties? And—\" he glanced at the banner, \"—in battle, someone must carry the banner. That man becomes the most visible target on the field. We need volunteers who understand they're likely to die.\"\n\nAnother crusader, younger, spoke up: \"And the relics, Your Majesty—they should never move without at least ten of us. Never less. Even in camp, even when we think we're safe.\"\n\nA third: \"We need passwords and recognition signs. If someone approaches the relics claiming to have orders, we need ways to verify.\"\n\nThe ideas flowed—practical, thoughtful, born from genuine devotion mixed with military experience. These men were taking their charge seriously.\n\nFray Hernando smiled slightly. \"Good. You understand. His Majesty has given you time before the campaign begins. Use it. Train together. Plan together. Become one body with one purpose.\"\n\nJuan stood, and all the crusaders rose with him. \"You have my complete trust, brothers. Fray Hernando will coordinate with you. Bring your plans to me before the wedding, and we will refine them together.\"\n\nHe placed his hand over his heart. \"Until the Reconquista is complete, until Granada falls and these holy lands are restored to Christ—we are bound together in this sacred charge. May God grant us victory.\"\n\nThe crusaders saluted as one—fist over heart, the gesture becoming their sign of unity.\n\nAs they began to file out, several approached Juan individually:\n\nThe veteran: \"Your Majesty, I fought at Antequera with your grandfather. I'll die before I let anyone touch those relics.\"\n\nA young knight: \"My whole family thinks I'm mad for taking the oath. But after today... I know this is where I'm meant to be.\"\n\nA common-born crusader, voice thick with emotion: \"Your Majesty touched these relics. I touched these relics. A king and a carpenter's son, both equal before God. I'll remember that when the fighting starts.\"\n\nAfter they departed, Álvaro entered quietly. \"Your Majesty, that was...\" He paused, searching for words. \"Those men would walk into Hell itself for you now. You've created something extraordinary.\"\n\nHe handed Juan a cup of watered wine. \"The Master of Calatrava is waiting whenever you're ready. After watching Don Luis de Guzmán leave yesterday looking reborn, Pedro González de Padilla is... eager... to discuss Calatrava's participation.\"\n\nFray Hernando approached as well. \"Your Majesty, I will work with the Guardian Company. Help them organize, develop their procedures. They're good men—faithful and serious about this charge.\"\n\nHe smiled slightly. \"Though I suspect Sir Thomas will have many opinions about their battlefield tactics when he returns from organizing the Seville crusaders.\""
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_1431_00075",
      "book": 1,
      "chapter": "1.12",
      "date": "1431-01-30",
      "end_date": null,
      "type": "military_action",
      "summary": "Don Pedro González de Padilla, Master of Calatrava (~45, professional soldier), arrives at Guzmán's urging. Pledges Calatrava's 1,500 knights and full participation. Juan shares secret two-army strategy: eastern army (23,000 troops) through central frontier with banner/relics, western army from Seville taking coastal ports with naval support. Pedro González provides expert frontier assessment — water supply critical, only 3 viable mountain passes, Sultan will likely concentrate against eastern army. Juan offers him command of the eastern army when Juan is not present. Pedro honestly admits never commanding 23,000 men but accepts with conditions: experienced subordinates, clear authority, support through mistakes. Father Tommaso presents comprehensive budget (35,276 florins for 8-month season: provisions 29,943 florins, cavalry operations 1,622, forward bases 177, intelligence 143). Pedro deeply impressed by unprecedented logistical preparation. Juan then plans with Álvaro: assigns Infante Juan west (advisor to Rodrigo), Infante Enrique east (tactical commander). Writes personal letter to both Infantes framing assignments as honors. Develops staggered deployment strategy: eastern army moves first visibly to draw Sultan's attention; western army holds until Juan signals Sultan is committed, then launches naval invasion. Establishes four-station relay system (Jaén-Córdoba-Écija-Carmona-Seville) for two-day message delivery. Rodrigo given operational freedom within strategic objectives. Administrative packet prepared for Seville including Martín de Córdoba as quartermaster.",
      "characters": [
        "juan_ii",
        "alvaro_de_luna",
        "pedro_gonzalez_de_padilla",
        "tommaso_parentucelli"
      ],
      "factions_affected": [],
      "location": "Toledo",
      "tags": [
        "military",
        "strategy",
        "command",
        "logistics",
        "crusade"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "Great.\n\n\nI move back to the palace and recieve the master of Calatrava."
        },
        {
          "role": "gm",
          "text": "This suggests that the Master of Calatrava saw what happened with Santiago and wants to align Calatrava similarly. He's probably coming from a position of wanting to participate fully but wanting clarity on terms.\n\nI should:\n1. Set the scene in Juan's study\n2. Introduce Pedro González de Padilla\n3. Have him explain why he's come (likely influenced by Don Luis)\n4. Let him present Calatrava's position\n5. Stop when Juan needs to respond or when natural dialogue point occurs\n\nKeep it SHORT during dialogue. Don't write Juan's actions or words.\n\nJuan returned to his study, where servants had refreshed the wine and opened the windows to let in the late morning air. The audiences were becoming routine now—though each required different handling.\n\nThe chamberlain announced: \"Don Pedro González de Padilla, Master of the Order of Calatrava, Your Majesty.\"\n\nThe man who entered was perhaps forty-five, dark-haired with grey at the temples, lean and fit. He wore the black robes of Calatrava with their distinctive red cross—the color reversed from Santiago's white robes. His bearing was that of a professional soldier, more than an administrator. He bowed deeply.\n\n\"Your Majesty, I am honored by this audience.\" He straightened, and there was directness in his eyes—a man who preferred plain speaking. \"I come at the urging of Don Luis de Guzmán, who spoke with me last evening after his audience with Your Majesty.\"\n\nPedro González smiled slightly. \"Don Luis was... transformed. I have known him twenty years, and I have never seen him so moved. He told me what Your Majesty offered—clarity, respect, and the opportunity for Santiago to fulfill its founding purpose without shame or diminishment.\"\n\nHe took a breath. \"Your Majesty, the Order of Calatrava was also founded to fight the Moors. We hold the central frontier—Ciudad Real, Calatrava la Nueva, the passes into Granada. We have fifteen hundred knights and men-at-arms ready for this crusade.\"\n\nThe Master met Juan's gaze steadily. \"I come to pledge Calatrava's full participation in the holy crusade against Granada, and to ask—as Don Luis did—for Your Majesty's guidance on how we can best serve.\"\n\nHe paused, then added candidly: \"And I confess, Your Majesty—I also come to understand the crusade taxation, the assessment process, and how Calatrava's service will be measured. Don Luis said Your Majesty was forthright and fair. I hope for the same clarity.\""
        },
        {
          "role": "player",
          "text": "I grant you the same fairness as I did to the knights of Santiago. And I thank you for your commitment as well.\n\n\nWhat I am about to tell you is still a secret, but I would like to discuss strategy with you if you dont mind. PLease keep this to yourself for now.\n\n\nI plan to come at Grenada with two armies. The largest will come straight through the center, attacking from the frontier you have been guarding for so long. I will commit the banner and the relics to this front. The other front will leave sevilla with a substantial but smaller force to take the western ports with naval support. The aim will be to divide the sultan's attention.\n\n\nRegarding the eastern front, I have 3000 cavalry set up to raid and scout ahead. I know we cant take grenada, but we will try to take forts to secure our supply base.\n\n\nWhat do you think of this strategy? We know the Moors have recieved substantial support from other Muslim countries."
        },
        {
          "role": "gm",
          "text": "Pedro would likely:\n- Be honored by the trust/confidence\n- Provide professional military assessment\n- Know the terrain, fortifications, water sources\n- Understand Granada's defensive capabilities\n- Have concerns and suggestions based on decades of frontier experience\n- Be realistic about challenges while supporting the plan\n\nI should have him respond thoughtfully, offering both validation and practical concerns/suggestions.\n\nPedro González's eyes widened slightly at being taken into confidence so quickly. He glanced toward the door—ensuring it was closed—then leaned forward with the intensity of a professional soldier presented with a strategic problem.\n\n\"Your Majesty honors me with this trust.\" He paused, clearly thinking through the implications. \"A two-pronged strategy... yes. It makes sense, especially if Granada has received reinforcements. Force them to divide their strength.\"\n\nHe stood and moved to the window, gazing south as if he could see the frontier from here. \"The central frontier—my frontier—is the most direct route to Granada city. Strong fortifications on both sides, but we know every approach. The terrain is...\" He made a gesture. \"Difficult but not impossible. The Moors have had centuries to fortify, but so have we. It's a grinding war of forts and supply lines.\"\n\nPedro turned back to Juan, his expression serious. \"Three thousand cavalry for raiding and scouting—that's substantial. Good. You'll need them. Granada's strength has always been mobility and intelligence. They know when we're coming, how many, where we're weak. Your raiders can disrupt that, keep them uncertain.\"\n\nHe crossed his arms, thinking. \"Taking forts to secure supply bases—essential. But Your Majesty, those forts...\" He shook his head. \"Each one is a siege. Each siege takes weeks, sometimes months. And while you're besieging one fortress, Granada can maneuver around you, raid your supply lines, attack your rear.\"\n\nPedro's voice grew more animated. \"The banner and relics on the eastern front—that will draw their attention, certainly. Every Moorish commander will want to capture them. Which means...\" He paused. \"Which means Your Majesty will face their main army. Their best troops. Their most experienced commanders. With reinforcements from Africa and Egypt, they might field twenty thousand men or more on that front.\"\n\nHe met Juan's eyes directly. \"Can the eastern army handle that? What numbers are we talking about?\""
        },
        {
          "role": "player",
          "text": "Including the 3000 cavalry, we have 23.000 troops."
        },
        {
          "role": "gm",
          "text": "Pedro González is a professional military commander with decades of frontier experience. He's hearing that Juan plans to field 23,000 troops on the eastern front against what could be Granada's main army (potentially 20,000+ with African/Egyptian reinforcements). This is a substantial force by medieval standards.\n\nHis reaction should be:\n1. Professional assessment - this is a serious force\n2. Cautious optimism mixed with practical concerns\n3. Questions about composition, command, logistics\n4. Acknowledgment that this could actually work\n5. Warnings about specific challenges on the central frontier\n\nHe's being consulted as an expert, so he should provide valuable tactical/strategic input while being respectful but direct.\n\nPedro González's eyebrows rose. \"Twenty-three thousand.\" He let out a slow breath. \"Your Majesty, that is... that changes everything.\"\n\nHe began pacing, the professional soldier calculating. \"Granada's main army, even with reinforcements, fields perhaps eighteen to twenty-two thousand at most. They've never had to face a Castilian army of that size on the frontier. Ever.\" He turned back to Juan. \"With twenty-three thousand, you don't just raid and take a few forts—you can advance. You can besiege major strongholds and still have enough strength to meet their field army.\"\n\nHis expression grew more animated. \"The three thousand cavalry—that's your screen and your striking force. They range ahead, disrupt supply, prevent ambushes, provide intelligence. The remaining twenty thousand...\" He gestured as if placing pieces on a map. \"Infantry for sieges, heavy cavalry for pitched battles, enough depth to rotate troops and maintain pressure.\"\n\nPedro paused, his tone becoming more cautious. \"But Your Majesty, there are challenges specific to the central frontier. May I speak plainly about them?\"\n\nAt Juan's nod, he continued: \"First—water. The approaches to Granada city go through arid country in summer. An army of twenty-three thousand needs enormous amounts of water daily. You'll need to control specific fortresses just for their wells and cisterns.\"\n\n\"Second—the mountain passes. There are only three viable routes for an army that size. The Moors know this. They'll fortify the passes, force you to besiege them in terrible terrain. Each pass could cost you weeks and hundreds of men.\"\n\n\"Third—\" He met Juan's eyes seriously. \"Sultan Muhammad IX is no fool. He's held Granada together for years despite internal disputes. If he sees your main army coming and knows the western coast is also under attack, he has two choices: split his forces and lose both fronts, or concentrate everything against one threat and try to destroy it completely before turning to the other.\"\n\nPedro's voice grew grave. \"If he concentrates against the eastern army—which he probably will, since that's where the banner is—Your Majesty could face their entire strength. Twenty-plus thousand Moors fighting desperately to protect their heartland, in terrain they know intimately, with short supply lines while yours stretch back to Castile.\"\n\nHe paused. \"It's winnable, Your Majesty. Twenty-three thousand well-commanded troops can do it. But it will be brutal. Casualties will be high. And you'll need exceptional logistics—food, water, ammunition for those bombards, medical care, everything flowing constantly from Castile.\"\n\nPedro looked at Juan directly. \"My question, Your Majesty—who commands this eastern army?\""
        },
        {
          "role": "player",
          "text": "I have not made a desicion about command. Master of Santiago will defer command in the field and will serve as an advisor from behind the lines.\n\n\nTo be honest, I was thinking of giving you the command of the eastern army when I am not present. Do you think you can shoulder this responsibility?"
        },
        {
          "role": "gm",
          "text": "Pedro González is a professional soldier, about 45, described as lean and fit with the bearing of a military man. He's the Master of Calatrava, which means he's already responsible for significant frontier defense. The question is how he'll respond to this offer.\n\nGiven:\n- He's been direct and professional\n- He's shown strategic understanding\n- He's clearly experienced with the frontier\n- He's younger and more capable than Don Luis\n- This is exactly the kind of command a professional soldier would want\n- But it's also terrifying responsibility\n\nHis response should reflect:\n- Initial shock/surprise (this is huge)\n- Honest assessment of his capabilities\n- Recognition of the trust being shown\n- Probably some humility but also confidence\n- Questions about support, authority, coordination\n\nThis shouldn't be an instant \"yes\" - a competent commander would ask clarifying questions first.\n\nPedro González went completely still. For a long moment, he simply stared at Juan, and the color drained slightly from his face before returning.\n\n\"Your Majesty...\" His voice was hoarse. He swallowed, composing himself. \"I... that is an extraordinary honor. And an extraordinary responsibility.\"\n\nHe moved to the chair, but didn't sit—instead gripping its back as if steadying himself. \"Twenty-three thousand men. The main thrust of the crusade. The banner and relics under my protection when Your Majesty is not present.\" He looked up. \"Your Majesty, I must be honest about my capabilities.\"\n\nPedro took a breath. \"I have commanded Calatrava's forces for eight years—fifteen hundred knights, frontier operations, raids, defense of strongholds. I know the central frontier intimately. Every fortress, every pass, every water source. I have fought the Moors in perhaps two dozen engagements, from skirmishes to battles of several thousand men.\"\n\nHis jaw tightened. \"But Your Majesty, I have never commanded an army of twenty-three thousand. The logistics alone—coordinating that many troops, managing supply lines, positioning forces for siege while maintaining field armies...\" He met Juan's eyes directly. \"I would need support. Experienced subordinates. Clear authority. And—\" he paused, \"—Your Majesty's trust that if I make mistakes, you will correct me rather than replace me.\"\n\nHe straightened. \"I am not saying no, Your Majesty. I am saying... I need to understand what resources and authority I would have. Who would serve under me? How much operational discretion? What happens if Granada concentrates their full strength against us and I must make critical decisions in hours, not days?\"\n\nPedro's voice grew firmer. \"If Your Majesty believes I can do this, I will give everything I have. Calatrava exists for exactly this war. But I need to know I won't fail you—or those twenty-three thousand men—because I lacked support or clarity of command.\""
        },
        {
          "role": "player",
          "text": "We all fail sometimes Pedro. And there is no shame in admitting one's own shortcomings.\n\n\nTake advice from others, like the former master of Santiago. Install and organize a staff for logistics, training, supply and everything. It is a great campain and army for sure. But like you said, never has an army of this size taken the field so someone will have to command it for the first time anyway. I have faith in your capabilities.\n\n\nYou can ask me to install commanders, for that is something only I can do. I will give you insight in the budget we have drafted for the eastern army. We have substantial logistical support ready.\n\n\nI summon brother Tomasso, the vatican brother who has drafted the budget to explain it to Pedro. So he can start planning."
        },
        {
          "role": "gm",
          "text": "Pedro's expression shifted—relief mixed with determination. He placed his hand over his heart. \"Your Majesty's faith means everything. I will not waste it.\"\n\nHe nodded firmly. \"You're right—someone must command this army for the first time. If Your Majesty believes I can do it, then by God, I will.\" His voice strengthened. \"And yes, I will take counsel from Don Luis. His frontier experience is invaluable. A staff for logistics, subordinate commanders...\" He was already thinking through the structure. \"I'll need Your Majesty's authority to requisition and organize, but I can build it.\"\n\nÁlvaro was dispatched and returned within minutes with Father Tommaso Parentucelli, who carried an armful of documents and ledgers. The Italian scholar bowed to Juan, then to Pedro with scholarly courtesy.\n\n\"Your Majesty, Master Pedro—how may I serve?\"\n\nJuan gestured to the table. \"Father Tommaso, the Master of Calatrava will command the eastern army. I want him to understand the logistical preparation we've made—the budget, supplies, everything planned for his twenty-three thousand troops.\"\n\nTommaso's eyes lit up—a man delighted to discuss his meticulous work. He spread documents across the table. \"Ah! Master Pedro, let me show you what Don Álvaro and I have prepared.\"\n\nHe pulled forward a multi-page document. \"The eastern army budget for an eight-month campaign season. Let us begin with the foundation: provisions.\"\n\nTommaso pointed to detailed calculations. \"Twenty-three thousand men require approximately 28,750 maravedís per day in food—bread, meat, wine. Over eight months, 240 days, that is 6,900,000 maravedís for basic provisions. We have added fifteen percent for wastage, spoilage, and transport losses, bringing the total to nearly eight million maravedís—about 29,943 florins.\"\n\nPedro leaned forward, studying the numbers. \"That's... comprehensive.\"\n\n\"It must be,\" Tommaso said earnestly. \"An army marches on its stomach, as the Romans knew. We have contracted with suppliers across Castile—grain from León, salted meat from the north, wine from La Rioja. Supply trains will flow constantly to forward depots we establish on the frontier.\"\n\nHe pulled forward another sheet. \"Your cavalry raiders—three thousand horsemen. We have budgeted for horse feed, replacement mounts, cavalry equipment. Approximately 1,622 florins for the campaign season. This assumes ten percent horse casualties and proper rotation of mounts to prevent exhaustion.\"\n\nPedro nodded appreciatively. \"Cavalry operations eat money. You've accounted for remounts?\"\n\n\"Three hundred replacement horses budgeted,\" Tommaso confirmed. \"At current market rates from Andalusian breeders.\"\n\nHe continued through the budget: \"Crown professional troops—two thousand men, their wages for eight months. Military Order knights—your Calatrava forces and Santiago's contingent—paid by your Orders, not the crown budget. Noble levies—eighteen thousand, paid by their lords per feudal obligation.\"\n\nTommaso's finger traced down the page. \"Fortifications and supply depots: we budget for establishing four to six forward bases along the frontier. Fortified positions where supplies accumulate, where wounded can be treated, where troops rotate for rest. About 177 florins.\"\n\n\"Intelligence gathering and raiding operations,\" he continued. \"Scouts, spies, local informants, bribes for potential defectors—143 florins. This seems small, but Master Pedro, you will find this invaluable. Knowing where Granada's forces are, where their supplies are stored, which commanders are competent...\"\n\nPedro was nodding along, clearly impressed. \"This is more thorough than any campaign planning I've seen.\"\n\nTommaso smiled. \"His Majesty and Don Álvaro insisted on it. Cardinal Capranica praised it as the finest military budget he'd encountered in thirty-seven years of Church administration.\"\n\nHe pulled forward a summary sheet. \"Total budget for the eastern army: approximately 35,276 florins for the eight-month season. This does not include the noble levies or Military Order forces, which are paid by their respective lords and Orders. The crown's responsibility is supplying everyone and paying crown troops.\"\n\nPedro studied the numbers. \"And this is... fully funded? We have these florins available?\"\n\n\"The campaign budget has been approved by the oversight committee,\" Tommaso confirmed. \"His Majesty has assembled resources from multiple sources—Barcelona donations, Florence, papal funds, the Portuguese dowry. The eastern army's budget is secure.\"\n\nHe leaned back. \"But Master Pedro, the budget is only the foundation. You will need a quartermaster corps, supply officers, clerks to track expenditures and requisitions. I recommend at least twenty administrators dedicated solely to eastern army logistics.\"\n\nTommaso pulled out another document. \"I have drafted an organizational structure if you wish to see it. Positions, responsibilities, reporting chains. You should not be personally managing supply wagons—you need subordinates for that, freeing you to command.\"\n\nPedro looked from the documents to Juan, something like wonder in his expression. \"Your Majesty, this is... I have never seen a campaign prepared like this. Usually we assemble troops, collect whatever supplies we can, and hope for the best.\"\n\nHe straightened. \"With this foundation—with these resources and this planning—twenty-three thousand men become a weapon rather than just a mob. We can sustain operations, maintain pressure, actually accomplish strategic objectives.\"\n\nHis voice grew more confident. \"I can do this, Your Majesty. With Don Luis's counsel, with this logistical support, with clear authority—I can command this army. I will make mistakes, but I will learn. And we will drive into Granada's heartland with more force than they have ever faced.\""
        },
        {
          "role": "player",
          "text": "I will leave you to it then. Take your time to develop startegy, I am at your disposal when you need me.\n\n\nI go away and let him with Tomasso to work.\n\n\nI take Alvaro aside.\n\n\nWe need to make sure Rodrigo who commands the western army can prepare in the same manner now. Maybe send someone with instructions and a partly copied budget so he knows what he is working with.\n\n\nI think about sending a few crown and vatican administrators as well. The budget requires oversight, best to send them now."
        },
        {
          "role": "gm",
          "text": "Juan is being very proactive and smart here. He wants to ensure Rodrigo Manrique (who commands the western army) gets the same level of support and preparation as Pedro González now has for the eastern army. This makes perfect sense - Rodrigo is in Seville with the crusaders, preparing for the western coastal campaign.\n\nJuan wants to:\n1. Send instructions and budget information to Rodrigo\n2. Send crown and Vatican administrators to help with oversight and logistics\n\nThis is good strategic thinking. Álvaro would support this and have practical suggestions about who to send and how to organize it.\n\nLet me have Álvaro respond positively and help implement this decision.\n\nÁlvaro nodded approvingly as they stepped into the corridor, away from where Tommaso and Pedro were already deep in discussion.\n\n\"Excellent thinking, Your Majesty. Rodrigo will need exactly the same preparation—he's a brilliant tactical commander, but he'll be managing twelve thousand men, naval coordination with the Genoese, siege operations along the coast...\" Álvaro lowered his voice. \"If we send him support now, he has six weeks before the campaign begins to organize properly.\"\n\nHe considered for a moment. \"For the budget and instructions, I'll prepare a comprehensive packet—the western army sections of the budget, operational objectives, command authority, coordination protocols with the naval forces. We should also include maps of the coastal fortresses, though Rodrigo knows that terrain well.\"\n\n\"As for administrators...\" Álvaro ticked off on his fingers. \"We'll need at least three. First, a senior quartermaster—someone who can manage provisions for twelve thousand men plus coordinate with ship captains for supply deliveries. Second, a financial overseer from the Vatican side—Tommaso can recommend someone from Capranica's staff to ensure proper accounting. Third, a logistics coordinator who understands siege operations—artillery, ammunition, engineering supplies.\"\n\nHe paused thoughtfully. \"I have someone in mind for the quartermaster role: Martín de Córdoba. He's been managing crown supply contracts for five years, knows every merchant and supplier in Andalusia, and is utterly incorruptible. A bit dull, but exactly what Rodrigo needs.\"\n\n\"For the Vatican administrator, I'll ask Tommaso. Capranica has brought qualified men—we need someone who won't try to interfere with military decisions but will keep meticulous records.\"\n\nÁlvaro's expression grew more serious. \"Your Majesty, we should also send someone with command experience to serve as Rodrigo's second. He's leading this army alone, and if something happens to him—injury, illness, God forbid worse—we need clear succession of command. Do you have someone in mind?\""
        },
        {
          "role": "player",
          "text": "I was thinking of sending infante Juan west. He has the experience to serve as a good advisor to Rodrigo. I will send Enrique east. We can use his tactical capabilities there and I suspect we will face battle there. He will want to be there himself.\n\n\nIf you agree, prepare and send this party and instructions to Rodrigo."
        },
        {
          "role": "gm",
          "text": "1. Infante Juan going west to advise Rodrigo - This makes sense politically and militarily. Infante Juan has experience, and the western campaign is more methodical (coastal sieges with naval support). He can provide strategic counsel without overshadowing Rodrigo.\n\n2. Infante Enrique going east - Enrique is the more martial of the two, and the eastern front is where the main battles will be. He'll want to be where the real fighting is, and his tactical skills will be valuable.\n\n3. This also keeps the two Infantes separated and under different command structures, which is politically smart - they can't coordinate any potential mischief.\n\n4. Both are crusaders who renounced their claims, so using them in the crusade makes sense and keeps them engaged in the holy mission.\n\nÁlvaro would likely see the wisdom in this - it uses their military experience while keeping them separated and subordinate to Juan's appointed commanders. It also shows Juan trusts them as crusaders while maintaining clear command authority.\n\nLet me have Álvaro respond thoughtfully to this decision.\n\nÁlvaro's eyebrows rose, then a slow smile spread across his face. \"Your Majesty, that is... remarkably astute.\"\n\nHe stepped closer, lowering his voice. \"Infante Juan to the west—yes. He has strategic experience, he's older, more cautious. The western campaign is methodical: systematic coastal sieges, naval coordination, logistics-heavy operations. He can advise Rodrigo without trying to seize command. And frankly, the western front is less... glorious. Fewer pitched battles, more grinding siege work. That suits Infante Juan's temperament.\"\n\nÁlvaro's expression grew more animated. \"Infante Enrique to the east—even better. He's the warrior of the two, lives for battle and personal combat. The eastern front is where the real fighting happens—field battles, cavalry actions, desperate sieges. He'll want to be there. And his tactical skills will genuinely help Pedro, who admitted he needs experienced subordinates.\"\n\nHe paused, considering the broader implications. \"And Your Majesty, this keeps them separated. Two different armies, two different commanders, two different missions. They can't coordinate any... unfortunate ideas. They serve the crusade as crusaders under your appointed commanders—Rodrigo and Pedro—not as independent princes.\"\n\nÁlvaro nodded decisively. \"It also demonstrates trust in them as crusaders while making clear they're subordinate to your command structure. The nobles will see this—the former rebels serving faithfully under commanders loyal to you.\"\n\nHe smiled. \"I'll prepare everything immediately. The packet for Rodrigo will include:\n\nFull western army budget and operational plans\n\nInstructions on Infante Juan's advisory role (clear that Rodrigo commands, Juan advises)\n\nThe three administrators I mentioned\n\nCoordination protocols with the Genoese fleet\n\nLetters of authority bearing your seal and the legate's\n\nFor the east, I'll prepare similar orders for Infante Enrique to report to Pedro González.\"\n\nÁlvaro paused. \"One suggestion, Your Majesty—you should personally write letters to both Infantes. Brief, but acknowledging their service, explaining their assignments, and expressing confidence in their contributions to the crusade. It frames this as honor and trust, not exile or punishment.\"\n\n\"How soon should the party depart for Seville?\""
        },
        {
          "role": "player",
          "text": "We do not need to hurry, but we should not tarry either.\n\n\nI will write the letters to the infantes immediately. Where are they anyway? They stayed behind in Seville right?"
        },
        {
          "role": "gm",
          "text": "1. The Infantes de Aragón (Juan and Enrique) took crusader oaths at the Council of Seville (November 8, 1430)\n2. They renounced their claims and joined the crusade\n3. The current date is January 30, 1431\n4. We're in Toledo for the wedding preparations\n\nI need to search more specifically for where the Infantes are currently located in the timeline.\n\nThe search results don't show where the Infantes are currently in January 1431. The most recent information shows they took crusader oaths at the Council of Seville in November 1430 and joined the crusade. Let me look at Chapter 8.5 which discussed their redemption and see if it mentions where they are now.\n\nFrom the earlier search result about Chapter 8.5, it mentions:\n- The Infantes took their oaths on November 12, 1430\n- They sent orders to their fortresses to have their troops report to Seville\n- But the current date is January 30, 1431\n\nI should assume they're likely in Seville with Rodrigo and the crusaders, preparing for the campaign. Let me have Álvaro clarify this for Juan.\n\nÁlvaro nodded. \"Tomorrow or the day after would be ideal, Your Majesty. The party needs perhaps two days to prepare properly.\"\n\nHe paused, then answered Juan's question. \"As for the Infantes—yes, they're both in Seville. After taking their crusader oaths in November, they've remained there working with Rodrigo Manrique and the growing crusader force. Infante Enrique has been particularly active, drilling troops and sharing his tactical knowledge. Infante Juan has been more... administrative. Helping coordinate supplies, working with his former household troops who've joined as individual crusaders.\"\n\nÁlvaro's expression was carefully neutral. \"They've been entirely cooperative, Your Majesty. No hint of resistance or second thoughts. If anything, they've thrown themselves into crusade preparations with surprising dedication.\"\n\nHe pulled out a recent letter. \"Rodrigo's last report, from five days ago. He writes: 'The Infantes work diligently. Infante Enrique is particularly valuable in training—the men respect his experience. Infante Juan asks many questions about logistics and supply, seems genuinely interested in learning how to support a major campaign. Both attend daily Mass with the crusaders. No concerns to report.'\"\n\nÁlvaro looked at Juan directly. \"Your Majesty's letters assigning them to their respective armies will reach them in perhaps ten days if we send the party soon. That gives them six weeks before the wedding to understand their roles and prepare mentally.\"\n\nHe paused. \"One suggestion—when you write to them, emphasize that these positions are honors, opportunities to prove their commitment to the crusade. Frame it as trust and responsibility, not exile or punishment. They're more likely to embrace the assignments enthusiastically if they feel valued rather than managed.\""
        },
        {
          "role": "player",
          "text": "I write the letter to them both.\n\n\nDear Cousins,\n\n\nI pray this letter recieves you safely and that you are both doing great and are keeping good health. As the campain is about to start, I have given much thought where your talents would be best applied and have come to the following conclusion.\n\n\nInfante Juan will remain in the western army and serve as a senior commander and advisor to Rodrigo. I need someone with experience to aid Ridrigo in his task, which is not small. Juan's wisdom and experience will serve him greatly.\n\n\nBut it is in the east where I want to land the hammer blow. I will lead this larger force straight through the center and expect the sultan to confront this force in the field. I would like to have infante Enrique by my side when we charge towards the Moorish lines and knowing his character, he would like that as well. I need tactical commanders in this army and the expected battle will give many - including myself - a chance for glory.\n\n\nYou both have your orders. Juan, you will assist Rodrigo. I will expect Enrique to join me as we advance towards Grenada.\n\n\nKeep faith cousins, go with God,\n\n\nJuan, king of Castille.\n\n\nOne final thought Alvaro. We move first with the eastern army. I want the sultan to commit and focus on this army. The western army moves in slightly slower. If we can delay their intentions for a while, it will serve us better. Hopefully they do not see our naval operations coming."
        },
        {
          "role": "gm",
          "text": "Juan has written a good letter - personal, clear about assignments, framing them as honors and matching their personalities. The strategic thinking about timing is also sound.\n\nLet me have Álvaro respond to both the letters and the strategic thinking.\n\nÁlvaro read the letters carefully, nodding with approval. \"Well crafted, Your Majesty. You've matched each Infante to what he values most—Juan gets responsibility and recognition of his experience, Enrique gets glory and battle. They'll both feel honored rather than sidelined.\"\n\nHe set the letters aside for sealing. \"I'll include these in the packet to Rodrigo, along with the budget documents and the administrators. The party can depart tomorrow afternoon.\"\n\nAt Juan's strategic observation, Álvaro's eyes sharpened with interest. He moved to the window, gazing south as if he could see the campaign unfolding.\n\n\"Your Majesty, that's... brilliant. Stagger the deployments.\" He turned back, speaking with growing enthusiasm. \"The eastern army musters visibly—twenty-three thousand troops gathering on the frontier, the banner and relics prominently displayed, Your Majesty leading personally. Granada's intelligence network will see it immediately. Every spy, every informant will report: 'The crusade is coming through the center.'\"\n\nHe began pacing, working through the implications. \"The Sultan must respond to that threat. It's his heartland, his capital, everything. He'll concentrate his forces, prepare his defenses, call in whatever reinforcements he can from Africa. All attention focused east.\"\n\nÁlvaro's smile was predatory. \"Meanwhile, the western army—twelve thousand troops—assembles more quietly in Seville. Port activity, yes, but that could be supply operations for the eastern campaign. The Genoese galleys arrive, but merchant traffic is normal in Seville. By the time Granada realizes we're launching a full naval invasion of their coast...\"\n\nHe snapped his fingers. \"They're committed. Their army is facing east, and Rodrigo is landing on their western shore, taking ports before they can respond. They have to choose: abandon the defense against Your Majesty's main army, or let the west fall while they fight you.\"\n\nÁlvaro paused, thinking through timing. \"How much delay are we talking about, Your Majesty? A week? Two? The longer we wait, the more Granada might notice the naval preparations. But the longer the eastern army holds their attention alone, the better positioned Rodrigo becomes.\"\n\nHe looked at Juan directly. \"And Your Majesty, there's another advantage to this approach—when you begin the eastern campaign first, with the banner and all the ceremony, it becomes the crusade in everyone's minds. Rodrigo's western operations become a supporting action, not a separate army. Which means...\" He smiled slightly, \"...everything focuses on you. All the glory, all the attention, all the pressure. Is that what Your Majesty wants?\""
        },
        {
          "role": "player",
          "text": "If we send a messenger from our eastern front, how long would it take for this message to arrive in Seville?"
        },
        {
          "role": "gm",
          "text": "1. The eastern/central frontier would be around areas like Jaén, Úbeda, or similar frontier fortresses\n2. Seville is in western Andalusia\n3. Distance would be roughly 200-250 km depending on the exact location\n\nMedieval messenger speeds:\n- Fast courier on horseback: 50-80 km per day on good roads\n- Royal messenger with remounts: could push to 100 km per day\n- Urgent message with relay system: even faster\n\nFor a distance of ~200-250 km:\n- Normal courier: 3-4 days\n- Fast courier with good roads: 2-3 days\n- Emergency relay: potentially 2 days\n\nGiven that this is within Castile, roads would be reasonably maintained, and Juan could establish relay stations. Also, medieval Castilian roads were fairly good in Andalusia.\n\nI should present Álvaro giving a realistic assessment with options for different urgency levels.\n\nÁlvaro considered this carefully. \"It depends on the urgency and the route, Your Majesty.\"\n\nHe moved to a mental map, calculating. \"From the central frontier—say, from the Jaén area where the eastern army would likely operate—to Seville is perhaps two hundred to two hundred fifty kilometers depending on the exact position.\"\n\nHe ticked off options: \"A normal courier, riding at sustainable pace with periodic rest stops, would take four to five days. Change horses at towns along the way, sleep at night, arrive intact but not exhausted.\"\n\n\"A fast royal courier, riding hard with priority access to fresh mounts, could do it in two and a half to three days. Push the horses harder, sleep less, carry documents that demand immediate remount at any royal or noble stable.\"\n\nÁlvaro paused. \"But if Your Majesty wanted to establish a proper relay system—stations every fifty to eighty kilometers with fresh riders and horses waiting—you could get messages through in as little as two days, perhaps even a day and a half if the roads are good and nothing goes wrong.\"\n\nHe met Juan's eyes. \"Why do you ask, Your Majesty? Are you thinking about coordinating the timing of Rodrigo's western landing with something happening on the eastern front?\""
        },
        {
          "role": "player",
          "text": "I want to keep the western army in reserve for a while. If it is a matter of days, this does not matter in the grand sceme of things in an eight months campain. I want to activate the naval manouver of the western army the moment the main army of the sultan is committed on the east. When they are, we send out our message to start the western operations. They are free to probe and skirmish over land before then. Expel muslim merchants and possible spies as well. Even if they discover our plans, this puts them in a dilemma anyway. I do not want to rely on surprise alone.\n\n\nCan you execute these directions?"
        },
        {
          "role": "gm",
          "text": "Juan is making a sophisticated strategic decision here. He wants:\n\n1. Eastern army to deploy first and visibly, drawing Granada's attention\n2. Western army to wait in Seville, appearing to be support/reserves\n3. Once Sultan Muhammad IX commits his main army to the eastern front (which will be obvious through intelligence), send a fast message to Rodrigo to launch the naval invasion\n4. Western army can do preliminary work - expelling spies, light skirmishes over land - but the main naval operation waits for the signal\n5. Even if Granada discovers the plan, they're in a strategic dilemma: can't ignore either threat\n\nThis is actually very smart. It forces the Sultan into an impossible position:\n- If he splits forces, both are weaker\n- If he concentrates east (likely, since that's where Juan and the banner are), the west falls\n- If he somehow concentrates west, Juan's massive eastern army advances unopposed\n\nÁlvaro would recognize this as excellent strategic thinking. He'd want to confirm a few practical details:\n- The relay system for messaging\n- Rodrigo's discretion in timing the actual landing\n- What \"committed\" means (how do they know the Sultan has fully engaged?)\n- Coordination with the Genoese fleet\n\nLet me write Álvaro's response showing he understands and will execute this.\n\nÁlvaro's expression shifted from interested to impressed. He was quiet for a moment, working through the strategic implications, then nodded slowly.\n\n\"Your Majesty, that is exceptionally sound thinking.\" He moved back to the table, already organizing the plan in his mind. \"You're not relying on Granada being blind—you're creating a dilemma they can't solve even if they see it coming.\"\n\nHe began outlining the execution: \"First, I'll establish a relay courier system between the eastern frontier and Seville immediately. We'll need stations at—\" he counted mentally, \"—perhaps four points. Jaén to Córdoba, Córdoba to Écija, Écija to Carmona, Carmona to Seville. Fresh horses and riders waiting at each station. That gives us reliable two-day message delivery, possibly faster in emergencies.\"\n\nÁlvaro continued: \"The packet to Rodrigo will include these orders:\n\nPhase One - Preparation (April-early May):\n\nAssemble western army in Seville quietly\n\nCoordinate with Genoese fleet arrival\n\nExpel Muslim merchants and suspicious persons from Seville and coastal areas\n\nConduct light overland patrols and skirmishes to appear normal\n\nKeep naval preparations as low-profile as possible\n\nBe ready to launch on short notice\n\nPhase Two - Activation Signal:\n\nWhen Your Majesty determines Sultan's main army is committed to the eastern front\n\nFast courier carries sealed orders: 'Launch western operations'\n\nRodrigo has discretion on exact timing of landing based on weather, readiness\n\nBut must move within days of receiving signal, not weeks\n\nPhase Three - Execution:\n\nFull naval invasion begins\n\nSystematic coastal conquest as planned\n\nOngoing coordination via relay system\"\n\nÁlvaro paused, considering practicalities. \"A few questions to ensure proper execution, Your Majesty:\n\nFirst—how do we define 'committed'? Is it when Granada's main army arrives at the frontier? When they engage in their first major battle? When intelligence confirms they've left the western approaches undefended? I need to give you clear criteria so you know when to send the signal.\"\n\n\"Second—Rodrigo will need discretion for the actual landing. Weather, tides, intelligence about specific ports—these change day by day. The signal says 'begin operations,' but he needs authority to choose the exact moment and target. Agreed?\"\n\n\"Third—once western operations begin, do we maintain the relay system for ongoing coordination? Can Rodrigo request support or adjustments, or does he operate independently once launched?\"\n\nHe looked at Juan directly. \"This plan is excellent, Your Majesty, but it requires clarity in execution. The eastern and western armies will be operating two hundred fifty kilometers apart, with the Sultan's forces between them. Clear communication protocols are essential.\""
        },
        {
          "role": "player",
          "text": "I will determine myself when the moment is right. I will be on the eastern army do give this order.\n\nRodrigo will have to determine this for himself. He has operational freedom. He has his objectives; to capture western ports and advance further if the possibility presents itself. How he achieves this is up to him.\n\nWe will maintain the relay system for continued communication. The better we can let every army know what is happening, the better we can both take strategic desicions."
        },
        {
          "role": "gm",
          "text": "1. Juan will personally judge when to send the signal - makes sense since he's with the eastern army and can see the situation firsthand\n2. Rodrigo gets operational freedom once activated - mission-type orders, which is smart for medieval command where detailed micromanagement over distance is impossible\n3. Maintaining relay system for ongoing coordination - ensures both armies can adapt to changing circumstances\n\nÁlvaro should acknowledge this is excellent command structure, confirm he can execute these orders, and perhaps offer one final practical consideration or confirm the next steps.\n\nÁlvaro nodded decisively. \"Clear and sound, Your Majesty. That's excellent command structure—strategic direction from you, operational freedom for your commanders, communication maintained for coordination.\"\n\nHe began making notes on parchment. \"I'll draft the complete orders for Rodrigo today. Everything will be in the packet: his budget, the administrative staff assignments, the Infante Juan letter, and these operational directives. The relay system I'll establish immediately—we need those stations functional before the campaign begins.\"\n\nHe looked up from his writing. \"The beauty of this approach, Your Majesty, is that even if Granada discovers the western preparations—which they might, Seville is not a small port—they still face an impossible choice. Do they weaken their eastern defense to protect the coast? Do they split their forces and risk being defeated in detail? Or do they commit fully to stopping you in the east and accept losing their western ports?\"\n\nÁlvaro set down his quill. \"Any choice they make is bad. That's strategic mastery, Your Majesty—not hoping the enemy makes mistakes, but forcing them into situations where every option costs them dearly.\"\n\nHe paused, then added: \"One final consideration—Your Majesty will be with the eastern army, personally commanding, with the banner and relics. That army becomes the focus of everything: Granada's attention, Castilian nobility's attention, Christendom's attention. The pressure on Your Majesty personally will be... immense. Every decision, every battle, will be magnified. Are you prepared for that?\"\n\nHis tone wasn't challenging, but genuinely checking that Juan understood the weight of this choice."
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_1431_00076",
      "book": 1,
      "chapter": "1.12",
      "date": "1431-01-30",
      "end_date": null,
      "type": "personal",
      "summary": "Deep emotional evening conversation between Juan and Isabel in the Portuguese chapel. Juan's pragmatic framing ('travel with army until pregnant, kingdom needs heir') deeply hurts Isabel, who'd opened up about fears of failing to have children. Isabel breaks down: she feels reduced to a duty, a problem to solve, not a person. Wants to matter as Isabel, not just as alliance or potential heir-bearer. Juan apologizes for being too practical from military planning all day. Makes promise: every evening together, private prayer, sharing hearts without others present. Isabel shares comprehensive fears: failing at children, traveling with army (never left palaces/convents), being in soldiers' way, Juan stopping seeing her after marriage. Juan claims he's told her he loves her; Isabel gently corrects him — he's been kind and considerate but never actually said those words. Juan confesses he was once in love before — a girl during his pilgrimage, not of royal blood, never told her, put her behind him. Isabel initially hurt ('second choice'), but understanding grows. Key moment: Juan realizes he forgot about the other girl when thinking about love with Isabel — Isabel recognizes this means she matters to him now. Both admit feeling inadequate in love. They walk in the garden, Juan describes white armor, Isabel calls him 'like Saint Michael.' Promise made: daily evening prayer together. Agreement to plan campaign travel with Dona Beatriz. Juan assigns Sancho's guard team permanently to Isabel.",
      "characters": [
        "juan_ii",
        "isabel_of_portugal",
        "dona_beatriz"
      ],
      "factions_affected": [],
      "location": "Toledo",
      "tags": [
        "personal",
        "marriage",
        "emotional"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "I am sure of it Alvaro. Proceed as planned.\n\n\nNow, excuse me. I want to join my betrothed in prayer and conclude the day.. \nI go to Isabel.\n\n\nI want to adress something. NEVER generate dialogue for Juan or generate actions for him. I will write this. Stop when I can say or do something."
        },
        {
          "role": "gm",
          "text": "In this case, Juan has said he wants to go to Isabel and join her in prayer to conclude the day. I should narrate him finding her, describe the scene, and then stop - allowing the user to write Juan's words and actions.\n\nLet me set the scene for where Isabel is and what she's doing, then stop before Juan says or does anything.\n\nÁlvaro bowed. \"As you command, Your Majesty. I'll have everything prepared by tomorrow afternoon.\"\n\nHe gathered his documents and departed, leaving Juan to seek out Isabel.\n\nThe Portuguese chapel was quiet in the evening dimness, lit only by a few candles before the half-finished altar. Isabel knelt on the cushions, her head bowed, hands clasped in prayer. The blue azulejo tiles reflected the candlelight, creating patterns that danced across the walls.\n\nShe didn't hear Juan enter at first, lost in her devotions. When she finally sensed his presence, she looked up, startled, then smiled softly. The tension and worry that had marked her face in their early days together was gone now, replaced by something calmer, more settled.\n\n\"Juan,\" she said quietly, starting to rise. \"I was just—\" She gestured to the altar, the candles. \"I've been praying for the crusade. For you. For everyone who will march.\"\n\nHer Portuguese ladies had clearly retired for the evening, leaving Isabel alone with her prayers. The chapel felt intimate, peaceful—a small sanctuary away from the demands of court and preparation for war."
        },
        {
          "role": "player",
          "text": "I kneel beside her take her hand and press a kiss on it. \nI have been looking forward to be with you all day Isabel. \nHave you been thinking about our family and our children?"
        },
        {
          "role": "gm",
          "text": "Isabel's cheeks colored at the kiss, at the directness of the question. Her hand trembled slightly in his, but she didn't pull away. When she met his eyes, there was vulnerability there—but also a kind of quiet courage.\n\n\"I have,\" she said softly. \"Every day, actually. When I pray.\" She glanced down at their joined hands. \"My mother wrote back. The letter arrived this morning. She said...\" Isabel's voice grew thick with emotion. \"She said she's proud of me. That I'm doing well. That she prays for us to be blessed with many children.\"\n\nShe took a breath, steadying herself. \"I'm frightened, Juan. Not of—\" she stumbled over the words, \"—not of being a wife to you. But of... what if I can't give you children? What if I fail at the one thing a queen must do?\" Her eyes searched his face. \"You need an heir. Castile needs an heir. And I...\"\n\nShe trailed off, then continued more quietly. \"But I've been praying for courage. Praying that God will bless us. That when the wedding night comes, I'll be brave enough. That I'll be a good wife to you.\"\n\nHer grip tightened on his hand. \"Seventeen days,\" she whispered. \"Seventeen days until we're married. Until we can start our family.\" There was hope in her voice, mixed with nervousness. \"Do you... do you think about it? About what our children might be like?\""
        },
        {
          "role": "player",
          "text": "I hope and pray that you will be a good wife and be able to serve me and the crown. We will see what will happens. Being nervous is natural Isabel. You are very pious and devout, everyone has seen it.\n\n\nI am happy you have heard back from your mother and that she supports you. We will write her again after the wedding. Is it possible to let her visit us here sometime?"
        },
        {
          "role": "gm",
          "text": "Then he shifts to talking about her mother visiting, which is more thoughtful and considerate.\n\nI need to show Isabel's reaction to this response. She just opened up about her fears of failing him, of not being able to have children, and Juan's response was somewhat cool and focused on duty rather than reassurance. This would likely sting a bit, even if she tries to accept it.\n\nI should show her processing this - maybe a moment of hurt or disappointment, but then trying to be dutiful and focus on the practical question about her mother. Isabel's character is someone who retreats into duty and devotion when emotionally uncertain.\n\nIsabel's expression flickered—a brief shadow of something that might have been hurt or disappointment, quickly smoothed over. She nodded, withdrawing her hand gently to clasp both in her lap.\n\n\"Of course. We will see what happens,\" she echoed quietly. \"God's will.\" Her voice was dutiful now, the momentary vulnerability retreating behind the familiar armor of piety and proper behavior.\n\nShe was silent for a moment, then seemed to gather herself, focusing on the more practical question. \"My mother...\" A genuine smile touched her lips at the thought. \"She would love to visit. She's never been to Castile. The journey is long, but—\" Isabel looked up at him. \"After the crusade season ends? Perhaps in the autumn, when the campaigning is done and you return? That would give us time to... to be settled as husband and wife before she comes.\"\n\nHer hands twisted together slightly. \"It would mean so much to me, Juan. To have her here. To show her the chapel, to introduce her to you properly, to...\" She trailed off, then added more softly, \"To show her that I'm doing well. That I'm managing.\"\n\nThe candlelight caught the moisture in her eyes—whether from emotion about her mother or something else, it was hard to say. \"Would that timing work? After the campaign? I wouldn't want to distract you before such an important undertaking.\""
        },
        {
          "role": "player",
          "text": "You will travel with me during the campain until you are pregnant. The kingdom needs an heir and I cannot afford to wait a year if you do not get pregnant when I have to leave Toledo.\n\n\nWhen we write your mother after the wedding, we will invite her in the autumn to visit us here in Toledo. God willing, you have given birth to our first child or are about to. Having your mother there would be great."
        },
        {
          "role": "gm",
          "text": "Juan is being quite direct and practical here - telling Isabel she'll travel with the campaign until she's pregnant. This is actually reasonable from a medieval dynasty perspective (securing the succession is critical), but it's also quite impersonal and focused on her as a vessel for heirs rather than as a person with feelings.\n\nIsabel has just been vulnerable, asking if he thinks about what their children might be like, expressing her fears and hopes. His response was quite cold - \"we will see what happens\" and focusing on her duty to serve him and the crown. Now he's being even more transactional - she travels with him until pregnant, because he can't afford to wait.\n\nIsabel would likely feel this distance, this reduction to her function. But she's dutiful, pious, and has been trained to accept her role. She'll probably mask any hurt and focus on the practical/acceptable aspects (her mother visiting, doing her duty).\n\nI need to show her reaction - probably trying to maintain composure, perhaps some hurt showing through, but ultimately accepting because this is her role and she knows it. She might retreat further into duty-focused responses.\n\nIsabel went very still. The color drained from her face, then returned in a faint flush. She looked down at her hands, no longer meeting his eyes.\n\n\"I see,\" she said quietly. \"Yes. Of course. The kingdom needs an heir.\" Her voice was carefully controlled, almost flat. \"I will... I will travel with the army until I'm with child. That makes sense.\"\n\nShe was silent for a long moment, her fingers gripping each other tightly enough that her knuckles whitened. When she spoke again, her tone was dutiful, all the earlier warmth and vulnerability gone.\n\n\"And my mother in the autumn. Yes. That would be... appropriate timing. If God wills it, she can help with the birth.\" Isabel's jaw tightened slightly. \"I will do my duty, Juan. You needn't worry about that. I understand what's required of me.\"\n\nShe rose slowly, smoothing her skirts with hands that trembled just slightly. \"It's getting late. I should... I should retire. Tomorrow will be busy, and we both need rest.\"\n\nHer eyes finally met his—there was hurt there, quickly masked, and something else. Resignation, perhaps. Or the retreat of someone who'd offered vulnerability and found only practicality in return.\n\n\"Good night, Juan.\" She curtsied formally, more distance in that gesture than in anything they'd shared over the past weeks. \"I'll see you tomorrow.\""
        },
        {
          "role": "player",
          "text": "Wait Isabel. Come here.\n\n\nWhat happened? You seem so worried all of a sudden. Why are you afraid? You know we are in this together, please tell me what is wrong.\n\n\nI look concerned at her."
        },
        {
          "role": "gm",
          "text": "Isabel is hurt because Juan's response to her vulnerability was cold and transactional. She opened up about her fears, asked if he thought about their future children, showed real emotion - and he responded with \"I hope and pray that you will be a good wife and be able to serve me and the crown. We will see what happens.\"\n\nThen he immediately told her she'd be traveling with the army until pregnant - framing it entirely around duty and the need for an heir, not about wanting to be with her or any warmth.\n\nShe's hurt and retreating. But Juan is now asking her what's wrong with genuine concern. This is a moment where Isabel could either:\n1. Retreat further and say \"nothing's wrong\"\n2. Try to express her hurt\n3. Something in between\n\nGiven her character (dutiful, not independently minded, but capable of genuine emotion when it comes to faith and personal relationships), and that Juan is specifically asking her with concern, she might try to express something - but struggle with it because she's not used to confronting or expressing disappointment to authority figures.\n\nIsabel stopped, her back still to him. Her shoulders rose and fell with a breath. When she turned back, there were tears in her eyes that she was trying to blink away.\n\n\"I...\" She struggled for words, her hands twisting together. \"I don't know how to say this. I'm not good at—\" She took another breath. \"Juan, when you came here tonight, I thought... I hoped...\"\n\nShe looked at him helplessly. \"I opened my heart to you. I told you I was frightened about being a wife, about giving you children. I asked if you thought about what our children would be like, and you...\" Her voice broke slightly. \"You said you hope I'll be able to serve you and the crown. That we'll see what happens.\"\n\nTears spilled over now. \"And then you told me I'll travel with the army until I'm pregnant. Not—not because you want me with you, but because the kingdom needs an heir and you can't afford to wait.\"\n\nShe wiped at her eyes with trembling hands. \"I know that's true. I know duty is important. But for a moment, I thought... when we pray together, when you're kind to me, I thought maybe you...\" She couldn't finish.\n\nIsabel looked at him with raw hurt in her eyes. \"I'm trying so hard, Juan. To be brave, to be a good queen, to do everything right. But sometimes I just want...\" She shook her head. \"I don't know what I want. I'm sorry. I shouldn't have said anything. You're right—duty is what matters.\""
        },
        {
          "role": "player",
          "text": "I stand up and pull her into an embrace, trying to comfort her.\n\n\nIm sorry Isabel. Military planning all day makes me a bit practical. Sometimes I forget you are not just a soldier that I am ordering around.\n\n\nI dont know if and when we will have children, love. I do not know god's plans and claiming otherwise would be a lie. We can only pray and do our best...\n\n\nLook at the bright side, we will be together for a while longer.\n\n\nShall we discuss this with Dona Beatriz and the others? I would like to cheer you up."
        },
        {
          "role": "gm",
          "text": "Juan is trying to comfort Isabel, but his approach is still somewhat clumsy. He's apologizing for being too practical/military, acknowledging she's not a soldier, and trying to soften the message. He's being more gentle now but still not quite understanding the deeper issue - she wanted emotional connection and reassurance of his feelings for her as a person, not just as a functional wife/queen.\n\nHe's inviting her ladies to join them, which could help lighten the mood but also might feel like he's avoiding the deeper emotional conversation. \n\nIsabel would likely feel somewhat comforted by the embrace and the apology, but still hurt. She's trying to be good and dutiful, so she'd probably accept this attempt at making things better, but the wound is still there. She might appreciate the company of her ladies, or she might feel like he's deflecting from addressing her actual feelings.\n\nI should show Isabel's response - she'd likely accept the comfort but still be somewhat withdrawn, processing the hurt. She might agree to bringing her ladies but with less enthusiasm than usual.\n\nIsabel stiffened at first in the embrace, then slowly relaxed against him. Her tears soaked into his shoulder, her breath coming in shaky gasps as she tried to compose herself.\n\n\"I know you don't mean to hurt me,\" she whispered. \"I know you have so much to think about—the crusade, the armies, everything.\" She pulled back slightly to look at him, wiping at her eyes. \"I just... sometimes I wish I was more than another problem you have to solve. Another duty to manage.\"\n\nShe managed a weak smile at his mention of the bright side. \"Yes. Together. That's... that's good.\" But the words lacked conviction.\n\nAt the suggestion of calling her ladies, Isabel hesitated. She looked toward the door, then back at Juan, uncertainty on her face. \"I don't know if I...\" She paused, clearly torn between wanting comfort and not wanting to appear weak in front of others. \"Dona Beatriz would know I've been crying. She always knows.\"\n\nIsabel took a shaky breath. \"But... yes. Perhaps that would help. She's good at cheering me up.\" A pause, then more quietly: \"Juan, when we're with the others, when we're around the army during the campaign... will you still pray with me? In the evenings? Just the two of us sometimes?\"\n\nThere was a vulnerability in that question—not asking about public displays or duty, but whether he'd still make time for those private moments they'd shared."
        },
        {
          "role": "player",
          "text": "What do you want Isabel? Tell me. What worries you? I want to take those away. If you dont want to go to the others, we dont have to.\n\n\nAnd lets make a promise now. Every evening when we are together, I will always make time to pray with you together. That way we can share our concerns and our hearts together, without anyone else.\n\n\nCome and pray with me. What are your worries? That our marriage will not be blessed with children? If so, we shall pray for this."
        },
        {
          "role": "gm",
          "text": "Isabel is hurt and vulnerable right now. Juan has just shown more emotional intelligence and care - recognizing he hurt her, offering comfort, asking what she wants, making a meaningful promise about praying together.\n\nShe needs to respond authentically to this - not just immediately bouncing back to being fine, but gradually opening up. She's been shown genuine care and concern.\n\nHer worries are:\n1. Being seen as just a duty/problem to solve rather than a person\n2. Fear of failing to provide children\n3. Traveling with an army (scary/unfamiliar)\n4. Losing the connection they've been building\n5. Not being enough for him\n\nShe should express these fears, but also respond positively to his promise about praying together - that's exactly what she needed to hear.\n\nIsabel's eyes filled with tears again, but different ones—relief, gratitude. She sank back down to her knees, pulling him down beside her.\n\n\"That promise means more to me than you know,\" she whispered. \"Every evening together, just us and God. Yes. Please, yes.\"\n\nShe took several breaths, trying to gather her thoughts. When she spoke, the words came haltingly but honestly.\n\n\"I'm worried about so many things, Juan. About children, yes—terrified I'll fail you in that. But also...\" She looked at him. \"I'm worried about traveling with the army. I've lived in palaces and convents my whole life. I don't know how to live in a military camp. What if I'm in the way? What if the soldiers resent me being there?\"\n\nHer voice grew smaller. \"And I'm worried that once we're married, once you have what you need from me, you'll... you'll stop seeing me. That I'll just be the queen in the tent, doing my duty, while you're out there with your commanders and your crusaders. That we'll pray together but you'll be thinking about battles and strategies, not really there with me.\"\n\nShe gripped his hands tightly. \"I know I'm not clever like the men who advise you. I'm not brave like the crusaders. I can't help you plan campaigns or give you wise counsel about Granada. All I can do is pray and try to give you children and be a proper queen.\"\n\nTears streamed down her face now. \"But sometimes I just want to matter to you as Isabel. Not as the Portuguese alliance or the potential mother of your heir, but just... me.\"\n\nShe looked at him desperately. \"Is that selfish? Is it wrong to want that?\""
        },
        {
          "role": "player",
          "text": "Of course it is not  selfish Isabel. And you know you matter to me. I have told you and everyone so many times I have fallen in love with you. I tell you that I have been looking forward to be with you, alone at the end of the day. I want to spend every evening with you and good company, maybe the Dona's or others and share stories. You know this already. So forgive me when I am a bit confused when you tell me you now doubt my commitment to you. I just don't understand. I feel like I have said something to upset you or have done something wrong but I dont really know what."
        },
        {
          "role": "gm",
          "text": "Juan is saying he's told Isabel he's fallen in love with her. Let me check if this is true. Looking back at the interactions...\n\nIn Chapter 10, when they first met privately, Juan led them in prayer and made a promise about the Portuguese chapel. He was considerate and kind. But I don't see him explicitly saying \"I love you\" or \"I've fallen in love with you.\"\n\nAt the Council dinner in Chapter 11, Juan gave a speech where he said he looked forward to marriage and praised Isabel, but he framed it more politically - about the alliance and her piety.\n\nI should check if there was a moment where Juan actually said he loved her. Looking through the summaries...\n\nActually, I don't see Juan ever explicitly saying \"I have fallen in love with you\" to Isabel. He's been kind, considerate, committed to praying with her, building the Portuguese chapel - but he hasn't said those words.\n\nSo Isabel would be confused by this claim. She would gently point out that he hasn't actually said this before. This is an important moment - Juan seems to genuinely believe he has said this, but Isabel's experience is different.\n\nI need to have Isabel respond truthfully but gently to this discrepancy.\n\nIsabel looked at him with confusion and pain mingling in her expression. She wiped at her tears, trying to understand.\n\n\"Juan, I...\" She hesitated, choosing her words carefully. \"You've been kind to me. You've been considerate. You promised to pray with me every evening, you're building the Portuguese chapel for me, you said I matter to you.\" Her voice was gentle but bewildered. \"But you've never told me you've fallen in love with me. Not once.\"\n\nShe searched his face. \"At the dinner, you told everyone we would 'do well enough together.' That I was pious and appropriate. Tonight, when I asked if you thought about our children, you said you hoped I could serve you and the crown well. These aren't the words of a man in love, Juan. They're the words of a man doing his duty thoughtfully.\"\n\nIsabel's hands tightened on his. \"I'm not asking you to lie to me. If this is an arranged marriage where we'll be partners in faith and duty, I can accept that. I will accept that. But please don't tell me you've said things you haven't said, or that I should already know things I don't know.\"\n\nHer voice broke. \"I would be so happy if you loved me, Juan. But I don't think you do. Not yet. Maybe someday, but not now. And that's—\" she swallowed hard, \"—that's alright. We can build something good anyway. But please, please don't make me feel like I'm failing to see something that isn't there.\""
        },
        {
          "role": "player",
          "text": "I am quiet for a moment.\n\n\nI feel like I love you Isabel. And I have declared this during dinner here in Toledo when we had to adress the cardinal's wishes of sending the Donna's away. I wanted to make sure you mattered to me greatly and I said I was falling in love with you then. And I thought I have done so on other occasions as well but indeed none come to mind.\n\n\nDo you love me Isabel? I have been looking forward to meeting you when I recieved your letters and portrait. I have loved getting to know you. I look forward to meeting and praying with you at the end of the day. I think about you during the day. I think about a future where our union is blessed with children. I want to get to know you even better. I want you by my side and am happy, knowing you are going to be such a great and beautiful queen. Maybe I have never been in love, but I think I do love you. But you have never told me you love me either. I never have demanded this from you isabel, nor will I. I...I do not know what more ton say."
        },
        {
          "role": "gm",
          "text": "Isabel needs to respond authentically. She's been upset because she felt like he was being coldly practical, treating her as a duty. But now he's opened up, shown vulnerability, and she needs to process this.\n\nLet me think about what Isabel would feel:\n1. She's surprised he mentioned the dinner - she may have interpreted that differently\n2. She's realizing they may have been talking past each other\n3. He's asking if she loves him - which is fair\n4. He's being vulnerable about not knowing what love is\n5. He's listing genuine caring behaviors\n\nIsabel would likely:\n- Feel some relief that he does care\n- Realize they've been miscommunicating\n- Be honest about her own feelings\n- Still be hurt but softer now\n- Recognize he's trying\n\nShe's 18-19, sheltered, raised in convents, doesn't have much experience with romantic love either. She probably doesn't know if what she feels is love or just hope and duty mixed with growing affection.\n\nIsabel was silent for a long moment, her tears slowing as she processed his words. When she finally spoke, her voice was softer, less hurt.\n\n\"At the dinner... when you spoke to the cardinal about my Portuguese ladies...\" She closed her eyes, remembering. \"You said I mattered greatly to you. That you were growing to... to cherish me, I think? And that my happiness was important.\" She opened her eyes. \"I thought you were being diplomatic. Saying what needed to be said to protect my ladies. I didn't think...\"\n\nShe looked down at their joined hands. \"Maybe we've both been misunderstanding each other.\"\n\nIsabel took a shaky breath. \"Do I love you?\" Her voice was barely a whisper. \"I don't know, Juan. I honestly don't know. I was raised by nuns. I've never... I don't know what romantic love feels like. I know what duty feels like. I know what faith feels like. I know I pray for you constantly. I know that when you're kind to me, my heart lifts. When we pray together, I feel safe. When you smile at me, I feel... hope.\"\n\nShe met his eyes. \"I look forward to seeing you too. I think about you during the day. When I heard about the crusade, my first thought was fear for your safety, not for Castile or politics. And tonight, when you talked about children like it was just strategy, it hurt so much because...\" She swallowed. \"Because I want them to matter to both of us, not just to the kingdom.\"\n\nIsabel's grip tightened on his hands. \"Maybe that's love? Or maybe it's just the beginning of love? I don't know. But I want it to be love, Juan. I want to love you and be loved by you, truly, not just as duty or partnership.\"\n\nShe wiped her eyes with one hand. \"I'm sorry I got so upset. I think... I think we're both trying very hard, and neither of us really knows how to do this. Neither of us has been in love before, have we?\""
        },
        {
          "role": "player",
          "text": "I have been once before. Please dont ask me more about this and take me for my word that I have acted honourably, but as my betrothed and you ask me if I ever was in love, you deserve the truth. Ill tell you more later if you want, but for now, let it lay.\n\n\nWould you like to walk through the garden with me? I visited the armourer today and have let him design an armour. I would like to hear what you think about how it will look like."
        },
        {
          "role": "gm",
          "text": "Isabel just learned that Juan has been in love before. This is a significant revelation that would naturally affect her. She's vulnerable, they've been having an emotional conversation, and now she learns he's loved someone else. She would likely have questions, feel insecure, or need reassurance, but Juan is asking her not to press and changing the subject to armor.\n\nShe would probably:\n1. Feel hurt/confused by this revelation\n2. Respect his request not to press further (she's dutiful)\n3. But the wound would still be there\n4. Try to compose herself\n5. Accept the change of subject, but she'd be processing this information\n\nI should show her emotional reaction but also her trying to be dutiful and accept his boundaries.\n\nIsabel went very still. The color drained from her face as she processed what he'd just said.\n\n\"You've been in love before.\" Her voice was flat, almost shocked. She stared at him for a long moment, a thousand questions clearly racing through her mind. Her lips parted as if to speak, then closed again.\n\nShe looked down at their hands, then pulled hers away slowly. \"I... yes. Of course. I won't ask.\" Her voice was tight, controlled. \"You acted honorably. I believe you.\"\n\nBut there was new pain in her eyes—a different kind than before. The knowledge that whatever he felt or might feel for her, someone else had been there first. That when he said he'd never been in love before, it hadn't been true.\n\nIsabel stood slowly, smoothing her skirts with trembling hands. \"A walk. Yes.\" Her voice was distant now, polite. \"I would like to hear about your armor.\"\n\nShe moved toward the chapel door, her posture rigid. Just before stepping through, she paused without turning back. \"Did she... did you love her very much?\" The question escaped before she could stop it, quiet and pained. Then immediately: \"I'm sorry. You asked me not to ask. Forgive me.\"\n\nShe pressed her hand against the doorframe, clearly trying to compose herself before facing the corridors and gardens beyond."
        },
        {
          "role": "player",
          "text": "It was a girl I met on my pilgrimage. I developed feelings for her, but I knew I would not marry her for she was not of royal blood. I have sought much prayer and have confessed a lot about her to father Hernando. It took a lot from me to let her from my mind. I wanted to confess my love to her, but I never did. She never has known my feelings for her and has probably forgotten all about me for now. I have put her behind me Isabel, rest assured. When we meet my sister, she may talk with you about this, for I have confided in her greatly then. Im sure she knows what to say.\n\n\nI feel like I am a fool back then and even now. I have no problems commanding armies or convincing nobles, but I feel so inadequate if it comes to matters of love. Forgive my shortcomings."
        },
        {
          "role": "gm",
          "text": "Isabel would be processing a lot here:\n1. Relief that he never acted on it and the girl doesn't know\n2. Pain that he loved someone else first\n3. Understanding that he struggled with it and sought spiritual counsel\n4. Perhaps some comfort that he's being honest with her now\n5. His admission of feeling inadequate in matters of love would resonate - she feels the same way\n6. The fact that he let her go for duty's sake might actually help Isabel understand him better\n\nShe would be emotional but this honesty might actually help bridge the gap between them. She might feel less alone in her confusion about love.\n\nI should have Isabel respond with a mix of emotions - hurt, but also understanding, and perhaps even relief at his vulnerability and honesty.\n\nIsabel turned back to him, and the rigid control in her posture softened. Tears welled in her eyes again, but different ones—not hurt or anger, but something closer to understanding.\n\n\"Oh, Juan.\" She moved back toward him, her hand reaching out tentatively. \"You loved her and you let her go. For duty. For the kingdom.\" Her voice trembled. \"That must have been so hard.\"\n\nShe wiped at her eyes. \"I'm... I'm relieved she never knew. That nothing happened. But I'm also...\" She struggled for words. \"I'm sad for you. That you had to give up someone you loved. And I'm...\" She looked down. \"I'm a little frightened that I'm the second choice. The duty, not the desire.\"\n\nBut then she took his hand gently. \"But you're being honest with me. You're telling me the truth even though it hurts to say it. And you're admitting you feel inadequate too.\" A small, shaky laugh escaped her. \"Juan, I feel like a complete fool when it comes to love. I have no idea what I'm doing. I'm terrified of everything—the wedding night, having children, being a proper wife, living with an army, all of it.\"\n\nShe squeezed his hand. \"Maybe... maybe we're both just stumbling through this together? Neither of us knowing what we're doing, both trying our best?\" There was hope in her voice. \"You gave up someone you loved for duty and kingdom. I left everything I knew in Portugal for the same reasons. Maybe that's what makes us... right for each other? We both understand sacrifice?\"\n\nShe looked up at him. \"I would like to meet your sister. And yes, let's walk. Tell me about your armor. And...\" She managed a genuine smile through her tears. \"Thank you for being honest with me. That matters more than you know.\""
        },
        {
          "role": "player",
          "text": "I take her hand and go for a walk with her through the garden.\n\n\nI must set something right Isabel. When I said I had never known love, I did not think of that other time. Please believe me it was not my intention to lie. Maybe what I meant to say was that I had never known love. And to be honest I had just forgotten about her when we discussed us being in love or not. Maybe that says something about what you mean to me and that I have forgotten about that other girl?\n\n\nAnd there is something else. I understand that you feel a bit afraid about travelling with the army. I can understand this and I must say that it is a bit hard for me to imagine the problems a woman might have in such situations. I never consider them. It helps me if you immediately tell your worries to me. I am very good at solving problems, and if I know them, I can. Do you want to discuss this with the Donna's sometime? Would planning for travel put you more at ease?"
        },
        {
          "role": "gm",
          "text": "Juan is trying to reassure Isabel about forgetting the other girl, and is being thoughtful about her concerns regarding traveling with the army. He's asking if she wants to discuss with the Donnas and if planning would help. I should have Isabel respond to these points naturally - she would be relieved/touched that he forgot about the other girl when thinking about love with Isabel, and would likely appreciate him being practical about the army travel concerns and offering to help plan/discuss with her ladies.\n\nIsabel's grip on his hand tightened, and she looked up at him with surprise and something that might have been joy breaking through the tears.\n\n\"You... you forgot about her when we were talking about love?\" Her voice was wondering. \"Juan, that's...\" She stopped walking, turning to face him fully. \"That's not nothing. That means something.\"\n\nA genuine smile broke across her face, tremulous but real. \"When you think about love now, you think about us. About me. Not about her.\" She pressed his hand to her cheek for a moment. \"Thank you for telling me that. It helps. It really helps.\"\n\nThey resumed walking through the garden, the night air cool around them. Isabel seemed lighter now, some burden lifted.\n\n\"And yes,\" she said more firmly. \"Yes, I would very much like to discuss the travel with Dona Beatriz and the others. They're practical women—Beatriz especially. She traveled from Portugal with me, managed the whole journey. If anyone can help me understand what I'll need, what to expect, how to...\" She gestured vaguely. \"How to live in a military camp without being in everyone's way, it's her.\"\n\nIsabel looked up at him. \"Would you help too? I mean, could we sit down together—you, me, the Donnas, maybe Don Álvaro?—and actually plan it? What I'll need, where I'll stay, how it works?\" There was eagerness in her voice now, the problem-solver emerging. \"If I understand what to expect, if I'm prepared, I think I'll be much less frightened.\"\n\nShe paused by a garden bench. \"Now tell me about this armor. What will you look like?\""
        },
        {
          "role": "player",
          "text": "Isabel, I wish I could hold you and comfort you and never let you go. But that would be improper now. Hopefully after the wedding this will be different.\n\n\nLets talk about lighter things tonight.\n\n\nI tell her about the armour and the white banners. That I intend to use this garments to arrive at the wedding."
        },
        {
          "role": "gm",
          "text": "Juan is expressing affection for Isabel and then shifting to lighter topics - talking about the armor. I should show Isabel's reaction to his words about wanting to hold her, then have her engage with his description of the armor. This is a lighter, more positive moment after their emotional conversation.\n\nI should NOT generate dialogue or actions for Juan. I need to stop and let him continue the conversation.\n\nIsabel's breath caught at his words. She looked up at him with eyes that were still wet from tears but now shining with something else entirely. \"After the wedding,\" she whispered, a blush rising to her cheeks. \"Yes. After the wedding.\"\n\nShe sat on the bench, pulling him down beside her, still holding his hand. As he described the armor—the Milan plate, the white plume, the banners streaming behind him on poles attached to his saddle—her eyes grew wider.\n\n\"You'll look like an angel,\" she breathed. \"Like Saint Michael himself, all in white and silver. The banner poles behind you...\" She imagined it, smiling. \"Everyone will see you from across the battlefield. It will be magnificent.\"\n\nThen a shadow of worry crossed her face. \"But Juan, won't that make you a target? Every Moorish archer will aim for the white king. Every knight seeking glory will charge at you.\" Her hand tightened on his. \"I know you need to be visible for your troops, but... promise me you'll be careful? Promise me you'll have guards close?\"\n\nShe looked at his face in the moonlight. \"And you're wearing this to arrive at the wedding? Riding up to the cathedral in full armor?\" A delighted laugh escaped her. \"The nobles will talk about it for years. It will be extraordinary.\""
        },
        {
          "role": "player",
          "text": "I give her hand a kiss. Shall we talk about the travel tomorrow? And the guards I have assigned to you and the donna's, how have they been? Whall I keep them as your personal guards also when we are on the roads?"
        },
        {
          "role": "gm",
          "text": "Juan is asking two questions:\n1. Should they talk about the travel tomorrow?\n2. How have the guards assigned to Isabel and the Donnas been, and should they continue as her personal guards on the road?\n\nI need to have Isabel respond to these questions. She should be in a better mood now after their conversation, feeling more connected to Juan. She would likely appreciate the thoughtfulness about her safety and comfort.\n\nI should NOT generate Juan's actions or dialogue - only Isabel's response and any environmental details.\n\nIsabel smiled at the kiss on her hand, her earlier distress seeming to fade in the quiet intimacy of the garden.\n\n\"Yes, tomorrow. With the Donnas and perhaps Don Álvaro. I think I'll sleep better tonight knowing we'll make a proper plan.\" She squeezed his hand. \"Thank you for understanding my worries.\"\n\nAt the mention of the guards, her expression brightened further. \"Oh, they've been wonderful. Very respectful, very attentive. There are four of them, yes? Led by a man named Sancho?\" She nodded approvingly. \"He's serious but kind. The Donnas feel safe with them, especially when we walk through the city or to the cathedral for Mass.\"\n\nShe considered his question. \"I think keeping them would be wise. They already know us, understand our routines. Dona Beatriz has even taught them a few words of Portuguese—she says it's important they can understand if we need something urgently.\" A small smile. \"And having the same guards on campaign... yes. That would help. Familiar faces when everything else is strange and new.\"\n\nIsabel looked up at the stars beginning to appear in the darkening sky. \"It's been a difficult evening, but I'm glad we talked. Even the hard parts.\" She turned back to him. \"Should we head inside? It's getting cold, and you have more meetings tomorrow, don't you? The Master of Alcántara, I think someone mentioned?\""
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_1431_00077",
      "book": 1,
      "chapter": "1.12",
      "date": "1431-01-31",
      "end_date": "1431-02-14",
      "type": "personal",
      "summary": "Time skip covering final 15 days before wedding. Isabel plans campaign travel with Dona Beatriz and Álvaro — practical logistics ease her fears. More nobles arrive daily, all accepting crusade taxation after word spreads from the three audiences. Master Gonzalo works day and night; delivers completed white armor three days before wedding — polished Milan plate with white plume, even Álvaro struck silent. Guardian Company (50 crusaders) develops procedures under Fray Hernando for relic/banner protection during travel and battle. Pedro González de Padilla spends week in Toledo with Tommaso on eastern army logistics before departing for frontier. Administrative packet dispatched to Rodrigo in Seville with budget, Infante assignments, relay system details, and three administrators. Juan and Isabel pray together every evening as promised — genuine partnership growing, fragile beginnings of love. Crusader recruitment approaches 250 sworn crusaders. Toledo fills to capacity with visitors for wedding and crusade announcement. On evening of February 14, Juan prays alone in banner chamber before father's sword — feels the certainty that he is where God needs him to be.",
      "characters": [
        "juan_ii",
        "isabel_of_portugal",
        "alvaro_de_luna",
        "dona_beatriz",
        "fray_hernando"
      ],
      "factions_affected": [],
      "location": "Toledo",
      "tags": [
        "preparation",
        "wedding",
        "crusade",
        "personal"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "We head inside and spend the next evening planning the travelling, comforting Isabel. I continue meeting with nobles and contribute to the other preparations as well. We skip ahead to the wedding which we will do in the next chapter.\n\n\nWrap up the chapter here. Create a new document in canvas and put an extensive summary of all events in this chat inside it. Name the document \"chapter 12\"."
        },
        {
          "role": "gm",
          "text": "Events to include in the summary:\n- The three noble audiences (Mendoza, Enríquez, Guzmán)\n- Armor fitting with Master Gonzalo\n- Address to the 50 crusader guards about relics and banner\n- Meeting with Master of Calatrava (Pedro González de Padilla)\n- Strategic planning with Álvaro about eastern/western army coordination\n- Letter writing to the Infantes\n- Evening with Isabel - the emotional conversation about love, worries, and planning\n- Skip ahead mention of continued preparations\n\nI'll create a comprehensive summary that captures all the key moments, decisions, dialogue highlights, and character development.\n\nCHAPTER 12: THE RECKONING (Conclusion)\n\nThe following days passed in a blur of preparation and planning. Isabel met with Juan, Álvaro, and her Portuguese ladies to carefully plan the travel arrangements for the campaign. Dona Beatriz proved invaluable, her practical mind immediately grasping the logistics—what Isabel would need in camp, how her quarters should be arranged, how to maintain dignity and comfort while living with an army. The four guards assigned to her—Sancho and his men—were confirmed as her permanent escort.\n\nMore nobles arrived daily in Toledo, their banners adding color to the ancient city's streets. Each brought levies, supplies, and—most importantly—acceptance of the crusade taxation. The three audiences Juan had held with Mendoza, Enríquez, and Guzmán had done their work. Word spread among the great houses: the young king was fair, the papal oversight was real, and resistance was both futile and spiritually dangerous.\n\nMaster Gonzalo worked day and night on the armor. Juan returned for fittings every three days, watching as the magnificent white-plumed harness took shape. The armorer's pride was evident—this would be his masterwork, the piece that made his reputation across Castile.\n\nThe Guardian Company of fifty crusaders drilled and planned under Fray Hernando's guidance, developing procedures for protecting the relics and banner during travel and battle. Their devotion was absolute, their brotherhood growing stronger each day.\n\nPedro González de Padilla remained in Toledo for a week, working intensively with Father Tommaso on logistics and strategy for the eastern army. The Master of Calatrava studied maps, calculated supply requirements, and absorbed everything Tommaso could teach him about managing an army of twenty-three thousand. When he finally departed for the frontier, it was with confidence and purpose—a man who understood both the weight of his responsibility and the support available to execute it.\n\nThe packet for Rodrigo departed two days after Juan's meeting with Álvaro—a comprehensive set of orders, budgets, administrators, and the letter to Infante Juan. The relay system between the eastern frontier and Seville was established, fresh horses and riders positioned at strategic points. The mechanism for coordinated warfare was in place.\n\nAnd through it all, Juan and Isabel met every evening in the Portuguese chapel. They prayed together as promised, sharing their concerns, their hopes, their fears. Slowly, carefully, they built something—not the passionate romance of poems or songs, but something perhaps more valuable: genuine partnership, mutual respect, and the fragile beginnings of love.\n\nIsabel grew more confident. The frightened girl who'd arrived from Portugal was becoming a queen—still nervous, still uncertain in many ways, but finding her strength in faith, in Juan's steady presence, and in understanding her role clearly.\n\nThe crusader recruitment continued. More men arrived daily to take the oath before the banner, to touch the relics, to join the white-tabarded company. By the time the wedding approached, nearly two hundred fifty crusaders had sworn themselves to the cause.\n\nToledo filled to bursting. Every inn, every noble house, every available space held visitors who'd come for the royal wedding and the crusade announcement that would follow. The city hummed with anticipation, with religious fervor, with the sense that something momentous was about to begin.\n\nMaster Gonzalo delivered the armor three days before the wedding. When Juan donned it for the first time—the polished Milan plate, the white-plumed helmet, the tabard flowing over gleaming steel—even Álvaro was struck silent. The Master of Calatrava's prediction was right: he looked like an angel of war.\n\nOn the evening of February 14th, 1431, Juan knelt alone in the banner chamber. Tomorrow he would marry. Tomorrow the crusade would be proclaimed publicly to all Castile's nobility. Tomorrow everything changed.\n\nHe prayed before the relics, before his father's sword, seeking guidance and strength for what lay ahead. And in that quiet moment, he felt it again—that certainty he'd learned to recognize. Not a voice, not a vision, but a deep conviction that he was where God needed him to be, doing what he was meant to do.\n\nThe Reconquista's final chapter was about to begin.\n\nSTATUS AT CHAPTER END\n\nDate: February 14, 1431, Evening\nLocation: Royal Alcázar, Toledo\n\nPolitical Situation:\n\nAll major noble houses committed to crusade\n\nTaxation accepted (grudgingly but accepted)\n\nMilitary Orders fully aligned and integrated\n\nPopular support at unprecedented levels\n\nPortuguese alliance secured through marriage\n\nMilitary Preparations:\n\nEastern Army: 23,000 troops, Pedro González commanding, comprehensive logistics\n\nWestern Army: 12,000 troops, Rodrigo commanding, naval support ready\n\n~250 sworn crusaders\n\nRelay communication system established\n\nStaggered deployment strategy finalized\n\nFinancial Status:\n\nTreasury: 390,200 florins available\n\nCampaign budget: 143,171 florins approved\n\nSurplus: 247,000+ florins\n\nTaxation revenue to flow during campaign\n\nPersonal:\n\nJuan and Isabel building genuine partnership\n\nMarriage tomorrow (February 15, 1431)\n\nWhite armor ready for dramatic entrance\n\nBanner and relics prepared for public unveiling\n\nWedding Plans:\n\nFull High Mass with Queen's coronation\n\nCardinal Capranica officiating\n\nBanner and relics unveiled during ceremony\n\nTaxation announcement to assembled nobility\n\nCrusader recruitment appeal\n\nJuan arriving in white armor on horseback\n\nNext Chapter: The Royal Wedding and Crusade Proclamation\n\nEND OF CHAPTER 12"
        },
        {
          "role": "player",
          "text": "Wrap up the chapter here. Create a new document in canvas and put an extensive summary of all events in this chat inside it. Name the document \"chapter 12\"."
        },
        {
          "role": "gm",
          "text": "# CHAPTER 12: THE RECKONING\n## Complete Summary of Events\n**Date Range:** January 29 - February 14, 1431  \n**Location:** Royal Alcázar, Toledo\n\n---\n\n## OVERVIEW\n\nChapter 12 focuses on Juan's final preparations before his wedding and the crusade's launch. The chapter centers on three critical noble audiences where Juan demonstrates his growing political maturity, strategic military planning with his commanders, the commissioning of his distinctive white armor, addressing the Guardian Company of crusaders, and navigating the complexities of his relationship with Princess Isabel. The chapter showcases Juan balancing political necessity, military preparation, and personal relationships as the wedding and crusade proclamation approach.\n\n---\n\n## PART I: THE THREE NOBLE AUDIENCES (January 29)\n\n### Setting the Stage\n\nFollowing the successful Council meeting where the crusade budget was approved and the Portuguese ladies crisis was resolved, several great noble houses requested private audiences to discuss the coming crusade taxation and their participation. Three audiences were scheduled for the same day: Mendoza, Enríquez, and Guzmán.\n\n### Audience One: House Mendoza (Afternoon)\n\n**Attendees:**\n- Don Íñigo López de Mendoza the Elder (head of house, late 50s)\n- Don Pedro González de Mendoza (his son and heir, age 30)\n\n**Key Discussion Points:**\n\nThe Mendozas came seeking clarity on crusade taxation and participation. Don Íñigo asked about levy requirements, and Juan inquired how many troops House Mendoza could field.\n\n**House Mendoza's Military Contribution:**\n- 1,800 men-at-arms and foot soldiers\n- 400 household troops under permanent arms\n- Remainder levied from estates\n- Well-equipped, properly trained forces\n\n**Strategic Conversation:**\n\nDon Íñigo raised concerns about assessment fairness, specifically asking if all great houses would face equal scrutiny. Juan explained the comprehensive oversight system:\n- Joint assessment teams (crown + Vatican)\n- Cardinal Capranica's meticulous procedures\n- No favoritism or special treatment\n- Fair and just taxation per papal bull\n\nJuan extended an opportunity to Pedro to take the crusader oath and join the white banner. Pedro accepted enthusiastically, noting his grandfather fell at Antequera and he wished to complete the Reconquista.\n\n**Command Structure Discussion:**\n\nDon Íñigo inquired about command positions. Juan explained the papal bull granted him total authority over all crusade forces and commanders. He would assign positions based on merit and effectiveness, not automatically grant command to nobles leading their own levies.\n\nJuan promised Pedro opportunity to prove himself and rise through ranks based on ability, potentially commanding forces far larger than 1,800 men. He committed to giving Pedro the chance to \"avenge your grandfather in a manner to cement your contribution to the reconquista.\"\n\n**Outcome:**\n\nDon Íñigo expressed complete satisfaction with the terms:\n- Fair assessment with Church oversight\n- Rewards based on service and merit\n- Pedro taking crusader oath at wedding\n- 1,800 Mendoza levies committed\n- House Mendoza will cooperate fully with assessors\n\nDon Íñigo indicated he would tell other nobles that the king \"judges all men by the same measure, rewards service over privilege, and leads a crusade blessed by Rome with proper oversight\"—effectively becoming an advocate for Juan's approach.\n\n**Personal Touch:**\n\nJuan showed the Mendozas around the palace, introduced them to Isabel (who impressed them with her knowledge of their family's monastery endowment), and brought them to see the banner and relics. Both Mendozas were profoundly moved by the relics, with Pedro kneeling in genuine devotion.\n\n### Audience Two: Don Enrique Enríquez, Admiral of Castile (Afternoon)\n\n**Background:**\nAge ~40, administrator rather than warrior, controlled unusual maritime-based wealth (ports, fishing rights, shipping interests).\n\n**Initial Nervousness:**\n\nDon Enríquez arrived clearly anxious about the crusade taxation, worried about how maritime holdings would be assessed compared to traditional agricultural estates.\n\n**Juan's Approach:**\n\nJuan immediately noticed his nervousness and invited him to speak frankly about his concerns. This direct, compassionate approach transformed the audience.\n\n**Key Concerns Addressed:**\n\n1. **Assessment Complexity:** Maritime revenue fluctuates with trade winds, seasons, and foreign commerce. How would assessors handle this?\n\nJuan's Response: \n- Assessments valid for maximum 10 years\n- If revenue changes significantly, reassessment conducted\n- System accounts for fluctuations in maritime trade\n- Both crown and Vatican assessors to ensure fairness\n\n2. **Naval Contribution:** Could naval service count toward crusade contribution?\n\n**Enríquez's Naval Assets:**\n- 4 carracks (personal control) - 60 tons cargo or 100 men each\n- 6 caravels (partnership interests) - faster, coastal patrol\n- Ability to contract 8-12 additional ships through merchant relationships\n\n**Strategic Naval Discussion:**\n\nJuan engaged Enríquez in substantive discussion about Castile's naval capabilities and needs:\n\n**Current Castilian Fleet:**\n- 3 war galleys (crown-owned, one needing repairs)\n- 8-10 city-maintained galleys\n- ~15-20 merchant vessels that could be pressed into service\n- Total: ~30 vessels (not a true fleet)\n\n**Comparison:**\n- Crown of Aragon: 60-80 war galleys\n- Venice: Hundreds\n- Granada: 12 purpose-built war galleys\n\n**Enríquez's Vision for Naval Power:**\n\nThe Admiral outlined why Castile needs a fleet:\n\n1. **Trade and Revenue:** Protect merchant shipping from Barbary corsairs, encourage commerce\n2. **Coastal Defense:** Counter Granada raids on southern towns\n3. **Power Projection:** Blockade enemy ports, land troops where desired\n4. **Atlantic Opportunities:** Portuguese exploration shows future wealth in Atlantic\n5. **Independence:** Not rely on hired Genoese or Portuguese ships\n\n**Practical Discussion:**\n\nJuan asked about defensive fleet requirements. Enríquez estimated 25-35 vessels for effective coastal patrol:\n- 15 war galleys: Southern coast (Cádiz to Gibraltar)\n- 10-15 ocean-going vessels: Atlantic coast\n- Annual cost: 300,000-350,000 maravedís\n- Initial construction: 500,000 maravedís\n\n**Pirate Bases Discussion:**\n\nJuan inquired about attacking pirate bases rather than just defending. Enríquez explained:\n- Primary bases: Barbary Coast (Ceuta, Tangier, Oran, Algiers)\n- Heavily fortified with their own fleets\n- Would require major expeditions with thousands of troops\n- Portugal has coveted Ceuta but hasn't attempted it\n- Controlling both sides of Gibraltar Strait = controlling Mediterranean-Atlantic trade\n\n**Expertise Assessment:**\n\nOn fleet expansion capability:\n- Shipbuilding: Adequate northern yards (Santander, Bilbao, La Coruña)\n- Basque shipwrights skilled for Atlantic vessels\n- Could build 30 ships over 3 years with investment\n- **Critical gap:** Naval commanders and experienced officers\n- Would need foreign experts initially as instructors\n- 5-10 years to train native Castilian naval officers\n\n**Portuguese Galley Quality:**\n\nJuan asked about Portuguese dowry ships versus Granada's. Enríquez confirmed Portuguese galleys superior individually:\n- Professional crews, better discipline\n- Better coordination and training\n- In one-on-one combat, Portuguese galley wins decisively\n- But Granada's crews know local waters intimately\n- 8 Portuguese + hired Genoese = comfortable superiority for crusade\n\n**Outcome:**\n\nDon Enríquez left satisfied and relieved:\n- Understood assessment would be fair and account for maritime fluctuations\n- No automatic naval service substitution, but his expertise valued\n- Juan interested in long-term fleet development\n- Commitment to cooperate fully with assessors\n- Future role in expanding Castile's maritime power\n\n### Audience Three: Don Luis de Guzmán, Master of Santiago (Late Afternoon)\n\n**Background:**\n- Age 56, Master of Order of Santiago\n- Commanded 2,000 Santiago knights\n- Had sided with Infantes during their rebellion\n- Order controlled vast estates across Castile\n- Faced crushing taxation: 10% church tax + 5% noble tax on personal holdings\n- Personal service exemption worthless (too old for campaign)\n\n**Juan's Approach:**\n\nRather than formal interrogation, Juan invited Guzmán for wine, showed him the palace, introduced him to Isabel, and brought him to see the banner and relics. The Master was profoundly moved by the relics, kneeling in genuine devotion.\n\n**The Transformation:**\n\nSeeing the banner reminded Guzmán of Santiago's founding purpose. He said: \"This is what Santiago was founded for. Everything else—politics, disputes, factions—it's all dust compared to this.\"\n\n**Santiago's Organization:**\n\nGuzmán explained the Order's structure:\n- Permanent frontier garrisons commanded by *comendadores*\n- Each commander manages military operations and supporting estates\n- Creates accountability: commanders depend on their lands being productive\n- Knights take vows (obedience, sometimes chastity, personal poverty)\n- Order itself wealthy to maintain permanent frontier defense\n- Knights own nothing personally but command troops and estates for Santiago\n\n**The Three Concerns:**\n\nGuzmán raised his worries candidly:\n\n1. **Taxation Optics:** Santiago founded for exactly this crusade, yet must pay heavily to participate. How does this preserve Order's honor?\n\nJuan's Response:\n- Taxes fund essential crusade infrastructure (ships, supplies)\n- Without taxation, crusade would be poorly supplied\n- Funds controlled by Vatican, allocated to crusade\n- All assessments will be fair and transparent\n\n2. **Personal Service:** At 56, Guzmán too old for sustained campaign. How to maintain honor when Master cannot lead personally?\n\nJuan's Response:\n- Step down from field command, no dishonor in this\n- Serve as honored advisor (prestigious position)\n- Can serve God in greater capacity than wielding sword\n- The choice is Guzmán's to make\n\n3. **Knights Taking Individual Crusader Oaths:** Would this weaken Santiago if best knights pledge directly to Juan's banner?\n\nJuan's Response:\n- Santiago exists to serve Reconquista\n- Knights serving white banner fulfill Order's purpose\n- Enhances rather than diminishes Santiago's honor\n- Juan commands everyone regardless per papal bull\n- After crusade, crusaders released from vows\n\n**The Critical Decision:**\n\nJuan gave Guzmán a genuine choice with no pressure:\n- Command Santiago forces in field (if he chose)\n- Or step down to advisory role, mentoring younger commanders\n- Either choice would be honored\n\n**Guzmán's Resolution:**\n\nAfter genuine reflection, Guzmán chose:\n- Step down from field command\n- Recommend younger Santiago commanders (30s-40s) for field leadership\n- Serve as advisor to crusade\n- Accept assignment to eastern army as senior advisor/mentor\n\nHis reasoning: \"I would be risking Santiago's men to protect my own pride. That's not leadership. That's vanity.\"\n\n**The Emotional Impact:**\n\nGuzmán was deeply moved:\n- Expected punishment for siding with Infantes\n- Instead received grace, respect, and opportunity for redemption\n- Saw chance for Santiago to fulfill founding purpose\n- Viewed this as personal and Order's redemption\n\nHis final words: \"You've given me—given us—redemption. A chance to serve our true purpose... The Order of Santiago commits fully to this crusade, Your Majesty. Our two thousand knights, our fortresses, our resources, our knowledge—all of it at your disposal.\"\n\n**Outcome:**\n\nComplete transformation of relationship:\n- Santiago fully committed (2,000 knights)\n- Master accepting advisory role in eastern army\n- Order's estates to cooperate fully with assessment\n- Knights free to take individual crusader oaths\n- Guzmán becomes advocate for crusade among Military Orders\n\n---\n\n## PART II: ARMOR COMMISSIONING (January 30, Morning)\n\n### Meeting with Master Gonzalo de Burgos\n\n**The Armorer:**\nStocky man in his 50s, burn-scarred forearms, master craftsman from Burgos.\n\n**Initial Discussion:**\n\nMaster Gonzalo presented initial pieces based on measurements but needed proper fitting. He raised critical question: How visible does Juan want to be on the battlefield?\n\n**Design Considerations:**\n\nThe armorer explained the tension:\n- King must be seen by troops (morale, command)\n- But visibility attracts enemy attention (arrows, glory-seeking knights)\n- Magnificence draws danger\n\n**Juan's Vision:**\n\nJuan described his intended appearance:\n- Dressed all in white\n- Mounted with banners fluttering behind on light wooden poles\n- Horse covered in plain white cloth\n- White tabard over armor\n- White plume on helmet\n- White shield and white lance with banner attached\n- Long white banners streaming in wind\n\nGoal: \"I want everyone to know who I am when I ride in front of my cavalry dressed all in white.\"\n\n**Álvaro's Warning:**\n\nThe Constable was grim: \"He becomes the primary target for every archer, crossbowman, and knight seeking glory. Your Majesty, this is... Bold. Strategically sound for morale. Extraordinarily dangerous personally.\"\n\n**Master Gonzalo's Response:**\n\nThe armorer was initially shocked, then enthusiastic once he understood the vision:\n\n**Armor Specifications:**\n- Full Milan plate (finest steel available)\n- Perfectly fitted for mobility, not just protection\n- Can fight, mount/dismount easily\n- White tabard over everything\n- Flawless armor beneath\n\n**Helmet Design:**\n- Elegant armet with visor\n- Tall white plume secured with brass fitting\n- White enamel accents along edges\n- Practical visibility through visor\n- Unmistakably Juan's\n\n**Banner Poles:**\n- Lightweight ash wood, 8 feet tall\n- Fitted into sockets attached to saddle\n- Two poles with white silk banners\n- Stream behind like wings when riding\n\n**Horse Equipment:**\n- White caparison over body\n- Head and chest armored beneath\n- White lance and shield\n\n**Shield Device:**\nJuan would decide what symbol to bear on the shield.\n\n**Safety Compromise:**\n\nMaster Gonzalo suggested two helmets:\n- Show helm: Magnificent, highly visible\n- Protected helm: Better face protection for intense fighting\n- Switch when arrows start flying heavily\n\n**Wedding Deadline:**\n\nJuan requested wearing the armor to arrive at his wedding (17 days away). Master Gonzalo:\n- Normally impossible timeline\n- But could prioritize visible ceremonial pieces\n- Work day and night with three best apprentices\n- Focus on cuirass, helmet with plume, gauntlets, greaves\n- Perfect for combat later, but wedding-ready in 17 days\n\nMaster Gonzalo's pride: \"You will look like an angel of war descended from Heaven itself.\"\n\n**Symbolic Impact:**\n\nÁlvaro noted: \"The papal legate officiating, the banner unveiled, you in white armor taking your marriage vows and announcing the crusade. It will be... unforgettable.\"\n\n**Commercial Impact:**\n\nMaster Gonzalo: \"When the nobles see this at your wedding, every one of them will want me to make their armor for the crusade. You're about to make me the busiest armorer in Castile, Your Majesty.\"\n\n**Fitting Process:**\n\nJuan underwent immediate detailed fitting:\n- Measuring with cords across all dimensions\n- Trying sample plates for movement assessment\n- Testing range of motion (sword strikes, shield work, mounting)\n- Special attention to fighting movements\n- Apprentices recording all measurements\n\nSchedule: Return in 3 days for first true fitting with roughed-out pieces.\n\n---\n\n## PART III: ADDRESSING THE GUARDIAN COMPANY (January 30, Midday)\n\n### The Banner Chamber\n\nTransformed into makeshift chapel:\n- Candles before relics\n- White banner mounted prominently\n- Sacred atmosphere\n\n### The Assembly\n\n50 sworn crusaders gathered:\n- Veterans and young knights\n- Common-born and nobles\n- All wearing white tabards with red crosses\n- Led by Fray Hernando\n- Absolute reverence and devotion\n\n### Juan's Address\n\n**Core Message:**\n\nJuan emphasized the sacred responsibility:\n- Relics bring blessing but also weight of protection\n- Guardian Company's duty to keep them safe\n- Will travel extensively, carry banner into battle\n- Relics will attract enemy attention\n- Enemy will try to kill Juan, trample banner, steal/desecrate relics\n\n**Exclusive Authority:**\n\nJuan granted exclusive rights:\n- Only these 50 may touch relics (once each)\n- Only they may guard banner and relics\n- No one else can claim this responsibility\n- Sacred trust placed solely in them\n\n**Operational Challenges:**\n\nJuan tasked them with solving practical problems:\n- How to travel safely with relics\n- How to separate banner from relics in battle\n- How to coordinate under attack\n- Guard rotation and watch duties\n- Chain of command when Juan not present\n\n**The Call:**\n\n\"Depend on one another brothers. Make sure there are always guards near these relics. And when we ride into battle together, guard me, defend the banner and give your life in the defence of the relics. Our lives mean nothing next to these relics, including my own.\"\n\n### The Prayer\n\nJuan led unified prayer:\n- Pledging lives to protection of sacred objects\n- Seeking strength and vigilance\n- Requesting wisdom in procedures\n- Commitment even unto death\n\nResponse was thunderous: \"AMEN!\" - 50 voices as one, many in tears.\n\n### Fray Hernando's Designation\n\nThe Franciscan formally named them the **Guardian Company**—\"the sacred few entrusted with Christendom's holiest treasures in this war.\"\n\n### Practical Planning Begins\n\nThe veterans immediately engaged:\n\n**Organizational Questions Raised:**\n- Clear chains of command needed\n- Who leads when Juan absent?\n- Rotation of watch duties\n- Banner carrier role (most visible target, likely to die)\n- Minimum guard for relics: Never less than 10\n- Passwords and recognition signs\n- Verification procedures for orders\n\n**Planning Timeline:**\n\nFray Hernando to coordinate with Guardian Company to develop comprehensive procedures before the wedding.\n\n### Individual Responses\n\nSeveral crusaders approached Juan personally:\n\n- Veteran (fought at Antequera): \"I'll die before I let anyone touch those relics.\"\n- Young knight: \"My family thinks I'm mad for taking the oath. But after today... I know this is where I'm meant to be.\"\n- Common-born crusader: \"Your Majesty touched these relics. I touched these relics. A king and a carpenter's son, both equal before God. I'll remember that when the fighting starts.\"\n\n**Impact:**\n\nÁlvaro: \"Those men would walk into Hell itself for you now. You've created something extraordinary.\"\n\n---\n\n## PART IV: MASTER OF CALATRAVA AUDIENCE (January 30, Late Morning)\n\n### Don Pedro González de Padilla\n\n**Background:**\n- Age 45, Master of Order of Calatrava\n- Black robes with distinctive red cross (reversed from Santiago's colors)\n- Professional soldier more than administrator\n- Direct, plain-speaking approach\n\n**Reason for Audience:**\n\nCame at Don Luis de Guzmán's urging after Luis's transformative audience. Pedro González arrived seeking the same clarity and fairness.\n\n**Initial Pledge:**\n\nCalatrava's commitment:\n- 1,500 knights and men-at-arms\n- Control central frontier (Ciudad Real, Calatrava la Nueva)\n- Hold passes into Granada\n- Full participation in crusade\n\nHe also came to understand taxation assessment and service measurement, asking for the same forthright treatment Juan gave Santiago.\n\n### Strategic Discussion\n\n**Juan's Confidence:**\n\nJuan revealed his two-army strategy (still secret at this point):\n\n**Eastern Army (23,000 troops):**\n- Straight through central frontier\n- Banner and relics committed to this front\n- 3,000 cavalry for raiding and scouting\n- Objective: Take forts to secure supply bases\n\n**Western Army (smaller force):**\n- Leave from Seville\n- Naval support\n- Take western ports\n- Divide Sultan's attention\n\nJuan asked for Pedro González's strategic assessment.\n\n### Professional Military Analysis\n\n**Pedro González's Response:**\n\nThe Master was honored to be consulted and provided detailed professional analysis:\n\n**Two-Pronged Strategy Assessment:**\n- Makes sense, especially against reinforced Granada\n- Forces enemy to divide strength\n- Central frontier most direct route to Granada city\n- But terrain difficult, fortifications strong on both sides\n\n**Three Thousand Cavalry:**\n- Substantial force for raiding/scouting\n- Essential given Granada's traditional advantages in mobility and intelligence\n- Can disrupt enemy intelligence, keep them uncertain\n\n**Fort Sieges:**\n- Each fortress takes weeks or months\n- While besieging one, Granada can maneuver around, raid supply lines\n- Essential but time-consuming\n\n**The Critical Question:**\n\n\"The banner and relics on the eastern front—that will draw their attention, certainly. Which means Your Majesty will face their main army... Can the eastern army handle that? What numbers are we talking about?\"\n\n**Juan's Answer: 23,000 Troops**\n\nPedro González's reaction: \"Your Majesty, that is... that changes everything.\"\n\n### Detailed Strategic Assessment\n\n**What 23,000 Enables:**\n\n- Granada's main army: 18,000-22,000 (even with reinforcements)\n- Castile never fielded this size on frontier before\n- Not just raiding—can actually advance\n- Can besiege major strongholds AND meet field army\n- 3,000 cavalry as screen and striking force\n- 20,000 for sieges, heavy cavalry, depth to rotate and maintain pressure\n\n**Three Critical Challenges:**\n\n1. **Water:**\n- Arid country in summer\n- 23,000 men need enormous daily water\n- Must control specific fortresses for wells and cisterns\n\n2. **Mountain Passes:**\n- Only 3 viable routes for army this size\n- Moors know this, will fortify heavily\n- Each pass could cost weeks and hundreds of men\n\n3. **Sultan's Strategic Choice:**\n- Muhammad IX is competent, not foolish\n- Seeing both fronts, he must choose:\n  - Split forces and lose both fronts\n  - Concentrate everything against one threat\n- Will likely concentrate against eastern army (where banner is)\n- Could face entire Granada strength\n\n**The Reality:**\n\n\"It's winnable, Your Majesty. Twenty-three thousand well-commanded troops can do it. But it will be brutal. Casualties will be high. And you'll need exceptional logistics—food, water, ammunition for those bombards, medical care, everything flowing constantly from Castile.\"\n\n### The Command Offer\n\n**Pedro González's Question:**\n\n\"Who commands this eastern army?\"\n\n**Juan's Offer:**\n\nJuan revealed:\n- Master of Santiago deferring field command, serving as advisor\n- Juan considering Pedro González for eastern army command when Juan not present\n- Asked directly: \"Do you think you can shoulder this responsibility?\"\n\n**Pedro González's Honest Response:**\n\nComplete stillness, then candid self-assessment:\n\n**Experience:**\n- 8 years commanding Calatrava (1,500 knights)\n- Frontier operations, raids, stronghold defense\n- Knows central frontier intimately\n- Fought Moors in ~24 engagements\n- Never commanded 23,000 men\n- Never managed logistics at this scale\n\n**His Conditions for Acceptance:**\n\n\"I am not saying no, Your Majesty. I am saying... I need to understand what resources and authority I would have.\"\n\n- Needs experienced subordinates\n- Needs clear authority\n- Needs support if he makes mistakes\n- Needs operational discretion for time-critical decisions\n\n\"If Your Majesty believes I can do this, I will give everything I have. Calatrava exists for exactly this war. But I need to know I won't fail you—or those twenty-three thousand men—because I lacked support or clarity of command.\"\n\n**Juan's Response:**\n\nRealistic and supportive:\n- Everyone fails sometimes, no shame in admitting shortcomings\n- Take advice from Don Luis and others\n- Build staff for logistics, training, supply\n- Someone has to command for first time\n- Can request commanders from Juan\n- Will have full budget and logistical support\n\n### Budget Presentation with Tommaso\n\nFather Tommaso Parentucelli arrived with comprehensive documents.\n\n**Eastern Army Budget Details:**\n\n**Provisions (29,943 florins):**\n- 23,000 men × 1.25 maravedís/day × 240 days = 6,900,000 maravedís\n- Plus 15% for wastage, spoilage, transport = 7,965,000 maravedís total\n- Contracted suppliers across Castile\n- Supply trains flowing constantly to forward depots\n\n**Cavalry Operations (1,622 florins):**\n- 3,000 horses\n- Feed and care for 8 months\n- 10% replacement horses (300 remounts budgeted)\n\n**Wages:**\n- 2,000 crown professional troops\n- Military Order forces paid by Orders\n- Noble levies paid by their lords\n\n**Infrastructure (177 florins):**\n- 4-6 forward supply bases\n- Fortified positions for supply accumulation, wounded treatment, troop rotation\n\n**Intelligence (143 florins):**\n- Scouts, spies, informants\n- Bribes for defectors\n- Knowing Granada's force positions\n\n**Total Eastern Army Budget:** ~35,276 florins (8-month season)\n\n**Administrative Support:**\n\nTommaso recommended 20 administrators solely for eastern army logistics:\n- Quartermaster corps\n- Supply officers\n- Clerks for tracking expenditures\n- Reporting chains\n- Subordinates manage details, freeing Pedro González to command\n\n**Pedro González's Reaction:**\n\n\"Your Majesty, this is... I have never seen a campaign prepared like this. Usually we assemble troops, collect whatever supplies we can, and hope for the best.\"\n\n\"With this foundation—with these resources and this planning—twenty-three thousand men become a weapon rather than just a mob. We can sustain operations, maintain pressure, actually accomplish strategic objectives.\"\n\n**Final Commitment:**\n\n\"I can do this, Your Majesty. With Don Luis's counsel, with this logistical support, with clear authority—I can command this army. I will make mistakes, but I will learn. And we will drive into Granada's heartland with more force than they have ever faced.\"\n\n**Outcome:**\n\nPedro González left to work with Tommaso on detailed planning, fully committed to commanding the eastern army.\n\n---\n\n## PART V: STRATEGIC COORDINATION WITH ÁLVARO (January 30, Afternoon)\n\n### Letters to the Infantes\n\n**Decision Made:**\n\nJuan assigned the Infantes to their respective armies:\n- Infante Juan: Western army, senior commander/advisor to Rodrigo\n- Infante Enrique: Eastern army, tactical commander serving with Juan\n\n**Letter Content:**\n\nFramed as honors and trust:\n- Juan's experience valuable to Rodrigo\n- Enrique's tactical skill needed where main battle expected\n- Both given clear orders and roles\n- Emphasized opportunity and glory\n\n**Álvaro's Assessment:**\n\nLetters well-crafted:\n- Matched each Infante to what he values\n- Juan gets responsibility, recognition of wisdom\n- Enrique gets glory, battle, cavalry charges\n- Both will feel honored rather than sidelined\n\n**Current Location:**\n\nBoth Infantes in Seville:\n- Working with Rodrigo and crusader force\n- Enrique drilling troops, sharing tactical knowledge\n- Juan helping coordinate supplies, logistics\n- Both entirely cooperative per Rodrigo's reports\n- Attending daily Mass with crusaders\n\nLetters to reach them in ~10 days, giving 6 weeks before wedding to understand roles.\n\n### Staggered Deployment Strategy\n\n**Juan's Strategic Insight:**\n\nEastern army moves first, western army delays slightly to:\n- Make Sultan commit to eastern front\n- Hide western naval preparations longer\n- Create dilemma Granada can't solve even if discovered\n\n**Álvaro's Enthusiasm:**\n\nRecognized brilliance of approach:\n\n**Phase 1:**\n- Eastern army (23,000) musters visibly on frontier\n- Banner and relics prominently displayed\n- Juan leading personally\n- Granada's intelligence sees it immediately\n- Every spy reports: \"Crusade coming through center\"\n\n**Phase 2:**\n- Sultan must respond to threat to heartland\n- Concentrates forces, prepares defenses\n- Calls reinforcements from Africa\n- All attention focused east\n\n**Phase 3:**\n- Western army assembles quietly in Seville\n- Could be supply operations for eastern campaign\n- Genoese galleys arrive (normal merchant traffic)\n- By time Granada realizes naval invasion...\n- Too late, Sultan committed east\n- Rodrigo landing on western shore\n\n**The Dilemma:**\n\nGranada must choose:\n- Abandon eastern defense to protect coast\n- Split forces (risk defeat in detail)\n- Commit fully east, accept losing western ports\n- Every choice is bad\n\n### Communication System\n\n**Relay Stations Established:**\n\nFour-station system for two-day message delivery:\n1. Jaén → Córdoba\n2. Córdoba → Écija\n3. Écija → Carmona\n4. Carmona → Seville\n\nFresh horses and riders at each station.\n\n**Operational Phases for Western Army:**\n\n**Phase 1 - Preparation:**\n- Assemble quietly in Seville\n- Coordinate Genoese fleet arrival\n- Expel Muslim merchants and suspicious persons\n- Light overland patrols (appear normal)\n- Keep naval preparations low-profile\n- Ready to launch on short notice\n\n**Phase 2 - Activation:**\n- Juan determines Sultan committed to east\n- Fast courier carries: \"Launch western operations\"\n- Rodrigo has discretion on exact timing\n- Must move within days of signal\n\n**Phase 3 - Execution:**\n- Full naval invasion begins\n- Systematic coastal conquest\n- Ongoing relay coordination\n\n**Command Clarity:**\n\n1. **Commitment Definition:** Juan will determine personally when Sultan committed (he'll be with eastern army)\n\n2. **Operational Freedom:** Rodrigo determines actual landing timing, targets, methods - has full operational discretion to achieve objectives\n\n3. **Ongoing Communication:** Relay system maintained throughout campaign for coordination\n\n**Álvaro's Summary:**\n\n\"Strategic direction from you, operational freedom for your commanders, communication maintained for coordination... That's strategic mastery, Your Majesty—not hoping the enemy makes mistakes, but forcing them into situations where every option costs them dearly.\"\n\n### Packet to Rodrigo\n\n**Contents Being Prepared:**\n- Full western army budget\n- Operational directives\n- Infante Juan letter and role explanation\n- Three administrators (quartermaster, Vatican financial overseer, logistics coordinator)\n- Coordination protocols with Genoese\n- Letters of authority with royal and legatine seals\n- Relay system information\n\n**Martín de Córdoba:**\n\nRecommended as senior quartermaster:\n- 5 years managing crown supply contracts\n- Knows every merchant and supplier in Andalusia\n- Utterly incorruptible\n- Perfect for Rodrigo's needs\n\n**Departure:** Party to leave following afternoon.\n\n---\n\n## PART VI: EVENING WITH ISABEL (January 30, Evening)\n\n### Initial Interaction\n\nJuan found Isabel in Portuguese chapel, praying for the crusade. She'd been thinking about their future family, had received letter from her mother.\n\n**Mother's Letter:**\n\nIsabel's mother:\n- Proud of her\n- Praying for them\n- Hopes for many children\n\n### The Difficult Conversation\n\n**Juan's Practical Approach:**\n\nWhen Isabel shared her fears about having children and being a good wife, Juan responded:\n- \"I hope and pray that you will be a good wife and be able to serve me and the crown.\"\n- \"We will see what happens.\"\n- Mentioned she was very pious and devout\n- Asked about her mother visiting\n\n**Isabel's Reaction:**\n\nWithdrew emotionally:\n- Hand pulled away\n- Vulnerability retreated\n- Voice became dutiful and flat\n- Hurt visible in her eyes\n\n**The Revelation:**\n\nWhen Juan mentioned she'd travel with the army until pregnant (kingdom needs heir, can't afford to wait), Isabel's composure cracked. She rose to leave, clearly wounded.\n\n**Juan's Confusion:**\n\nHe noticed something wrong but didn't understand what he'd said to upset her.\n\n### Isabel's Breaking Point\n\nWhen Juan stopped her and asked what was wrong, Isabel's emotions poured out:\n\n**Her Pain:**\n\nShe'd opened her heart:\n- Shared fears about being wife and mother\n- Asked if he thought about their children\n- Offered vulnerability\n\nHis response:\n- Hope she can serve crown\n- \"We'll see what happens\"\n- Announcement she'd travel with army until pregnant (not because he wants her, but because kingdom needs heir)\n\n**Isabel's Words:**\n\n\"I opened my heart to you. I told you I was frightened... and you said you hope I'll be able to serve you and the crown. That we'll see what happens... You told me I'll travel with the army until I'm pregnant. Not because you want me with you, but because the kingdom needs an heir and you can't afford to wait.\"\n\n\"I know duty is important. But for a moment, I thought maybe you...\" (couldn't finish)\n\n**Her Plea:**\n\n\"I'm trying so hard, Juan. To be brave, to be a good queen, to do everything right. But sometimes I just want...\" (shook head) \"I don't know what I want.\"\n\n### Juan's Response and Reconciliation\n\n**The Embrace:**\n\nJuan pulled her into embrace, recognizing his error:\n- \"Military planning all day makes me a bit practical.\"\n- \"Sometimes I forget you are not just a soldier that I am ordering around.\"\n- Admitted he doesn't know God's plans about children\n- Noted bright side: they'd be together longer\n\n**The Promise:**\n\nJuan committed: \"Every evening when we are together, I will always make time to pray with you together. That way we can share our concerns and our hearts together, without anyone else.\"\n\n**Isabel's Deeper Fears:**\n\nShe shared comprehensive worries:\n- Terrified of failing to have children\n- Afraid of traveling with army (never lived in military camp)\n- Worried about being in soldiers' way\n- Feared being resented\n- Concerned that after marriage he'd stop seeing her\n- Worried he'd just be thinking about battles during prayer\n- Felt inadequate (not clever like advisors, not brave like crusaders)\n- Just wanted to matter as Isabel, not just as alliance or potential heir-bearer\n\n**The Misunderstanding:**\n\nJuan expressed confusion, saying he'd told her many times he'd fallen in love with her, mentioned looking forward to being with her, wanting to spend evenings together.\n\n**Isabel's Correction:**\n\nShe gently pointed out he'd never said he was in love with her:\n- At dinner he said they'd \"do well enough together\"\n- He'd been kind and considerate\n- But these weren't words of a man in love\n\nShe asked him not to make her feel like she was failing to see something that wasn't there.\n\n### The Confession\n\n**Juan's Past Love:**\n\nJuan revealed he'd been in love once before during his pilgrimage:\n- Girl not of royal blood\n- Never told her his feelings\n- She never knew\n- He's put her behind him\n- His sister María knows the story\n\n**Isabel's Shock:**\n\nBrief pain that someone else had been there first, but then understanding:\n- He loved someone and let her go for duty\n- Must have been hard\n- Relieved nothing happened\n- But feared she was \"second choice—the duty, not the desire\"\n\n**Mutual Understanding:**\n\nBoth acknowledged they feel inadequate in love:\n- Juan: \"I have no problems commanding armies or convincing nobles, but I feel so inadequate if it comes to matters of love.\"\n- Isabel: \"I feel like a complete fool when it comes to love. I have no idea what I'm doing.\"\n\n**Shared Sacrifice:**\n\nIsabel recognized parallel:\n- Juan gave up someone he loved for duty/kingdom\n- She left everything in Portugal for same reasons\n- Maybe that makes them right for each other\n- Both understand sacrifice\n\n### Clarification and Hope\n\n**The Forgotten Love:**\n\nJuan realized when discussing being in love, he'd forgotten about that other girl:\n- \"Maybe that says something about what you mean to me and that I have forgotten about that other girl?\"\n\n**Isabel's Joy:**\n\nThis meant everything to her:\n- When he thinks about love now, he thinks of Isabel, not the other girl\n- She matters to him in present, not just as duty\n\n**Planning for Travel:**\n\nJuan offered to discuss military camp travel with Dona Beatriz and others, to plan properly and ease Isabel's fears. Isabel enthusiastically agreed - practical planning would help her feel prepared rather than frightened.\n\n### The Garden Walk\n\n**The Armor Description:**\n\nJuan described his white armor:\n- Milan plate with white plume\n- Banners streaming behind on poles\n- All white with shield and lance\n- Arriving at wedding in this armor\n\n**Isabel's Reaction:**\n\n- \"You'll look like an angel... like Saint Michael himself\"\n- Worried about him being target\n- Made him promise to be careful and keep guards close\n- Delighted about the dramatic wedding entrance\n\n**The Intimate Moment:**\n\nJuan: \"I wish I could hold you and comfort you and never let you go. But that would be improper now. Hopefully after the wedding this will be different.\"\n\nIsabel's response: Breath caught, eyes shining, blushing - \"After the wedding. Yes. After the wedding.\"\n\n**Evening Plans:**\n\nAgreement to discuss travel planning next day with Donnas and Álvaro. Discussion of her guards (Sancho and three others) who'd been wonderful, would continue with her on campaign.\n\n---\n\n## PART VII: SUBSEQUENT DAYS (January 31 - February 14)\n\n### Travel Planning\n\nJuan, Isabel, Álvaro, and Portuguese ladies met to plan campaign travel:\n- Dona Beatriz's practical expertise invaluable\n- Detailed logistics: what Isabel needs in camp, quarters arrangement\n- How to maintain dignity and comfort with army\n- Four guards (Sancho's team) confirmed as permanent escort\n- Planning gave Isabel confidence and reduced fear\n\n### Noble Arrivals\n\nToledo filled daily with arriving nobles:\n- Bringing levies, supplies\n- Accepting crusade taxation\n- Word spread from Mendoza, Enríquez, Guzmán audiences\n- King fair, papal oversight real, resistance futile and dangerous\n- Great houses responding favorably\n\n### Armor Progress\n\nMaster Gonzalo worked continuously:\n- Juan returned for fittings every three days\n- Magnificent white-plumed harness taking shape\n- Armorer's masterwork and pride evident\n- On track for wedding deadline\n\n### Guardian Company Development\n\n50 crusaders drilled and planned under Fray Hernando:\n- Procedures for protecting relics and banner\n- Travel protocols\n- Battle operations\n- Separation of banner from relics strategies\n- Brotherhood strengthening\n- Absolute devotion maintained\n\n### Pedro González's Preparation\n\nMaster of Calatrava spent week in Toledo:\n- Intensive work with Tommaso on logistics\n- Strategy for eastern army\n- Map study\n- Supply calculations\n- Learning to manage 23,000 troops\n- Left for frontier with confidence and purpose\n\n### Rodrigo's Packet\n\nComprehensive orders departed for Seville:\n- Budget and operational directives\n- Infante Juan letter and role\n- Three administrators assigned\n- Relay system details\n- Coordination protocols\n- Two days to reach Rodrigo\n\n### Daily Prayer\n\nJuan and Isabel met every evening in Portuguese chapel as promised:\n- Sharing concerns, hopes, fears\n- Building genuine partnership\n- Growing mutual respect\n- Fragile beginnings of love\n- Isabel gaining confidence daily\n\n### Crusader Recruitment\n\nContinued acceleration:\n- Men arriving daily to take oath\n- Touch relics\n- Join white-tabarded company\n- Approaching 250 sworn crusaders by wedding\n\n### City Atmosphere\n\nToledo bursting:\n- Every inn, noble house, space filled\n- Visitors for wedding and crusade announcement\n- Religious fervor\n- Sense of momentous beginning\n- Anticipation building\n\n### Armor Delivery\n\nThree days before wedding:\n- Master Gonzalo delivered completed armor\n- Juan donned it first time\n- Polished Milan plate, white-plumed helmet, tabard over gleaming steel\n- Even Álvaro struck silent\n- Looked like angel of war\n- Master of Calatrava's prediction: accurate\n\n### Final Evening (February 14)\n\n**Juan's Private Prayer:**\n\nAlone in banner chamber:\n- Before relics and father's sword\n- Seeking guidance for what lay ahead\n- Tomorrow: marriage\n- Tomorrow: public crusade proclamation to all nobility\n- Tomorrow: everything changes\n\n**The Certainty:**\n\nIn that quiet moment, Juan felt it again:\n- Deep conviction (not voice or vision)\n- Where God needed him to be\n- Doing what meant to do\n- Ready for what came next\n\n**The Reconquista's final chapter about to begin.**\n\n---\n\n## STATUS AT CHAPTER END\n\n**Date:** February 14, 1431, Evening  \n**Location:** Royal Alcázar, Toledo\n\n### Political Situation\n\n**Noble Support:**\n- All major houses committed to crusade\n- House Mendoza: 1,800 levies, Pedro taking crusader oath\n- Admiral Enríquez: Naval expertise offered, assessment accepted\n- Master of Santiago: 2,000 knights, full Order commitment\n- Master of Calatrava: 1,500 knights, commanding eastern army\n- Taxation grudgingly but firmly accepted\n- Word spread: king fair, oversight real, resistance dangerous\n\n**Military Orders:**\n- Santiago fully aligned (Don Luis as eastern advisor)\n- Calatrava fully aligned (Pedro González commanding east)\n- Alcántara likely to follow (Master requesting audience)\n- All three Orders integrated into crusade structure\n\n**Popular Support:**\n- Unprecedented levels\n- Religious fervor across kingdom\n- Banner and relics legendary\n- Crusade seen as sacred mission\n- Toledo filled with enthusiastic visitors\n\n**Portuguese Alliance:**\n- Secured through marriage\n- Isabel gaining confidence\n- Building genuine partnership with Juan\n- Mother to visit autumn (hopefully for grandchild's birth)\n\n### Military Preparations\n\n**Eastern Army (23,000 troops):**\n- Commander: Don Pedro González de Padilla (Master of Calatrava)\n- Senior Advisor: Don Luis de Guzmán (Master of Santiago)\n- Tactical Commander: Infante Enrique de Aragón\n- Comprehensive logistics prepared\n- Budget: 35,276 florins (approved)\n- Forward supply bases planned\n- 3,000 cavalry raiders organized\n- Don Luis mentoring from behind lines\n\n**Western Army (12,000 troops):**\n- Commander: Rodrigo Manrique\n- Senior Advisor: Infante Juan de Aragón\n- Naval support: Genoese galleys + Portuguese ships\n- Budget: ~75,000+ florins (approved)\n- Systematic coastal conquest plan\n- Staggered deployment strategy\n- Awaiting activation signal from Juan\n\n**Crusader Force:**\n- ~250 sworn crusaders\n- Guardian Company: 50 elite protecting relics/banner\n- Procedures developed for travel and battle\n- Brotherhood and devotion absolute\n- White tabards with red crosses\n- Growing daily\n\n**Strategic Coordination:**\n- Relay system established (Jaén-Córdoba-Écija-Carmona-Seville)\n- Two-day message delivery\n- Staggered deployment: East moves first, west on signal\n- Communication maintained throughout campaign\n- Rodrigo has operational freedom within objectives\n\n### Financial Status\n\n**Available Resources:**\n- Treasury: 390,200 florins\n- Campaign budget (both armies): 143,171 florins approved\n- Surplus after campaign: 247,000+ florins\n- Taxation revenue to flow during campaign (24,000-38,000 florins)\n- Multiple funding sources secured\n- Comprehensive oversight in place\n\n**Assessment Program:**\n- 43 trained crown assessors ready\n- ~12 ecclesiastical observers from Capranica\n- Joint teams to ensure fairness\n- Focus on major houses first\n- 2-3 months for complete assessments\n- Revenue June-October 1431\n\n### Personal Relationships\n\n**Juan & Isabel:**\n- Building genuine partnership\n- Based on shared faith and mutual respect\n- Daily prayer together as promised\n- Fragile beginnings of love growing\n- Travel plans made, Isabel's fears addressed\n- Will travel with army until pregnant\n- Both understanding sacrifice and duty\n- Honest about inadequacies in love\n\n**Juan & Álvaro:**\n- Strong working partnership\n- Trust and capability demonstrated\n- Strategic planning exceptional\n- Álvaro managing complex preparations flawlessly\n\n**Juan & Military Orders:**\n- Transformed relationships\n- From political tension to genuine partnership\n- Masters seeing sacred purpose restored\n- Commitment absolute\n\n**Juan & Nobility:**\n- Growing respect and acceptance\n- Fair treatment building support\n- Clear authority established\n- Papal backing providing legitimacy\n\n### Wedding Plans (February 15, 1431)\n\n**Ceremony:**\n- Full High Mass with Queen's coronation\n- Cardinal Capranica officiating\n- Cathedral of Toledo\n- 3+ hours ceremony\n- Morning start (9:00 AM)\n\n**Dramatic Elements:**\n- Juan arriving in white armor on horseback\n- White plume, banners streaming\n- Banner and relics unveiled during ceremony\n- Public procession through Toledo streets\n- Isabel crowned as Queen Consort\n\n**Announcements:**\n- Crusade taxation details revealed\n- Crusader recruitment appeal\n- Public display of banner for veneration\n- Assessment program explained\n\n**Symbolism:**\n- Papal legate officiating\n- Sacred and political combined\n- Royal-papal cooperation demonstrated\n- Strength shown to potential opponents\n- Popular enthusiasm channeled\n\n**Security:**\n- Guardian Company escorting relics\n- Juan's personal guards\n- Isabel's guards (Sancho's team)\n- City watch maintaining order\n\n### Campaign Timeline\n\n**Immediate (Post-Wedding):**\n- Crusader recruitment surge expected\n- Noble levies begin mustering\n- Final preparations accelerate\n- Equipment procurement continues\n\n**Spring 1431 (April-May):**\n- Eastern army musters on frontier\n- Banner and relics move east with Juan\n- Western army assembles quietly in Seville\n- Assessment teams deploy across Castile\n\n**Campaign Season (April-November 1431):**\n- Eastern army advances through center\n- Western army launches on Juan's signal\n- Systematic operations both fronts\n- Granada forced into impossible strategic position\n- 8-month sustained campaign\n\n### Key Themes\n\n**Strategic Mastery:**\n- Forcing enemy into dilemmas\n- Not relying on surprise alone\n- Comprehensive planning and logistics\n- Clear command structure with operational freedom\n\n**Political Maturity:**\n- Juan balancing firmness with grace\n- Offering redemption alongside authority\n- Building genuine partnerships\n- Fair treatment building loyalty\n\n**Sacred and Secular:**\n- Religious devotion genuine, not mere politics\n- But used strategically for maximum effect\n- Banner and relics as both spiritual and political power\n- Crusade as authentic faith and calculated strategy\n\n**Personal Growth:**\n- Juan learning to navigate love and duty\n- Isabel finding confidence and voice\n- Both admitting inadequacies\n- Building something real through honesty\n\n**The Machinery of War:**\n- Logistics as foundation of victory\n- Professional preparation unprecedented\n- Comprehensive systems and procedures\n- Nothing left to chance\n\n---\n\n## LOOKING AHEAD TO CHAPTER 13\n\n**The Royal Wedding:**\n- Juan's dramatic arrival in white armor\n- Banner and relics unveiled\n- Isabel crowned Queen\n- Crusade proclaimed\n- Nobility's response\n- Popular reaction\n- New crusaders swearing oaths\n\n**Immediate Aftermath:**\n- Consummation and beginning of married life\n- Final campaign preparations\n- Armies beginning to muster\n- Assessment program deployment\n- Last moments before war\n\n**The Campaign Begins:**\n- Eastern army movement\n- Juan with banner to frontier\n- Western army holding position\n- Strategic chess game commencing\n- The Reconquista's final push\n\n---\n\n**END OF CHAPTER 12: THE RECKONING**\n\nThe summary document has been created successfully in canvas. It's a comprehensive summary of all the events in Chapter 12, covering:\n\n1. The three noble audiences (Mendoza, Enríquez, Guzmán)\n2. The armor commissioning with Master Gonzalo\n3. Addressing the Guardian Company\n4. The Master of Calatrava audience and command appointment\n5. Strategic planning with Álvaro\n6. The evening with Isabel (the difficult conversation and reconciliation)\n7. The subsequent days of preparation\n8. Status summary and looking ahead\n\nThe document is extensive and detailed, capturing all the major events, dialogue, strategic decisions, and character development from this chapter.\n\nI've created a comprehensive summary document of Chapter 12 in the canvas. The document captures all the major events from this session:\n\nThe three noble audiences (Mendoza, Enríquez, and Guzmán)\n\nJuan's white armor commissioning\n\nAddressing the Guardian Company of 50 crusaders\n\nThe Master of Calatrava's appointment to command the eastern army\n\nStrategic planning with Álvaro for the staggered deployment\n\nThe difficult but ultimately healing evening conversation with Isabel\n\nThe subsequent two weeks of preparation leading to the wedding\n\nThe summary includes detailed political developments, military preparations, personal relationships, and sets up perfectly for Chapter 13 which will begin with the royal wedding."
        }
      ],
      "roll": null
    }
  ]
}