{
  "chapter": "1.14",
  "book": 1,
  "event_count": 7,
  "date_range": "1431-02-22 / 1431-03-12",
  "events": [
    {
      "event_id": "evt_1431_00084",
      "book": 1,
      "chapter": "1.14",
      "date": "1431-02-22",
      "end_date": null,
      "type": "military_action",
      "summary": "One week after wedding. Isabel relationship roll: 31 (Comfortable and Dutiful) — genuine fondness growing, feels safe and content, not fiery passion but steady warmth. Pregnancy roll: 52 (Early March Conception — will conceive ~4 weeks from now). Juan inspects crusader encampment outside Toledo: 267 sworn crusaders in Toledo (50 original + 217 new recruits), 101 in Seville, 368 total. Captain García Fernández reports 53 new arrivals this week, projecting 400 by month's end. Juan orders force division: Seville crusaders to western army under Rodrigo, Toledo crusaders to eastern army under banner. Emphasizes quality over quantity — only combat-ready men march in April, rest continue training and join in waves. Inspects artillery: Master Gunner Pietro Calabrese (Italian from Milan) commands 5 medium bombards with 30 crew. Juan redirects artillery from western to eastern army. Pietro needs extra oxen, infantry protection, weather-proof powder transport. Departure for Jaen: March 5-10, arrival by month's end.",
      "characters": [
        "juan_ii",
        "isabel_of_portugal",
        "garcia_fernandez",
        "pietro_calabrese",
        "fray_hernando"
      ],
      "factions_affected": [],
      "location": "Toledo",
      "tags": [
        "military",
        "inspection",
        "artillery",
        "crusade",
        "personal",
        "roll"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "I and Isabel have just had our first wedding night. I have taken care to make her feel comfortable and loved. During the coming weeks, we have intercourse many times as we can now finally be intimate.\n\n\nIgnoring any sexual content, I want to roll on a d100 table to generate a historically accurate response from Isabel to this aspect of married life. How is her feelings towards Juan developping given everything that has happened before? Also ignore her getting pregnant or not, just fucus on the relationship aspect, given that she is fifteen and Juan is eighteen.\n\n\nCan you do this?"
        },
        {
          "role": "gm",
          "text": "This is part of the RPG we're playing set in 1430 Castile. Let me recall the context:\n- Juan II is 18, Isabel is 15\n- They just had their first wedding night (Chapter 14)\n- Juan took care to make her comfortable and loved\n- They've been intimate many times over the coming weeks\n- The user wants to focus on relationship development, not pregnancy\n- This should be historically accurate for a 15th century royal marriage\n\nI can absolutely do this! Let me first search the project knowledge to understand the full context of Juan and Isabel's relationship leading up to this point, then I'll create a historically appropriate d100 table.\n\n1. **Pre-wedding context:**\n- Juan was originally in love with Isabel Ruiz (a converso merchant's daughter) during his pilgrimage, but gave her up for duty\n- He married Princess Isabel of Portugal for political alliance\n- Princess Isabel is 15, Juan is 18\n- She's described as plain (rolled 41 appearance, 48 personality), conventionally pious, dutiful, not independently minded\n- She was nervous, sheltered, missing her family\n- Their relationship started awkwardly as neither expected to be partners in statecraft\n\n2. **Before the wedding:**\n- Juan tried to make her comfortable through shared faith\n- He took her to see the relics and they prayed together, which created a genuine connection\n- He promised to remodel the Toledo chapel in Portuguese style\n- She found security in clear expectations and religious devotion\n- In Chapter 12, their relationship deepened significantly - he confessed about the other Isabel, she realized they both sacrificed for duty\n- She became emotionally invested when he forgot about the other girl\n- They had a romantic moment in the garden where he said he wished he could hold her\n- She responded with breath caught, eyes shining, blushing: \"After the wedding. Yes. After the wedding.\"\n\n3. **Their wedding (Chapter 14):**\n- Just had their first wedding night\n- Juan took care to make her comfortable and loved\n- They've been intimate many times over the weeks following\n- She's 15, he's 18\n\nSo now I need to create a d100 table for how Isabel is responding emotionally to the intimate aspect of married life, given:\n- She's a 15-year-old sheltered Portuguese princess\n- She was nervous but had developed genuine feelings for Juan before the wedding\n- She's conventionally pious and dutiful\n- Juan has been considerate and loving\n- This is 15th century, so expectations are different\n- She understands sacrifice and duty\n\nHer anticipation builds from a mix of youthful excitement and carefully nurtured emotional connection. The garden moment crystallized her growing feelings, transforming nervous energy into hopeful expectation. Her sheltered upbringing meets genuine affection, creating a complex emotional landscape of desire tempered by religious and social expectations.\n\nI'll analyze the potential emotional responses, weighing her personal development against societal constraints. The romantic tension they've built provides a foundation for her emerging feelings, balancing her dutiful nature with genuine emotional investment.\n\nPerfect! I have the full context. Let me create a historically accurate d100 table for how Isabel of Portugal (age 15) is responding emotionally to the intimate aspects of married life with Juan (age 18) over these weeks.\n\nEvaluation: Factors Affecting Isabel's Emotional Response\n\nFactors in Favor (Supporting Positive Development):\n\nJuan's considerate approach - He made her feel \"comfortable and loved\" on their wedding night, not just taking what was his right\n\nPre-existing emotional connection - She already had developing feelings (\"After the wedding. Yes. After the wedding.\" with shining eyes)\n\nShared faith foundation - Their relationship is grounded in mutual piety and prayer\n\nThe \"forgotten love\" moment - She knows he now thinks of her, not the other Isabel, when he thinks of love\n\nHer dutiful nature - She wants to fulfill her role properly and please her husband\n\nMedieval context - Physical intimacy is expected duty, normalized in her understanding\n\nYouth and emotional capacity - At 15, she's capable of being swept up in new feelings\n\nFactors Against (Limiting Extreme Positivity):\n\nAge and inexperience - She's only 15, sheltered in convents, entirely new to physical intimacy\n\n\"Many times\" - The frequency might be overwhelming for someone so inexperienced\n\nPhysical realities - Medieval women's first experiences were often painful; even with consideration, there's adjustment\n\nHer insecurity - She's plain (rolled 41), might worry she's inadequate\n\nPiety and pleasure tension - Conventional piety might create guilt about enjoying intimacy \"too much\"\n\nNot independently minded - She processes emotions through duty/expectation rather than self-discovery\n\nMissing her mother - No female guide to help her understand these new feelings\n\nCultural modesty - 15th century noblewomen were taught to be modest about physical desires\n\nD100 Table: Isabel's Emotional Response to Marital Intimacy\n\n1-5: Overwhelmed and Retreating\nIsabel finds the frequency and intensity overwhelming despite Juan's kindness. She becomes anxious, performing her duty but withdrawing emotionally. She prays more, seeks refuge in familiar rituals, and becomes quieter around Juan. Not traumatized, but needing space to process that she's not getting.\n\n6-15: Dutiful but Disconnected\nIsabel fulfills her marital obligations properly and without complaint, but treats intimacy as exactly that—an obligation. She's polite, accommodating, even tries to please Juan, but shows no particular emotional engagement beyond duty. The physical aspect hasn't opened her heart further; it's simply another royal responsibility she performs adequately.\n\n16-30: Slowly Adjusting\nIsabel is still adjusting to the physical realities of married life. She's not distressed, but not particularly enthusiastic either. Some discomfort remains. She appreciates Juan's consideration and is gradually becoming more comfortable, but the frequency leaves her little time to fully process each encounter. She's in transition—not unhappy, but not yet finding joy in it either. Needs more time.\n\n31-50: Comfortable and Dutiful\nIsabel has adjusted well to married life. The physical intimacy is no longer strange or uncomfortable. She fulfills her duties willingly and finds comfort in Juan's affection, even if she doesn't experience overwhelming passion. She's content, feels safe with him, and appreciates his gentleness. Their relationship is warm and functional. She's developing genuine affection—not fiery love, but steady, growing fondness. A solid foundation.\n\n51-70: Awakening Affection\nIsabel is surprised to discover she genuinely enjoys Juan's touch and attention. The physical intimacy has deepened her emotional attachment significantly. She finds herself thinking about him during the day, looking forward to evening, feeling a flutter when he enters a room. She's still modest and wouldn't speak of such things, but she's falling in love—not just with the idea of her husband-king, but with Juan himself. She initiates small touches now, holds his hand longer, meets his eyes with shy warmth.\n\n71-85: Blossoming Devotion\nIsabel has fallen deeply for Juan. The combination of his consideration, their shared faith, and the intimate bond they're building has transformed her from dutiful bride to genuinely devoted wife. She seeks his company, lights up when he's near, and the physical aspect of their marriage has become something she actively desires, though she'd be mortified to admit it aloud. She prays thanking God for her husband. Her plain features seem brighter, more animated. She's discovering passion within her dutiful nature.\n\n86-95: Deep Love Emerging\nIsabel is experiencing something she never expected—genuine, deep romantic love. Juan's tenderness has unlocked something in her heart. She's not just content or affectionate; she's ardently attached to him. She thinks of him constantly, worries when he's away even briefly, feels almost physical pain at separation. The intimate aspect of their marriage has revealed depths of feeling she didn't know she possessed. She would never speak of it (modesty forbids), but she burns for him. Her prayers now include passionate gratitude for this unexpected gift.\n\n96-100: Transformative Love\nAgainst all expectations of an arranged marriage, Isabel has fallen completely, overwhelmingly in love with Juan. The weeks of intimacy combined with his genuine care have transformed her utterly. The plain, dutiful Portuguese princess has discovered she's capable of passionate devotion. She finds courage she didn't know she had, speaks more freely with him, even offers opinions tentatively. The physical intimacy has become sacred to her—a profound expression of their bond. She would follow him anywhere, do anything for him. This isn't just fulfilling duty; this is the great love of her life, and she knows it.\n\nInstructions: Roll your physical d100 and report the result. I'll then narrate Isabel's emotional state and how it manifests in her behavior toward Juan during these weeks."
        },
        {
          "role": "player",
          "text": "I rolled 31, so Comfortable and Dutiful. \nA week after our wedding, we awaken one morning and I initiate intimacy with her again. When I am done, I hold her.\n\n\nI love you Isabel. This is how I imagined married life to be. How do you like being married?"
        },
        {
          "role": "gm",
          "text": "Her response should reflect:\n1. Genuine warmth and growing affection\n2. Modest pleasure at his declaration\n3. Her dutiful nature - she wants to please him\n4. Some shyness about discussing intimate matters\n5. Contentment with how things are going\n6. Her conventional piety might frame her happiness in religious terms\n7. She's 15, sheltered, not eloquent about emotions\n8. She'd be honest but measured\n\nI should narrate this in the novel-like style requested, showing her physical responses, internal state, and then her actual words. This is an intimate, tender moment between them.\n\nMorning Light in the Royal Bedchamber\nToledo, Late January 1431\nOne Week After the Wedding\n\nThe winter morning light filters through the heavy curtains, casting the bedchamber in soft grays and golds. Isabel lies in Juan's arms afterward, still catching her breath, her dark hair loose across the pillows. She's grown accustomed to these moments over the past week—the initial strangeness has faded, replaced by a quiet comfort in his presence, in his touch.\n\nWhen Juan says he loves her, she feels a small flutter in her chest—pleasure, warmth, a sense of being valued. She's not overwhelmed by passion, but there's genuine fondness growing in her heart, like a plant taking root in good soil.\n\nShe turns her head slightly to look at him, her plain features soft in the morning light. A small, shy smile touches her lips. Her hand finds his where it rests on her waist, her fingers curling around his gently.\n\n\"I... I am content, my lord,\" she says quietly, her voice carrying that careful modesty she was raised with. \"More than content. You have been so kind to me. So gentle.\"\n\nShe pauses, gathering her thoughts. Speaking about such intimate matters makes her blush, but Juan's question deserves an honest answer.\n\n\"I prayed for months about this marriage,\" she continues, her thumb tracing small circles on the back of his hand. \"I was frightened, leaving Portugal. Frightened of... all of this.\" A delicate gesture that encompasses the bed, their intimacy, her new life. \"But God has been merciful. You have been merciful.\"\n\nHer eyes meet his—earnest, warm, if not quite burning with passion. \"I like being your wife, Juan. I like waking beside you. I like our evening prayers together. I like...\" she colors slightly, but presses on with characteristic dutiful honesty, \"...I like when you hold me, as you are now.\"\n\nShe shifts closer, resting her head against his shoulder with a small sigh of contentment. \"I think we shall do well together. Better than well.\" A pause. \"I am... I am happy. Truly.\"\n\nIt's clear she means it. This is not fiery, all-consuming love—not yet, perhaps not ever—but it's real affection, growing trust, genuine fondness. For a girl raised on duty and devotion, this warmth and safety is more than she dared hope for from an arranged marriage.\n\nWhat does Juan say or do?"
        },
        {
          "role": "player",
          "text": "Now, given our relationship, draft a table d100 to determine if and when she will get pregnant. Lets not move past may in the current timeline. What are the chances she gets pregnant before then?"
        },
        {
          "role": "gm",
          "text": "Frequent intimacy (\"many times\" over weeks)\n\nNo known fertility issues\n\nGood nutrition (royal diet)\n\nMedieval expectations: first pregnancy often within 3-6 months\n\nHistorical parallel: Many royal brides pregnant within first few months\n\nFactors Against/Delaying:\n\nIsabel's age (very young, body still maturing despite fertility)\n\nStress of new marriage, new country, upcoming crusade\n\nMedieval infant/pregnancy loss rates (though this is about conception, not outcome)\n\nSimple chance - even healthy couples don't always conceive immediately\n\nTravel and disruption (if crusade preparations involve movement)\n\nThe Table\n\n1-5: No Pregnancy by May\nDespite their youth and frequency, Isabel does not conceive by May 1431. This is unusual but not impossible - sometimes it just takes longer, even for healthy young couples. No signs of pregnancy as May ends. They remain hopeful but Isabel begins to worry privately if something is wrong with her.\n\n6-15: Very Late Conception (Late April/Early May)\nIsabel conceives in late April or early May. By the end of May, she has missed one period and is beginning to suspect, but it's too early to be certain. She feels slightly nauseated some mornings but attributes it to anxiety about the crusade. Won't be confirmed until June/July.\n\n16-35: Late March Conception\nIsabel conceives in late March. By mid-to-late May, she has missed two periods and is fairly certain she's pregnant, though she hasn't told Juan yet—waiting to be absolutely sure. Some morning sickness, breast tenderness, fatigue. She'll confirm it with him in early June, about 10-11 weeks along.\n\n36-60: Early March Conception\nIsabel conceives in early March, about 4-5 weeks after the wedding. By April she misses her first period; by May she's missed two and is experiencing clear symptoms: nausea, fatigue, breast changes. She tells Juan in late April/early May, around 8-10 weeks pregnant. Confirmed pregnancy well before crusade departure.\n\n61-80: Late February Conception\nIsabel conceives in late February, within 3-4 weeks of the wedding. By late March/early April she knows she's pregnant (missed periods, symptoms). She tells Juan in mid-April. By May she's 12-14 weeks along—pregnancy clearly established, past the most dangerous early weeks. Beginning to show slightly. This affects crusade planning significantly.\n\n81-92: Mid-February Conception\nIsabel conceives within 2-3 weeks of the wedding (mid-February). By late March she's certain; tells Juan in early April. By May she's 14-16 weeks along and definitely showing. Quickening (feeling movement) may occur in late May. Pregnancy well-established. Major factor in crusade decisions—does she travel to camp? Stay in Toledo?\n\n93-98: Early February Conception (Immediate)\nIsabel conceives within the first week of marriage (what we're currently playing). By mid-March she suspects; by late March/early April she knows. Tells Juan in April. By May she's 16-18 weeks along, clearly pregnant, possibly feeling movement. This is very fast but not unheard of historically. Significantly impacts all spring crusade plans.\n\n99-100: Wedding Night/First Week Conception (Confirmed Early)\nIsabel conceived on or immediately after the wedding night. She has strong early symptoms—by mid-March she's quite certain. Tells Juan in late March. By May she's 18-20 weeks along, visibly pregnant, definitely feeling movement. Medieval midwives would confirm \"quickening.\" This rapid conception would be seen as divine blessing on the marriage and crusade. Dramatically affects campaign planning.\n\nHistorical Context Notes:\n\nMedieval pregnancy detection relied on missed periods (2-3 cycles for certainty), physical symptoms, and \"quickening\" (fetal movement felt around 16-20 weeks)\n\nFirst-time mothers often took longer to recognize quickening\n\nGiven their frequency and youth, conception within 2-4 months is historically very likely (60-80% range reflects this)\n\nA pregnancy not occurring by May (6-15% chance) would be concerning but not medically alarming yet\n\nAny pregnancy confirmed by May would significantly impact crusade logistics—does Isabel travel to camp, or remain in Toledo?\n\nRoll your d100 to determine the pregnancy timeline (or lack thereof) through May 1431."
        },
        {
          "role": "player",
          "text": "I rolled early march conception (I rolled 52). Lets keep this in mind as we move forward.\n\n\nI kiss Isabel and get out of bed. I get ready to inspect the crusaders who have swollen in numbers quite a bit lately."
        },
        {
          "role": "gm",
          "text": "Currently we're one week after the wedding, so we're in early February 1431. Isabel is not yet pregnant but will conceive in early March (about 4 weeks from now).\n\nJuan is getting up to inspect the crusaders. According to the project documents, at the end of Chapter 8 (November 1430), there were 151 crusaders. By Chapter 10 (January 1431), the number had grown to 340+. The user says numbers have \"swollen quite a bit lately\" so I should check what the current count would be.\n\nLet me search for more details about crusader recruitment numbers.\n\nSince we're now one week after the wedding (early February 1431), the numbers would be somewhere between the 200 mentioned in Chapter 11 and the 700 projected for April. Given active recruitment, I'd estimate around 250-280 crusaders at this point in early February.\n\nLet me narrate Juan getting ready and going to inspect the crusaders.\n\nRoyal Bedchamber, Toledo\nEarly February 1431\nMorning\n\nJuan kisses Isabel gently on the forehead before rising from the bed. The stone floor is cold against his feet, but servants have already been in to stoke the fire—the room is warming nicely. He moves to the basin where fresh water awaits, steam rising faintly in the winter air.\n\nAs he washes and dresses, servants attend him with practiced efficiency. His attire today is practical—a fine doublet in deep blue with the Castilian arms embroidered on the chest, sturdy boots, a heavy cloak lined with fur against the February chill. This is the king inspecting his warriors, not holding court.\n\nIsabel watches from the bed, pulling the covers modestly around herself, her dark hair still loose. There's something peaceful about her expression—content, as she said. Not passion, perhaps, but genuine warmth.\n\n\"I'll return for our evening prayers,\" Juan tells her as he buckles his sword belt. \"Rest if you wish. Or Doña Beatriz mentioned the Portuguese chapel renovations are nearly complete—you might want to see them.\"\n\nThe Crusader Encampment\nOutside Toledo's Eastern Walls\n\nThe ride through Toledo's streets takes Juan past the cathedral, where construction continues even in winter, past the Jewish quarter with its synagogues and workshops, and finally through the eastern gate where the crusader encampment spreads across the hills.\n\nWhat had been 151 men in November has swelled dramatically. The recruitment proclamation distributed after your wedding, read in churches and market squares across Castile, has brought a flood of applicants. The careful screening by Fray Hernando and the crusader captains means not all are accepted—but many are.\n\nCurrent count: 267 sworn crusaders.\n\nThe encampment is well-organized. White tents arranged in neat rows, each with eight men. A central area for training. A chapel tent where Mass is said daily. Supply wagons, smithies, armories. This is no longer a symbolic gathering—this is the core of an army.\n\nAs Juan approaches on horseback with his guard, a horn sounds. Men emerge from tents, form up in rough formations. They're not professional soldiers trained to parade ground perfection, but they're learning discipline.\n\nCaptain García Fernández—one of the original four crusaders, now promoted to training commander—strides forward and drops to one knee. He's a grizzled veteran, scars on his face, eyes that have seen battle.\n\n\"Your Majesty,\" he says, his voice carrying. \"Two hundred sixty-seven sworn crusaders await your inspection. Fifty-three new arrivals this week alone.\"\n\nBehind him, the men stand at attention. They're a mix: younger sons of minor nobility in decent armor, prosperous farmers who could afford equipment, a few merchants' sons, even several former soldiers seeking redemption or adventure. All wear white surcoats over their armor or clothing—the crusader's mark.\n\nThe morning sun catches on mail, on sword hilts, on the white banner flying above the central tent—a smaller version of the banner bearing the True Cross fragment that remains in the royal chapel.\n\nWhat does Juan do or say to the assembled crusaders?\n\nStatus Note:\n\nSworn Crusaders: 267 (up from 151 in November)\n\nNew this week: 53\n\nRecruitment pace: Accelerating as word spreads\n\nQuality: Mixed but improving as training continues\n\nLocation: Eastern approach to Toledo, organized encampment\n\nDate: Early February 1431 (Wedding was late January)"
        },
        {
          "role": "player",
          "text": "I give them a salute before retreating with the captain to discuss.\n\n\nCaptain. I arrived in Seville with 151 crusaders and took 50 with me to Toledo. The other 101 stayed behind in Seville.\n\n\nNow, we have recruited more crusaders. What is the actual number of crusaders here right now in Toledo?"
        },
        {
          "role": "gm",
          "text": "Eastern Encampment, Toledo\nEarly February 1431\n\nCaptain García Fernández straightens from his salute and turns to walk with Juan toward the command tent, away from the assembled crusaders. His weathered face shows a moment of consideration as he works through the numbers.\n\n\"Your Majesty, let me give you the precise accounting,\" he says, pulling a small ledger from his belt—clearly Fray Hernando's influence has taught these men to keep records.\n\nHe flips it open. \"When Your Majesty departed Seville for the wedding journey, you took fifty crusaders as escort and honor guard. That left one hundred and one crusaders in Seville under the command of Captain Alonso Pérez.\"\n\nHe traces a finger down the page. \"Those one hundred and one remain in Seville, training and maintaining the encampment there. Captain Alonso sends weekly reports—no desertions, morale excellent, they're eager to march when the campaign begins.\"\n\n\"Here in Toledo,\" García continues, \"Your Majesty arrived with the original fifty. Since the wedding and the distribution of the recruitment proclamation, we have received and accepted two hundred and seventeen new crusaders.\"\n\nHe looks up from the ledger. \"That gives us two hundred and sixty-seven crusaders here in Toledo right now. Combined with the one hundred and one in Seville, Your Majesty commands three hundred and sixty-eight sworn crusaders total.\"\n\nHe pauses, then adds with evident satisfaction: \"And applications continue to arrive daily. Fray Hernando is screening another thirty-seven candidates this week. If even half pass his spiritual examination and our military assessment, we'll have four hundred crusaders by month's end.\"\n\nThe captain gestures toward the organized encampment. \"The new men are learning quickly. Many are former soldiers or at least know which end of a sword to hold. The noble sons need more training in discipline—they're used to giving orders, not taking them—but they're adapting.\"\n\nWhat does Juan wish to discuss with the captain?\n\nCrusader Status:\n\nIn Toledo: 267 (50 original + 217 newly recruited)\n\nIn Seville: 101 (original group that stayed)\n\nTotal Sworn: 368\n\nPending Review: 37 candidates this week\n\nProjected by month's end: ~400"
        },
        {
          "role": "player",
          "text": "Continue recruitment and training and arming them. I do not want to march ill trained men into combat. I plan to leave some behind or even most when the season begins. I want everyone who marches to war to have the confidence to hold his own in combat. Start preparing to leave some of our number behind to train some more. They can join us later.\n\n\nWhen do we plan to start the campain again according to our budget? April? March?"
        },
        {
          "role": "gm",
          "text": "\"## Eight-Month Campaign Season (April - November 1431)\"\n\nAnd in Chapter 9 summary:\n\"**Next Major Events:**\n- Recruitment proclamation distribution (late December)\n- Travel to Toledo (late December)\n- Wedding to Princess Isabel (January/February)\n- Papal Legate expected arrival (spring, hopefully)\n- Comprehensive decree issuance (campaign launch)\n- First campaign season begins (April/May)\"\n\nSo the campaign is planned to begin in April or May 1431, with an 8-month season running April through November.\n\nJuan is currently in early February 1431. The wedding just happened in late January. So he has about 2-3 months before campaign season begins.\n\nJuan is being wise here - he doesn't want to march untrained men to their deaths. He's thinking about quality over quantity and is willing to leave some behind for more training.\n\nCommand Tent, Eastern Encampment\nEarly February 1431\n\nCaptain García Fernández nods approvingly at Juan's words. \"Wise, Your Majesty. Better two hundred crusaders who can hold a shield wall than four hundred who'll break at first contact.\" He makes a note in his ledger.\n\n\"We're already separating the wheat from the chaff in training,\" he continues. \"The men who've held a sword before, who understand formations, who don't freeze when horses charge at them in mock battle—those will be ready by campaign season. The others...\" He shrugs. \"They have the heart, but need more time. We'll keep training them here and send them forward in waves as they're ready. Better they join us in June as competent warriors than April as corpses waiting to happen.\"\n\nHe flips through his ledger to a marked page. \"According to the campaign budget Don Álvaro and Father Tommaso prepared—the one Your Majesty approved with the oversight committee—the campaign begins in April.\"\n\nGarcía taps the page. \"Eight-month campaign season, April through November 1431. That gives us...\" he counts mentally, \"...about two months from now. Maybe ten weeks at most.\"\n\n\"The budget assumed we'd have seven hundred sworn crusaders by campaign start,\" he adds. \"At our current recruitment pace, we'll likely reach five hundred to five hundred fifty actually sworn and ready. If we hold to your standard—only men truly ready for combat march in April—I'd estimate three hundred to three hundred fifty campaign-ready crusaders by then.\"\n\nHe looks up from the ledger. \"That leaves perhaps two hundred still training here in Toledo, joining us in waves through May and June as they complete their preparation. The hundred in Seville are mostly veterans from Your Majesty's original recruitment—they'll be ready to march when we consolidate forces.\"\n\nThe captain pauses, then asks carefully: \"Your Majesty, will we be consolidating the Seville crusaders here in Toledo before the campaign? Or will they march directly to the staging area when the time comes?\"\n\nWhat does Juan answer?\n\nCampaign Timeline:\n\nCurrent Date: Early February 1431\n\nCampaign Start: April 1431 (about 8-10 weeks away)\n\nCampaign Duration: 8 months (April - November 1431)\n\nCrusader Readiness Estimate (April start):\n\nReady for combat: 300-350\n\nStill training: 200\n\nTotal sworn: 500-550 (by April)"
        },
        {
          "role": "player",
          "text": "The hundred in Seville will fight in the western army. The rest will fight in the east under the banner. I want both armies to have crusaders present."
        },
        {
          "role": "gm",
          "text": "Command Tent, Eastern Encampment\nEarly February 1431\n\nCaptain García Fernández nods thoughtfully, immediately grasping the strategic wisdom. \"A sound division, Your Majesty. Both armies bear witness to the sacred mission, both have the crusaders' example to inspire the levies.\"\n\nHe makes notes in his ledger. \"So the Seville crusaders—one hundred men, mostly veterans—will march with Don Rodrigo Manrique's western coastal army. They'll be the shock troops for the systematic conquest along the coast, naval-supported operations.\"\n\n\"The Toledo crusaders,\" he continues, \"will march with Your Majesty and the banner under the Master of Calatrava's eastern command. The raids, the mobile operations, the frontier defense—and wherever Your Majesty leads them personally.\"\n\nGarcía considers for a moment. \"The Seville group is more experienced on average—they were your first recruits, the men who answered before it was fashionable. They'll serve Don Rodrigo well in the grinding work of sieges. The Toledo crusaders are more numerous, with fresh enthusiasm. Under the banner, with Your Majesty present, that enthusiasm becomes a weapon.\"\n\nHe pauses, then adds: \"Should I coordinate with Captain Alonso in Seville to ensure his hundred are fully prepared for siege warfare specifically? Different training emphasis than mobile raiding operations. They'll need to understand escalades, mining, artillery support, holding breaches...\"\n\nWhat does Juan say?\n\nForce Distribution:\n\nWestern Army (Rodrigo Manrique): ~100 Seville crusaders (veterans, siege-focused)\n\nEastern Army (Master of Calatrava/Juan II): ~250-300 Toledo crusaders (mobile, banner-focused)\n\nStill Training: ~150-200 (will join in waves, likely eastern army)"
        },
        {
          "role": "player",
          "text": "I will write Rodrigo in Seville if they have recieved any recruits there. Any they train in Seville will stay with them there and into combat as well. All Toledo recruits will be committed to the eastern army.\n\n\nDo you have everything you need?"
        },
        {
          "role": "gm",
          "text": "Command Tent, Eastern Encampment\nEarly February 1431\n\nCaptain García Fernández nods firmly. \"Clear division, Your Majesty. Seville crusaders to the western army, Toledo crusaders to the eastern. Simple, no confusion about assignments.\" He makes another note.\n\n\"As for what we need...\" He considers carefully, glancing out toward the encampment. \"We have adequate provisions from the royal stores—Father Tommaso's administrators have been efficient with supply. Arms and armor are sufficient for those who arrived without. The training grounds are good, though we could use more wooden practice weapons as our numbers grow—we're breaking sword-trainers faster than the carpenters can replace them.\"\n\nHe taps his chin. \"Fray Hernando has been invaluable for spiritual screening and maintaining discipline. If he could assign one or two more chaplains to the Toledo encampment as we grow, it would help. Three hundred men need more than one priest for confessions, especially before they march to war.\"\n\n\"Beyond that, Your Majesty, we're well-resourced. The men know they're paid fairly, fed well, and serving a sacred cause. Morale is excellent. We just need time—time to train the raw ones properly so they don't get themselves killed in their first battle.\"\n\nHe straightens. \"By April, I'll have three hundred crusaders ready to march under the banner. They'll do you proud, Your Majesty.\"\n\nDoes Juan have any other matters to discuss with the captain, or does he return to other duties?\n\nCaptain's Needs:\n\nMore wooden practice weapons (minor, being addressed)\n\n1-2 additional chaplains for growing encampment\n\nTime to train recruits properly (already planned)"
        },
        {
          "role": "player",
          "text": "You can get more wooden swords yourself. Adress this supply problem captain. I will make sure you recieve more chaplains.\n\n\nI greet him again and exit the tents and make my way to inspect the aquired artillery. How are they?"
        },
        {
          "role": "gm",
          "text": "Captain García Fernández colors slightly at the mild rebuke, then nods sharply. \"Of course, Your Majesty. I'll have the carpenters working overtime. Supply is my responsibility.\" He salutes as Juan exits the tent.\n\nArtillery Grounds, Western Edge of Toledo\nMid-Morning\n\n1. Artillery acquisition began in December/January 1431\n2. They acquired 4-6 medium bombards from Burgundian/Italian foundries\n3. Master gunners were hired to train Castilian crews\n4. The investment was ~90,000-100,000 maravedís (around 358-378 florins)\n5. Training began in winter 1431\n6. They're supposed to be ready for campaign by spring (April)\n\nIt's now early February 1431, so they've had about 2 months. The artillery should be present and in training, but not fully ready yet. There would be master gunners training crews, some test firings, etc.\n\nLet me create a scene where Juan inspects the artillery grounds and sees the progress.\n\nArtillery Grounds, Western Edge of Toledo\nEarly February 1431\n\nJuan rides west from the crusader encampment, following the sound he can already hear echoing across the hills—the deep, earth-shaking BOOM of cannon fire.\n\nThe artillery grounds are set in a broad valley away from the city proper, where stray shots won't endanger buildings or people. As Juan approaches, he sees the fruits of three months' investment and preparation.\n\nFive medium bombards are positioned in a line, each mounted on heavy wooden carriages. They're impressive pieces—bronze tubes about eight feet long, each weighing perhaps 2,000 pounds. Three are currently cool and being cleaned and maintained. The other two are active, their crews working through firing drills.\n\nMaster Gunner Pietro Calabrese—a grizzled Italian from Milan, hired at considerable expense—notices Juan's approach and hurries over, wiping powder residue from his hands. He's perhaps fifty, with burn scars on his forearms and the squinting eyes of a man who's stared at too many cannon flashes.\n\n\"Your Majesty!\" He bows quickly, his Castilian heavily accented. \"You come at good time. We are drilling the third crew today. Watch, watch.\"\n\nHe gestures toward one of the active bombards. A crew of six men works around it with practiced but not yet perfect coordination:\n\nThe loading process:\n\nOne man swabs the barrel with a wet sponge on a pole—cleaning out residue\n\nAnother measures gunpowder from a barrel, pouring it carefully down the barrel\n\nA third rams a wooden sabot and wadding down with a long pole\n\nTwo men roll a stone ball (perhaps 50 pounds) to the muzzle and lever it in\n\nMore wadding is rammed down\n\nThe master gunner checks the aim, adjusts the elevation with wooden wedges\n\nPietro shouts: \"¡Fuego!\"\n\nThe slowmatch touches the touch-hole. For a heartbeat, nothing—then:\n\nBOOM!\n\nThe bombard belches flame and smoke, lurching backward against its restraints. The stone ball arcs through the air and—after what seems like forever—crashes into a earthwork target about 300 yards away, sending dirt flying.\n\nThe crew cheers. Pietro nods approval but makes notes on a slate.\n\n\"Not bad, not bad,\" he mutters. He turns to Juan. \"Your Majesty, we have five bombards ready. Could have six, but one had casting flaw—dangerous, sent it back to foundry. These five, they are good. Strong bronze, proper design.\"\n\nHe walks Juan along the line, explaining each piece:\n\nArtillery Status:\n\n5 medium bombards operational (originally ordered 4-6)\n\nEach can fire 40-50 pound stone balls approximately 300-400 yards accurately\n\nRate of fire: 10-12 shots per day per bombard if pressing hard, 6-8 if careful\n\nGunpowder supply: Adequate for the campaign season, stored carefully in dry magazines\n\nStone shot: Stonemasons are cutting balls continuously; hundreds already stockpiled\n\nCrew Training:\n\n\"We have trained five crews now,\" Pietro explains. \"Each crew six men plus me or one of my two assistants supervising. They are learning. Not perfect yet—still slow, sometimes make mistakes. But by April?\" He shrugs. \"They will be competent. Not masters, but competent. Can breach wall given time.\"\n\nHe points to the earthwork targets showing crater damage. \"In siege, Your Majesty, these bombards will pound same spot on wall for days. Stone cracks, mortar crumbles. Three days, maybe five days of steady fire? Wall comes down. Much faster than trebuchet, much faster than starvation.\"\n\nThe Challenge:\n\n\"The hard part, Your Majesty, is not firing. Is moving them. Each bombard weighs nearly one ton. The carriage, another ton. Must have eight oxen to pull each one. Roads must be good, or we get stuck. And protection—\" he gestures seriously, \"—Granada has archers, cavalry. Guns are slow, vulnerable. Need infantry protection always.\"\n\nHe shows Juan the support train: wagons of gunpowder (kept far apart in case of accident), carts of stone shot, barrels of tools and spare parts, the oxen teams being trained to not panic at the cannon fire.\n\nAssessment:\n\nThe artillery program is progressing well. Not perfect, but solid. By April, these five bombards should be ready to deploy with the western army to begin the systematic reduction of coastal fortresses.\n\nPietro adds one concern: \"Your Majesty, Granada has Ottoman guns too. Maybe better than ours. When we besiege their fortresses, they shoot back. My men must learn to work under fire. We will practice, but...\" He shrugs. \"First real siege, some will panic. Is normal. They will learn or they will die.\"\n\nWhat does Juan say or do?\n\nArtillery Status Summary:\n\nOperational Bombards: 5 medium pieces\n\nTrained Crews: 5 crews (6 men each = 30 gunners)\n\nMaster Gunners: 3 (Pietro + 2 assistants)\n\nGunpowder Supply: Adequate for 8-month campaign\n\nStone Shot: Hundreds prepared, more being cut\n\nTransport: 40 oxen trained and assigned\n\nReadiness: On track for April deployment\n\nEstimated Effectiveness: Can breach fortress walls in 3-5 days of concentrated fire"
        },
        {
          "role": "player",
          "text": "Great job and continue to train. But you will fight with me on the eastern front. Does not change much in regards to your training, butsomething to keep in mind. I will deploy you against the walls of the fortresess there.\n\n\nKeep on training. We move out at the beginning of April. Anything you need?"
        },
        {
          "role": "gm",
          "text": "Artillery Grounds, Western Edge of Toledo\nEarly February 1431\n\nPietro Calabrese's eyebrows rise slightly at this information. He thinks for a moment, then nods slowly.\n\n\"Eastern front, Your Majesty. With the raiding forces and the banner.\" He scratches his scarred chin. \"This changes some things, yes. Eastern front is more... how do you say... opportunistic? We hit targets when we find them, not systematic siege campaign.\"\n\nHe considers the implications. \"Means we must be more mobile. Ready to move quickly when intelligence finds weak fortress or opportunity. Western coast campaign—that would be slow, methodical, one fortress after another. Eastern front—we might sit idle for week, then suddenly need to set up siege in two days.\"\n\nPietro walks back toward the bombards, Juan following. \"Is good, actually. My crews learn to work fast, work under pressure. And eastern fortresses...\" he grins, showing missing teeth, \"...maybe not as strong as coastal ones. Granada puts their best defenses on coast where Christian navies threaten. Inland fortresses, frontier castles—older, weaker walls perhaps.\"\n\nHis Needs:\n\n\"What I need, Your Majesty, for eastern deployment:\n\nFirst—good scouts and intelligence. My guns are useless if we don't know which fortresses are worth attacking. Need to know: how thick are walls? How many defenders? Can we get guns into position? I need reconnaissance before we commit to siege.\n\nSecond—more oxen teams. Eastern terrain is mountains, bad roads. If we get stuck, we hold up entire army. I want eight oxen per gun, maybe need ten in mountains. And spare oxen, because they die—sickness, enemy raids, accidents.\n\nThird—infantry protection always. My crews work slow, exposed. Granada cavalry sees artillery train, they attack. Need good infantry, archers, cavalry screen while we work. This is Commander's responsibility, but I say it now: protect the guns or lose them.\n\nFourth—covered wagons for powder. Rain ruins gunpowder. Spain has spring rains, yes? I need good canvas covers, maybe wooden carts with roofs. Keep powder dry at all costs.\n\nFifth—\" he hesitates, then continues, \"—authority to refuse suicide missions. Your Majesty, sometimes commanders see big gun and think 'we can take any fortress now!' But some fortresses, the terrain is wrong, walls too thick, defenders too many. If I say 'this siege will fail, we waste ammunition and men,' I need your backing to refuse. I serve you, but I will not throw away guns and crews on impossible tasks just because some nobleman wants glory.\"\n\nHe meets Juan's eyes directly. \"I am expensive, Your Majesty. My crews are trained, my guns are valuable. Use us well, and we win you fortresses. Use us badly, and you lose everything. I need authority to say 'no' when operation is foolish.\"\n\nDoes Juan grant Pietro this authority and agree to his other needs?\n\nPietro's Requirements:\n\nGood reconnaissance/intelligence before siege commitments\n\nExtra oxen teams (10 per gun instead of 8, plus spares)\n\nGuaranteed infantry/cavalry protection during operations\n\nWeather-protected gunpowder transport\n\nAuthority to advise against tactically unsound siege operations"
        },
        {
          "role": "player",
          "text": "You shall have the oxen and protection you need master gunner.\n\n\nBeginning April we start to push into Grenada. Will you be ready by then? How long will your travel to the front take?"
        },
        {
          "role": "gm",
          "text": "For readiness:\n- Pietro said the crews are learning, will be \"competent\" by April\n- They have 5 operational bombards\n- They're training now\n- About 2 months left to train\n- Pietro seems confident they'll be ready\n\nFor travel time:\n- Heavy artillery with oxen teams moves very slowly\n- From Toledo to the Granada frontier (eastern approach, likely toward the Jaén area or similar)\n- Medieval ox-drawn heavy loads: maybe 10-15 miles per day on good roads, less on bad terrain\n- Distance from Toledo to Granada frontier: roughly 200-250 miles depending on route\n- So maybe 15-20 days of travel minimum, possibly longer\n- Plus they need to coordinate with the army, not travel alone (vulnerable)\n- Roads in spring might be muddy from rains\n- Terrain gets mountainous as they approach Granada\n\nPietro would be realistic about this - he's experienced. He'd want to leave with plenty of time to spare.\n\nArtillery Grounds, Western Edge of Toledo\nEarly February 1431\n\nPietro nods gratefully at the promise of oxen and protection. \"Good, Your Majesty. With those, we can work.\"\n\nHe considers the timeline question carefully, his experienced eyes calculating. \"Ready by April? Sí, we will be ready. My crews train every day now. By April first, they know their work—load, aim, fire, maintain. Not perfect, but competent. Good enough for war.\"\n\nThen he addresses the more complex question—the march itself. He walks to a rough map pinned to a board near the magazine, showing the route from Toledo to the Granada frontier.\n\n\"Travel time, Your Majesty... this is the problem.\" He traces the route with a powder-stained finger. \"Toledo to Granada frontier—to Jaén, Úbeda, wherever your eastern army concentrates—is perhaps two hundred fifty miles, maybe more. Through La Mancha, then into mountains.\"\n\nHe taps the map. \"My guns with full ammunition train, powder wagons, support carts—we are slow. Very slow. On good flat roads in La Mancha, maybe fifteen miles per day with full ox teams. In the mountains approaching Granada?\" He makes a face. \"Ten miles per day. Maybe eight if roads are bad, if spring rains make mud.\"\n\nPietro does the calculation aloud: \"Two hundred fifty miles... if we average twelve miles per day, that is twenty days of travel. But we cannot march every day—oxen must rest, wheels break, we must stop for repairs. And we should not travel alone—too vulnerable. Must move with army or strong escort.\"\n\nHe straightens, meeting Juan's eyes. \"Your Majesty, if campaign begins April first, I must leave Toledo by March tenth. Maybe earlier, March fifth to be safe. This gives us three weeks travel time with margin for problems.\"\n\n\"But better—\" he continues, \"—if I coordinate with your main eastern army assembly. When do your forces concentrate? Where? If I march with army, we have protection, and I arrive exactly when needed. If I march alone or with small escort, we might arrive early and sit exposed, or late and miss first opportunity.\"\n\nHe crosses his arms. \"So, Your Majesty—when and where does eastern army assemble for campaign? I will plan my departure to join them, or to arrive at staging area same time they do.\"\n\nWhat does Juan tell Pietro about the army assembly timeline and location?\n\nArtillery Movement Calculation:\n\nDistance: ~250 miles Toledo to Granada frontier\n\nSpeed: 10-15 miles/day depending on terrain\n\nTravel time: 20-25 days including rest\n\nDeparture needed: Early to mid-March (March 5-10)\n\nRecommendation: Coordinate with main army assembly for protection and timing"
        },
        {
          "role": "player",
          "text": "March towards Jaen. You will be directed further after then.\n\n\nIf there is nothing further, get to it."
        },
        {
          "role": "gm",
          "text": "Artillery Grounds, Western Edge of Toledo\nEarly February 1431\n\nPietro Calabrese nods sharply, committing the orders to memory. \"Jaén. Capisco—I understand, Your Majesty. We march toward Jaén in early March, arrive by month's end, await further orders there.\"\n\nHe straightens, placing his fist over his heart in a rough salute. \"My guns will be ready, Your Majesty. My crews will be ready. We will serve you well.\"\n\nAs Juan turns to leave, Pietro adds one last thing, his voice carrying genuine respect: \"Your Majesty—is good you inspect your forces yourself. Good you see the guns, the crusaders, the preparations. Some kings just give orders and expect miracles. You come, you look, you understand what is real. This is why we will win.\"\n\nHe bows, then immediately turns back to his crews, barking orders in Italian-accented Spanish about powder measurements and barrel alignment.\n\nThe Royal Alcázar, Toledo\nLate Morning\n\nJuan rides back through Toledo's streets toward the Alcázar. The winter sun is climbing higher now, though the air remains crisp. The inspection tour has consumed most of the morning—crusaders, artillery, all progressing well toward the April campaign launch.\n\nAs he enters the Alcázar courtyard and dismounts, a servant hurries forward. \"Your Majesty, Don Álvaro requests audience when convenient. He says correspondence has arrived from Seville—from Don Rodrigo Manrique regarding crusader recruitment there.\"\n\nThe letter Juan was planning to write about Seville recruitment—it seems Rodrigo has anticipated the question.\n\nWhat does Juan do?\n\nCurrent Time: Late morning, early February 1431\nLocation: Royal Alcázar, Toledo\nPending: Álvaro has correspondence from Rodrigo about Seville crusader recruitment"
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_1431_00085",
      "book": 1,
      "chapter": "1.14",
      "date": "1431-02-22",
      "end_date": null,
      "type": "diplomacy",
      "summary": "Meeting with Álvaro at the Alcázar. Rodrigo Manrique reports from Seville: 101 original crusaders in excellent shape, 27 new recruits accepted (of 43 applicants), total 128 in Seville, projecting 150-170 by April. Juan orders formal noble levy summons sent immediately with assembly deadline March 25 at staging areas — no staggered arrivals. Force targets confirmed: 12,000 western army (Seville), 23,000 eastern army (Jaen). 43 trained tax assessors deployed with dual mission: audit army spending and assess noble estate revenues. Treasury: 390,000 florins available. Juan announces travel plans: leave Toledo early March for Jaen with Isabel, brief visit to Seville, then return. Isabel stays with army until pregnancy confirmed, then returns to Toledo.",
      "characters": [
        "juan_ii",
        "alvaro_de_luna",
        "rodrigo_manrique"
      ],
      "factions_affected": [
        "royal_court"
      ],
      "location": "Toledo",
      "tags": [
        "diplomacy",
        "logistics",
        "planning",
        "taxation"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "I meet with Alvaro"
        },
        {
          "role": "gm",
          "text": "Don Álvaro's Office, Royal Alcázar\nLate Morning, Early February 1431\n\nJuan is shown into Álvaro's working chambers, a spacious room lined with documents, maps, and correspondence. The Royal Constable rises from behind his desk, several letters spread before him.\n\n\"Your Majesty,\" Álvaro greets him with a bow. \"I trust the inspection went well? The crusaders are progressing?\"\n\nHe gestures to a chair and pours wine—a light midday refreshment. Once Juan is seated, Álvaro picks up one of the letters, breaking the wax seal that shows Rodrigo Manrique's personal device.\n\n\"This arrived by fast courier this morning from Seville. Don Rodrigo reports on the preparations there—including crusader recruitment.\" Álvaro scans the letter, then reads aloud the relevant sections:\n\nFrom Don Rodrigo Manrique, Seville\nDated January 30, 1431\n\n\"...The one hundred crusaders Your Majesty left in my charge continue their training with dedication. Captain Alonso Pérez has maintained excellent discipline, and there have been no desertions or significant problems.\n\nRegarding recruitment: The proclamation distributed after His Majesty's wedding has reached Seville and the surrounding regions. We have received forty-three applications for crusader service here in Seville. After screening by our chaplains and assessment of military capability, we have accepted twenty-seven new crusaders. They began their oaths and training last week.\n\nThe recruitment pace in Seville is notably slower than what I understand Toledo is experiencing. I attribute this to two factors: First, many young men from western Castile have already traveled to Toledo hoping to join His Majesty's personal forces under the banner. Second, Seville's population is more merchant and maritime—fewer men with military experience or inclination.\n\nHowever, the quality of our Seville recruits is generally high. Several are former sailors with combat experience against Barbary corsairs. Others are sons of the military orders' administrative families. They understand naval operations and coastal warfare, which will serve the western campaign well.\n\nBy my estimate, if recruitment continues at this pace, Seville will provide perhaps fifty to seventy additional crusaders by campaign start—giving us a total Seville force of one hundred fifty to one hundred seventy crusaders for the western army...\"\n\nÁlvaro looks up from the letter. \"So, Your Majesty—combining reports: Toledo has two hundred sixty-seven crusaders currently, Seville has one hundred twenty-seven total. That's three hundred ninety-four crusaders sworn, with recruitment continuing in both cities.\"\n\nHe sets the letter down. \"Rodrigo also reports on other preparations—artillery coordination, naval contracts with Genoese captains, supply depot establishment. The western army preparations are proceeding smoothly. He expects to be ready to march by early April as planned.\"\n\nÁlvaro pauses, then adds: \"There's one other matter Rodrigo mentions. The Infantes—Juan and Enrique—have been cooperative in their crusader service preparations, but Rodrigo notes they seem... subdued. Going through motions correctly but without enthusiasm. He wonders if we should be concerned about their commitment once the campaign actually begins and they're far from oversight.\"\n\nThe Constable pours more wine, his expression thoughtful. \"Your Majesty, is there anything specific you wish me to communicate back to Rodrigo? Or any other matters we should address while we're reviewing preparations?\"\n\nWhat does Juan say or ask?\n\nCrusader Status Update:\n\nToledo: 267 currently\n\nSeville: 127 (100 original + 27 newly recruited)\n\nTotal Sworn: 394 crusaders\n\nProjected by April: 500-550 total"
        },
        {
          "role": "player",
          "text": "Everything seems to be in order. We march south soon to start with cavalry probing the border forts. After a few weeks we will march ahead with our main army and drive into Grenada. \nAs soon as the sultan deploys against us, we signal for the naval operation in the west to start.\n\n\nSend out summons if we have not done so already for the nobles to deploy in the eastern and western armies. Especially the great noble houses are required to came with all their levies. I choose Jaen as a staging area for our eastern army for now."
        },
        {
          "role": "gm",
          "text": "The strategy Juan outlines:\n1. Cavalry probing border forts first (light forces)\n2. Main army marches after a few weeks\n3. When Sultan deploys against eastern army, signal western naval operation to begin\n4. This is smart - draw Granada's attention east, then hit them west when committed\n\nÁlvaro would likely:\n- Confirm whether summons have been sent\n- If not, draft them immediately\n- Confirm the staging area (Jaén)\n- Possibly raise practical questions about timeline\n- Discuss the coordination between eastern and western operations\n\nLet me write this response with Álvaro being the capable administrator he is.\n\nDon Álvaro's Office, Royal Alcázar\nLate Morning, Early February 1431\n\nÁlvaro listens carefully to Juan's strategic outline, nodding as he absorbs the operational plan. When Juan finishes, the Constable sets down his wine and pulls a fresh sheet of parchment toward him, dipping his quill.\n\n\"A sound strategy, Your Majesty—draw Granada's main forces east with our concentrated army and the banner, then unleash the naval assault on their western coast when they're committed against you.\" He makes notes as he speaks. \"They cannot ignore your presence with the True Cross and the crusader host. When they march to meet you, their coastal defenses are weakened.\"\n\nHe looks up. \"Regarding the noble summons—we have not yet issued the formal levy call. The recruitment proclamation for crusaders went out after your wedding, but the mandatory noble levy summons has not been sent. We were planning to issue it in late March, giving nobles approximately four weeks to assemble and march. But if Your Majesty wishes them sent now...\"\n\nÁlvaro calculates quickly. \"Early February now. If we send summons this week, nobles have nine to ten weeks to gather their forces and reach the staging areas. More than adequate—perhaps even too generous. Some will dawdle. But it does give the great houses no excuse for delay.\"\n\nHe begins drafting the key points:\n\n\"Formal Summons to Issue Immediately:\n\nTo Eastern Army (Staging at Jaén):\n\nAll nobles holding lands in Leon, Old Castile, New Castile, Extremadura\n\nRequired to present with full feudal levies\n\nStaging point: Jaén\n\nAssembly deadline: March 25th (giving 7 weeks)\n\nCommander: His Majesty Juan II, with Master of Calatrava as field marshal\n\nTo Western Army (Staging at Seville):\n\nAll nobles holding lands in Andalusia, Murcia, western territories\n\nRequired to present with full feudal levies\n\nStaging point: Seville\n\nAssembly deadline: March 25th (giving 7 weeks)\n\nCommander: Don Rodrigo Manrique\"\n\nÁlvaro taps the parchment. \"The great houses specifically...\" He lists them: \"Mendoza, Guzmán, Enríquez, Manrique, Álvarez de Toledo, Pimentel, Velasco—all will be named explicitly with their required contributions. No ambiguity, no excuses.\"\n\nHe pauses, then adds a practical consideration: \"Your Majesty, you mentioned cavalry probing operations beginning first, then the main army weeks later. Should the summons specify staggered arrival? Light cavalry first, then heavy forces? Or should everyone assemble at Jaén by late March and we organize operations from there?\"\n\n\"Also—\" Álvaro glances at another document, \"—the coordination signal between your eastern operations and Rodrigo's western assault. How shall this be managed? Courier riders? Smoke signals visible from mountain peaks? This must be planned carefully. If the signal is delayed or missed, we lose the strategic advantage.\"\n\nWhat does Juan specify about the timing and coordination?\n\nSummons Status:\n\nFormal levy summons not yet issued\n\nCan be sent immediately (early February)\n\nGives nobles ~7 weeks to assemble (by late March)\n\nStaging areas: Jaén (East), Seville (West)\n\nCoordination Questions:\n\nStaggered arrival or all-at-once assembly?\n\nHow to signal between eastern and western armies?"
        },
        {
          "role": "player",
          "text": "We change nothing about our signal system. It is in place, it is enough. And we do not stagger arrival. Uncertainty enough, they just have to wait a bit in Jaen. Send out summons and tell them we expect them to be present and ready 25 March. And make sure both armies recieve enouth troops. The west must total 12.000, the east 23.000. But we have already made these calculations.\n\n\nAnything else we should discuss?"
        },
        {
          "role": "gm",
          "text": "Don Álvaro's Office, Royal Alcázar\nLate Morning, Early February 1431\n\nÁlvaro nods briskly, making final notes on the summons draft. \"Understood, Your Majesty. Signal system remains as planned, no staggered arrivals, assembly deadline March 25th at both staging points. The force compositions are already calculated—twelve thousand for the west under Don Rodrigo, twenty-three thousand for the east under your direct command. I'll have the formal summons drafted today and sent by courier tomorrow to every major house.\"\n\nHe sets aside the parchment and reviews his other documents briefly. \"A few other matters for Your Majesty's awareness, though none require immediate decisions:\n\nFirst— the forty-three tax assessors are trained and ready to deploy with the armies in April, as planned. Father Tommaso's administrators will coordinate with them. Cardinal Capranica's ecclesiastical observers will join them as well.\n\nSecond— the Portuguese dowry funds—one hundred eighty thousand florins—were transferred to the royal treasury upon your wedding. Combined with existing funds, we have three hundred ninety thousand florins available for campaign expenses and reserves.\n\nThird— the Genoese naval contracts. Rodrigo is finalizing terms but expects all twelve combat galleys and ten transport vessels to be secured by mid-March. The Portuguese galleys from the dowry are already being prepared in Lisbon.\"\n\nÁlvaro pauses, then asks: \"Your Majesty, do you intend to remain here in Toledo until the March departure, or will you return to Seville before the campaign? There are advantages to either—Toledo keeps you close to the crusader recruitment and training, but Seville is closer to final preparations for both armies.\"\n\nHe adds with a slight smile: \"Also, the Queen might appreciate knowing how long you'll be in residence before marching to war.\"\n\nWhat does Juan decide about his immediate plans?\n\nCurrent Status Summary:\n\nDate: Early February 1431\n\nTreasury: 390,000 florins available\n\nCrusaders: 394 sworn (Toledo + Seville)\n\nNoble Summons: Being sent immediately, assembly March 25\n\nCampaign Start: April 1431\n\nArtillery: 5 bombards ready, crews training\n\nCurrent Location: Toledo with Isabel"
        },
        {
          "role": "player",
          "text": "Put the tax assessors to work to both inspect the army spends correctly and to assess the revenues of estates in Castille. We march south soon to Jaen, I will split off and visit Seville quickly. Isabel will stay in Jaen for a few days before I get back. I think we will leave at the beginning of March to keep it comfortable for Isabel."
        },
        {
          "role": "gm",
          "text": "Don Álvaro's Office, Royal Alcázar\nLate Morning, Early February 1431\n\nÁlvaro nods, making careful notes. \"Excellent, Your Majesty. The assessors will deploy with dual purpose—financial oversight of campaign expenditures and revenue assessment of noble estates. Father Tommaso will coordinate the division of responsibilities.\"\n\nHe pauses at Juan's travel plans, considering the logistics. \"Early March departure for Jaén—that gives us about four weeks to finalize preparations here. The journey to Jaén is approximately one hundred twenty miles, perhaps six to seven days of comfortable travel for the Queen. Then Your Majesty makes a quick visit to Seville—another eighty miles, two to three days each way—while the Queen rests in Jaén.\"\n\nÁlvaro sets down his quill and looks at Juan directly. \"Your Majesty, may I speak frankly about the Queen's presence at Jaén?\"\n\nAt Juan's nod, he continues: \"Jaén is the staging area for twenty-three thousand troops. By late March it will be a military encampment—soldiers, supplies, noise, limited amenities. The Queen will be safe, certainly, with proper quarters in the fortress and adequate guard. But it is not... comfortable. Not like Toledo or even a peaceful castle.\"\n\nHe chooses his words carefully. \"Some kings leave their queens in secure, comfortable locations during campaigns. Toledo, for instance, or Burgos. The Queen could maintain court, manage correspondence, coordinate with Church authorities. She would be far from any danger, in familiar surroundings.\"\n\n\"Alternatively,\" Álvaro adds, \"if Your Majesty wishes the Queen closer to the campaign—for morale, for the symbolic unity of the crusade—Jaén serves that purpose. But it requires accepting certain... inconveniences for Her Majesty.\"\n\nHe spreads his hands. \"This is Your Majesty's decision, of course. I merely wish to ensure you've considered the practical realities. The Queen is young, newly arrived in Castile, and has shown herself dutiful but not... accustomed to military camps.\"\n\nHow does Juan respond regarding Isabel's presence at the staging area?\n\nTravel Timeline:\n\nDeparture from Toledo: Early March\n\nArrival in Jaén: Mid-March (6-7 day journey)\n\nJuan's Seville visit: 5-6 days round trip\n\nCampaign start: April\n\nIsabel's situation: Would be in military staging area with 23,000 troops assembling"
        },
        {
          "role": "player",
          "text": "She is not pregnant yet. She will stay with me until she is. Shen she is, she will leave for Toledo to give birth.\n\n\nAny other matters that require our attention?"
        },
        {
          "role": "gm",
          "text": "Don Álvaro's Office, Royal Alcázar\nLate Morning, Early February 1431\n\nÁlvaro nods at Juan's practical approach, making a note. \"Understood, Your Majesty. The Queen travels with the army until pregnancy is confirmed, then returns to Toledo for safety and proper care. A sensible arrangement.\"\n\nHe reviews his documents one final time, checking for any other pressing matters. \"I believe we've covered the essential preparations, Your Majesty. The summons will go out tomorrow. Crusader recruitment and training continues. Artillery crews drill daily. The assessors and administrators are ready to deploy. Naval contracts are being finalized.\"\n\nHe sets the papers aside. \"The next major milestone is early March—departure for Jaén. Until then, it's a matter of allowing the preparations to continue. The machinery is in motion.\"\n\nÁlvaro pauses, then adds with a slight smile: \"Your Majesty, you've spent the morning inspecting crusaders and artillery. The afternoon is yours. The Queen mentioned yesterday that the Portuguese chapel renovations are nearly complete—perhaps she would appreciate seeing them with you?\"\n\nThe Constable stands, bowing. \"Unless Your Majesty requires anything else, I'll begin drafting the formal noble summons and coordinate with Father Tommaso on the assessor deployments.\"\n\nWhat does Juan do with the rest of his day?\n\nStatus Summary (Early February 1431):\n\nTreasury: 390,000 florins\n\nCrusaders: 394 sworn (267 Toledo, 127 Seville)\n\nArtillery: 5 bombards, trained crews\n\nNoble Summons: Being issued (assembly March 25)\n\nDeparture for Jaén: Early March\n\nCampaign Start: April 1431\n\nIsabel's Status: Not yet pregnant (will conceive in early March per roll)"
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_1431_00086",
      "book": 1,
      "chapter": "1.14",
      "date": "1431-02-22",
      "end_date": null,
      "type": "personal",
      "summary": "Afternoon with Isabel. They inspect the completed Portuguese chapel — Portuguese heraldry, saints, blue-and-white color scheme, private devotional shrine. Juan prays a deeply personal, vulnerable prayer: asks God's blessing on their marriage, the crusade, Isabel's comfort in a foreign land, and for children. Isabel is profoundly moved and prays her own response, then opens up about struggling to express emotions she was never taught to articulate. The shared vulnerability deepens their emotional connection significantly — moving beyond duty toward genuine intimacy of the heart.",
      "characters": [
        "juan_ii",
        "isabel_of_portugal"
      ],
      "factions_affected": [],
      "location": "Toledo",
      "tags": [
        "personal",
        "marriage",
        "religion",
        "emotional"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "Get to is Alvaro.\n\n\nI will visit Isabel now.\n\n\nI go to her."
        },
        {
          "role": "gm",
          "text": "The Queen's Chambers, Royal Alcázar\nEarly Afternoon, Early February 1431\n\nÁlvaro bows as Juan departs. \"At once, Your Majesty. The summons will be ready by evening for your review before dispatch.\"\n\nJuan makes his way through the Alcázar's corridors toward Isabel's chambers. The palace is busy with midday activity—servants carrying linens, clerks hurrying with documents, courtiers lingering in conversation. They all bow or curtsy as their king passes.\n\nHe reaches Isabel's apartments and the guards announce him. Inside, he finds the chambers warm and well-lit, the fire crackling pleasantly. Doña Beatriz and two other Portuguese ladies are present, working on embroidery near the windows where the winter light is strongest.\n\nIsabel herself sits at a small writing desk, carefully composing a letter. She's dressed in a deep burgundy gown, her dark hair partially covered by a simple veil. When Juan enters, she looks up, and a genuine smile crosses her plain features—the kind of smile that comes naturally now, not the careful dutiful expression she wore in their first weeks.\n\n\"My lord!\" She sets down her quill and rises, curtsying. The Portuguese ladies immediately stand as well, bowing.\n\nIsabel dismisses them with a gesture. \"Please, leave us.\" Doña Beatriz gathers the other ladies, and they withdraw to the adjoining chamber, closing the door but remaining within call as propriety requires.\n\nWhen they're alone, Isabel's formality relaxes slightly. She moves toward Juan, her movements easy, comfortable. \"I wasn't expecting you until evening prayers. How were the crusaders? And the artillery?\"\n\nThere's genuine interest in her voice—she's been listening to his talk of preparations, trying to understand this campaign that consumes so much of his attention.\n\nShe glances back at her writing desk. \"I was writing to my mother in Portugal. Telling her about...\" a slight blush, \"...about married life. That I'm content. That you're kind to me.\"\n\nWhat does Juan say or do?\n\nTime: Early afternoon\nLocation: Isabel's chambers, private\nIsabel's mood: Comfortable, affectionate, genuinely pleased to see him"
        },
        {
          "role": "player",
          "text": "I close the door, take Isabel into an embrace and kiss her. I have intercourse with her passionately. I then ask her to get dressed so we can inspect the new chapel together."
        },
        {
          "role": "gm",
          "text": "The Queen's Chambers, Royal Alcázar\nEarly Afternoon, Early February 1431\n\nJuan closes the door firmly and draws Isabel into his arms. She comes willingly, her initial surprise melting into warmth as he kisses her. What follows is natural between husband and wife—passionate on his part, willing and affectionate on hers.\n\nAfterward, as they lie together briefly, Isabel rests her head against his chest, quiet and content. There's a peacefulness to the moment, the winter afternoon light streaming through the windows.\n\n\"The chapel,\" Juan reminds her after a time.\n\nIsabel nods, sitting up and reaching for her discarded clothing with that particular mixture of modesty and practicality. \"Yes, of course. I've been eager to see it completed.\"\n\nShe dresses with Juan's help—the complex gowns require assistance—and calls for Doña Beatriz to help with the final adjustments and her veil. The older Portuguese lady enters with knowing discretion, asking no questions, simply helping her mistress become presentable again.\n\nWithin a quarter hour, they're both properly dressed. Isabel links her arm through Juan's as they leave her chambers, her cheeks still slightly flushed but her bearing composed.\n\nThe Portuguese Chapel, Royal Alcázar\nMid-Afternoon\n\nThe chapel is in the eastern wing of the Alcázar, a modest space that's been thoroughly transformed over the past month. As Juan and Isabel enter, the change is immediately apparent.\n\nThe previous Castilian decorations have been replaced with distinctly Portuguese elements. The altar cloth bears Portuguese heraldry—the five blue shields on white. Portuguese saints have been added to the niches: Saint Anthony of Lisbon (patron of Portugal), Saint Isabel of Portugal (the Queen's namesake), and others. The windows have been fitted with new glass in blue and white, casting colored light across the stone floor.\n\nMost significantly, a small shrine has been established on the right side—clearly for private devotion. It contains a beautifully carved wooden statue of the Virgin Mary in Portuguese style, surrounded by candles and a kneeling bench covered in blue velvet.\n\nIsabel stops in the doorway, her hand tightening on Juan's arm. For a moment she says nothing, simply looking at the transformed space. Then Juan sees tears gathering in her eyes.\n\n\"It's...\" her voice catches slightly. \"It's like a piece of home. Here in Castile.\"\n\nShe walks forward slowly, taking in every detail. She touches the altar cloth gently, examines the saints' statues, then kneels at the private shrine. Her lips move in silent prayer—genuine, heartfelt devotion.\n\nWhen she rises and turns back to Juan, her plain features are transformed by emotion. \"Thank you,\" she says quietly. \"I know you did this for me. To give me a place where I could feel... myself. Where I could pray in the way I learned as a child.\"\n\nShe moves back to him, taking both his hands in hers. \"Every evening, we'll pray here together. As you promised. This will be our place.\"\n\nWhat does Juan say?\n\nThe Portuguese Chapel:\n\nCompleted renovations\n\nPortuguese heraldry and saints\n\nPrivate devotional shrine\n\nBlue and white color scheme\n\nReady for daily evening prayers together"
        },
        {
          "role": "player",
          "text": "Lets pray together.\n\n\nI kneel down with Isabel.\n\n\nO lord father, hear us.\n\n\nBefore you sit two of your children. King and queen. You know our worries and shortcomings father, we do not hide them from you. We each have a different role to play in your design. Be with me father when I rule as king and lead your crusade. Do not only grant me wisdom, but protect me as well so I may return to my beloved Isabel. Be with her as well father as she sets out to travel with me. Her life has changed so much since she has left her home in Portugal. She has aquitted herself with such grace, may she continue to do so and bear the responsibilities as queen by my side in the days and years to come.\n\n\nPray grant us father our greatest desire and let us not only be husband and wife, king and queen but also mother and father. Bless our union and see the love and affection we hold for one another. We know that our problems and desires are so small and insignificant to you as we lay them humbly at your feet.\n\n\nForgive me father, your servant for my shortcomings as a husband. When I upset Isabel, I feel like I have failed. Sometimes no matter what I do, it always seems to be the wrong thing. Guide your son as I learn to navigate Isabel's heart. That I may understand her better so I can take care of her. That I can protect her. And stand before any evil threatening her. I am your soldier Isabel, just point out your worries and I will make them go away.\n\n\nBless this moment when we are alone together and all future moments when we seek each other's company.\n\n\nAmen."
        },
        {
          "role": "gm",
          "text": "There's a moment at the end where Juan seems to shift from praying to God to speaking directly to Isabel (\"I am your soldier Isabel\") - this is a touching slip, showing how his devotion to her and to God are intertwining.\n\nIsabel would be deeply moved by this prayer. She's conventionally pious, finds her comfort in faith, and Juan is speaking her language here. The vulnerability he shows, the genuine care for her, the acknowledgment of his struggles to understand her - all of this would touch her heart.\n\nGiven that she's at \"Comfortable and Dutiful\" (rolled 31) in terms of her emotional response to their intimate life, and we know she's developing genuine affection, this prayer would push her emotional connection deeper. Not to the level of passionate love yet, but definitely strengthening the bond.\n\nShe would likely respond with her own prayer, probably more traditional and less personal, but heartfelt. Then she might address his concern about \"always doing the wrong thing\" - reassuring him, because she's actually quite content.\n\nThis is early March conception time based on the roll (52 - Early March Conception). So this is likely happening right around when she conceives, though neither would know yet.\n\nThe Portuguese Chapel, Royal Alcázar\nMid-Afternoon, Early February 1431\n\nIsabel kneels beside Juan at the shrine, her hands folded in prayer, her head bowed. As he speaks, Juan can see her shoulders stiffen slightly at first—the formal posture of someone preparing to hear a conventional royal prayer. But as his words continue, as the vulnerability and genuine emotion become clear, something changes in her bearing.\n\nWhen Juan finishes with \"Amen,\" there's a moment of profound silence in the chapel. Then Isabel whispers her own \"Amen,\" her voice catching slightly.\n\nShe remains kneeling, her eyes still closed, and begins her own prayer—her voice soft but steady:\n\n\"Heavenly Father, I thank You for bringing me to this place, to this man. When I left Portugal, I was frightened. I thought I was being sent away from everything I knew, to a foreign land, to a stranger.\"\n\nHer hands clasp tighter. \"But You have been merciful. You gave me a husband who prays with me, who thinks of my comfort, who...\" her voice wavers, \"...who cares whether I am upset. Who wants to understand my heart.\"\n\n\"Bless Juan, Father. Protect him in battle. Bring him home safely. Let me be worthy of the care he shows me. Let me be a good wife to him, a good queen for Castile. And if it is Your will...\" she pauses, her breath catching, \"...make me a mother. Let our union bear fruit. Let me give him the child he desires, the heir Castile needs.\"\n\n\"Thank You for this chapel. For this place where we can come together before You. For these moments of peace before the war begins. Amen.\"\n\nWhen she opens her eyes and turns to look at Juan, tears are streaming down her face. She reaches out, touching his cheek gently.\n\n\"Juan,\" she says—not 'Your Majesty' or 'my lord,' just his name. \"You don't always do the wrong thing. You... you don't understand. I'm not upset with you. I'm not unhappy. Sometimes I don't know how to tell you what I'm feeling because I don't fully understand it myself.\"\n\nShe takes both his hands in hers, squeezing them. \"I was raised in convents. I was taught to be quiet, obedient, dutiful. To not think too much about my own feelings, just to do what was expected. And now you ask me what I feel, what I want, what troubles me...\"\n\nA small, helpless laugh escapes her. \"Sometimes I don't know how to answer because no one ever asked me before. Not truly. You're teaching me that I'm allowed to have feelings, to express them. It's... new. And a little frightening. But also...\" she searches for the word, \"...freeing.\"\n\nShe leans her forehead against his shoulder, still holding his hands. \"You're not failing as a husband. You're patient with me when I don't know how to be a wife except through duty. You're kind when I'm awkward. You made me this chapel so I would have a piece of home. You pray for my worries and call yourself my soldier.\"\n\nShe pulls back to look at him directly, her plain face radiant with sincerity. \"I am content, Juan. More than content. I am... I am happy. Truly happy. For the first time since leaving Portugal, I feel like I belong somewhere. With someone.\"\n\nWhat does Juan say or do?\n\nIsabel's Emotional State:\n\nDeeply moved by Juan's vulnerable prayer\n\nFeeling understood and valued\n\nStruggling to articulate complex new emotions\n\nGenuinely happy in the marriage\n\nGrowing affection and trust"
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_1431_00087",
      "book": 1,
      "chapter": "1.14",
      "date": "1431-03-02",
      "end_date": "1431-03-07",
      "type": "personal",
      "summary": "Final weeks in Toledo: Juan trains daily in armor, building endurance to 6 hours in full harness. March 2: departure for Jaen. Roll: 99 (Exceptional Journey with Notable Event). Roll: 92 (The Letter from Portugal). Six-day journey through La Mancha and hill country. Isabel insists on riding horseback instead of wagon, proves herself a competent rider. Day 5: courier delivers letter from Isabel's mother, the Queen of Portugal. The Queen Mother reveals her own arranged marriage started cold but became deep love over 20 years. Advice: 'Do not hide yourself from Juan. Show him your true self. Love grows like a garden — plant seeds now.' Isabel reads the letter aloud to Juan, breaks down crying, and confesses all her hidden fears — fear of failing as queen, fear of not giving him a son, fear he deserved someone better. She asks him to know the 'real' Isabel. The moment fundamentally transforms their relationship from comfortable duty to genuine emotional partnership. Isabel conceived during this journey (early March, per pregnancy roll). Neither knows yet. Arrival at Jaen March 7.",
      "characters": [
        "juan_ii",
        "isabel_of_portugal",
        "dona_beatriz",
        "alvaro_de_luna"
      ],
      "factions_affected": [],
      "location": "Jaen",
      "tags": [
        "personal",
        "journey",
        "marriage",
        "emotional",
        "roll"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "I spend the rest of the day with Isabel preparing for travel. I wear my armour more to get accustomed to wearing it for longer periods of time. I dont want to drop down during battle just from exhaustion. I learn to make myself more comfortable not always wearing all parts of the armour and move around wearing my chainmail most of the day anyway.\n\n\nThen we leave for Jaen to be on time there for the mustering of the army.\n\n\nGenerate a table d100 to determine how successful we are in travelling, me and Isabel."
        },
        {
          "role": "gm",
          "text": "**Factors Favoring Successful Travel:**\n- Royal escort and protection (well-guarded)\n- Main roads between Toledo and Jaén (relatively well-maintained)\n- Early March weather (spring, not terrible winter conditions)\n- Planned journey with adequate preparation\n- Isabel is young and healthy\n- Juan is experienced with travel now\n- About 120 miles, 6-7 days of comfortable travel planned\n\n**Factors Against/Complications:**\n- Isabel is 15, not used to extended travel\n- Early March can still have rain/mud\n- Mountain passes between La Mancha and Jaén\n- Potential bandits (though unlikely with royal escort)\n- Isabel may be newly pregnant (conceived early March per the roll) - might have early symptoms\n- Large baggage train slows travel\n- Medieval roads can be rough\n\nThe journey should mostly go well given the preparation and resources, but there's room for complications. Let me create a table that reflects this.\n\nThe Weeks Before Departure\nMid-February to Early March 1431\n\nJuan spends the remaining weeks in Toledo preparing for war in the most practical way—by living in his armor. Each morning he dons the Milan white plate piece by piece, learning which straps can be loosened for comfort, which pieces can be temporarily removed during rest, how to manage the weight for hours at a time.\n\nThe chainmail becomes his constant companion. He wears it under his doublets during the day, feeling the weight on his shoulders, learning how to move naturally despite it. At first it's exhausting—his shoulders ache, his neck is stiff. But gradually his body adapts. The crusaders training in the encampment see their king walking the grounds in mail and half-plate, and it inspires them.\n\nIsabel watches this transformation with a mixture of concern and pride. She helps him with the straps, learns which pieces go where, understands that this is how he prepares for the reality ahead.\n\nBy early March, Juan can wear full harness for six hours without debilitating fatigue. Not comfortable, but manageable. Enough to fight a battle if needed.\n\nPreparations for the journey are extensive. Isabel's belongings must be packed, her Portuguese ladies prepared for travel, proper wagons and tents arranged. The royal household mobilizes for a move to a military staging area.\n\nD100 Table: Journey from Toledo to Jaén (Early March 1431)\n\n1-3: Disaster\nSevere spring storms hit the second day out. Roads turn to impassable mud. A wagon carrying Isabel's belongings overturns, and she falls ill from exposure to cold rain. The journey takes 12 days instead of 7, and Isabel arrives at Jaén exhausted, feverish, and miserable. She requires bed rest for a week upon arrival. The army assembly is delayed while the King tends to his sick wife.\n\n4-10: Serious Complications\nHeavy rains and muddy roads slow progress significantly. Isabel suffers from travel sickness—nausea, fatigue, possibly early pregnancy symptoms. One of her Portuguese ladies becomes ill. The journey takes 10 days with frequent stops. Isabel arrives at Jaén worn out and needing several days to recover. The romantic aspect of traveling together is overshadowed by discomfort.\n\n11-25: Multiple Difficulties\nModerate rain and poor road conditions in the mountain passes. Isabel finds the journey more taxing than expected—the constant movement, sleeping in tents, simple camp food. She doesn't complain but is clearly struggling. Takes 9 days. She's relieved to arrive at Jaén but the experience has dampened her enthusiasm for traveling with the army. Minor tensions arise from the hardships.\n\n26-45: Challenging but Manageable\nSome rain and muddy stretches slow progress. Isabel experiences discomfort—sore from riding/wagon travel, tired from irregular sleep, possibly early morning nausea (early pregnancy). Takes 8 days. She handles it with characteristic dutiful grace but is clearly not enjoying the experience. Arrives at Jaén tired but functional. Realizes traveling with an army is harder than anticipated.\n\n46-65: Adequate Journey\nWeather is mixed but manageable. Isabel finds travel tiring but bearable. Some discomfort, some beautiful moments. They make decent time—7-8 days as planned. Isabel arrives at Jaén in reasonable condition, having learned what campaigning involves. Neither wonderful nor terrible—just the reality of medieval travel. Their evening prayers together in wayside chapels or tent provide comfort.\n\n66-80: Good Journey\nWeather cooperates reasonably well. Isabel proves more resilient than expected, finding the journey an adventure despite discomfort. Takes 7 days as planned. Some lovely moments—sunrises over La Mancha, evening prayers together, conversations during travel. Isabel arrives at Jaén tired but in good spirits, proud she managed the journey. Their bond strengthens through shared experience.\n\n81-90: Very Successful\nExcellent weather for early March. Isabel adapts well to travel life, discovering she's more capable than she thought. Juan's preparation and her Portuguese ladies' support make the journey comfortable. Takes 6-7 days. Beautiful scenery, good roads, no incidents. They arrive at Jaén in good condition and good spirits. Isabel feels confident about remaining with the army (at least until pregnant).\n\n91-97: Excellent Journey\nPerfect traveling conditions. Isabel surprises everyone, including herself, by genuinely enjoying much of the journey—the freedom of the road, the changing landscapes, time alone with Juan away from court. Takes 6 days. Several memorable moments that become fond memories. She arrives at Jaén energized and ready for the challenges ahead. The experience deepens their marriage significantly.\n\n98-100: Exceptional Journey with Notable Event\nIdeal weather and conditions. Isabel not only handles the journey well but has a transformative experience—perhaps a moment of spiritual revelation at a wayside shrine, or a profound conversation with Juan under the stars, or witnessing something that makes her truly understand the crusade's purpose. The journey becomes a pilgrimage of sorts. They arrive at Jaén with their relationship transformed, both feeling blessed. Additionally, something fortunate occurs—perhaps they rescue travelers from bandits (burnishing Juan's reputation), or they're given an enthusiastic welcome at a town that inspires the people, or they receive unexpectedly good news via courier.\n\nRoll your d100 to determine how the journey to Jaén unfolds."
        },
        {
          "role": "player",
          "text": "I rolled 99. so thats great!\n\n\nYou mention some fortunate event occurs that transforms Isabel and Juan. What would this be? We keep this result in mind from now on, but generate anothed d100 table for the sort of event that occurs."
        },
        {
          "role": "gm",
          "text": "D100 Table: The Transformative Event During the Journey to Jaén\n\n1-8: The Miracle at the Shrine\nAt a wayside shrine to Santiago, Isabel experiences a profound spiritual moment. While praying, she sees what she believes is a vision or sign—perhaps a beam of light illuminating the saint's statue at the exact moment she prays for a child, or she finds a perfectly white dove feather on the altar (symbol of the Holy Spirit). She becomes absolutely convinced God has blessed their union and will grant them a child. This certainty transforms her from dutiful wife to passionate believer in their shared destiny. Juan witnesses her transformation and is moved by her faith.\n\n9-16: Saving the Children\nThey encounter a village devastated by recent Granadan raiders—burned homes, slaughtered men. A group of orphaned children huddle in the church, terrified and starving. Isabel immediately takes charge, organizing food distribution, comforting the children, arranging for their care. Juan sees a side of her he's never witnessed—commanding, compassionate, fierce in protecting the innocent. She tells him through tears: \"This is why we fight. Not for glory, but for them.\" The moment crystallizes the crusade's moral purpose for both of them and deepens their bond through shared conviction.\n\n17-24: The Bandit Ambush\nBandits attack the column. Juan and his guards engage them while Isabel remains with her ladies. One bandit breaks through toward the Queen's wagon. Isabel, instead of freezing, grabs a fallen guard's sword (badly, awkwardly) and actually tries to defend herself. Juan arrives in time to dispatch the threat, but he's stunned—she didn't scream or faint, she tried to fight. Afterward, her hands shake violently and she cries from the terror, but Juan holds her and tells her she was brave. She discovers she has courage she didn't know existed. Their mutual respect deepens enormously.\n\n25-32: The Confession Under Stars\nOne night camping in La Mancha, under brilliant stars, they have their longest, most honest conversation ever. Away from court, from expectations, they truly talk—about fears, hopes, inadequacies, dreams. Isabel admits she sometimes feels like she's playing a role, not living. Juan admits the same. They realize they're both young people thrust into enormous roles, both scared, both doing their best. The vulnerability creates profound intimacy. They make love under the stars afterward, and it's different—not duty, not even just affection, but genuine passion born of true understanding.\n\n33-40: The Pregnant Woman\nThey find a pregnant woman in labor on the roadside, abandoned because traveling was slowing her family's flight from Granada raids. Isabel insists on stopping despite the delay. She helps deliver the baby with the assistance of her ladies and a local midwife they fetch. Juan watches in awe as his dutiful, quiet wife becomes fierce and commanding in the birthing chamber. The baby is born healthy—a boy. The grateful mother names him Juan. Isabel holds the infant afterward, tears streaming, and tells Juan: \"I want this. I want to give you a son.\" The experience makes motherhood real and urgent for her, not just duty.\n\n34-48: The Old Knight's Blessing\nThey stop at a small castle where an ancient knight—a veteran of earlier Granada campaigns—offers hospitality. Over dinner, he tells stories of decades of frontier warfare, of losses and victories, of the long struggle. He looks at young Juan and says something profound about kingship, sacrifice, and purpose that crystallizes Juan's understanding of his role. Then he blesses both of them, saying he sees in them the ones who will finally finish what his generation could not. The old man dies three days later (they learn by courier). His blessing becomes something they both treasure—a passing of the torch from one generation to the next.\n\n49-56: The Moorish Merchant\nThey encounter a Moorish merchant traveling under safe-conduct, a man of obvious learning and dignity. Over a shared meal, he speaks candidly about Granada's internal divisions, about Muslims who might welcome peace, about the difference between warriors and ordinary people. Isabel, surprising everyone, engages him in thoughtful conversation about faith and coexistence. Juan sees her intelligence and genuine curiosity. The conversation challenges both their assumptions—the crusade is righteous, but the enemy is human, complex. It deepens their understanding without diminishing their resolve. The merchant gifts Isabel a beautiful book of Arabic poetry in translation before departing.\n\n57-64: The Thunderstorm Revelation\nA massive thunderstorm forces them to shelter in a small church. Lightning strikes close by, terrifyingly powerful. In the darkness, holding each other, Isabel admits her deepest fear: \"What if I can't give you a son? What if I fail?\" Juan's response—that she could never fail him, that she's already more than he hoped for—unlocks something in her. She realizes he truly loves her, not just as duty or convenience, but as a person. The storm passes. They emerge to find a rainbow arcing across the sky. Both take it as a sign. Their relationship transforms from comfortable partnership to genuine love.\n\n65-72: The Veteran Crusader\nThey meet an old crusader who fought in Juan's grandfather's campaigns. He's now blind, living in a monastery. He asks to touch Juan's face, to \"see\" the new crusader king. After a long moment, he declares: \"You have your grandfather's spirit, but a kinder heart. You'll do what he couldn't—not through cruelty, but through faith.\" Then he asks to meet Isabel. He touches her face too, and says: \"A queen of Portugal for a crusade of Castile. God works in patterns. You are meant to be here.\" The blessing and prophecy profoundly moves both of them, giving them a sense of destiny and purpose beyond politics.\n\n73-80: The Village Welcome\nA village turns out en masse to welcome them—not because they're ordered to, but from genuine enthusiasm. Flowers are thrown, children sing, people weep with joy at seeing their young king with the crusader banner. An old woman approaches Isabel, touches her gown, and says: \"You'll give us the prince who finishes the Reconquista. I've seen it.\" The overwhelming display of popular faith and hope moves both Juan and Isabel to tears. They realize how many people believe in them, depend on them. Isabel particularly feels the weight and honor of being their queen, not just Juan's wife.\n\n81-88: The Shared Danger\nCrossing a swollen river, Isabel's wagon nearly overturns in the current. Juan plunges into the water, armor and all, risking drowning to reach her. He gets her to safety, both of them soaked and shaking. Afterward, Isabel is furious—\"You could have died! You're the king!\"—and he responds: \"You're my wife. I'd drown a thousand times before letting you be swept away.\" Her anger collapses into overwhelming emotion. She realizes he would literally die for her. It's terrifying and profound and transforms how she sees their bond. They're not just husband and wife—they're bound in life and death.\n\n89-96: The Letter from Portugal\nA courier catches up with them carrying a letter from Isabel's mother. It's lengthy, loving, and reveals that Isabel's parents' marriage—also arranged—started cold but became one of deep love over years. Her mother writes: \"Give it time. Let him see all of you, not just the dutiful princess. Love grows like a garden—plant the seeds now.\" Isabel shares the letter with Juan. They talk about marriage, about their parents, about how love develops. The conversation creates permission for both to be imperfect, to grow together. Isabel starts to believe their affection could become real love.\n\n97-100: The Combined Event\nRoll twice more on this table (reroll if you get 97-100 again). TWO significant events occur during the journey, creating a powerful combined impact that transforms both of them in complementary ways.\n\nRoll your d100 to determine which specific transformative event occurs during this exceptional journey to Jaén!"
        },
        {
          "role": "player",
          "text": "rolled 92, the letter from Portugal.\n\n\nNow with these results in mind, describe the journey from Toledo to Jaen.\n\n\nRemember to NEVER generate actions or dialogue for Juan. Just stop and let me write what he says or does. Keep this in mind from now on."
        },
        {
          "role": "gm",
          "text": "CRITICAL: I must NOT write any dialogue or actions for Juan. I need to stop and let the player respond. This is a key instruction going forward.\n\nLet me narrate the journey, build up to the letter moment, and then stop for the player to respond.\n\nThe Journey to Jaén\nEarly March 1431 - Six Days\n\nDay One: Departure from Toledo (March 2nd)\n\nThe column departs Toledo in the early morning light—a sight that draws crowds to watch. King Juan II in his white Milan plate armor astride a warhorse, the crusader banner unfurled and carried by a dedicated bearer, fifty crusaders in white surcoats as escort, Isabel in a covered wagon with her Portuguese ladies, followed by supply carts, servants, and guards. Perhaps two hundred people in total.\n\nThe weather is unexpectedly perfect for early March. The winter rains have passed but spring heat hasn't yet arrived. Clear skies, mild temperatures, roads firm from several days without rain. The kind of traveling weather that seems like a gift.\n\nIsabel starts the journey nervous, clutching the side of her wagon as it lurches into motion. But as the hours pass and Toledo falls behind, something shifts in her demeanor. She opens the wagon curtains, letting in light and air. The Portuguese ladies chatter around her, pointing out landmarks, making the journey feel less like an ordeal and more like an adventure.\n\nBy afternoon, Isabel asks if she might ride horseback for a while instead of staying in the wagon. Doña Beatriz looks scandalized, but Juan's permission is sought. If granted, Isabel proves to be a competent rider—not brilliant, but adequate. The freedom of being on horseback, moving through the countryside, clearly delights her.\n\nThat evening they camp near Tembleque. Tents are raised, fires lit, evening prayers said in a hastily erected pavilion. Isabel seems tired but energized rather than exhausted. Over a simple camp meal, she's more talkative than usual, asking questions about the terrain, about military logistics, showing genuine interest.\n\nDay Two: Through La Mancha (March 3rd)\n\nThe second day takes them deeper into La Mancha—the vast, flat heartland of Castile. The landscape is austere but has a stark beauty: endless plains, distant windmills, small villages of white-washed houses. The sky seems impossibly large.\n\nIsabel rides horseback again for most of the day. Something about the open country affects her—perhaps the sense of space, of possibility. She's more animated than Juan has ever seen her at court. The Portuguese ladies notice it too, exchanging pleased glances.\n\nAround midday, they pass through a small town that turns out to welcome them. Word has spread that the crusader king and his new queen are traveling through. Villagers line the road, children wave, an old priest offers blessings. It's spontaneous, genuine. Isabel is visibly moved by the warmth of the reception.\n\nThat night, camping under the stars, Isabel joins Juan outside the tent pavilion for a while after evening prayers. The night sky in La Mancha is breathtaking—thousands of stars visible without city lights to dim them. She's quiet but companionable, sitting close to him, wrapped in a cloak against the cooling air.\n\n\"It's beautiful,\" she says softly, looking up. \"I've never seen stars like this. In the convent, we went to bed early. At court, there are always torches and lamps. But here...\" She trails off, simply gazing upward.\n\nDay Three: The Hill Country (March 4th)\n\nThe third day brings the first gentle hills as they approach the Sierra Morena foothills. The terrain becomes more varied—olive groves, oak forests, streams cutting through valleys. The weather continues perfect.\n\nIsabel grows more confident on horseback, riding for longer stretches. She begins to understand the rhythm of campaign travel—the early starts, the steady pace, the mid-day rest, the race to reach the planned stopping point before darkness. It's arduous but there's a simplicity to it that seems to appeal to her structured, dutiful nature.\n\nA memorable moment occurs at a wayside shrine to Saint James. The column stops to allow prayers. Isabel dismounts and enters the small chapel. She prays for a long time—longer than usual. When she emerges, her eyes are red but her expression is peaceful, almost radiant. She doesn't explain what she prayed for, but there's a quiet certainty about her for the rest of the day.\n\nThat evening, she asks Juan to tell her about his pilgrimage to Santiago de Compostela. She listens intently to the stories—the long walk, the struggles, the moment of renunciation before the Pope. \"You gave up everything for this crusade,\" she says quietly. \"Your own desires, your own plans. Everything.\" There's new understanding in her voice.\n\nDay Four: Into the Mountains (March 5th)\n\nThe fourth day takes them into proper mountain passes. The road becomes steeper, more winding. Progress slows but the scenery is spectacular—peaks rising around them, eagles circling overhead, spring flowers beginning to bloom in sheltered valleys.\n\nIsabel continues to surprise everyone with her resilience. No complaints about the harder terrain, no requests to slow down. If anything, she seems energized by the challenge. The Portuguese ladies are less enthusiastic—several suffer from saddle soreness and fatigue—but Isabel herself is thriving.\n\nDuring the mid-day rest, she sits with Juan away from the main group, eating simple travel bread and cheese. \"I thought I would hate this,\" she admits. \"When you said I would travel with the army, I was frightened. I imagined being miserable, being a burden, wanting to go home.\" She looks around at the mountains. \"But I don't hate it. I feel... I don't know. More capable than I thought. Like I'm discovering I can do things I didn't know I could do.\"\n\nThat night's camp is in a mountain valley beside a clear stream. The evening prayers feel especially meaningful, surrounded by God's creation in such dramatic form. Isabel's voice joining Juan's in the prayers is stronger, more confident than it was even a week ago.\n\nDay Five: The Courier (March 6th)\n\nThe fifth day begins with continued mountain travel. The passes are navigated successfully, and by afternoon they're beginning the descent toward the Guadalquivir valley and Jaén beyond.\n\nIt's during the afternoon rest stop that a courier catches up with them—a rider who's been pursuing the column since Toledo. He carries letters, including one sealed with Portuguese royal marks addressed to Queen Isabel.\n\nThe courier is brought to the royal pavilion. He bows deeply, travel-stained and exhausted. \"Your Majesties, dispatches from Toledo. One urgent letter for Her Majesty the Queen from Portugal.\"\n\nIsabel's hands tremble slightly as she takes the letter. Her mother's seal. She looks at Juan, uncertainty flickering across her face—should she read it privately? Should she share it?\n\nThe letter is lengthy, multiple pages in her mother's careful hand. Isabel breaks the seal and begins to read, her eyes moving rapidly across the lines. Juan can see emotions playing across her face—surprise, then something deeper, more profound. Her eyes fill with tears, but she's smiling.\n\nShe reads for several long minutes in silence. Then, clutching the pages, she looks up at Juan with an expression of such vulnerability and hope that it transforms her plain features into something almost luminous.\n\n\"My mother...\" Isabel's voice catches. \"She writes about marriage. About her own marriage to my father.\" She hesitates, then seems to make a decision. \"May I... may I read you part of it?\"\n\nShe doesn't wait for an answer, her need to share overwhelming her usual caution:\n\n\"My dearest Isabel,\n\nYour letters bring me such joy, knowing that you are settling into your new life and that King Juan treats you with kindness. But I sense in your words an uncertainty, a searching for something you cannot quite name. You write that you are 'content' and 'doing your duty well.' These are good things, my daughter, but they are not everything.\n\nI must tell you something about your father and me. Our marriage was arranged when I was your age—fifteen years old. I had never met the King of Portugal before our wedding day. I was terrified. For the first year, perhaps longer, I was merely dutiful. I performed my obligations. I was polite. I tried to please him. But I held myself apart, showing him only the princess I was taught to be, never the girl underneath.\n\nIt was not until I allowed him to see my fears, my inadequacies, my true self—not just the perfect, dutiful princess—that love began to grow between us. The turning point came one night when I confessed to him that I felt like I was failing, that I didn't know how to be a proper queen, that I was frightened all the time. I expected disappointment. Instead, he held me and confessed his own fears, his own sense of inadequacy.\n\nFrom that moment of shared vulnerability, real love began. Not the distant, formal partnership of duty, but genuine affection, trust, desire. Now, twenty years later, your father is not just my king and husband—he is my dearest friend, the person I trust most in the world.\n\nMy darling daughter, here is what I wish for you: Do not hide yourself from Juan. Show him not just the dutiful queen, but Isabel—the girl who reads poetry, who prays with her whole heart, who has fears and hopes and dreams. Let him see you struggle. Let him see you uncertain. Let him see you fully human.\n\nLove in arranged marriages does not arrive complete on the wedding night. It grows like a garden—you must plant seeds now. The seed of honesty. The seed of vulnerability. The seed of allowing yourself to be truly known. Water these seeds with patience and attention, and over months and years, love will grow.\n\nYou write that Juan is kind, that he prays with you, that he has made you a Portuguese chapel. These are not small things, Isabel. These are the actions of a man who cares. But he can only care for the Isabel he knows. If you show him only the dutiful surface, he will care for that surface. If you show him your true self, he might come to love that self.\n\nTrust him with your fears. Trust him with your inadequacies. Trust him with the parts of yourself you usually hide. Give yourselves time—not just months, but years—to grow into love. It will not happen overnight, but I truly believe it can happen.\n\nI see in your letters that you already care for him more than you perhaps realize. You worry when he trains too hard. You think about how to please him. You notice small details about his moods. These are the first tender shoots of love beginning to grow.\n\nBe patient with yourself. Be patient with him. Be brave enough to be vulnerable. And know that your father and I pray for you every day, that your marriage might become as blessed as ours has been.\n\nWith all my love,\nYour mother\"\n\nIsabel's voice has been growing thicker with emotion as she reads. By the end, tears are streaming down her face. She looks at Juan with raw, unguarded feeling.\n\n\"She's right,\" Isabel whispers. \"I've been so afraid of doing everything wrong, of disappointing you, that I've only shown you the dutiful princess. The girl who does everything correctly. But that's not... that's not all of me.\"\n\nShe clutches the letter like a lifeline. \"I'm frightened all the time, Juan. Frightened I'll fail as a queen. Frightened I won't give you a son. Frightened you'll realize you deserved better than a plain Portuguese princess who doesn't know how to be clever or charming. I hide all of this because I thought... I thought if you saw how scared and inadequate I really am, you'd be disappointed.\"\n\nHer plain face is transformed by emotion—vulnerable, open, utterly honest. \"But my mother is right. If I keep hiding, you'll never know me. And I want...\" her voice breaks, \"...I want you to know me. The real me. Not just the dutiful surface.\"\n\nShe waits, trembling slightly, tears on her cheeks, having just revealed more of herself than she perhaps ever has before.\n\nWhat does Juan say or do?"
        },
        {
          "role": "player",
          "text": "I think I wanted you be in love with you from the moment we met Isabel. Now I think that I truly do. I love to see you ride all day and enjoy the outdoors. You are so beautiful when you are confident, riding beside me on the road.\n\n\nI am glad you are with me Isabel, I truly am.\n\n\nI proceed to have intercourse with her to seal our love."
        },
        {
          "role": "gm",
          "text": "Mountain Valley Camp\nEvening, March 6th\n\nIsabel's eyes widen at Juan's words, fresh tears spilling over. \"You... you love me?\" Her voice is barely a whisper, disbelieving and hopeful at once.\n\nWhen he affirms it, when he speaks of her beauty and confidence, something breaks open in her expression—joy, relief, overwhelming emotion. She moves into his embrace, clutching him tightly, her face pressed against his chest.\n\n\"I love you too,\" she whispers against him. \"I didn't know if I was allowed to say it. If it was too soon. If it was just duty that I was mistaking for something more. But I do. I love you, Juan.\"\n\nThe intimacy that follows is private, sacred—a consummation not just of their bodies but of this new depth of emotional connection and mutual vulnerability.\n\nDay Six: Descent to Jaén (March 7th)\n\nThe final day of travel dawns bright and clear. The column descends from the mountains toward the Guadalquivir valley and the fortress city of Jaén beyond.\n\nIsabel rides beside Juan for most of the day, and there's something fundamentally different about her presence now. She sits taller in the saddle. She meets his eyes more readily. She smiles more freely. The carefully constructed dutiful mask has cracked, revealing the genuine young woman beneath.\n\nThey talk as they ride—not about politics or duty, but about small things. Childhood memories. Favorite prayers. What they hope for their children someday. The conversation flows naturally, comfortably, with long silences that feel companionable rather than awkward.\n\nThe Portuguese ladies notice the change, whispering among themselves. Doña Beatriz looks especially pleased, as if she's witnessed something she'd hoped for but hadn't quite believed would happen so soon.\n\nBy mid-afternoon, Jaén comes into view—the fortress city perched on its hillside, dominating the valley below. Beyond it, to the south, the mountains of Granada rise in the distance. The frontier. The battleground.\n\nThe sight sobers both of them. This is no longer a romantic journey through the countryside. This is the staging area for war.\n\nAs they approach the city gates, they can see activity—troops already beginning to assemble, tents being erected outside the walls, the machinery of war preparation in motion.\n\nIsabel reaches over and briefly touches Juan's armored hand. \"Whatever comes,\" she says quietly, \"we face it together. Until I must go back to Toledo.\" There's no fear in her voice now, just steady resolve.\n\nThe gates of Jaén open to receive them. The journey that transformed their marriage is complete.\n\nThey have arrived at Jaén on March 7th, eighteen days before the army assembly deadline of March 25th. The campaign will begin in April. Isabel is not yet showing signs of pregnancy, though conception occurred during these six days (per the earlier roll placing conception in early March).\n\nWhat does Juan do upon arriving at Jaén?"
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_1431_00088",
      "book": 1,
      "chapter": "1.14",
      "date": "1431-03-07",
      "end_date": null,
      "type": "military_action",
      "summary": "Eastern army briefing at Jaen with Don Pedro González de Padilla (Master of Calatrava). Status: ~3,000 troops present, full 23,000 expected by March 25. Military Orders committed: Calatrava 1,500 knights, Santiago 2,000, Alcántara 1,000. Four supply depots operational at Ciudad Real, Úbeda, Baeza, and Jaen. Intelligence: Granada concentrating forces westward and near Granada city, unaware of eastern offensive's full scale. 3,000 cavalry organized into six raiding columns of 500 each. Six surgeons contracted with field hospitals at each depot. Pietro's 5 bombards arriving late March. Strategy: drive toward Granada city, take fortresses to secure supply corridor, stay flexible. Pedro estimates 90-150 miles through mountains, 12+ significant fortresses; in 8 months could take 3-4 major positions pushing 40-60 miles deeper. Juan grants Pedro full command authority in his absence with formal letter. Infante Enrique must obey or face consequences. Pedro raises concern about Granada calling Ottoman/North African aid.",
      "characters": [
        "juan_ii",
        "pedro_gonzalez_de_padilla",
        "alvaro_de_luna"
      ],
      "factions_affected": [
        "royal_court"
      ],
      "location": "Jaen",
      "tags": [
        "military",
        "strategy",
        "briefing",
        "command"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "We set up camp and find accomodations for ourself and Isabel especially.\n\n\nI meet with the Master of Calatrava to discuss his campain preparations and his plans for the upcoming campain."
        },
        {
          "role": "gm",
          "text": "Jaén's fortress dominates the hillside city—a massive stone structure built over centuries, expanded and strengthened against Moorish raids. The current alcaide (fortress commander), Don Fernán Sánchez, has been expecting the King's arrival and has prepared the best quarters available.\n\nThe royal apartments are in the fortress's main keep—stone chambers that, while defensible, lack the comfort of Toledo's Alcázar. Servants work quickly to make them habitable: tapestries hung to block drafts, braziers lit against the mountain chill, proper furnishings brought from storage.\n\nFor Isabel, a suite of three connecting rooms is prepared: a bedchamber, a receiving room for her ladies, and a small private chapel. The windows face south toward the mountains of Granada—a constant reminder of the frontier's proximity. Doña Beatriz immediately sets about making the space comfortable, directing servants with practiced efficiency.\n\nIsabel surveys her new quarters with pragmatic acceptance. After six days on the road, sleeping in tents and simple wayside accommodations, even these austere fortress chambers seem adequate. \"It will do,\" she tells Doña Beatriz. \"We're not here for comfort.\"\n\nOutside the fortress walls, the eastern army's staging area is taking shape. What had been empty fields is now rapidly filling with activity:\n\nSupply depots being constructed, protected by wooden palisades\n\nArtillery grounds marked out for Pietro Calabrese's bombards when they arrive\n\nCrusader encampment areas designated, waiting for the Toledo and Seville crusaders\n\nNoble levy assembly points identified, each major house assigned specific camping areas\n\nStables and corrals for thousands of horses\n\nField hospitals being established by military surgeons\n\nWagon parks for transport and logistics\n\nThe machinery of war preparation hums with activity, even though most forces haven't yet arrived. The deadline is March 25th—eighteen days away. By then, this valley will hold 23,000 men.\n\nMeeting with the Master of Calatrava\n\nDon Pedro González de Padilla arrives at the fortress within an hour of Juan's arrival, having been notified by fast courier of the King's approach. He's been based in Jaén for the past two weeks, overseeing the initial preparations.\n\nHe's shown into Juan's working chambers—a stone room with maps already spread across a heavy oak table, documents stacked nearby, the military command center beginning to take form.\n\nDon Pedro is forty-five years old, wearing the black robes of Calatrava with the distinctive red cross. He's built like a soldier—broad-shouldered, scarred hands, the weathered face of a man who's spent decades on the frontier. His bearing is professional, direct, without courtly flourishes.\n\nHe bows. \"Your Majesty. Welcome to Jaén. The eastern army's heart.\" His voice is gravelly, matter-of-fact. \"I trust the journey was... manageable? The Queen is well?\"\n\nAfter Juan's response, Pedro moves directly to business, as is his nature. He gestures to the maps on the table—detailed charts of the Granada frontier, showing fortresses, mountain passes, river crossings, known Moorish patrol routes.\n\n\"The preparations proceed on schedule, Your Majesty. Let me brief you on the current status.\"\n\nHe begins methodically, pointing to various locations on the map:\n\nForce Assembly:\n\n\"As of this morning, we have approximately three thousand troops already present or arriving daily—early arrivals from nearby territories. By March 25th, we expect the full twenty-three thousand as summoned. The noble houses have been responsive. No significant delays reported.\"\n\n\"The Military Orders are committed: my own Calatrava brings fifteen hundred knights and men-at-arms, Santiago brings two thousand under Don Luis's coordination, Alcántara brings one thousand. All have confirmed they'll be in position by the deadline.\"\n\nSupply Situation:\n\n\"Father Tommaso's administrators have been... extraordinarily efficient.\" There's genuine respect in his voice. \"Supply contracts finalized. Forward depots being stocked—we have four primary bases along the frontier at Ciudad Real, Úbeda, Baeza, and here at Jaén. Food, fodder, ammunition, medical supplies flowing in daily.\"\n\n\"Provisions for twenty-three thousand men for eight months are being accumulated. The quartermaster corps Father Tommaso assigned is managing it well. I've never seen campaign logistics prepared with this level of detail.\"\n\nIntelligence Network:\n\nPedro taps several points on the map marking Granadan territories. \"Our scouts and spies report Granada is aware something is coming, but they don't yet know the scale. Sultan Muhammad IX has concentrated forces near Granada city and along the western approaches—he's expecting your main thrust there, given the historical pattern.\"\n\n\"He doesn't realize we're preparing a massive eastern offensive. The element of surprise may not last long once we assemble twenty-three thousand men here, but we should have at least a week or two of operational advantage when the campaign begins.\"\n\nCavalry Raiding Forces:\n\n\"The three thousand cavalry raiders are being organized into six mobile columns of five hundred each. Light, fast, able to strike deep into Granada territory and withdraw before they can be caught. Commanders selected—all experienced frontier fighters who know the terrain.\"\n\n\"Once operations begin, these columns will range across the entire frontier simultaneously. Force Granada to spread their defenses thin, gather intelligence on fortress strengths, identify opportunities for our main force to exploit.\"\n\nArtillery:\n\n\"Your Master Gunner—Pietro Calabrese, the Italian—sent word he'll arrive by late March with five bombards. I've prepared artillery positions and protected magazines for gunpowder storage. Never commanded with siege artillery before, Your Majesty. It will be... a learning experience.\"\n\nMedical Preparations:\n\n\"Six surgeons contracted, field hospitals established at each forward depot. Father Tommaso insisted on this—said you wanted wounded cared for properly. It's more medical support than I've ever seen for a campaign.\"\n\nPedro straightens from the maps, meeting Juan's eyes directly. \"Your Majesty, the eastern army will be ready to march in April as planned. Every element is falling into place. The budget, the logistics, the command structure—it's the most thoroughly prepared campaign I've ever been part of.\"\n\nHe pauses, then continues with characteristic honesty: \"I won't lie—commanding twenty-three thousand men still terrifies me. It's ten times larger than anything I've managed before. But with Don Luis advising, with Infante Enrique handling tactical coordination, with Father Tommaso's administrators managing logistics... I believe we can do this.\"\n\n\"The question is—\" he taps the map showing Granada's mountain fortresses, \"—what exactly do you want us to accomplish in the first campaign season? We can raid, we can gather intelligence, we can besiege isolated fortresses. But what are your strategic priorities, Your Majesty? Where do you want the eastern army focused once operations begin?\"\n\nHe waits for Juan's guidance on strategic objectives.\n\nWhat does Juan tell the Master of Calatrava about the eastern campaign's priorities and objectives?"
        },
        {
          "role": "player",
          "text": "We drive towards Grenada. The more forts we can take, the further we can go next year. We keep pressing into Grenada until we can lay siege to it without being concerned about our supply lines being raided from bases along the way.\n\n\nBut we stay light on our feet. A lot can happen. Maybe we have a big battle, maybe we dont. We start with the 3000 cavalry screening ahead. Once we start hearing back from them, we plan our next move."
        },
        {
          "role": "gm",
          "text": "Command Chamber, Jaén Fortress\nMarch 7th, 1431 - Evening\n\nDon Pedro González listens intently to Juan's strategic guidance, his weathered face showing concentration. When Juan finishes, the Master of Calatrava nods slowly, processing the approach.\n\n\"Drive toward Granada city. Clear the fortresses as we go. Secure the supply corridor.\" He traces a finger along the map from Jaén southward through the mountain passes toward Granada. \"It's bold, Your Majesty. But it's the right strategy. Half-measures won't win this war.\"\n\nHe studies the terrain more closely. \"The distance from here to Granada city is approximately ninety miles as the crow flies—but through mountains, it's more like one hundred twenty to one hundred fifty miles of actual marching. Between us and Granada...\" he points to various fortified positions, \"...there are at least twelve significant fortresses, perhaps more smaller strongholds.\"\n\nPedro taps several key positions. \"The major obstacles: Alcalá la Real here, about thirty miles south. Strong fortress, well-garrisoned. Then Moclín, guarding the approaches. Íllora. Each one commands vital passes or river crossings. Granada won't surrender these easily—each could require weeks to reduce if they resist.\"\n\nHe straightens, meeting Juan's eyes. \"But your approach—using the cavalry as our eyes and ears first—that's sound tactics. We don't commit the main army until we know what we're facing.\"\n\nThe Cavalry Screening Plan:\n\nPedro begins outlining how the reconnaissance will work: \"Once operations begin in April, we unleash the six cavalry columns simultaneously across a hundred-mile front. They probe every fortress, every garrison, every patrol route. Within two weeks, we'll have comprehensive intelligence on:\n\nWhich fortresses are strongly held, which are weak\n\nWhere Granada has concentrated their forces\n\nSupply routes and vulnerable points\n\nMorale among their garrisons—who might surrender, who'll fight to the death\n\nTerrain conditions and best approach routes for our artillery\"\n\n\"While the cavalry ranges ahead, the main army—twenty thousand infantry, artillery, supplies—advances at infantry pace toward whatever objective the intelligence reveals as most vulnerable or strategically valuable.\"\n\nFlexibility and Adaptation:\n\n\"Your Majesty's emphasis on staying flexible—that's crucial. If our cavalry discovers Granada has massed their field army at one location, we might choose to avoid battle and strike elsewhere. If they find a weak fortress isolated from support, we can take it quickly before Granada reinforces.\"\n\nPedro's expression grows more serious. \"The big question is whether Sultan Muhammad will give us a major battle. If he concentrates his forces—perhaps fifteen to twenty thousand troops—and meets us in the field, do we accept battle? Or do we maneuver around him?\"\n\nHe gestures at the map. \"A decisive victory in open battle could shatter their field army and open the way to Granada city in a single campaign season. But if we lose...\" he doesn't need to finish the thought.\n\n\"My recommendation: We should be prepared for battle but not seek it unless conditions favor us. Our advantage is numbers, artillery, and the crusaders' fanaticism. Granada's advantage is mobility, knowledge of terrain, and defensive positions. Let them come to us if they want battle—fight on ground of our choosing.\"\n\nThe Fortress Problem:\n\n\"Taking fortresses as we advance—that's the grinding work. Even weak fortresses can hold out for weeks if determined. Strong ones like Alcalá la Real? Could take a month or more of siege.\"\n\nPedro calculates aloud: \"Eight-month campaign season, April through November. If we spend three to four weeks taking each major fortress, we might manage three or four significant conquests in one season. That would push our secure supply line perhaps forty to sixty miles deeper into Granada—a quarter to a third of the way to Granada city.\"\n\n\"Not enough to besiege the capital this year, but enough to make next year's campaign significantly easier. And if we get lucky—if fortresses surrender quickly or we catch them weak—we might accomplish more.\"\n\nCoordination with Western Army:\n\nPedro glances at the map's western coast. \"Your plan is that once Granada commits their main forces against us in the east, the western army under Don Rodrigo strikes the coast with naval support. That timing will be critical. If we draw the Sultan's army east too early, before Rodrigo is ready, we face their full strength. If too late, they might not take the bait.\"\n\n\"We'll need fast, reliable communications between the armies. Couriers taking three to four days minimum between fronts. Signal fires from mountain peaks when major engagements occur. Some method to coordinate the simultaneous pressure.\"\n\nHis Assessment:\n\nDon Pedro straightens, his expression resolute. \"Your Majesty, this strategy can work. Drive toward Granada, take fortresses to secure our corridor, stay flexible based on intelligence, avoid disadvantageous battles. It's aggressive enough to make real progress, cautious enough to avoid disaster.\"\n\n\"The twenty-three thousand men, the artillery, the supply system, the cavalry reconnaissance—we have the tools. The question becomes execution. Weather, disease, Granada's response, fortune of war—these will determine how far we actually penetrate.\"\n\nHe pauses, then asks: \"One critical question, Your Majesty: When do you march with us? Will you be present from the campaign's start in April, or will you coordinate both armies from a central position initially? The men—especially the crusaders—will fight harder with you and the banner present. But you're also the Supreme Commander of both armies, needing to coordinate the overall strategy.\"\n\nWhat does Juan tell him about his personal role in the campaign?"
        },
        {
          "role": "player",
          "text": "I will lead the eastern army when present. Everyone will see me and know I am there. We will face our enemies head-on.\n\n\nYour deployments are sound. I will depart for a visit in Seville shortly but will be back in time for us to start pressing Grenada.\n\n\nBefore I depart, is there anything you wanted to discuss or tell me?"
        },
        {
          "role": "gm",
          "text": "Possible topics:\n1. Command structure clarity when Juan is away in Seville\n2. Concerns about specific nobles or forces\n3. Questions about the Infantes (Juan and Enrique) who are under his command\n4. Coordination details\n5. Personal matters or concerns\n6. Questions about the Queen's presence at the staging area\n7. Details about the crusaders arriving\n8. Concerns about Granada's response\n\nGiven Pedro's character (direct, honest, practical), he would likely:\n- Want to clarify command authority while Juan is in Seville\n- Possibly have concerns about the Infantes serving under him\n- Want to understand how long Juan will be gone\n- Perhaps ask about what he should do if urgent situations arise\n\nLet me craft something realistic and in character for Pedro González.\n\nCommand Chamber, Jaén Fortress\nMarch 7th, 1431 - Evening\n\nDon Pedro González nods at Juan's declaration about leading from the front. \"Good. The crusaders will fight like demons with you visible. And Granada will know this crusade is no mere border raid—their king opposes them personally.\"\n\nAt Juan's question about other matters, Pedro pauses, considering. Then he speaks with his characteristic directness:\n\n\"A few things, Your Majesty, while we have the opportunity.\"\n\nCommand Authority During Your Absence:\n\n\"You'll be in Seville for—what, five or six days? During that time, if urgent matters arise, who has final authority here? I assume it's me as field commander, but I want clarity. If a major Granada raid hits our forward positions, if nobles arrive early and start disputes, if intelligence comes in requiring immediate response—I need to know I can act without waiting for Your Majesty's return.\"\n\nHe meets Juan's eyes. \"I'm not asking for carte blanche. Just clear authority to manage day-to-day military operations while you're coordinating with Don Rodrigo.\"\n\nThe Infantes:\n\nPedro's expression becomes more guarded. \"The Infantes—Juan and Enrique de Aragón. They're assigned to serve under my command as crusader commanders. They've been... cooperative so far. Polite. Professional. But Your Majesty, these are men who claimed the Castilian throne three months ago. Now they take orders from me.\"\n\n\"I don't doubt their crusader oaths—Fray Hernando vouches for their spiritual transformation. But in battle, when men are dying, when split-second decisions matter—will they follow my orders without hesitation? Or will old pride, old ambitions surface?\"\n\nHe spreads his hands. \"I need to know: If I give Infante Enrique an order in combat and he questions it, disputes it, or worse—ignores it—what is my authority? Can I discipline a prince of Aragon who's also a sworn crusader? Or does that create a diplomatic incident?\"\n\nThe Queen's Presence:\n\nPedro glances toward the fortress chambers where Isabel is settling in. \"Your Majesty, I understand the Queen travels with the army until she's with child. That's your decision, of course. But I must be clear about something: Once operations begin, this will be a military camp of twenty-three thousand soldiers. Men fighting, dying, cursing, drinking when they can, all the ugliness of war.\"\n\n\"I'll ensure Her Majesty's quarters are secure and her ladies protected. But I cannot make this camp suitable for a royal court. She'll see wounded men. Hear screams from the field hospitals. Smell death. Live with constant noise and danger.\"\n\nHis weathered face shows concern. \"I've seen queens visit armies for ceremonies and leave quickly. I've never seen one remain through an actual campaign. I just want to ensure Your Majesty—and the Queen—understand what that truly means. Once we march south and engage Granada, there's no comfortable retreat to Toledo if it becomes too harsh.\"\n\nGranada's Response:\n\n\"Finally, Your Majesty—Granada will respond to our buildup here. They have spies, just as we do. By late March, when twenty-three thousand troops are assembled at Jaén, Sultan Muhammad will know. He'll have three or four weeks before we actually march in April to prepare his response.\"\n\n\"He might try a pre-emptive strike against our staging area. He might fortify his border fortresses. He might mass his field army and wait for us to come to him. Or—\" Pedro's voice grows more serious, \"—he might call for help. Ottoman support. North African mercenaries. Other Muslim powers who don't want to see Granada fall.\"\n\n\"I'm not saying this to discourage the campaign. But Your Majesty should be aware: The larger and more successful we become, the more desperate Granada's response may be. This might not stay a war between Castile and Granada. It could expand.\"\n\nHe falls silent, having said his piece. His expression shows he's not trying to undermine Juan's plans—just ensuring his king understands the practical realities ahead.\n\nWhat does Juan respond to these concerns?"
        },
        {
          "role": "player",
          "text": "You are in full command of the army in my absence. That means I expect you to take all precautions and desicions to achieve our goals.\n\n\nEnrique will have to do as you say. In fact, everyone should. When I come back I will adress any challenges to your command. If you can wait until I return, please do. Roll heads if you really need to, but better let me handle it if you know what I mean.\n\n\nI will let Alvaro write you a letter of authority to cement your command when I am gone if it would help you."
        },
        {
          "role": "gm",
          "text": "Command Chamber, Jaén Fortress\nMarch 7th, 1431 - Evening\n\nDon Pedro González's expression shows visible relief at the clarity. \"Thank you, Your Majesty. That's exactly what I needed to hear. Full command authority in your absence, with your backing to address challenges when you return. And yes—\" he nods firmly, \"—I understand. Better to let you 'roll heads' than me creating diplomatic incidents with Aragonese princes.\"\n\nA slight, grim smile crosses his weathered face. \"I'll keep Infante Enrique busy with useful tasks and out of situations where his pride might get tested. Reconnaissance coordination, cavalry liaison—important work that keeps him engaged but not in direct confrontation with my authority.\"\n\nRegarding the letter of authority: \"A formal letter from Don Álvaro would be very helpful, Your Majesty. Not because I doubt your word, but because twenty-three thousand men need to see clear chains of command in writing. When some proud noble questions why he should take orders from the Master of Calatrava while the King is absent, I can simply show him the royal letter. Settles disputes before they begin.\"\n\nPedro considers for a moment. \"The letter should state clearly: In Your Majesty's absence, Don Pedro González de Padilla, Master of Calatrava, commands the eastern army with full royal authority. All nobles, knights, soldiers, and crusaders will obey his orders as they would Your Majesty's own. Challenges to his command will be addressed by the King upon his return.\"\n\n\"Simple, clear, no ambiguity. I'll have copies made and distributed to all major commanders so everyone knows the structure.\"\n\nHe pauses, then continues: \"Regarding the Queen and the potential for Granada to call in allies—I've said my piece. Your Majesty has heard my concerns. The Queen's presence is your decision, and I'll ensure her safety as best I can. As for Granada seeking help...\" he shrugs, \"...we'll deal with whatever comes. We have the numbers, the faith, and the preparation. Let them call for help—we'll crush whoever answers.\"\n\nPedro straightens, looking satisfied. \"Unless Your Majesty has other matters to discuss, I should return to the preparations. The supply trains arriving tomorrow need inspection, and I want to review the cavalry commanders before they deploy.\"\n\nHe bows. \"Safe travels to Seville, Your Majesty. I'll have everything ready for the campaign launch when you return.\"\n\nDoes Juan have anything else to discuss with the Master of Calatrava, or does he let him return to his duties?"
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_1431_00089",
      "book": 1,
      "chapter": "1.14",
      "date": "1431-03-08",
      "end_date": "1431-03-14",
      "type": "military_action",
      "summary": "Juan decides to ride to Seville for western army inspection, invites Isabel. Roll: 40 (Duty-Bound Single Volunteer) — Dona Catarina (age 23) volunteers to accompany Isabel out of duty; Dona Beatriz (54) physically unable, Maria and Ana decline as inadequate riders. Traveling party: 13 riders. Roll: 44 (Adequate Journey) — four-day ride March 8-11, first day hard but bodies adapt, workmanlike routine by day three, Catarina reveals dry humor. Arrival in Seville. Rodrigo Manrique briefs: ~1,800 troops present, 12,000 expected by March 25. Naval force: 12 Genoese combat galleys (38,400 florins), 10 transports (12,000 florins), 8 Portuguese dowry galleys — 30 ships total. 127 crusaders (projecting 160-170 by April). Coastal supply caches pre-positioned. Intelligence: Granada reinforcing western fortresses but doesn't realize full naval invasion planned. Meeting with Infante Juan de Aragon — profoundly transformed from proud rebel prince to humble, cooperative subordinate. Wearing simple crusader tabard. Juan calls him 'cousin,' officially designates him as part of Rodrigo's command. The Infante brings diplomatic skill, logistics experience, speaks Genoese dialect. Rodrigo establishes 'You follow my orders' — Infante accepts fully. Hour-long planning session proves command structure works.",
      "characters": [
        "juan_ii",
        "isabel_of_portugal",
        "dona_catarina",
        "rodrigo_manrique",
        "infante_juan_de_aragon",
        "dona_beatriz",
        "enrique_enriquez"
      ],
      "factions_affected": [
        "royal_court"
      ],
      "location": "Seville",
      "tags": [
        "military",
        "naval",
        "journey",
        "command",
        "roll"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "Go with god.\n\n\nI go to say goodbye to Isabel before I leave for Seville"
        },
        {
          "role": "gm",
          "text": "Command Chamber to Queen's Quarters\nJaén Fortress, March 7th - Evening\n\nDon Pedro González bows deeply. \"And with you, Your Majesty. Until your return.\" He gathers his maps and documents, exiting the chamber with the purposeful stride of a soldier with much to do.\n\nJuan makes his way through the fortress corridors toward Isabel's apartments. The stone passages are lit by torches, casting flickering shadows. Guards snap to attention as their king passes.\n\nHe reaches Isabel's chambers and is announced by the guards. Inside, he finds the rooms transformed from their earlier austere state—tapestries hung, braziers warming the space, Isabel's personal belongings arranged to make it feel less like a military fortress and more like a residence.\n\nIsabel is standing by the window, looking out at the darkening valley below where campfires are beginning to dot the landscape as the first troops settle in. She's changed from her travel clothes into a deep blue gown, her hair properly arranged again after days on the road. Doña Beatriz and another Portuguese lady are present, working on some embroidery in the corner.\n\nWhen Juan enters, Isabel turns from the window. Her face lights up with that new openness she's developed—genuine pleasure at seeing him, no longer hidden behind dutiful formality.\n\nBut then she sees something in his bearing, perhaps the purposeful way he's come to her chambers. Her expression shifts to concern.\n\n\"You're leaving.\" It's not a question. She crosses to him quickly. \"For Seville. You mentioned it on the road.\" Her hands find his, holding them. \"How long will you be gone?\"\n\nDoña Beatriz and the other lady immediately stand and curtsy, beginning to withdraw to give them privacy. Isabel glances at them, then back at Juan, her plain features showing worry she's no longer trying to hide.\n\n\"Five days? Six?\" She searches his face. \"The army gathers here while you're coordinating with Don Rodrigo for the western campaign.\" She's been listening, learning, trying to understand the strategy.\n\nHer grip on his hands tightens slightly. \"I just...\" she hesitates, then the new Isabel—the one who learned to be vulnerable—pushes through, \"...we just had those six days together. The journey. Everything we talked about. And now you're leaving already.\"\n\nThere's no accusation in her voice, just honest emotion. She understands duty, understands necessity. But she's also a young woman who just discovered she's in love with her husband, and now he's departing.\n\nThe Portuguese ladies have withdrawn to the far chamber, leaving them essentially alone.\n\nWhat does Juan say or do?"
        },
        {
          "role": "player",
          "text": "I sit with her and pull her close to me.\n\n\nI will need to travel around a lot. And when the army starts to move into Grenada, I need to be there as well.\n\n\nI had thought about sending you home to Toledo as soon ass you were pregnant. But I have not discussed this with you at all. What would you like to do? Do you want to travel more with me, or remain here in Jaen for a while?"
        },
        {
          "role": "gm",
          "text": "Isabel's Chambers, Jaén Fortress\nMarch 7th, Evening\n\nIsabel settles into Juan's embrace, her head resting against his shoulder. At his question, she's quiet for a long moment, clearly thinking carefully about her answer.\n\n\"I hadn't thought about it either,\" she admits softly. \"On the journey, I was so focused on just... managing each day. Proving to myself I could do it. But now we're here, and the reality is different.\"\n\nShe pulls back slightly to look at his face, her expression serious. \"When you said I would travel with the army until I was with child, I accepted it as my duty. But you're asking what I want, and I...\" she pauses, searching for words, \"...I'm not used to that question mattering.\"\n\nHer hand finds his. \"What I want is to be with you. After those six days on the road, after everything we talked about under the stars, after my mother's letter—I don't want to be separated. I love you, Juan. Being apart feels wrong, especially now, when everything feels so new between us.\"\n\nBut then doubt creeps into her voice. \"But I also heard what that means. The Master of Calatrava's concerns aren't wrong. A military camp isn't a royal progress. If I stay with the army when it marches south, I'll see terrible things. Men dying. The ugliness of war. I think I'm strong enough—the journey showed me I'm more capable than I knew—but what if I'm not? What if I become a burden when you need to focus on leading?\"\n\nShe looks down at their joined hands. \"And there's the other question. If I remain here in Jaén instead of traveling to Seville with you, I'm alone in this fortress for nearly a week. Then alone again when you march south with the army. Is that better? Or worse?\"\n\nIsabel meets his eyes, vulnerable but trying to be practical. \"What do you want, Juan? What do you need? If having me with the army would distract you or create problems, tell me honestly. If you'd rather I stayed safe in Jaén, or returned to Toledo now, I'll do it. But if...\" her voice softens, \"...if you want me with you, if my presence helps rather than hinders, then I want to be there. Even knowing it will be hard.\"\n\nShe squeezes his hand. \"Just tell me truthfully what's best. For you, for the crusade. I'll follow your lead.\"\n\nWhat does Juan tell her?"
        },
        {
          "role": "player",
          "text": "Would you like to visit Seville with me, my love? We will travel quickly without carriage. Just riding on horseback all day and sleeping under the stars probably. There and back again. Would any of your ladies feel brave enough to come along? Or do you think you are up to it to travel without them if they do not want to come along?"
        },
        {
          "role": "gm",
          "text": "Isabel's response should show:\n- Her new willingness to be vulnerable and honest\n- Her growing confidence from the journey\n- Her awareness of propriety vs. her desires\n- Her practical concerns about the ladies\n- Her love for Juan making her want to say yes\n\nShe would likely be torn between:\n- Wanting to go (romantic, adventure, be with Juan)\n- Concern about propriety\n- Worry about the physical demands\n- Concern for her ladies\n\nLet me write her response showing this internal conflict, leaning toward saying yes but being realistic about the challenges.\n\nIsabel's Chambers, Jaén Fortress\nMarch 7th, Evening\n\nIsabel's eyes widen at the proposal. For a moment she's silent, and Juan can see emotions playing across her face—surprise, excitement, uncertainty, desire, all tangled together.\n\n\"Just... riding? Like we did on the journey, but faster? Sleeping under the stars?\" Her voice carries a mixture of wonder and nervousness. \"Without the wagons, without the full household, without—\" she glances toward where her ladies withdrew, \"—proper chaperones?\"\n\nA blush colors her cheeks, but there's a spark in her eyes that wasn't there before the journey. \"Part of me wants to say yes immediately. Those moments on the road, when it was just us talking in the evenings, when we could be Juan and Isabel instead of King and Queen—those were...\" she searches for words, \"...those were the happiest I've been since leaving Portugal.\"\n\nBut then practicality reasserts itself. \"But Juan, I've only been riding for six days. Long days in the saddle, faster pace—eighty miles to Seville, you said? Two or three days each way if we push hard?\" She bites her lip. \"I think I could manage it. I want to try. But I'd be sore, exhausted. Would I slow you down?\"\n\nShe stands, pacing to the window and back, clearly wrestling with herself. \"And my ladies...\" She glances toward the adjoining chamber where Doña Beatriz and the others have withdrawn. \"Doña Beatriz is in her fifties. She managed the journey to Jaén but only in the wagon. Hard riding would be too much for her. The younger ladies—Catarina maybe, or Maria—they ride well enough, but this kind of travel?\"\n\nIsabel turns back to Juan, her expression conflicted. \"If I ask them and they say no, then what? Do I go anyway, just you and me and your guards? That would be...\" she hesitates, \"...it would cause talk. A queen traveling alone with her husband and soldiers, no proper ladies in attendance. People would whisper.\"\n\nThen her face softens, showing the new Isabel who's learning to be honest about her feelings. \"But I don't care about the whispers if you don't. I care about being with you. About having more time like we had on the road. About not being separated when our marriage finally feels... real.\"\n\nShe moves back to him, taking both his hands. \"If you truly want me to come—if this isn't just you being kind because you think I want to go—then I'll ask Catarina and Maria if either is willing. If they say yes, I'll bring one. If they say no...\" she meets his eyes directly, \"...then I'll come anyway. Just with your guards as escort. Let people talk. I'd rather be with you than worry about propriety.\"\n\nA nervous laugh escapes her. \"Listen to me. Three weeks ago I would never have said such a thing. But my mother wrote about being brave enough to be vulnerable. Maybe this is part of that—being brave enough to choose what I want instead of what's expected.\"\n\nShe squeezes his hands. \"So yes. I want to go to Seville with you. Fast riding, sleeping under stars, all of it. Just tell me when we leave and I'll be ready.\"\n\nThen a thought occurs to her. \"Should I ask the ladies now? See if any will come? Or do you want to leave immediately?\"\n\nWhat does Juan tell her?"
        },
        {
          "role": "player",
          "text": "Draft a d100 table to determine how the ladies respond to Isabel's request to go with her on the road. Will they come along?"
        },
        {
          "role": "gm",
          "text": "D100 Table: Portuguese Ladies' Response to Hard Riding Journey\n\n1-8: Complete Refusal with Concern\nAll of Isabel's ladies refuse, and they're genuinely worried about the propriety and safety of the journey. Doña Beatriz is particularly distressed, arguing this is unsuitable for a queen and begging Isabel to reconsider. The ladies point out the scandal it will cause, the physical danger, and how inappropriate it is. They offer to stay in Jaén and wait, but make Isabel feel like she's being reckless. Creates tension and doubt, though Isabel can still choose to go.\n\n9-18: Polite Refusals\nAll ladies decline as graciously as possible. Doña Beatriz explains she physically cannot manage it. The younger ladies (Catarina, Maria) admit they're not skilled enough riders for such a journey and would slow the party down or risk injury. They're apologetic but firm. No judgment, just honest assessment of their limitations. Isabel travels with only Juan's guards as escort.\n\n19-30: Reluctant Single Volunteer (Inadequate)\nOne lady (Maria) volunteers out of pure duty despite being clearly unsuited for the journey. She's a poor rider, frightened of hard travel, but feels obligated to prevent scandal. Her volunteering would actually make the journey worse—she'd struggle, slow them down, possibly get injured. Isabel would need to decide whether to accept her sacrifice or decline and travel without ladies anyway.\n\n31-45: Duty-Bound Single Volunteer (Adequate)\nCatarina volunteers, recognizing it's her duty even though she's not enthusiastic. She's a competent rider—not brilliant, but adequate. She can manage the journey but won't enjoy it. She'll be sore, tired, and uncomfortable but won't complain. Provides the bare minimum of propriety for Isabel. Functional but not ideal. Isabel has one lady-in-waiting for appearances.\n\n46-60: Willing Single Volunteer (Good)\nCatarina volunteers and actually seems somewhat excited by the adventure, despite the hardships. She's a good rider, younger (early 20s), more resilient. She admits it will be difficult but says she's willing to try, and she wants to support the Queen. She'll manage the journey well enough, providing companionship for Isabel and satisfying propriety. A solid, positive outcome.\n\n61-75: Enthusiastic Single Volunteer (Excellent)\nCatarina eagerly volunteers, revealing she actually misses hard riding from her youth in northern Portugal. She's an excellent horsewoman, physically capable, and genuinely excited for the challenge. She'll not only manage the journey but enjoy it, providing good companionship for Isabel and no concerns about slowing the party down. She sees it as an adventure. Best single-volunteer outcome.\n\n76-85: Two Volunteers (Mixed Capability)\nBoth Catarina and Maria volunteer. Catarina is capable and willing; Maria is less skilled but determined not to let Catarina go alone. Having two ladies provides better propriety and companionship for Isabel, but Maria will struggle with the pace. The group might need to slow slightly or show extra patience. Still workable, and Isabel appreciates their loyalty even if it's not perfectly efficient.\n\n86-93: Two Volunteers (Both Capable)\nBoth Catarina and Maria volunteer, and both turn out to be better riders than initially apparent. They're young, resilient, and actually rise to the challenge. They'll be tired and sore but manage the journey without slowing the party. Having two ladies makes the journey much more proper, provides Isabel with companionship, and shows their devotion. Very good outcome.\n\n94-97: Three Volunteers (Excellent Support)\nCatarina, Maria, and a third younger lady (Ana) all volunteer. All three are capable riders in their early-to-mid 20s. They're loyal to Isabel and willing to face hardship for her. Having three ladies provides excellent propriety, good companionship, and demonstrates strong devotion from her Portuguese household. They manage the journey well, support each other, and Isabel feels well-attended. The journey becomes almost a bonding experience for the Portuguese women.\n\n98-100: Unexpected Devotion\nAll of Isabel's younger ladies volunteer (Catarina, Maria, Ana, and perhaps one or two others—4-5 total). They're inspired by Isabel's transformation during the Toledo-Jaén journey and want to be part of this new, bolder version of their queen. Even Doña Beatriz, though unable to ride herself, gives her blessing and organizes the others. The younger ladies prove surprisingly capable and enthusiastic. Isabel travels with a small but devoted retinue that manages the hard journey while providing full propriety. The experience strengthens bonds between Isabel and her household. Creates a memorable, positive dynamic.\n\nRoll your d100 to determine how the Portuguese ladies respond to Isabel's request!"
        },
        {
          "role": "player",
          "text": "I rolled 40, so Catarina volunteers.\n\n\nWe approach the ladies together and ask them if they want to accompany Isabel as she travels with me to Seville. Draft the response keeping this response in mind."
        },
        {
          "role": "gm",
          "text": "Isabel's Chambers, Jaén Fortress\nMarch 7th, Evening\n\nIsabel calls for her ladies to return to the main chamber. Doña Beatriz enters first, followed by three younger women: Catarina (perhaps twenty-three, dark-haired, slender), Maria (younger, maybe nineteen, with a round face and nervous energy), and Ana (early twenties, quiet and observant).\n\nThey curtsy to Juan and Isabel, clearly curious about being summoned back so formally.\n\nIsabel takes a breath, squeezing Juan's hand once for courage, then addresses them: \"Ladies, the King and I have a question for you. His Majesty travels to Seville tomorrow—a quick journey, perhaps three days there and three back. Hard riding, sleeping in the field, moving fast. He has asked if I wish to accompany him, and I... I do.\"\n\nShe pauses, her cheeks coloring slightly. \"But it would be more proper if I had at least one lady-in-waiting with me. I know this is asking much—the journey will be difficult, long hours in the saddle, simple camp conditions. So I wanted to ask: Would any of you be willing and able to make this journey?\"\n\nThere's a moment of stunned silence.\n\nDoña Beatriz speaks first, her weathered face showing immediate concern. \"Your Majesty, I...\" She glances at Juan, then back to Isabel. \"Forgive me, but I must speak plainly. I am fifty-four years old. The journey from Toledo to Jaén nearly broke me, even in a wagon. Hard riding to Seville and back? I would not survive it. Or if I did, I would slow Your Majesties terribly and likely injure myself.\"\n\nHer voice softens with genuine regret. \"If I were twenty years younger, I would go without hesitation. But I cannot. I'm sorry, my lady.\"\n\nIsabel nods understanding. \"Of course, Doña Beatriz. I would never ask that of you.\"\n\nThe three younger ladies exchange glances. Maria speaks hesitantly: \"Your Majesty, I... I'm not a strong rider. On the journey here, I could barely manage the hours we traveled, and that was at a gentle pace. Fast riding for days?\" She looks down, ashamed. \"I would fall behind or get injured. I don't think I'm capable of it.\"\n\nAna, the quiet one, adds softly: \"I'm the same, Your Majesty. I can ride, but not well enough for what you're describing. I would be a burden.\"\n\nAll eyes turn to Catarina. She's been silent, clearly thinking. She's taller than the others, with a more athletic build. Her expression shows internal struggle—duty warring with reluctance.\n\nFinally, she straightens and curtsies. \"Your Majesty, I will go.\"\n\nHer voice is steady but not enthusiastic. \"I can ride well enough. Better than Maria or Ana, at least. I won't slow you down too much.\" She meets Isabel's eyes. \"You need a lady-in-attendance, and I'm the only one here who can manage it. So I'll do it.\"\n\nThere's no excitement in her voice, no eagerness for adventure. Just acceptance of obligation. But there's also no resentment—Catarina understands the necessity and is willing to shoulder the burden.\n\nDoña Beatriz looks relieved. \"Catarina is our best rider, Your Majesties. She grew up near the coast where they ride more. She'll manage the journey.\" Then she adds with motherly concern, \"But Your Majesty, you'll need to pack light. Simple clothes, practical. No court gowns, no heavy baggage. You'll be living like soldiers for six days.\"\n\nCatarina nods. \"I can be ready within an hour if needed, Your Majesty. Just tell me when we depart.\"\n\nIsabel looks at Juan, then back to Catarina. \"Thank you, Catarina. Truly. I know this isn't... I know it's asking a lot.\"\n\nCatarina manages a small smile. \"You're my queen, Your Majesty. Where you go, I should follow. Even if it means my backside will be screaming by tomorrow night.\" The attempt at humor lightens the mood slightly.\n\nMaria and Ana both look relieved they weren't chosen, but also slightly guilty about it. Doña Beatriz already seems to be mentally organizing what Isabel and Catarina will need for the journey.\n\nWhen does Juan want to depart, and does he have anything else to say to the assembled ladies?"
        },
        {
          "role": "player",
          "text": "We ride tomorrow at first light. Catarina, thank you for coming with us. Lets depart.\n\n\nI assemble my party, I take a few guard crusaders with me as well as some household guards as well.\n\n\nDraft a d100 table to determine how the journey goes to Seville. If the ladies cannot keep up, I just slow the pace down a bit, we are under no immediate time pressure."
        },
        {
          "role": "gm",
          "text": "The table should account for:\n- Weather\n- The women's stamina\n- Potential threats (bandits, Granada scouts)\n- Relationship dynamics\n- Unexpected events\n- Pace management\n\nIsabel's Chambers, Jaén Fortress\nMarch 7th, Night\n\nThe ladies curtsy as Juan and Isabel prepare to leave. Catarina immediately begins mentally preparing for the journey, while Doña Beatriz starts organizing practical clothing for both Isabel and Catarina.\n\n\"First light, Your Majesties. We'll be ready,\" Catarina says with quiet resolve.\n\nDawn Departure Preparation\nMarch 8th, 1431\n\nBy dawn, the small party is assembled in the fortress courtyard:\n\nKing Juan II in practical traveling clothes with mail underneath, sword at his side\n\nQueen Isabel in simple riding attire, her hair braided practically, no jewels or finery\n\nCatarina similarly dressed for hard travel\n\nSix crusaders from the Guardian Company (veterans, reliable)\n\nFour household guards (Juan's personal escort)\n\nPack horses with minimal supplies—bedrolls, food, water, basic necessities\n\nTotal: Thirteen riders plus pack animals. Light, fast, mobile.\n\nThe sun is just breaking over the mountains as they prepare to ride west toward Seville.\n\nD100 Table: The Journey to Seville (Jaén to Seville, ~80 miles)\n\n1-3: Disaster - Granada Raid\nThe party encounters a Granada raiding force in the mountains—perhaps 20-30 light cavalry probing Castilian defenses. A running fight ensues. The guards protect Juan and the women, but someone is injured (roll to determine if it's a guard, Catarina, or worst case, Isabel). They're forced to hole up in a fortified village for days while the wounded recover. Journey takes 8-10 days instead of 3. Creates serious complications for campaign timeline and potentially for Isabel's safety going forward.\n\n4-8: Serious Incident - Injury\nCatarina's horse stumbles on the second day, throwing her. She's badly bruised, possibly with a sprained wrist or ankle. Not life-threatening but painful. The party must slow dramatically or stop for a day. Isabel feels guilty for asking her to come. The journey takes 5-6 days and creates tension. Catarina bears it stoically but is clearly suffering.\n\n9-15: Significant Complications - Weather\nSevere spring storms hit—cold rain, high winds, muddy roads. Everyone is soaked and miserable. Isabel and Catarina particularly struggle with the conditions. They must seek shelter in poor accommodations (rundown inns, barns). Takes 5-6 days. No one is seriously hurt but everyone arrives in Seville exhausted, cold, and bedraggled. Not the impressive arrival Juan might have hoped for.\n\n16-25: Multiple Difficulties - Hard Journey\nThe pace proves too much for both women. By the end of the first day, both Isabel and Catarina are exhausted and saddle-sore. Juan slows the pace significantly, turning a 3-day journey into 5 days. Some beautiful moments camping, but mostly just grinding discomfort. Both women are tough and don't complain, but Juan can see them struggling. Arrives in Seville with both women worn out and needing recovery time.\n\n26-40: Challenging But Managed - Learning Experience\nThe journey is hard. Isabel and Catarina both struggle with the long hours and fast pace, especially the first two days. Juan adjusts to a moderate pace—not the fast ride he'd envisioned, but steady progress. Takes 4 days instead of 3. Some discomfort, some soreness, but manageable. Both women prove their resilience even if they're not enjoying it. Catarina warms slightly to Isabel, seeing her determination. Arrive tired but functional.\n\n41-55: Adequate Journey - Building Stamina\nThe journey takes 4 days at a steady pace. The first day is rough for both women, but by day two they're adapting. Isabel's experience from the Toledo-Jaén journey helps—she knows how to manage the discomfort now. Catarina proves more capable than her dutiful acceptance suggested. Some nice evening moments around campfires. They arrive in Seville tired but in good spirits. A workmanlike journey—not memorable, but successful.\n\n56-70: Good Journey - Pleasant Surprise\nThe weather cooperates beautifully. Both women manage the pace better than expected—Isabel is getting genuinely comfortable on horseback, and Catarina reveals she actually does enjoy riding when it's not in a formal court setting. Takes 3-4 days with some lovely moments: sunrise over olive groves, evening prayers under stars, good conversation around campfires. The small group bonds. Arrive in Seville in good condition.\n\n71-82: Very Good Journey - Bonding Experience\nPerfect traveling weather and good roads. Both women not only manage the journey but seem to thrive. Isabel continues her transformation into a more confident, capable version of herself. Catarina, initially reluctant, discovers she actually enjoys the adventure and freedom from court restrictions. She opens up more, becoming friendlier with Isabel. The guards are impressed by both women's stamina. Several memorable moments that strengthen relationships. Takes 3 days, arrive in excellent condition.\n\n83-91: Excellent Journey - Memorable Adventure\nEverything goes remarkably well. Beautiful weather, good pace, no incidents. Isabel rides with growing confidence and joy—she's genuinely becoming skilled. Catarina transforms from dutiful volunteer to enthusiastic companion, the two women bonding over the shared experience. The evening camps feel almost like pilgrimages—spiritual conversations, shared laughter, good camaraderie. One particularly beautiful moment (spectacular sunset, or meaningful conversation, or witnessing something inspiring) creates a lasting memory. Arrive in Seville energized rather than exhausted.\n\n92-97: Outstanding Journey with Notable Event\nThe journey is excellent in all respects, AND something notable occurs: Perhaps they encounter pilgrims heading to Santiago and share an evening of stories and prayer; or they witness a particularly moving display of popular devotion to the crusade in a village; or Isabel and Catarina have a deep conversation that transforms Catarina from servant to friend; or they rescue travelers in minor distress and earn gratitude; or they spot Granada scouts in the distance but evade them cleverly, giving Juan tactical intelligence. The journey becomes a story worth telling.\n\n98-100: Exceptional Journey - Transformative Experience\nThe journey is not just successful but transformative for everyone involved. Perfect conditions combine with multiple meaningful moments. Isabel fully comes into her own as a rider and traveler, impressing even the veteran guards. Catarina becomes genuinely devoted to Isabel as a friend, not just a queen. The small group bonds into a tight unit. Something profound happens—perhaps a spiritual experience, or witnessing something that crystallizes the crusade's purpose, or a moment of danger handled perfectly that builds confidence. They arrive in Seville not just successfully, but as a transformed, unified group with a story that will be remembered.\n\nRoll your d100 to determine how the journey to Seville unfolds!"
        },
        {
          "role": "player",
          "text": "rolled 44, so Adequate Journey - Building Stamina.\n\n\nBriefly describe the journey (not day to day) to Seville keeping this result in mind."
        },
        {
          "role": "gm",
          "text": "The Journey to Seville\nMarch 8-11, 1431 - Four Days\n\nThe journey west from Jaén proves to be a test of endurance more than adventure. The first day is particularly hard on both Isabel and Catarina—long hours in the saddle, muscles protesting, the novelty of the Toledo-Jaén journey now replaced with the reality that this is simply grueling work. By evening, both women dismount stiffly, trying to hide winces. Catarina remains dutifully silent, but Isabel admits quietly to Juan that she aches everywhere.\n\nThe second day begins with visible reluctance from both women, but something shifts as the miles pass. Bodies begin adapting to the rhythm. Isabel, drawing on her experience from the previous journey, finds ways to shift position, to pace herself, to manage the discomfort rather than fight it. Catarina, for her part, proves more resilient than her dutiful acceptance suggested—she has the stamina for this, even if she's not enthusiastic about it.\n\nBy the third day, a workmanlike routine has established itself. Rise before dawn, ride through the morning, brief rest at midday, ride through the afternoon, make camp at dusk. The landscape transitions from mountains to rolling hills to the flatter terrain approaching Seville. Olive groves and whitewashed villages. Spring flowers beginning to bloom.\n\nThe evening camps provide the journey's better moments. Gathered around small fires, eating simple food, the formality of court falls away. Catarina proves to have a dry sense of humor when she lets her guard down. The crusader guards treat both women with protective respect, impressed despite themselves by their endurance. Evening prayers take on a different quality under the open sky—more intimate, more genuine than formal chapel services.\n\nIsabel and Juan find stolen moments of conversation—nothing profound like their journey to Jaén, but comfortable companionship. She's less the transformed bride discovering herself and more the practical partner settling into a rhythm. When she's too tired to talk, she simply sits close to him, and that's enough.\n\nOn the fourth day, Seville comes into view—the great city on the Guadalquivir, the Giralda tower rising above the rooftops, the smell of the river and the sea beyond. They arrive in the late afternoon, tired and dusty but intact. Isabel has proven she can handle difficult travel. Catarina has fulfilled her duty without complaint. The crusaders have seen their queen and king live like soldiers for four days and respect them more for it.\n\nIt wasn't a transformative journey or a romantic adventure. It was simply successful—a thing that needed doing, done competently. Sometimes that's enough.\n\nThey arrive in Seville on March 11th, in the late afternoon. The city is bustling with preparations for the western campaign. What does Juan do upon arrival?"
        },
        {
          "role": "player",
          "text": "I first settle Isabel and Catarina into comfortable quarters and tell her I will be with her shortly after doing some business.\n\n\nI seek out Don Rodrigo immediately to hear from him how things have been. I also greet the crusaders who have stayed behind."
        },
        {
          "role": "gm",
          "text": "Juan arrives in Seville with Isabel and Catarina. He wants to:\n1. Settle them into comfortable quarters\n2. Meet with Don Rodrigo about western campaign preparations\n3. Greet the crusaders who stayed in Seville (the 101 who remained when he took 50 to Toledo)\n\nI should provide a good scene with Rodrigo updating Juan on all preparations, crusader recruitment in Seville, and the state of the western campaign readiness.\n\nThe Royal Alcázar of Seville—a sprawling palace complex of Moorish and Christian architecture—has prepared chambers for the King and Queen. The quarters are far more comfortable than Jaén's fortress: spacious rooms with fine furnishings, proper windows opening onto gardens, the sound of fountains in courtyards below.\n\nIsabel and Catarina are visibly relieved as servants usher them into the prepared apartments. After four days of hard riding and nights on the ground, even Catarina—dutiful and uncomplaining—looks grateful for beds, baths, and walls.\n\n\"Rest,\" Juan tells Isabel, squeezing her hand. \"I have business with Don Rodrigo, but I'll return for evening prayers.\" He kisses her forehead. \"You did well. Four days of hard riding—you're becoming quite the campaigner.\"\n\nIsabel manages a tired smile. \"I'm becoming quite the woman with saddle sores, you mean. But yes—I managed it.\" She glances at Catarina, who's already being led toward a bathing chamber by servants. \"We both did.\"\n\nThe Western Command Center\nRoyal Alcázar, Military Wing\n\nDon Rodrigo Manrique has established his headquarters in the palace's military wing—a suite of rooms that now functions as the command center for the western campaign. Maps cover every wall, documents are stacked on tables, and the organized chaos of military preparation fills the space.\n\nRodrigo is in his mid-forties, lean and weathered from years on the Granada frontier. He wears practical military dress—no court finery—and moves with the efficiency of a professional soldier. When Juan enters, he looks up from a map showing the western Granadan coast and immediately bows.\n\n\"Your Majesty! We weren't expecting you until tomorrow.\" He straightens, then calls to an aide: \"Send word to Captain Alonso—the King is here and will likely want to see the crusaders.\"\n\nHe gestures Juan to the map table. \"Welcome to Seville, Your Majesty. The western campaign's beating heart. Let me brief you on our status.\"\n\nForce Assembly:\n\nRodrigo taps various locations on the map. \"The noble summons have been well-received. As of this morning, we have approximately eighteen hundred troops already present or within a day's march—early arrivals from Andalusia and nearby territories. By March 25th, we expect the full twelve thousand as planned.\"\n\n\"The Military Orders are committed: Santiago brings eight hundred knights to the western army, Alcántara brings four hundred. Both confirmed they'll be in position by the deadline. The Admiral Enríquez has also pledged five hundred of his household troops—all naval-experienced men who understand amphibious operations.\"\n\nCrusader Status:\n\n\"The crusaders, Your Majesty—\" Rodrigo's weathered face shows genuine respect. \"Captain Alonso Pérez has done excellent work with the hundred and one you left in my charge. No desertions, discipline excellent, training rigorous. They're ready to fight.\"\n\n\"As for new recruitment since your wedding proclamation: We've received forty-three applications here in Seville. After Fray Hernando's spiritual screening and our military assessment, we've accepted twenty-seven new crusaders. Quality is high—several are former sailors with combat experience against Barbary corsairs, others are sons of Military Order families. They understand naval warfare, which serves our coastal campaign well.\"\n\nHe consults a document. \"Current total: one hundred twenty-seven sworn crusaders in Seville. I estimate we'll reach perhaps one hundred sixty to one hundred seventy by campaign start—giving your western army a solid crusader core.\"\n\nNaval Contracts:\n\nRodrigo moves to another map showing the coast and sea routes. \"The Genoese contracts are finalized, Your Majesty. I've secured twelve combat galleys and ten transport vessels—all captained by experienced Genoese mariners. Total cost as budgeted: thirty-eight thousand four hundred florins for the galleys, twelve thousand for transports. Eight-month contracts starting April 1st.\"\n\n\"The Portuguese dowry galleys—eight ships—are being prepared in Lisbon. They'll sail south in late March to join us here. Admiral Enríquez is coordinating with Portuguese captains to ensure smooth integration with the Genoese fleet.\"\n\n\"Twenty combat-capable ships plus ten transports—that gives us naval superiority along the western coast. Granada's galleys from North Africa are more numerous, but they're dispersed. In our operational area, we'll dominate the sea.\"\n\nSupply Situation:\n\n\"Father Tommaso's administrators continue to impress me,\" Rodrigo admits. \"Supply depots are being stocked throughout Andalusia. Food, fodder, ammunition, medical supplies—all accumulating as planned. The provisioning budget for twelve thousand men for eight months is on track.\"\n\n\"We've also established supply caches at several coastal locations—Tarifa, Gibraltar, points along the coast where we can pre-position materials for quick access once operations begin. The naval supply chain should function smoothly.\"\n\nThe Infantes:\n\nRodrigo's expression becomes more guarded. \"Infante Juan de Aragón, Your Majesty. He's been... cooperative. Professional. He attends all planning meetings, coordinates logistics, assists with noble recruitment. On the surface, everything is proper.\"\n\n\"But—\" Rodrigo meets Juan's eyes, \"—he's subdued. Going through motions correctly but without enthusiasm. When I look at him, I see a man doing penance, not a man who wants to be here. He'll serve adequately, I think, but I don't sense passion for the campaign.\"\n\n\"I received your letter about his formal role as senior advisor to me. I haven't shown it to him yet—wanted to wait until you arrived so we could present it together, make it feel like an honor rather than an assignment.\"\n\nArtillery and Siege Equipment:\n\n\"No bombards for the western army—they're all committed to your eastern operations. But we have traditional siege equipment being prepared: trebuchets, mangonels, rams, siege towers. Lumber is stockpiled, engineers hired, crews training. We can conduct sieges, just more slowly than with your Italian gunner's cannons.\"\n\nIntelligence:\n\nRodrigo taps several points on the Granada coast. \"Our scouts report Granada is reinforcing their western fortresses—Estepona, Marbella, Málaga. They know something is coming. But they don't yet seem to realize we're preparing a full-scale naval invasion. They're expecting raids, not systematic conquest.\"\n\n\"Sultan Muhammad has concentrated most of his attention eastward—toward Jaén and the central frontier. He assumes that's where the main crusade will strike, especially with the banner and relics going east. He's correct, of course, but it means his western defenses are weaker than they might be.\"\n\n\"Our advantage is timing. If we launch when he's fully committed against your eastern army, we can take several coastal fortresses before he can redeploy forces to stop us.\"\n\nAssessment:\n\nRodrigo straightens from the maps. \"Your Majesty, the western army will be ready to launch operations in April as planned. Twelve thousand troops, thirty ships, full supplies, clear objectives. When you send the signal that Granada is committed eastward, we strike.\"\n\nHe pauses, then adds: \"One concern, Your Majesty: The timing coordination. If the signal is delayed, if we launch too early or too late, the strategic advantage is lost. The relay system Don Álvaro established should work, but it requires your eastern army to clearly determine when the moment is right.\"\n\n\"When you're with the eastern army and you see Granada commit—truly commit—to facing you, that's when you send the word. I'll need perhaps three to five days after receiving the signal to finalize embarkation and launch. So factor that into your timing.\"\n\nHe meets Juan's eyes directly. \"Questions, Your Majesty? Concerns? Anything you want changed or emphasized?\"\n\nWhat does Juan say or ask Rodrigo?"
        },
        {
          "role": "player",
          "text": "Sounds great, lets summon infante Juan."
        },
        {
          "role": "gm",
          "text": "Rodrigo nods and calls to an aide standing near the door. \"Send for Infante Juan de Aragón. Tell him His Majesty the King wishes to see him immediately.\"\n\nThe aide bows and hurries out. Rodrigo turns back to Juan. \"He's been quartered near the crusader encampment, actually. Lives among them rather than taking noble apartments in the palace. Part of his penance, I think. Or perhaps genuine humility—I'm honestly not certain which.\"\n\nWhile they wait, Rodrigo adds quietly: \"Your Majesty, I should mention—he attends daily Mass with the crusaders. Confesses regularly to Fray Hernando's assistant chaplain here. Whatever else he is, he's taking his crusader oath seriously. Whether that translates to enthusiasm for this campaign...\" He shrugs. \"You'll see for yourself.\"\n\nWithin ten minutes, there's a knock at the door. The aide returns. \"Infante Juan de Aragón, Your Majesty.\"\n\nThe Infante enters, and the change from the proud prince who once claimed the Castilian throne is striking. He wears a simple white crusader's tabard over plain traveling clothes—no rich fabrics, no jewelry, nothing to mark him as royalty except his bearing. He's in his late thirties, with dark hair going gray at the temples, a lined face that suggests both hardship and intelligence.\n\nHe bows deeply to Juan—a proper, submissive bow with none of the stiff pride that marked his earlier interactions. \"Your Majesty. I came as quickly as I could.\" His voice is quiet, respectful, with none of the defiance that colored his words at the Council of Seville.\n\nHe straightens, and his eyes meet Juan's briefly before dropping in deference. There's something in his expression—not quite broken, but humbled. Changed. Whether that change is genuine transformation or simply exhaustion from months of penance is hard to discern.\n\n\"Don Rodrigo said you wished to see me, Your Majesty. I am at your service.\" He waits, hands clasped before him, the posture of a penitent rather than a prince.\n\nRodrigo watches the interaction carefully, saying nothing, letting Juan take the lead.\n\nWhat does Juan say or do?"
        },
        {
          "role": "player",
          "text": "Good to see you cousin. And good to see that you have taken to your new tasks with dedication. I want to officially designate you as part of the command of Rodrigo. I hope that this would be a place that suits your talents."
        },
        {
          "role": "gm",
          "text": "Infante Juan's eyes widen slightly at being addressed as \"cousin\"—a gesture of kinship rather than the cold formality of rank. Something shifts in his expression, though he keeps his composure.\n\n\"Your Majesty is... gracious.\" His voice catches slightly. \"More gracious than I deserve.\"\n\nHe glances at Rodrigo, then back to Juan. \"I have tried to be useful here. To serve as a crusader should. When I knelt before you at the Council of Seville and renounced my claims, I meant every word. This crusade—\" he gestures toward the maps showing Granada's coast, \"—this is what matters. Not thrones, not pride, not the ambitions that led me to rebel.\"\n\nHe pauses, gathering himself. \"Don Rodrigo has been patient with me. He's given me work—logistics, recruitment coordination, planning. I've tried to do it well. But I...\" he hesitates, searching for words, \"...I wasn't certain if I was truly trusted, or simply being kept busy and watched.\"\n\nAt Juan's designation of him as part of Rodrigo's command, Infante Juan's weathered face shows genuine emotion—gratitude mixed with something like relief.\n\n\"A place that suits my talents,\" he repeats quietly. \"Your Majesty, I spent years governing territories, managing nobles, coordinating campaigns on my brother Alfonso's behalf in Aragon. I know logistics. I know how to keep armies supplied, how to manage difficult nobles, how to make operations function. If Don Rodrigo will have me in his command structure, I will serve with everything I have.\"\n\nHe straightens slightly, some of his old confidence returning—not pride, but professional competence. \"I know the western nobles. Many of them have ties to Aragon, and some will be... difficult. I can help manage those relationships. I know naval operations from years on the Mediterranean. I can coordinate with the Genoese captains—I speak their dialect. And I understand amphibious warfare from watching Alfonso's campaigns.\"\n\nHis voice grows stronger. \"Your Majesty, I cannot undo my rebellion. I cannot take back the damage I caused. But I can serve this crusade well. Give me this role, and I swear by the oath I took before the Holy Relics—I will not fail you.\"\n\nThere's sincerity in his words, but also something else: a man who's found purpose after months of penance, who's being offered meaningful work instead of mere atonement.\n\nRodrigo, who's been watching silently, speaks up: \"Your Majesty, if I may—Infante Juan has been valuable these past months. If you formalize his role as senior advisor to my command, I believe he'll serve the western campaign well. His experience and connections will be assets.\"\n\nHe looks at the Infante directly. \"But understand this: When we march, when we fight, you follow my orders. Your wisdom and counsel will be heard, but I command. Can you accept that?\"\n\nInfante Juan meets Rodrigo's eyes without flinching. \"I can. I spent years as my brother's subordinate. I know how to serve under another's command. You lead, Don Rodrigo. I will advise, coordinate, and execute your orders. Nothing more.\"\n\nHe turns back to Juan, waiting for the King's final word.\n\nWhat does Juan say?"
        },
        {
          "role": "player",
          "text": "Welcome to command cousin. I am glad you have found such purpose.\n\n\nI spend an hour with both of them going over details before returning to Isabel."
        },
        {
          "role": "gm",
          "text": "Western Command Center, Royal Alcázar\nMarch 11th, Late Afternoon to Early Evening\n\nInfante Juan bows deeply, and for the first time since entering, there's genuine warmth in his expression. \"Thank you, Your Majesty. Thank you for seeing past what I was, to what I might yet become. I will not disappoint you.\"\n\nHe places his fist over his heart—the crusader's salute. \"For God and Castile. For the completion of the Reconquista.\"\n\nRodrigo nods with satisfaction and gestures both men to the map table. \"Then let's work. We have much to coordinate before the campaign begins.\"\n\nThe Next Hour\n\nThe three men settle into detailed planning. Rodrigo spreads out operational maps, supply documents, noble levy commitments, and naval contracts. The discussion is technical, practical—the work of commanders preparing for war:\n\nForce Composition Details: They review which noble houses are sending which levies, identify potential problem nobles who might need Infante Juan's diplomatic touch, discuss how to integrate the Military Orders' forces with noble levies and crusaders.\n\nNaval Operations: Infante Juan proves his value immediately, offering insights about Genoese captain temperaments, explaining Mediterranean naval tactics, suggesting coordination protocols between the various ship types. His experience shows.\n\nSupply Chain Management: The three work through the logistics of keeping twelve thousand men fed and equipped during amphibious operations—how to coordinate ship-to-shore supply transfers, establish beachhead depots, maintain communication between land and naval forces.\n\nCoastal Fortresses: They examine intelligence reports on Estepona, Marbella, and other targets. Infante Juan adds context from his knowledge of similar fortifications, suggests siege approaches, identifies which might surrender quickly versus which will resist.\n\nTiming Coordination: They refine the signal system—how Juan's message from the east will trigger final preparations, how quickly the fleet can embark once the order comes, contingency plans if timing goes wrong.\n\nNoble Management: Infante Juan provides valuable insight into the personalities involved—which nobles will follow orders readily, which will need careful handling, which might cause trouble. His years dealing with Aragonese and Andalusian nobility make him genuinely useful.\n\nBy the time the hour concludes, it's clear the command structure will function well. Rodrigo has the military expertise and leadership authority. Infante Juan brings diplomatic skill, logistical experience, and valuable connections. The partnership seems genuine.\n\nAs they finish, Rodrigo says to Infante Juan: \"We'll meet daily while His Majesty is here, then continue preparations after he returns to Jaén. I want detailed operational plans ready by March 20th.\"\n\nInfante Juan bows to both men. \"It will be done, Don Rodrigo. Your Majesty, thank you again. For everything.\" He departs, his step lighter than when he entered.\n\nRodrigo turns to Juan after the Infante leaves. \"Your Majesty, that was well done. You've given him purpose and dignity while keeping him subordinate. He'll serve well, I think. The man who rebelled is gone—what remains is a competent administrator who wants redemption.\"\n\nQueen's Chambers, Royal Alcázar\nEarly Evening\n\nJuan makes his way through the palace corridors toward Isabel's apartments. The sun is setting, casting warm light through the arched windows. He can hear the distant sound of fountains in the courtyards below.\n\nWhen he reaches Isabel's chambers and is announced, he finds the rooms transformed into comfortable living quarters. Isabel has bathed and changed into a deep burgundy gown, her hair properly arranged. She looks refreshed after the journey, though there's still evidence of fatigue around her eyes.\n\nShe's sitting by the window with a book—Castilian poetry, the one Juan gave her months ago. Catarina is in the adjoining room, giving them privacy but remaining within call.\n\nWhen Juan enters, Isabel sets the book aside and stands, a smile lighting her plain features. \"You're back. I was starting to wonder if Don Rodrigo had recruited you into his planning for the entire evening.\" She moves to him, taking his hands. \"How did it go? Is everything ready for the western campaign?\"\n\nWhat does Juan say or do?"
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_1431_00090",
      "book": 1,
      "chapter": "1.14",
      "date": "1431-03-12",
      "end_date": "1431-03-18",
      "type": "personal",
      "summary": "Days in Seville (March 12-14): audiences with western nobles, visiting crusaders, dining with Genoese captains (Infante Juan invaluable as translator), meeting merchants. Personal time with Isabel: walking Alcázar gardens, evening prayers, exploring Seville's cathedral. Notable: Isabel's hand unconsciously moves to her belly during prayers — around time of conception but neither knows yet. Return journey to Jaen (March 15-18): four days, notably easier than westward trip. Both women more confident riders. Isabel suggests pushing the pace. Catarina opening up, becoming companion rather than servant. Arrive in good condition. Staging area has grown to 8,000-10,000 troops with more arriving daily. Seven days until March 25 assembly deadline. Campaign launch approximately two weeks away.",
      "characters": [
        "juan_ii",
        "isabel_of_portugal",
        "dona_catarina",
        "infante_juan_de_aragon",
        "rodrigo_manrique"
      ],
      "factions_affected": [],
      "location": "Jaen",
      "tags": [
        "narrative",
        "journey",
        "preparation",
        "campaign"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "Everything is going well. We will stay here a few days, get rested and then return to Jaen.\n\n\nI hug her and give her a kiss.\n\n\nHave you recovered my love? Do you think we can...be together again tonight? I have missed you."
        },
        {
          "role": "gm",
          "text": "Queen's Chambers, Royal Alcázar\nEarly Evening, March 11th\n\nIsabel melts into Juan's embrace, returning his kiss with warmth. When he asks his question, a blush colors her cheeks, but there's also a small, knowing smile—the new Isabel who's learning to be comfortable with her feelings and desires.\n\n\"I have recovered,\" she says softly, her arms still around him. \"The bath helped enormously. And an actual bed instead of the ground—\" she laughs quietly, \"—you have no idea how wonderful that felt.\"\n\nShe pulls back slightly to look at his face, her expression showing both affection and honest assessment. \"I am still... a bit sore. Four days of hard riding took its toll. But—\" her hand comes up to touch his cheek, \"—I've missed you too. And we're in a proper bedchamber with actual privacy for the first time since we left Jaén.\"\n\nHer blush deepens, but she doesn't look away. \"I want to be with you, Juan. Even if I'm not quite at my best tonight.\" A hint of humor enters her voice. \"Just... perhaps be gentle? Your wife is discovering that becoming a campaigner has certain consequences for more intimate activities.\"\n\nShe takes his hand and leads him toward the bedchamber door, then pauses to call softly toward the adjoining room: \"Catarina, the King and I are retiring for the evening. We'll see you in the morning.\"\n\nThere's a brief rustling sound and Catarina's respectful voice: \"Of course, Your Majesty. Good night.\"\n\nIsabel closes the bedchamber door, turning back to Juan with that mixture of vulnerability and confidence that's become her nature since the journey to Jaén. She reaches up to kiss him again, her hands moving to help him with his clothing.\n\n\"I love you,\" she whispers. \"Even when my body is complaining about all the riding.\"\n\n[The intimate evening proceeds privately between husband and wife.]\n\nThe Next Morning\nMarch 12th, Royal Alcázar, Seville\n\nThe morning sun streams through the bedchamber windows. Juan and Isabel wake together in the comfortable bed—a far cry from sleeping on the ground during their journey.\n\nWhat does Juan plan to do during his time in Seville? Does he have other business to attend to, or does he spend time with Isabel and prepare for the return journey to Jaén?"
        },
        {
          "role": "player",
          "text": "I spend some days in Seville making myself available to those who want to see me. I take time to connect and be with Isabel. Then we travel back to Jaen and assume it goed the same as the first journey, only now we are more practiced. Briefly describe what happens and the return journey."
        },
        {
          "role": "gm",
          "text": "Seville - March 12-14, 1431\nThree Days in the City\n\nJuan spends his time in Seville productively, balancing royal duties with personal time:\n\nAudiences and Meetings:\n\nOver three days, he makes himself available to various petitioners and important figures. The western nobles arriving early for the campaign assembly request audiences—some seeking clarification on their levy obligations, others wanting to pledge additional support, a few hoping to position themselves favorably for rewards after the campaign. Juan handles each with the mixture of firmness and grace that's become his style.\n\nHe visits the crusader encampment outside the city walls, greeting the 127 sworn crusaders personally. Captain Alonso Pérez presents them for inspection—they're disciplined, well-trained, eager. Many are the original 101 who stayed in Seville when Juan traveled to Toledo. They're delighted to see their king, and Juan spends time talking with several, hearing their stories, reinforcing their sense of sacred purpose.\n\nThe Genoese ship captains request a meeting. Juan dines with them one evening—rough, practical seafarers who speak a mixture of Italian dialects and broken Castilian. They're professionals, interested in payment terms and operational parameters. Juan assures them the contracts will be honored, and they seem satisfied. Infante Juan proves invaluable at this meeting, translating nuances and building rapport.\n\nHe also meets with several Andalusian merchants and guild leaders who've contributed funds to the crusade. They're treated to a brief audience where Juan thanks them personally, reinforcing that the crown remembers its supporters.\n\nTime with Isabel:\n\nBut Juan also carves out significant time with Isabel, away from the demands of kingship. They walk the Alcázar's gardens together in the mornings—beautiful Moorish courtyards with orange trees, fountains, tiled pavilions. These quiet moments feel precious, knowing that once the campaign begins, such peace will be rare.\n\nThey pray together in the palace chapel each evening, maintaining the rhythm they established. Isabel seems more relaxed here than in Jaén's austere fortress—the Alcázar's comfort suits her better, though she doesn't complain about what's to come.\n\nOne afternoon, they explore Seville's cathedral together—the massive Gothic structure rising where a mosque once stood. Isabel is awed by its scale. They pray before the cathedral's relics, and Juan notices her hand instinctively moving to her belly in a small, unconscious gesture. She doesn't say anything, and he doesn't ask, but the gesture lingers in his mind.\n\nTheir nights together are tender and intimate. Isabel is recovering from the journey's physical toll, and their lovemaking reflects that—gentler, less urgent, but no less meaningful. They talk in the darkness about hopes and fears, about the campaign ahead, about the life they're building together.\n\nBy the third day, Isabel seems refreshed and ready to face the return journey. \"I actually miss Jaén a little,\" she admits with surprise. \"It's strange—the fortress is so much less comfortable than this, but it feels like... where we're supposed to be right now. Where the work is.\"\n\nThe Return Journey to Jaén\nMarch 15-18, 1431 - Four Days\n\nThe return journey proves notably easier than the trip west:\n\nDay One: Both Isabel and Catarina are visibly more confident in the saddle from the start. Their bodies have adapted—the soreness that plagued the first journey is manageable now. They set a steady pace, and both women keep up without struggle. Juan notices Isabel sitting taller, handling her horse with more natural ease.\n\nDay Two: The weather remains cooperative—clear March skies, mild temperatures. The party makes good time. Around the evening campfire, Catarina actually initiates conversation rather than remaining dutifully silent. She tells stories of her childhood in northern Portugal, makes Isabel laugh. The dynamic between the two women has shifted—less queen and attendant, more companions.\n\nDay Three: Isabel surprises everyone by suggesting they push the pace slightly. \"We're making good time, but we could do better,\" she says. \"I can manage it if Catarina can.\" Catarina agrees, looking almost pleased at the challenge. They ride harder, covering more ground. By evening, both women are tired but satisfied, even proud.\n\nDay Four: They arrive in Jaén in the late afternoon, having completed the return journey in the same four days but with far less struggle. Isabel dismounts with only slight stiffness—a marked contrast to her exhausted state arriving in Seville. \"I'm becoming quite the rider,\" she tells Juan with genuine satisfaction. \"My mother wouldn't recognize me.\"\n\nThe fortress commander greets them at the gates. The staging area outside the walls has grown significantly—more tents, more troops arriving daily. The army assembly is progressing on schedule.\n\nIsabel surveys it all with a new perspective. After two hard journeys, after seeing military preparations in both Seville and Jaén, she's beginning to truly understand what her husband is undertaking. There's no fear in her expression—just steady resolve.\n\n\"We're really doing this,\" she says quietly as they ride through the gates. \"The crusade. It's all real now.\"\n\nJaén Fortress\nMarch 18th, 1431 - Late Afternoon\n\nThey've returned with a week remaining until the March 25th assembly deadline. The staging area is filling rapidly—perhaps eight to ten thousand troops already present, with more arriving daily. The machinery of war is fully in motion.\n\nWhat does Juan do upon returning to Jaén? The campaign launch is now less than two weeks away."
        },
        {
          "role": "player",
          "text": "Lets wrap up the chapter here. Create a new document in canvas and put an extensive summary in it. Name it \"Chapter 14\""
        },
        {
          "role": "gm",
          "text": "Chapter 14 marks the crucial transition from wedding celebrations to active campaign preparation. Juan II and Queen Isabel's relationship deepens significantly through shared experiences and vulnerability, while the military machinery of the crusade advances steadily toward its April launch. The chapter covers six weeks of intensive preparation, traveling, and relationship building, culminating with the royal couple's return to Jaén with the campaign now imminent.\n\n---\n\n## PART I: THE MARRIAGE DEEPENS (Early February 1431)\n\n### The First Week of Marriage\n\nFollowing their wedding in late January, Juan and Isabel consummate their marriage and spend the first weeks of February establishing their intimate relationship. Juan is careful to make Isabel feel comfortable and loved, and they are intimate frequently during these weeks.\n\n**Isabel's Emotional Response (Rolled 31/100 - Comfortable and Dutiful):**\n\nIsabel adjusts well to married life over the first week. The physical intimacy is no longer strange or uncomfortable—she has adapted to the reality of married life. She fulfills her duties willingly and finds comfort in Juan's affection, even if she doesn't yet experience overwhelming passion. \n\nHer feelings are characterized by:\n- Genuine affection that's growing steadily\n- Appreciation for Juan's gentleness and consideration\n- Comfort and safety in his presence\n- Contentment rather than passionate love (at this stage)\n- A solid foundation being built through warmth and trust\n\n### The Morning Conversation (One Week After Wedding)\n\nAfter intimacy one morning, Juan holds Isabel and tells her he loves her, saying this is how he imagined married life would be. When he asks how she likes being married, Isabel responds with characteristic honesty:\n\n**Isabel's Response:**\n- \"I am content, my lord. More than content.\"\n- She acknowledges his kindness and gentleness\n- Admits she prayed for months about the marriage and was frightened\n- Expresses genuine happiness: \"I like being your wife, Juan.\"\n- Says she likes waking beside him, their evening prayers, and when he holds her\n- Believes they will \"do well together. Better than well.\"\n\nIt's clear affection and real fondness, growing trust—not yet fiery love, but genuine contentment and happiness in an arranged marriage that's exceeding her expectations.\n\n### Pregnancy Timeline Established (Rolled 52/100)\n\nBased on the roll for pregnancy conception timeline, **Isabel conceives in early March** (during one of their journeys or immediately after). By late April/early May, she will have missed two periods and be experiencing clear symptoms, confirming the pregnancy around 8-10 weeks. This will significantly impact campaign planning when confirmed.\n\n---\n\n## PART II: INSPECTING THE CRUSADE PREPARATIONS (Early February, Toledo)\n\n### The Crusader Encampment\n\nJuan inspects the crusaders outside Toledo's eastern walls. The force has grown dramatically since the wedding recruitment proclamation:\n\n**Current Crusader Status:**\n- **Toledo:** 267 crusaders (50 original from Seville + 217 newly recruited)\n- **Seville:** 101 crusaders (remained for training under Captain Alonso Pérez)\n- **Total Sworn:** 368 crusaders across both locations\n- **Quality:** Mixed but improving with training\n- **Pending Review:** 37 candidates being screened this week\n- **Projection:** ~400 crusaders by month's end, 500-550 by April campaign start\n\n**Meeting with Captain García Fernández:**\n\nThe training commander reports excellent discipline and no desertions. Juan gives clear guidance:\n- Continue recruitment and training\n- Prioritize combat readiness over numbers\n- Only deploy men truly ready to fight\n- Those needing more training will join later in waves\n- Better 300 competent warriors than 400 who'll break in battle\n\n**Force Division Decided:**\n- **Western Army:** ~100 Seville crusaders (veterans) + any Seville recruits\n- **Eastern Army:** ~250-300 Toledo crusaders + reinforcements arriving later\n- Clear division—no confusion about assignments\n\n### Artillery Inspection\n\nMaster Gunner Pietro Calabrese presents the artillery status:\n\n**Artillery Readiness:**\n- **5 medium bombards operational** (one rejected due to casting flaw)\n- Each fires 40-50 pound stone balls, 300-400 yard range\n- Rate of fire: 10-12 shots/day if pressed, 6-8 if careful\n- **5 trained crews** (6 men each = 30 gunners total)\n- **3 master gunners** (Pietro + 2 assistants)\n- Adequate gunpowder and hundreds of stone shot prepared\n- 40 oxen trained for transport\n\n**Pietro's Concerns and Needs:**\n- Good reconnaissance before siege commitments\n- Extra oxen teams (10 per gun vs 8, plus spares) for mountain terrain\n- Guaranteed infantry/cavalry protection during operations\n- Weather-protected powder transport\n- Authority to advise against tactically unsound sieges\n\n**Deployment Change:**\nJuan redirects the artillery to the **eastern army** (originally planned for western). Pietro will march toward Jaén in early March, arriving by month's end. He understands the eastern campaign is more opportunistic, requiring greater mobility and flexibility.\n\n### Coordination with Álvaro\n\nDon Álvaro briefs Juan on Rodrigo's letter from Seville:\n\n**Seville Crusader Status:**\n- 100 original crusaders maintaining excellent discipline\n- 27 new crusaders recruited and accepted (43 applied)\n- Current total: 127 in Seville\n- Quality high—several former sailors, Military Order family sons\n- Projection: 150-170 crusaders by April for western army\n\n**Noble Summons Decision:**\n- Formal levy summons **sent immediately** (early February)\n- Assembly deadline: **March 25th** at staging areas\n- Gives nobles ~7 weeks to gather and march\n- No staggered arrival—everyone assembles, waits if needed\n- Force targets: 12,000 west (Seville), 23,000 east (Jaén)\n\n**Tax Assessors Deployed:**\n- 43 trained assessors ready\n- Dual mission: audit campaign spending + assess noble estate revenues\n- Deploy with armies in April\n\n**Timeline Confirmed:**\n- **Campaign Start:** April 1431\n- **Campaign Duration:** 8 months (April-November)\n- **Current Treasury:** 390,000 florins available\n\n---\n\n## PART III: THE JOURNEY TO JAÉN (March 2-7, 1431)\n\n### Departure Preparations\n\nJuan decides to depart for Jaén in early March, traveling with Isabel. The plan:\n- Isabel travels with the army until pregnant, then returns to Toledo\n- When pregnancy confirmed, she leaves for safety and proper care\n- Early March departure allows comfortable travel pace\n\n### The Exceptional Journey (Rolled 99/100)\n\nThe six-day journey from Toledo to Jaén proves transformative for Juan and Isabel's relationship. Perfect weather, Isabel's growing confidence on horseback, and meaningful conversations create an exceptional experience.\n\n**Day One (March 2):** \nDeparture from Toledo with ~200 people (king, queen, crusaders, guards, servants). Perfect weather. Isabel nervous initially but adapts quickly. By afternoon, she requests to ride horseback instead of wagon—granted, she proves competent. Evening camp near Tembleque—Isabel tired but energized, more talkative than usual.\n\n**Day Two (March 3):**\nThrough La Mancha's vast plains. Isabel rides horseback most of the day, becoming more animated than Juan has seen at court. Town welcomes them spontaneously—villagers, children, priest's blessings. Isabel visibly moved. Evening under brilliant stars—Isabel sits with Juan, awed by the beauty.\n\n**Day Three (March 4):**\nInto hill country approaching Sierra Morena. Isabel growing confident on horseback. Long prayer at wayside shrine to Saint James—Isabel emerges with red eyes but peaceful, radiant expression. Evening: Juan tells her about his pilgrimage to Santiago; she understands the depth of his sacrifice for the crusade.\n\n**Day Four (March 5):**\nMountain passes, spectacular scenery. Isabel surprises everyone with her resilience—no complaints, energized by challenge. Mid-day conversation: \"I thought I would hate this... But I don't hate it. I feel... more capable than I thought.\" Evening prayers in mountain valley feel especially meaningful.\n\n**Day Five (March 6) - THE TRANSFORMATIVE MOMENT:**\n\n### The Letter from Portugal (Rolled 92/100)\n\nA courier catches up with the column carrying a letter from Isabel's mother. The letter proves to be the catalyst for profound emotional breakthrough:\n\n**Key Passages from the Mother's Letter:**\n\nThe Queen Mother of Portugal writes extensively about her own arranged marriage, revealing:\n\n- She too was fifteen, terrified, merely dutiful for the first year\n- Love began only when she showed her true self—fears, inadequacies, vulnerability\n- The turning point came when she confessed feeling like a failure\n- Her husband responded with his own fears and inadequacies\n- From that shared vulnerability, real love grew over twenty years\n- Now her husband is not just king but her dearest friend\n\n**Her Advice to Isabel:**\n\n*\"Do not hide yourself from Juan. Show him not just the dutiful queen, but Isabel—the girl who reads poetry, who prays with her whole heart, who has fears and hopes and dreams.\"*\n\n*\"Love in arranged marriages does not arrive complete on the wedding night. It grows like a garden—you must plant seeds now. The seed of honesty. The seed of vulnerability. The seed of allowing yourself to be truly known.\"*\n\n*\"Trust him with your fears. Trust him with your inadequacies. Trust him with the parts of yourself you usually hide.\"*\n\n**Isabel's Emotional Response:**\n\nAfter reading the letter to Juan, Isabel breaks down, revealing her deepest fears:\n\n- Constant fear of doing everything wrong, of disappointing him\n- Fear she won't give him a son\n- Fear he'll realize he deserved better than a plain Portuguese princess\n- Admits she's been hiding her scared, inadequate true self behind dutiful perfection\n- Her mother is right—if she keeps hiding, he'll never truly know her\n- She wants Juan to know the real Isabel, not just the dutiful surface\n\nThis moment of profound vulnerability transforms their relationship from comfortable partnership to genuine emotional intimacy.\n\n**Day Six (March 7):**\nFinal descent to Jaén. Isabel rides beside Juan, fundamentally changed—sitting taller, meeting his eyes more readily, smiling freely. The carefully constructed dutiful mask has cracked. They talk naturally about childhood, hopes for children, small intimate things. By afternoon, Jaén appears on its hillside. Isabel touches Juan's hand: \"Whatever comes, we face it together. Until I must go back to Toledo.\"\n\n**Journey Impact:**\nThe six-day journey transforms Isabel from dutiful bride to genuine partner. She discovers capability, confidence, and most importantly—the courage to be vulnerable and fully known. Their marriage shifts from arranged obligation to real love beginning to bloom.\n\n---\n\n## PART IV: JAÉN AND EASTERN COMMAND (March 7-8, 1431)\n\n### Establishing Royal Quarters\n\nThe fortress at Jaén provides defensible but austere quarters. Isabel pragmatically accepts the military staging area reality: \"We're not here for comfort.\" Outside the walls, the eastern army staging area rapidly takes shape with supply depots, artillery grounds, crusader camps, and preparation for 23,000 troops.\n\n### Meeting with Master of Calatrava\n\nDon Pedro González de Padilla (age 45, Master of Calatrava) briefs Juan on eastern army preparations:\n\n**Force Assembly Status:**\n- ~3,000 troops already present, more arriving daily\n- Full 23,000 expected by March 25th deadline\n- Noble houses responsive, no significant delays\n- Military Orders committed: Calatrava (1,500), Santiago (2,000), Alcántara (1,000)\n\n**Supply Situation:**\n- Father Tommaso's administrators \"extraordinarily efficient\"\n- Four forward depots: Ciudad Real, Úbeda, Baeza, Jaén\n- Provisions for 23,000 men for 8 months being accumulated\n- Quartermaster corps managing excellently\n\n**Intelligence:**\n- Granada aware something coming but not the scale\n- Sultan Muhammad IX concentrated forces near Granada city and western approaches\n- Expects main thrust west (historical pattern)\n- Doesn't realize massive eastern offensive being prepared\n- Element of surprise should last 1-2 weeks once 23,000 assemble\n\n**Cavalry Raiders:**\n- 3,000 cavalry organized into six mobile columns of 500 each\n- Light, fast, able to strike deep and withdraw\n- Commanders selected—all experienced frontier fighters\n- Will range across entire frontier, force Granada to spread defenses\n\n**Artillery:**\n- Pietro Calabrese arriving late March with 5 bombards\n- Positions and magazines prepared\n- Pedro admits: \"Never commanded with siege artillery before\"\n\n**Medical:**\n- 6 surgeons contracted\n- Field hospitals at each forward depot\n- More medical support than Pedro has ever seen\n\n**Strategic Guidance from Juan:**\n\nJuan provides clear strategic direction:\n- **Drive toward Granada city**\n- Take fortresses along the way to secure supply corridor\n- Stay light on feet—be flexible based on what develops\n- Start with 3,000 cavalry screening ahead\n- Plan next moves based on intelligence they gather\n- Goal: Push secure supply line close enough to besiege Granada without supply raids\n\nPedro's honest assessment: \"The distance is 90-150 miles through mountains with at least 12 significant fortresses between here and Granada. Each could take weeks to reduce. In eight months, we might take 3-4 major fortresses, pushing 40-60 miles deeper—a quarter to a third of the way to the capital. Not enough to besiege Granada this year, but enough to make next year significantly easier.\"\n\n**Command Authority Issues:**\n\nPedro raises concerns about:\n1. **Authority in Juan's absence:** Needs clear command while Juan visits Seville\n2. **The Infantes:** Princes who claimed throne now take orders from him—will they obey?\n3. **Isabel's presence:** Warning about reality of military camp with 23,000 soldiers\n4. **Granada's response:** Sultan might call for Ottoman/North African help\n\n**Juan's Responses:**\n\n- **Full command authority** in Juan's absence to make all necessary decisions\n- Can \"roll heads if needed\" but better to let Juan handle challenges when he returns\n- Álvaro will write formal letter of authority cementing command structure\n- Infante Enrique will serve under Pedro's orders; Juan will address challenges\n- Isabel stays with army until pregnant (decision made)\n- External threats will be dealt with as they arise\n\nThe letter of authority will state clearly: \"In Your Majesty's absence, Don Pedro González de Padilla, Master of Calatrava, commands the eastern army with full royal authority. All nobles, knights, soldiers, and crusaders will obey his orders as they would Your Majesty's own.\"\n\n---\n\n## PART V: THE JOURNEY TO SEVILLE (March 8-11, 1431)\n\n### Departure Planning\n\nJuan decides to visit Seville quickly to coordinate with Rodrigo, taking Isabel with him. He proposes hard riding—80 miles, just guards as escort, sleeping under stars. Isabel must decide whether to bring ladies-in-waiting.\n\n**The Ladies' Response (Rolled 40/100 - Duty-Bound Single Volunteer):**\n\nWhen asked, the Portuguese ladies respond:\n- **Doña Beatriz** (54): Physically cannot manage hard riding\n- **Maria** (19): Not skilled enough rider, would slow party or get injured\n- **Ana** (early 20s): Same—inadequate for such journey\n- **Catarina** (23): Volunteers out of duty, not enthusiasm\n\nCatarina is competent but not excited: \"You need a lady-in-attendance, and I'm the only one here who can manage it. So I'll do it.\" She recognizes obligation and accepts it without resentment, but there's no eagerness—just acceptance of duty.\n\n**Traveling Party:**\n- King Juan II\n- Queen Isabel\n- Catarina (lady-in-waiting)\n- 6 Guardian Company crusaders\n- 4 household guards\n- Pack horses with minimal supplies\n- Total: 13 riders plus pack animals\n\n### The Journey West (Rolled 44/100 - Adequate Journey, Building Stamina)\n\nThe four-day journey to Seville is workmanlike rather than adventurous:\n\n**Day One (March 8):** Hard on both women—long hours, muscles protesting. By evening, both dismount stiffly. Isabel admits she aches everywhere. Catarina remains dutifully silent.\n\n**Day Two (March 9):** Bodies begin adapting. Isabel draws on Toledo-Jaén experience, finds ways to manage discomfort. Catarina proves more resilient than her dutiful acceptance suggested.\n\n**Day Three (March 10):** Workmanlike routine established. Rise before dawn, ride all day with brief midday rest, camp at dusk. Landscape transitions from mountains to rolling hills to flatter terrain. Evening camps provide better moments—Catarina shows dry humor when relaxed. Guards impressed by women's endurance.\n\n**Day Four (March 11):** Arrive Seville late afternoon. Tired and dusty but intact. Not transformative or romantic—simply successful. A thing that needed doing, done competently.\n\n---\n\n## PART VI: SEVILLE AND WESTERN COMMAND (March 11-14, 1431)\n\n### Meeting with Don Rodrigo Manrique\n\nJuan immediately meets Rodrigo at the western command center. The frontier veteran briefs him:\n\n**Force Assembly:**\n- ~1,800 troops present or within a day's march\n- Full 12,000 expected by March 25th\n- Military Orders committed: Santiago (800), Alcántara (400)\n- Admiral Enríquez pledged 500 naval-experienced household troops\n\n**Crusader Status:**\n- Original 101: No desertions, excellent discipline, ready to fight\n- New recruitment: 43 applications, 27 accepted\n- Quality high—former sailors, Military Order family sons\n- Current total: 127 crusaders\n- Projection: 160-170 by April\n\n**Naval Contracts Finalized:**\n- 12 Genoese combat galleys: 38,400 florins (8 months)\n- 10 transport vessels: 12,000 florins (8 months)\n- 8 Portuguese galleys from dowry (being prepared in Lisbon)\n- Total: 20 combat-capable ships + 10 transports\n- Naval superiority in operational area assured\n\n**Supply Situation:**\n- Father Tommaso's administrators continuing excellence\n- Depots stocked throughout Andalusia\n- Supply caches pre-positioned at coastal locations\n- Naval supply chain ready to function\n\n**The Infantes:**\nRodrigo's assessment of Infante Juan: \"Cooperative. Professional. But subdued. Going through motions correctly without enthusiasm. Doing penance, not passion.\" Hasn't yet shown him the formal command letter—waited for Juan's arrival.\n\n**Artillery:**\nNo bombards for west (all committed to east). Traditional siege equipment prepared: trebuchets, mangonels, rams, siege towers.\n\n**Intelligence:**\n- Granada reinforcing western fortresses (Estepona, Marbella, Málaga)\n- Don't yet realize full-scale naval invasion being prepared\n- Sultan concentrated attention eastward (correct assumption)\n- Western defenses weaker than they might be\n- Timing advantage if launch when Sultan committed east\n\n**Coordination Concerns:**\nRodrigo emphasizes timing is critical. Needs 3-5 days after receiving signal to finalize embarkation and launch. Juan must clearly determine when Granada truly committed to eastern front.\n\n### Meeting with Infante Juan de Aragón\n\nThe prince arrives wearing simple crusader tabard—no rich fabrics, no jewelry. The change from proud prince is striking. He bows deeply, respectfully, with genuine humility.\n\n**Juan's Approach:**\nAddresses him as \"cousin\" (kinship, not cold formality), compliments his dedication, officially designates him as part of Rodrigo's command, expresses hope the role suits his talents.\n\n**Infante Juan's Response:**\n\nDeeply moved by being called \"cousin\" and offered meaningful role:\n- \"More gracious than I deserve\"\n- Admits uncertainty whether truly trusted or just watched\n- When offered command role, shows gratitude and relief\n- Lists his relevant experience: governance, logistics, managing nobles, naval operations, Mediterranean campaigns\n- \"I know the western nobles. Many have ties to Aragon, and some will be difficult. I can help.\"\n- Speaks Genoese dialect, can coordinate with captains\n- Understands amphibious warfare\n- Swears by his oath: \"I will not fail you\"\n\n**Rodrigo's Support:**\n\"If you formalize his role as senior advisor to my command, he'll serve well. His experience and connections will be assets. But—you follow my orders. Can you accept that?\"\n\nInfante Juan: \"I can. I spent years as my brother's subordinate. I know how to serve under another's command. You lead, Don Rodrigo. I will advise, coordinate, and execute your orders. Nothing more.\"\n\n**Outcome:**\nThe command structure works. Rodrigo has military expertise and authority. Infante Juan brings diplomatic skill, logistical experience, and valuable connections. Partnership seems genuine. The rebellious prince is gone—what remains is competent administrator seeking redemption.\n\n### Time in Seville (March 12-14)\n\n**Royal Duties:**\n- Audiences with western nobles arriving early\n- Visiting 127 crusaders—personal greetings, reinforcing sacred purpose\n- Dinner with Genoese captains (Infante Juan invaluable as translator)\n- Meetings with Andalusian merchants and guild leaders who contributed funds\n\n**Time with Isabel:**\n- Walking Alcázar's beautiful Moorish gardens in mornings\n- Evening prayers in palace chapel maintaining their rhythm\n- Exploring Seville's massive cathedral together\n- Quiet conversations about hopes, fears, the campaign ahead\n- Tender, gentle intimacy as Isabel recovers from journey\n- Isabel: \"I actually miss Jaén a little... the fortress feels like where we're supposed to be right now. Where the work is.\"\n\n**Notable Moment:**\nIn the cathedral, Isabel's hand unconsciously moves to her belly during prayers. She doesn't say anything, Juan doesn't ask, but the gesture lingers. (This is during the time frame when conception occurred per the earlier roll.)\n\n---\n\n## PART VII: RETURN TO JAÉN (March 15-18, 1431)\n\n### The Journey East\n\nThe return journey proves notably easier than the trip west:\n\n**Day One (March 15):** Both women visibly more confident from the start. Bodies adapted, soreness manageable. Steady pace, both keep up without struggle. Isabel sits taller, handles horse with natural ease.\n\n**Day Two (March 16):** Good weather continues. Good time made. Evening campfire: Catarina initiates conversation, tells Portuguese stories, makes Isabel laugh. Dynamic shifting from queen/attendant to companions.\n\n**Day Three (March 17):** Isabel suggests pushing pace slightly—\"We're making good time, but we could do better. I can manage it if Catarina can.\" Catarina agrees, almost pleased. They ride harder, cover more ground. Both tired but satisfied, even proud.\n\n**Day Four (March 18):** Arrive Jaén late afternoon. Four days completed with far less struggle than before. Isabel dismounts with only slight stiffness. \"I'm becoming quite the rider. My mother wouldn't recognize me.\"\n\n**Staging Area Growth:**\nOutside the walls, the army assembly has grown significantly—more tents, more troops arriving daily. Perhaps 8,000-10,000 already present, with more streaming in. The machinery of war fully in motion.\n\n**Isabel's Observation:**\nSurveying the growing army: \"We're really doing this. The crusade. It's all real now.\" No fear—just steady resolve.\n\n---\n\n## CHAPTER END STATUS\n\n**Date:** March 18, 1431, Late Afternoon  \n**Location:** Jaén Fortress  \n**Time Until Assembly Deadline:** 7 days (March 25)  \n**Time Until Campaign Launch:** ~2 weeks (Early April)\n\n### Military Preparations\n\n**Eastern Army (Jaén):**\n- **Current strength:** 8,000-10,000 present, growing daily\n- **Expected:** 23,000 by March 25th\n- **Commander:** Don Pedro González de Padilla (Master of Calatrava)\n- **Crusaders:** 267 in Toledo preparing to march to Jaén\n- **Artillery:** 5 bombards arriving late March with Pietro Calabrese\n- **Cavalry raiders:** 3,000 light cavalry in 6 mobile columns\n- **Supply:** 4 forward depots stocked, quartermaster corps functioning\n- **Command authority:** Clear letter from Álvaro establishing Pedro's authority\n\n**Western Army (Seville):**\n- **Current strength:** ~1,800 present\n- **Expected:** 12,000 by March 25th\n- **Commander:** Rodrigo Manrique\n- **Senior Advisor:** Infante Juan de Aragón (formally appointed)\n- **Crusaders:** 127 present, projected 160-170 by April\n- **Naval:** 30 ships contracted (12 Genoese galleys, 10 transports, 8 Portuguese)\n- **Supply:** Depots throughout Andalusia, coastal caches pre-positioned\n- **Strategy:** Launch when Sultan committed to eastern front (signal from Juan)\n\n**Total Crusader Force:**\n- Sworn crusaders: 368 (267 Toledo, 101 Seville)\n- New this month: 27 Seville\n- Projected by April: 500-550 total\n- Quality: High and improving with training\n\n### Financial Status\n\n- **Treasury:** 390,000 florins available\n- **Campaign Budget:** 143,171 florins (approved)\n- **Surplus:** 247,000+ florins plus taxation revenue during campaign\n- **Tax Assessors:** 43 ready to deploy for dual mission (audit + assessment)\n\n### Personal Status\n\n**Juan II:**\n- Age 18\n- Confident, prepared for campaign\n- Successfully integrated Infantes into command structure\n- Strong relationships with both eastern (Pedro) and western (Rodrigo) commanders\n- Marriage deepened significantly through shared experiences\n\n**Queen Isabel:**\n- Age 15\n- Transformed from dutiful bride to genuine partner\n- Discovered unexpected capability and confidence\n- Learned to be vulnerable and fully known\n- Relationship with Juan shifted from obligation to real love beginning\n- **Pregnant** (conceived early March, not yet aware)\n- Committed to staying with army until pregnancy confirmed\n- More comfortable on horseback, adapting to campaign life\n\n**Isabel & Catarina:**\n- Relationship evolved from queen/servant to companions\n- Catarina showed resilience and dry humor\n- Both women proved capable of hard travel\n- Growing bond through shared challenges\n\n### Strategic Situation\n\n**Coordination:**\n- Eastern army will deploy first, drawing Granada's attention\n- When Sultan commits forces east, signal sent to Rodrigo\n- Western naval assault launches 3-5 days after signal\n- Relay system established for two-day communication\n- Forces Granada into impossible dilemma\n\n**Granada Intelligence:**\n- Aware something coming but not full scale\n- Sultan concentrated forces near Granada city and west\n- Expects crusade through west (historical pattern)\n- Doesn't realize 23,000-troop eastern offensive\n- Element of surprise may last 1-2 weeks after assembly\n\n**Timeline:**\n- March 25: Army assembly deadline at both staging areas\n- Late March: Final preparations, artillery arrives\n- Early April: Campaign launches\n- April-November: Eight-month campaign season\n\n### Key Themes\n\n**Marriage and Vulnerability:**\nThe letter from Isabel's mother catalyzed profound emotional breakthrough. Isabel learned that real love grows from vulnerability, honesty, and showing one's true self—not from perfect dutiful performance. Juan and Isabel's relationship transformed from comfortable partnership to genuine intimacy.\n\n**Capability and Confidence:**\nIsabel discovered she's more capable than she knew—handling hard travel, adapting to discomfort, becoming skilled on horseback. This physical confidence paralleled her emotional growth in showing her true self to Juan.\n\n**Command and Redemption:**\nInfante Juan's appointment to Rodrigo's command showed Juan's mature leadership—offering meaningful roles and dignity while maintaining clear authority structures. The rebellious prince becoming competent, humbled administrator seeking redemption through service.\n\n**Preparation and Reality:**\nThe crusade shifted from abstract plan to imminent reality. Troops assembling, ships contracted, supplies accumulated, commanders in place. The machinery of war now irreversibly in motion toward April launch.\n\n### Looking Forward to Chapter 15\n\n**Immediate Events:**\n- Final week before March 25 assembly deadline\n- Continued troop arrivals at both staging areas\n- Pietro Calabrese and artillery arrive at Jaén\n- Toledo crusaders (267) march to join eastern army\n- Noble houses complete their levy assemblies\n- Final equipment distribution and training\n- Isabel likely beginning to notice early pregnancy symptoms (though too early to confirm)\n\n**Campaign Launch Preparation:**\n- Strategic briefings for all commanders\n- Final supply verification\n- Cavalry raiding columns organize and prepare\n- Guardian Company finalizing banner protection protocols\n- Coordination systems tested\n- Last diplomatic and intelligence updates from Granada\n\n**Personal Dynamics:**\n- Juan and Isabel's final peaceful time before war begins\n- Isabel's pregnancy symptoms may start appearing\n- Decision point approaching about Isabel's continued presence\n- The transition from preparation to actual combat operations\n\n**Strategic Questions:**\n- Will noble levies all arrive as committed?\n- How will Granada respond to 23,000 troops at Jaén?\n- Will the coordination between east and west function as planned?\n- Can the supply systems sustain the massive forces?\n- Will Infante Juan and Enrique truly serve loyally under others' command?\n\nThe crusade stands at the threshold. Six weeks of preparation have brought everything into position. Now comes the test of execution—the grinding reality of siege warfare, the uncertainty of battle, the challenge of sustaining massive armies in enemy territory, and the question of whether Juan's grand strategy will work in practice as brilliantly as it does on maps.\n\n---\n\n**END OF CHAPTER 14**\n\n1. Overview\n2. The marriage deepening (Isabel's emotional development, the morning conversation)\n3. Inspecting crusade preparations (crusaders, artillery, coordination with Álvaro)\n4. The journey to Jaén (the exceptional 6-day journey with the transformative letter from Isabel's mother)\n5. Jaén and eastern command (meeting with Master of Calatrava, strategic planning)\n6. The journey to Seville (adequate journey with Catarina volunteering)\n7. Seville and western command (meeting with Rodrigo and Infante Juan)\n8. Return to Jaén (easier journey showing their growth)\n9. Chapter end status (comprehensive summary of military, financial, personal, and strategic situation)\n10. Key themes and looking forward to Chapter 15\n\nThe document is extensive and detailed, capturing the six weeks of events from early February to mid-March 1431, and sets up well for the next chapter where the campaign will actually launch.\n\nNow I should confirm with the user that the document has been created and is ready for their review.\n\nI've created a comprehensive summary document for Chapter 14 titled \"Chapter 14: The Gathering Storm - Complete Summary\" and saved it to canvas.\n\nThe summary captures the full six weeks of events (early February to mid-March 1431), including:\n\nIsabel and Juan's deepening marriage and the transformative letter from her mother\n\nMilitary preparations and inspections (crusaders, artillery)\n\nThe exceptional journey to Jaén with its emotional breakthrough\n\nCommand meetings with the Master of Calatrava and Rodrigo Manrique\n\nThe appointment of Infante Juan to western command\n\nIsabel's growing confidence and capability\n\nComplete status summaries for both armies, finances, and strategic situation\n\nSetup for Chapter 15 with the campaign launch now imminent\n\nThe document is ready for you to review or reference as we begin Chapter 15. Would you like to start the next chapter now?"
        }
      ],
      "roll": null
    }
  ]
}
