{
  "chapter": "2.12",
  "book": 2,
  "event_count": 11,
  "date_range": "1433-10-10 / 1433-11-10",
  "events": [
    {
      "event_id": "evt_1433_00426",
      "book": 2,
      "chapter": "2.12",
      "date": "1433-10-10",
      "end_date": "1433-10-10",
      "type": "diplomacy",
      "summary": "King Alfonso V of Aragon arrives in Toledo for Prince Fernando's baptism, having sailed from Sicily with six galleys and a retinue of forty. Roll 88 (Full Honors and Extended Stay): Alfonso comes personally as godfather, bringing significant diplomatic news. At a private dinner he shares two developments: Pope Eugenius has formally rejected Rene of Anjou's claim to Naples, and he delivers a letter from Byzantine Emperor John VIII Palaiologos addressed to Juan.",
      "characters": [
        "juan_ii",
        "alfonso_v",
        "alvaro_de_luna"
      ],
      "factions_affected": [
        "royal_court"
      ],
      "location": "Toledo",
      "tags": [
        "diplomatic",
        "baptism",
        "alfonso_v",
        "naples",
        "constantinople",
        "reunion"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "We have the baptism. \nDraft a d100 to see if king alfonso comes personally to the baptism."
        },
        {
          "role": "gm",
          "text": "Web Search: Alfonso V Aragon Naples 1433 location military campaign\n\nAlfonso V | King of Aragon, Sicily & Naples | Britannica britannica.com\n\nHistory of Alfonso V, king of Aragon and Naples | Britannica britannica.com\n\nAlfonso V of Aragon - Wikipedia wikipedia.org\n\nMediterranean campaign of Alfonso V of Aragon - Wikidata wikidata.org\n\nAlfonso V of Aragon (the Magnanimous) (1396–1458) | Encyclopedia.com encyclopedia.com\n\nAlfonso V wga.hu\n\nKing Alfonso V of Aragon King of Naples and Sicily italiangenealogy.blog\n\nAlfonso V of Aragon grokipedia.com\n\nAragonese conquest of Naples - Wikipedia wikipedia.org\n\n(PDF) ''Alfonso V the Magnanimous and his second homeland Napoli'' academia.edu\n\nNow I have the historical context. In our alternate timeline, Alfonso came to the Te Deum in April 1433, but historically he was in Sicily from 1432 preparing his fleet for the Naples campaign. Let me check the campaign's current status and what we established about Alfonso.\n\nD100 Roll: Does King Alfonso V of Aragon Attend Fernando's Baptism Personally?\n\nContext:\n\nDate: October 15, 1433\n\nLocation: Cathedral of Toledo\n\nAlfonso's Current Location: Sicily/Southern Italy (managing Naples campaign)\n\nAlfonso's Role: Designated godfather to Prince Fernando\n\nFactors to Consider\n\nSUCCESS FACTORS (Reasons Alfonso Would Come):\n\nSacred Obligation of Godparenthood — In medieval Catholic theology, being a godparent creates a cognatio spiritualis, a spiritual kinship that carries genuine religious weight. Alfonso, a devout Catholic, would understand this obligation seriously. Refusing to fulfill it in person would be spiritually problematic.\n\nThree-Kingdom Alliance Investment — Alfonso has invested heavily in the Castile-Aragon partnership. He attended the Te Deum in April 1433 despite being deep in his Naples preparations. Becoming godfather to the heir of Castile binds his interests to Fernando's future. Missing this would damage the relationship.\n\nChanged Strategic Outlook — Our campaign established that Alfonso experienced a \"spiritual crisis\" and \"humbling\" from the Naples disasters. He's now genuinely invested in Iberian cooperation rather than purely Italian obsession. The baptism serves his reoriented priorities.\n\nJuan's Advocacy in Rome — Juan has actively supported Alfonso's Naples claim to Pope Eugenius IV (resulting in papal support per the April 1433 decree). Alfonso owes Juan considerable political debt. Attending honors that debt.\n\nDistance Is Manageable — Sicily to Toledo is roughly 3-4 weeks by sea and land. An October baptism means Alfonso would have received notice by late August at the latest. He has 6-8 weeks to travel.\n\nNaples Military Situation (Alternate Timeline) — Historically, Alfonso was preparing his fleet in 1432-1433 but the actual Battle of Ponza wasn't until August 1435. In our timeline, with papal support and Castilian military commitments, his position is stronger. He can afford to leave temporarily.\n\nFAILURE FACTORS (Reasons Alfonso Might Not Come):\n\nMilitary Operations Active — Even with improved position, Alfonso is actively managing the Naples campaign. Italian politics are treacherous. Leaving his fleet and army unsupervised for 2+ months is genuinely risky.\n\nDistance and Weather — October Mediterranean sailing can be dangerous. Alfonso might send a high-ranking representative (Queen María, one of the Infantes as his proxy) rather than risk the voyage himself.\n\nRené of Anjou Still Active — Despite papal support for Alfonso's claim, René of Anjou (released from Burgundian captivity in 1432) is actively contesting Naples. Alfonso's enemies could exploit his absence.\n\nProxy Is Acceptable — Medieval custom allows high nobility to send proxies for baptisms when travel is genuinely impossible. A bishop or royal relative standing in would be understood, not insulting.\n\nQueen María Available — Alfonso's wife (Juan's sister) could represent Aragon with full honor. This would satisfy the spiritual obligation while keeping Alfonso at his post.\n\nTwo Major Trips in One Year — Alfonso already traveled to Granada for the Te Deum in April. Making two major journeys to Castile in the same year is unusual for a king managing an active military campaign abroad.\n\nD100 Table\n\nRoll\nOutcome\n01-15\nAlfonso cannot attend. Critical military situation in Italy (perhaps René's forces probe his positions, or Genoese fleet movements require his presence). Sends heartfelt letter and magnificent gifts, with Queen María or Infante Juan acting as proxy godfather with full authority. Letter explains necessity, promises future visit. Relationship undamaged but opportunity missed.\n16-35\nAlfonso sends Queen María as full proxy. Decision made rationally: he cannot leave Naples preparations for 2+ months, but María represents Aragon with complete legitimacy. She travels with substantial retinue and gifts befitting the occasion. Alfonso sends personal letter expressing genuine regret. Honorable solution, properly managed.\n36-55\nAlfonso attends but with minimal entourage and tight timeline. Arrives days before the baptism, departs within a week after. Clearly balancing obligations: fulfills sacred duty but cannot linger. Some tension about his abbreviated presence, but the essential act is accomplished. Juan understands the constraints.\n56-75\nAlfonso attends with appropriate ceremony. Arrives a week before, stays through celebrations, departs thereafter. Brings significant retinue befitting his status as godfather. Full participation in the baptism and feast. Takes opportunity to discuss alliance matters with Juan. Solid diplomatic success.\n76-90\nAlfonso attends with full honors and extended stay. Views this as investment in the alliance. Arrives early, participates fully, uses occasion for substantial diplomatic discussions about Constantinople expedition, Naples coordination, and future cooperation. His presence signals serious Iberian partnership.\n91-100\nAlfonso arrives with unexpected news or proposal. Perhaps a significant development in Naples (positive or negative) that he wants to discuss in person. Or he brings additional diplomatic proposal beyond the baptism. His attendance becomes more than ceremonial—a working summit disguised as family occasion.\n\nProbability Assessment\n\nGiven:\n\nThe strong relationship built over the campaign\n\nAlfonso's new spiritual outlook and Iberian focus\n\nThe sacred weight of godparenthood\n\nJuan's genuine political support for Naples\n\nBut also the real constraints of military command\n\nMy assessment: This should be weighted toward attendance but with meaningful possibility of proxy. The relationship is strong, but Alfonso is a king managing a war. Roll of 40+ for personal attendance seems appropriate.\n\nReady to roll when you are, Sicco."
        },
        {
          "role": "player",
          "text": "rolled 88"
        },
        {
          "role": "gm",
          "text": "The dice favor Iberian unity.\n\nOctober 1433 — Toledo\n\nThe autumn sun hung low over Toledo as the royal household prepared for the baptism of Prince Fernando. Servants bustled through the Alcázar's corridors, hanging fresh tapestries and polishing silver that would grace the feast tables. Archbishop Alonso de Toledo had spent days rehearsing the ceremony with his deacons, determined that this baptism—the christening of Castile's heir—would be spoken of for generations.\n\nBut it was the arrival on October 10th that set the court buzzing.\n\nKing Alfonso V of Aragon sailed into Santander with a fleet of six galleys, having left his Naples operations in the capable hands of his brother Pedro and his condottieri captains. He traveled overland with a retinue of forty—modest by royal standards, but including several figures of note: Don Bernat de Centelles (freshly returned from Rome), the Bishop of Valencia, and a train of mules bearing gifts that required their own escort.\n\nWhen Álvaro de Luna brought the news to Juan in his private chambers, even the Condestable seemed impressed.\n\n\"He's come himself, Your Majesty. Not the Queen, not a proxy. Alfonso himself, with nearly a week to spare before the baptism.\"\n\nThe reunion took place in the Alcázar's great hall, stripped of its mourning black but not yet fully restored to celebration. Alfonso entered with the confident stride of a man who had made a decision and was satisfied with it. At thirty-seven, he looked weathered by Mediterranean campaigns—sun-darkened skin, new lines around his eyes—but his embrace of Juan was genuine and warm.\n\n\"Cuñado,\" Alfonso said, using the familiar term for brother-in-law. \"I could not let another man stand where I should stand. Not for this.\"\n\n\"The Naples situation—\" Juan began.\n\nAlfonso waved a hand. \"René probes, the Genoese scheme, the Pope dithers despite his fine words. It will all still be there when I return. But my godson will only be baptized once.\" He gripped Juan's shoulders. \"Besides, I have news that required speaking face to face, not trusting to letters and messengers.\"\n\nJuan raised an eyebrow. \"News?\"\n\n\"After the ceremony. Tonight is for family, not strategy.\" Alfonso's eyes moved past Juan to where little Catalina was being held by Doña Beatriz, watching the strange king with wide, curious eyes. \"And this must be the princess who has inherited her mother's spirit, if reports are true.\"\n\nThat evening, the Alcázar hosted a private dinner—just the immediate royal household and Alfonso's closest companions. The mood was subdued compared to what a baptismal celebration might normally be; Isabel's absence hung over everything, her empty chair at the table a silent reminder of what had been lost scarcely two months before.\n\nBut Alfonso proved himself a sensitive guest. He spoke of Isabel warmly, sharing a memory from their childhood in the Castilian court—how she had once beaten him at chess when she was only nine, and he a proud teenager of fifteen.\n\n\"She looked at me afterward,\" Alfonso recalled, \"and said, 'You let me win.' I told her I hadn't. She said, 'Then you should have. Now everyone saw you lose to a little girl.'\" He shook his head, smiling sadly. \"Sharp as a Toledo blade, even then. Castile was lucky to have her, however briefly.\"\n\nJuan said nothing, but his hand tightened around his wine cup.\n\nLater, after Catalina had been taken to bed and the servants had withdrawn, Alfonso leaned forward with the expression of a man shifting from courtesy to business.\n\n\"The news I mentioned. Two matters, both significant.\"\n\nJuan gestured for him to continue.\n\n\"First—Pope Eugenius has written to René of Anjou directly, informing him that the Holy See no longer recognizes his claim to Naples. The letter cites the strategic necessity of Aragonese naval power for the Constantinople expedition.\" Alfonso's smile was thin. \"René is reportedly furious. His French allies are making noise about the Pope overstepping. But it stands. Your advocacy in Rome bore fruit.\"\n\n\"And the second matter?\"\n\nAlfonso reached into his doublet and withdrew a folded letter, sealed with Byzantine purple wax.\n\n\"This arrived in Palermo three weeks ago. From Emperor John VIII Palaiologos himself.\" He handed it across the table. \"He's heard about Castile's commitment to Constantinople. He's heard about the Military Order knights, the naval construction, the crusading treasury you've built. And he has a proposal.\"\n\nJuan broke the seal and began to read.\n\n[STOP]\n\nThe letter from Constantinople awaits your reading. Alfonso sits across from you, watching your face as you absorb whatever the Byzantine Emperor has written. Álvaro stands nearby, also waiting.\n\nWhat does Juan do?"
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_1433_00427",
      "book": 2,
      "chapter": "2.12",
      "date": "1433-10-10",
      "end_date": null,
      "type": "diplomacy",
      "summary": "Juan reads Emperor John VIII Palaiologos's letter from Constantinople, revealing the dire state of the city. Roll 17 (Dire: Slow Decay): Constantinople has fewer than 40,000 inhabitants, entire districts stand empty, walls crumble from decades of deferred maintenance, and annual Ottoman tribute of 300,000 silver coins bleeds the treasury. Sotomayor's 300 Castilian knights have boosted morale but cannot save the city alone. The Emperor requests sustained alliance, a personal visit from Juan, and long-term commitment. Alfonso proposes naval power as the strategic key to Constantinople's survival.",
      "characters": [
        "juan_ii",
        "alfonso_v",
        "alvaro_de_luna",
        "gomez_de_sotomayor"
      ],
      "factions_affected": [
        "royal_court"
      ],
      "location": "Toledo",
      "tags": [
        "diplomatic",
        "constantinople",
        "byzantine",
        "letter",
        "roll",
        "naval"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "I think we should now roll for what the situation is in Constantinople. Be historic and realistic. Draft a d100 table."
        },
        {
          "role": "gm",
          "text": "A wise approach. Let me research the actual situation in Constantinople in 1433 to ground this properly.\n\nWeb Search: Constantinople 1433 Ottoman siege Byzantine Empire John VIII Palaiologos\n\nFall of Constantinople - Wikipedia wikipedia.org\n\nThe Fall of Constantinople | Western Civilization lumenlearning.com\n\nFall of Constantinople shadowsofconstantinople.com\n\nJohn VIII Palaiologos - Wikipedia wikipedia.org\n\nThe Sieges of Constantinople – The Byzantium Blogger byzantium-blogger.blog\n\nJohn VIII Palaiologos grokipedia.com\n\nThe Fall of Constantinople: When the Byzantine Empire Fell | History vocal.media\n\nJohn VIII Palaiologos Biography | Pantheon pantheon.world\n\nConstantinople, 1453: the Final Fall of the Roman Empire - Historic Mysteries historicmysteries.com\n\nConstantine XI Palaiologos: The Last Byzantine Emperor and His Legacy - Ancient History Sites ancient-history-sites.com\n\nWeb Search: Ottoman Empire 1433 Murad II Byzantine relations peace treaty tribute\n\nMurad II | Ottoman Sultan & Conqueror of Constantinople | Britannica britannica.com\n\nBYZANTINE-OTTOMAN RELATIONS IN EARLY 1420'S dergipark.org.tr\n\nByzantine–Ottoman wars - Wikipedia wikipedia.org\n\nBYZANTINE-OTTOMAN RELATIONS IN EARLY 1420'S uludag.edu.tr\n\n(PDF) Byzantine-Ottoman Relations in Early 1420’s academia.edu\n\nMeet Mehmed II, The Ottoman Ruler Who Conquered Constantinople And The Last Vestige Of The Roman Empire allthatsinteresting.com\n\nOttoman Empire - Restoration, 1402-81, Expansion | Britannica britannica.com\n\nConquest of Constantinople - Warfare History Network warfarehistorynetwork.com\n\nTreaty of Gallipoli - Wikipedia wikipedia.org\n\nPeace of Szeged - Wikipedia wikipedia.org\n\nWeb Search: Constantinople 1430s economy walls Theodosian military strength population\n\nImposing Walls Defended Constantinople For Ten Centuries - GreekReporter.com greekreporter.com\n\nWalls of Constantinople - Wikipedia wikipedia.org\n\nProtection · Theodosian Walls: Mirror to Rise and Fall of Constantinople · The Urban Imagination harvard.edu\n\nThe Theodosian Walls shadowsofconstantinople.com\n\nConstantinople, Theodosian Walls - Livius livius.org\n\nTheodosian Walls - World History Encyclopedia worldhistory.org\n\nFall of Constantinople - Wikipedia wikipedia.org\n\nTheodosian Land Walls of Constantinople | Turkish Archaeological News turkisharchaeonews.net\n\nTheodosian Walls thebyzantinelegacy.com\n\nAncient History: Walls of Constantinople historynet.com\n\nThe Treaty of 1424 made Byzantium an Ottoman vassal, paying 300,000 silver coins annually in tribute\n\nThe 1422 siege ended without conquest, but Constantinople is effectively surrounded\n\nThe city's population has drastically declined (Black Death killed half between 1346-1349)\n\nBy the 1430s, Constantinople consists of \"walled villages separated by vast fields\"\n\nThe Theodosian Walls remain formidable but require constant maintenance\n\nThe empire controls only Constantinople itself, some Aegean islands, and the Morea (Peloponnese)\n\nJohn VIII is actively seeking Western aid and considering Church union with Rome\n\nThe Ottomans are not currently besieging the city but control all surrounding territory\n\nMurad II is dealing with internal challenges (Karamanid Turks, Balkan resistance)\n\nWhat Sotomayor's 300 knights would find:\n\nThis is a CHAOS ROLL — what external situation exists beyond Juan's control?\n\nD100 Table: Constantinople's Condition (October 1433)\n\nRoll\nSituation\n01-10\nCrisis: Ottoman Pressure Intensifying\nMurad II has increased military presence around Constantinople. Raiding parties probe defenses. Tribute demands have increased. Some wall sections are in critical condition. The Greeks are desperate and grateful for Castilian arrival, but 300 knights are a drop in the bucket. The Emperor's letter is essentially a plea for immediate, massive intervention. Sotomayor's assessment: \"The city can hold perhaps two years without major reinforcement. The walls require 100,000+ florins in repairs. We need 2,000+ permanent defenders minimum.\"\n11-25\nDire: Slow Decay\nNo active siege, but the city is dying slowly. Population has fallen below 50,000. Entire districts stand empty. The walls show decades of deferred maintenance. Ottoman control of surrounding territory means food prices are extortionate. The Byzantine court is divided between those favoring Church union with Rome and those preferring Ottoman vassalage. Castilian knights received gratefully but with skepticism—they've seen Western promises before. The Emperor's letter requests sustained commitment, not just temporary reinforcement.\n26-45\nPrecarious: Stable But Vulnerable\nCurrent Ottoman-Byzantine relations are tense but not actively hostile. Tribute is paid grudgingly. The walls are in acceptable condition in most sections but need significant work in others. The Castilian vanguard has been well-received—proof that Western aid is real, not just promises. Sotomayor reports that 1,000 knights could meaningfully strengthen defenses, but long-term survival requires either massive Western intervention or fundamental change in Ottoman power. The Emperor proposes formal alliance and coordination of crusading efforts.\n27-60\nHopeful: A Window of Opportunity\nMurad II is distracted by Karamanid challenges in Anatolia and Serbian/Hungarian resistance in the Balkans. Ottoman pressure on Constantinople has actually decreased since 1424. The walls are being repaired with the 60,000 florins Sotomayor brought. Morale has improved dramatically—Castilian knights are seen as harbingers of real Western commitment. The Emperor proposes ambitious coordination: Castilian naval power in the eastern Mediterranean, joint operations against Ottoman positions, possible recovery of lost territories. His letter is optimistic but realistic about the fragility of this window.\n61-75\nEncouraging: Byzantine Resurgence Possible\nThe Morea (under Constantine Palaiologos, the Emperor's brother) has been successfully pushing back against Ottoman and Latin forces. Serbian and Hungarian resistance is tying down Ottoman armies in the Balkans. There's genuine possibility of a coordinated Christian counter-offensive if Western powers commit. The Emperor proposes something unprecedented: a formal military alliance with specific commitments, joint command structures, and coordinated timing. He sees Castile's completed Reconquista as proof that sustained Christian effort can defeat Islamic powers.\n76-90\nUnexpected: A Byzantine Proposal\nBeyond military alliance, the Emperor makes a dynastic proposal. With Juan widowed and needing to remarry, John VIII suggests a Byzantine princess—cementing Castile's commitment through blood ties. This would bind Castilian interests to Constantinople's survival for generations. The military situation is precarious but stable; the proposal is strategic positioning for the long-term. Sotomayor notes the Greeks are \"thinking in centuries, not campaigns.\"\n91-100\nRemarkable: Ottoman Internal Crisis\nNews has reached Constantinople that Murad II faces serious internal challenges. A pretender (perhaps one of the Ottoman princes the Byzantines have sheltered) has raised rebellion in Anatolia. Karamanid forces are exploiting Ottoman distraction. The Sultan has withdrawn forces from the Balkans to deal with internal threats. For the first time in decades, Constantinople is not immediately threatened. The Emperor sees this as a once-in-generation opportunity: if Christian powers coordinate NOW, they might permanently weaken Ottoman power. His letter is urgent—this window may close within months.\n\nProbability Assessment\n\nGiven historical context:\n\n1433 was relatively quiet for Constantinople (no active siege)\n\nMurad II was consolidating power, not aggressively expanding\n\nThe Treaty of 1424 created uneasy peace\n\nReal crisis came later (1440s-1450s)\n\nThe situation should lean toward \"precarious but stable\" with possibility of either direction. No extreme crisis (that would be historically inaccurate for 1433), but genuine vulnerability.\n\nReady to roll, Sicco."
        },
        {
          "role": "player",
          "text": "rolled 17"
        },
        {
          "role": "gm",
          "text": "The dice speak grimly.\n\nJuan unfolded the Byzantine letter, the purple wax crumbling as he broke the imperial seal. The Greek script was accompanied by a Latin translation—someone in the Emperor's chancery understood their audience.\n\nAlfonso watched his face as he read. Álvaro moved closer, reading over Juan's shoulder.\n\nFROM JOHN VIII PALAIOLOGOS, EMPEROR OF THE ROMANS, TO JUAN II, KING OF CASTILE AND LEÓN, CONQUEROR OF GRANADA, DEFENDER OF THE FAITH\n\nWritten at Constantinople, the twenty-ninth day of September, in the year of Our Lord 1433\n\nRoyal Brother,\n\nYour knights have arrived. Three hundred men bearing the cross of Castile now walk the walls that Constantine the Great built eleven centuries ago. They are the first Western soldiers to come not as conquerors or merchants, but as brothers in Christ. For this, you have my eternal gratitude and that of all Romans.\n\nBut I must speak truth to you, as one king to another, for pretty words serve neither of us.\n\nThe city your knights have come to defend is dying.\n\nNot from siege—the Turk does not waste men against our walls when time does his work for him. We die from a slower poison. The great plague took half our people eighty years ago, and we have never recovered. Where once a million souls filled these streets, now perhaps forty thousand remain. Entire districts stand empty, their houses crumbling, their churches silent. Between the inhabited quarters lie fields—actual fields, within the walls of the Queen of Cities, where farmers grow vegetables among the ruins of palaces.\n\nYour Master of Alcántara has seen this. He has walked the Theodosian Walls and counted their defenders. He has seen the sections where mortar crumbles and stone has fallen. He has watched my soldiers—old men and boys, many of them—try to patrol fortifications that once required ten thousand trained troops to man properly.\n\nThe sixty thousand florins you sent are being spent wisely. The most critical sections are being repaired. But the walls stretch for seven kilometers on the landward side alone, and decades of poverty have left their mark everywhere. Your Master estimates one hundred thousand florins more would be needed to restore them properly. Perhaps more.\n\nThe Turk knows all this. He does not need spies—he can see our weakness from across the Bosphorus. Sultan Murad contents himself with tribute and patience. Each year we pay him three hundred thousand silver coins we can barely afford. Each year more of my people slip away to seek better lives elsewhere. Each year the empire shrinks a little more.\n\nYour three hundred knights have lifted our spirits beyond measure. They are proof that the West has not forgotten us. But I must be honest with you, King Juan: three hundred knights cannot save Constantinople. Nor can one thousand. Nor can the seven hundred more you have promised.\n\nIf Constantinople is to survive another generation, we need not reinforcement but transformation. We need the Christian powers to recognize that our fall would be their disaster—that if the Turk takes this city, he gains a base from which to threaten all Christendom. We need sustained commitment measured in decades, not campaigns.\n\nI am told you completed the Reconquista in three years. Seven hundred and ten years of struggle, ended by one king's determination. I am told you conquered what your ancestors could not because you understood that half-measures fail and that God favors those who commit fully.\n\nI write to ask: Will you commit fully to us?\n\nNot just knights, though we need them desperately. Not just gold, though our walls cry out for repair. I ask for alliance—true alliance, sealed by treaty and oath, binding your kingdom to ours until Constantinople is safe or fallen.\n\nI ask for your presence. Come to Constantinople, King Juan. See with your own eyes what your knights defend. Walk our walls. Pray in the Hagia Sophia, the greatest church in Christendom. Let the Sultan see that Castile's king himself stands with the Romans.\n\nAnd let us speak, king to king, of what might yet be possible. The Turk is not invincible. He has enemies—the Karamanids in Anatolia, the Hungarians and Serbians in the Balkans. If Christian powers coordinated their efforts rather than each fighting alone...\n\nBut these are dreams for our meeting. For now, I ask only this: Do not abandon us. Your knights have given my people hope for the first time in years. If Castile withdraws, that hope dies, and with it perhaps the will to resist at all.\n\nI entrust this letter to your King of Aragon, who has proven himself a friend to Christian causes. May God guide your deliberations.\n\nYour brother in Christ,\n\nJohn VIII Palaiologos\nEmperor of the Romans\n\nΒασιλεύς καὶ Αὐτοκράτωρ Ῥωμαίων\n\nJuan set the letter down slowly. The candles flickered in the evening breeze from the open window. Somewhere in the Alcázar, a servant was singing.\n\nAlfonso broke the silence. \"Sotomayor's report is attached. Twelve pages. The Emperor does not exaggerate.\"\n\n\"Forty thousand people,\" Juan said quietly. \"Toledo has more than that.\"\n\n\"The walls can hold,\" Alfonso said. \"Sotomayor is clear on that. The Theodosian fortifications are the greatest in the world—even undermanned, even with sections in poor repair. What they cannot do is hold forever without relief.\"\n\nÁlvaro, who had been reading over Juan's shoulder, straightened. \"Your Majesty, this is... this is not a military problem. A thousand knights, ten thousand knights—they cannot rebuild a dying city. This is asking Castile to prop up an empire.\"\n\n\"Yes,\" Juan said. He looked at the letter again, at the Emperor's signature. The last true Roman Emperor, ruling over empty streets and crumbling palaces.\n\nAlfonso leaned forward. \"I have been thinking about this since the letter arrived. About what Castile could actually do that would matter. Not just knights—anyone can send knights. Something that changes the calculation.\"\n\n\"And?\"\n\n\"Naval power.\" Alfonso's eyes were intent. \"The Turk has armies, but his fleet is nothing compared to what it could be. Constantinople's sea walls are its strongest defense—the Theodosian walls face only the landward approach. If Castile's new fleet, combined with Aragonese galleys and Venetian support, controlled the approaches to the Bosphorus...\"\n\nHe let the thought hang.\n\nThe night deepened. Fernando's baptism was five days away. A dying empire had written asking for salvation. And Juan sat with the letter in his hands, weighing the weight of crowns.\n\n[STOP]\n\nAlfonso has offered a strategic concept—naval power as the key to Constantinople's long-term survival. Álvaro clearly has reservations about the scope of commitment being requested. The Emperor's letter asks for nothing less than sustained, generational alliance.\n\nWhat does Juan say or do?"
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_1433_00428",
      "book": 2,
      "chapter": "2.12",
      "date": "1433-10-10",
      "end_date": "1433-10-11",
      "type": "council",
      "summary": "Juan commits major resources to support Alfonso's Naples campaign: 40,000 florins from the treasury (to hire condottiere Francesco Sforza), diplomatic pressure on Genoa and Milan to discourage interference, and the Castilian fleet of four armed carracks to anchor at Valencia as a show of force. Alfonso departs promising Naples by spring. Alvaro raises concerns about spending rate, noting the treasury will hold approximately 175,000 florins after disbursements. Juan plans his Constantinople visit for spring 1434 with the remaining 700 knights. The marriage delegation's progress from Ferrara is briefly discussed.",
      "characters": [
        "juan_ii",
        "alfonso_v",
        "alvaro_de_luna"
      ],
      "factions_affected": [
        "royal_court"
      ],
      "location": "Toledo",
      "tags": [
        "council",
        "naples",
        "treasury",
        "diplomacy",
        "fleet",
        "valencia",
        "genoa",
        "milan"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "Interesting. I will visit soon. And take stock for ourselves.\n\n\nHow is the campain going in Naples? Anything I can do to help? The sooner this conflict is won and won strongly by you, the better."
        },
        {
          "role": "gm",
          "text": "Alfonso's expression shifted—a flicker of genuine gratitude beneath the diplomatic mask.\n\n\"The campaign.\" He exhaled slowly, reaching for his wine cup. \"Better than it was. Worse than I'd hoped.\"\n\nHe took a long drink before continuing.\n\n\"Your advocacy in Rome changed everything. When Eugenius declared for my claim over René's, half the Neapolitan nobility suddenly remembered they'd always supported Aragon.\" A thin smile. \"Remarkable how papal favor clarifies men's loyalties.\"\n\nAlfonso set down the cup and began ticking off points on his fingers.\n\n\"René of Anjou is furious, as I said. He's writing to every court in Europe claiming the Pope overstepped his authority. The French are making noise about supporting him, but Charles VII has his own problems—the English still hold half his kingdom, and he's more concerned with that than with his cousin's Italian ambitions.\"\n\n\"So René lacks the strength to contest you directly?\"\n\n\"For now. He has partisans in Naples itself—the Angevin faction isn't dead, just cowed. And Genoa...\" Alfonso's jaw tightened. \"Genoa remains the problem. They see Aragonese control of Naples as a threat to their Mediterranean trade. Filippo Maria Visconti in Milan plays both sides, promising support to whoever seems stronger that week.\"\n\nÁlvaro, who had been listening quietly, spoke up. \"What do you need, Your Majesty? Specifically?\"\n\nAlfonso turned to him, then back to Juan. \"Three things would end this quickly.\"\n\nHe held up one finger. \"Gold. Always gold. Condottieri don't fight for promises, and I'm maintaining an army in Sicily while preparing the invasion fleet. Forty thousand florins would let me hire Francesco Sforza away from whoever's currently paying him. Sforza alone is worth five thousand men.\"\n\nA second finger. \"Ships. Not for transport—I have enough galleys for that. Combat vessels to counter Genoa if they intervene. Your new fleet, Juan... four armed carracks with modern cannon would make the Genoese think twice about challenging me at sea.\"\n\nA third finger. \"Diplomatic pressure. If Castile made clear to Genoa and Milan that Aragonese success in Naples serves Iberian interests—that interference would be remembered—it might give Visconti pause. He's a schemer, not a warrior. He won't risk a wider war if he thinks the costs outweigh the gains.\"\n\nAlfonso lowered his hand. \"With those three things? I take Naples by spring. Without them?\" He shrugged. \"Perhaps a year. Perhaps two. Perhaps René finds enough French gold to make a real fight of it.\"\n\nHe looked at Juan directly. \"You spoke of winning strongly. Strong victory requires speed. The longer this drags on, the more opportunities my enemies have to coordinate against me. And the longer I'm tied down in Italy...\"\n\n\"The longer Constantinople waits,\" Juan finished.\n\n\"Yes.\" Alfonso's voice was quiet. \"I read the Emperor's letter before I brought it to you. Forty thousand people in a city built for a million. I've seen dying cities, Juan. I watched Naples tear itself apart during Joanna's madness. Constantinople is worse—it's not even fighting anymore. It's just... fading.\"\n\nHe leaned back in his chair. \"If you want me at your side when you sail to the Bosphorus, help me finish Naples first. Then Aragon's fleet joins Castile's. Then we go east together, as we discussed at the Te Deum. Three kingdoms united.\"\n\nThe candles had burned low. Through the window, Juan could see stars over Toledo—the same stars that shone over Constantinople's empty districts and Naples' contested shores.\n\n[STOP]\n\nAlfonso has laid out his needs clearly:\n\n40,000 florins (to hire Sforza)\n\nNaval support (Castile's new carracks)\n\nDiplomatic pressure on Genoa and Milan\n\nThe treasury currently holds approximately 275,000 florins (300,000 minus the 25,000 for La Dote de la Reina Isabel). The fleet includes 4 armed carracks (one the royal flagship Princess Catalina) that should be completing sea trials around now.\n\nWhat does Juan wish to offer or discuss?"
        },
        {
          "role": "player",
          "text": "Done. Alvaro, prepare the treasury to dispense these funds and for a diplomatic message towards Genoa and Milan. The ships are barely built and will be used by me to travel to Constantinople. But I can anchor them in ports on full display so Genoa knows that they are in operation."
        },
        {
          "role": "gm",
          "text": "Alfonso rose from his chair and clasped Juan's hand firmly—not the formal gesture of kings, but the grip of a brother-in-law who had just received more than he'd dared ask for.\n\n\"Cuñado,\" he said, voice rough with emotion. \"You do not haggle. You do not hesitate. I will not forget this.\"\n\nÁlvaro was already making notes, his quill scratching against parchment. \"Forty thousand florins to be drawn from the treasury. I'll have the letters of credit prepared for Your Majesty's signature tomorrow. The funds can travel with King Alfonso when he departs, or be sent directly to his bankers in Barcelona—whichever is more secure.\"\n\n\"Barcelona,\" Alfonso said. \"Genoese pirates have been known to intercept shipments in the Tyrrhenian Sea. Better the gold travels overland through Aragon.\"\n\nÁlvaro nodded, still writing. \"And the diplomatic messages. To Genoa—what tone does Your Majesty wish to strike?\"\n\nJuan considered. \"Firm but not threatening. Make clear that Castile views the resolution of the Naples question as vital to Iberian interests. That we have committed substantial resources to King Alfonso's success. That we would view any interference in this matter as an unfriendly act toward the Crown of Castile.\"\n\n\"And Milan?\"\n\n\"Similar, but... softer. Visconti is a schemer, as Alfonso says. Give him room to scheme his way toward neutrality. Remind him that Castile has no quarrel with Milan, that we respect his position in Lombardy, that we hope he will recognize the wisdom of allowing the Naples question to resolve itself without Milanese entanglement.\"\n\nAlfonso smiled thinly. \"You understand Visconti well for someone who's never met him.\"\n\n\"I've met men like him. They respond to two things—profit and fear. Show them that opposing you offers neither, and they find reasons to stay home.\"\n\nÁlvaro looked up from his notes. \"The ships, Your Majesty. You mentioned anchoring them in ports on display. Which ports? And for how long?\"\n\nJuan turned to Alfonso. \"Where would Genoese eyes see them most clearly?\"\n\n\"Valencia,\" Alfonso said without hesitation. \"It's Aragonese, so they'd have safe harbor. But every Genoese merchant ship passes through those waters. Word would reach Genoa within weeks that Castile's new carracks—armed with cannon, flying royal banners—were sitting in a friendly port within striking distance of the Italian coast.\"\n\n\"Then Valencia. After the baptism, the Princess Catalina and her sister ships sail for Valencia. They anchor there through the winter while I prepare the Constantinople expedition. Genoa sees them. Genoa wonders what they're for. Genoa decides that perhaps this is not the year to challenge Aragon at sea.\"\n\nAlfonso laughed—a genuine sound, surprised out of him. \"You're sending your entire new fleet to intimidate Genoa without firing a shot, and you call it preparation for Constantinople.\"\n\n\"It is preparation. The ships need shakedown voyages before crossing the Mediterranean. The crews need experience. And if their presence happens to make your campaign easier...\" Juan shrugged. \"God works through practical means.\"\n\nÁlvaro finished his notes and looked up. \"I'll have drafts of the diplomatic messages ready for Your Majesty's review tomorrow morning. The treasury disbursement can be authorized immediately after the baptism—I would not recommend moving large sums during the celebrations, too many eyes.\"\n\n\"Agreed,\" Juan said.\n\nAlfonso moved toward the door, then paused. \"One more thing. The Emperor's letter—his request that you come in person. You said you would visit soon. How soon?\"\n\n\"Spring. As I promised the Military Order Masters. After the winter storms pass, after your Naples situation is resolved or nearly so, after I've had time to arrange proper regency for a months-long absence.\"\n\n\"And the remaining seven hundred knights?\"\n\n\"They sail with me. Sotomayor's three hundred hold the walls. I bring the rest, assess the situation with my own eyes, and decide what commitment makes sense based on what I see—not what others tell me.\"\n\nAlfonso nodded slowly. \"When you walk the walls of Constantinople, remember that the Theodosian fortifications stood for a thousand years. They can stand longer—if there are men willing to stand with them.\" He opened the door. \"Good night, Juan. I'll see you at the baptism.\"\n\nThe door closed behind him.\n\nÁlvaro remained, organizing his notes. The candles guttered in their holders.\n\n\"Forty thousand florins,\" he said quietly. \"Plus sixty thousand already sent to Constantinople. Plus the fleet construction costs. Plus La Dote de la Reina Isabel.\" He looked up. \"Your Majesty is spending treasure at a rate that cannot continue indefinitely.\"\n\n\"I know.\"\n\n\"The treasury will hold approximately two hundred thirty-five thousand florins after these disbursements. That sounds substantial, but crown expenses alone consume nearly one hundred thousand annually. If there are no new revenues—\"\n\n\"There will be new revenues. Granada's taxes are only beginning to flow. The Strait of Gibraltar tolls have not yet been implemented. The wool trade continues to grow.\"\n\nÁlvaro set down his quill. \"I do not question Your Majesty's judgment. I merely observe that Constantinople is a pit into which gold disappears. The Emperor speaks of sustained commitment measured in decades. Castile cannot sustain such commitment alone.\"\n\n\"No,\" Juan agreed. \"Which is why Alfonso must win Naples quickly. Which is why the Pope must pressure other Christian kingdoms to contribute. Which is why I must go there myself—to see what is truly needed, and to make the case to all of Christendom that Constantinople's fall would be disaster for us all.\"\n\nA long silence.\n\n\"There is also the matter of Your Majesty's remarriage,\" Álvaro said carefully. \"The delegation to Ferrara should reach Rome soon. If Lucia d'Este is amenable, negotiations could conclude by Christmas. A Ferrarese bride brings connections to the Italian states—potentially useful for both the Naples situation and the Constantinople question.\"\n\nJuan nodded slowly. Isabel had been dead barely two months. The thought of another woman in her chambers, her place at table, her side of the bed...\n\nBut kings did not have the luxury of grief.\n\n\"We'll discuss the marriage after the baptism,\" he said. \"One thing at a time. First, we christen my son.\"\n\n[STOP]\n\nThe pieces are in motion:\n\n40,000 florins committed to Alfonso for Naples\n\nDiplomatic pressure on Genoa and Milan\n\nFleet to anchor at Valencia as show of force\n\nConstantinople visit planned for spring 1434\n\nThe baptism of Prince Fernando is in five days. Is there anything else Juan wishes to address before the ceremony, or shall we proceed to October 15th?"
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_1433_00429",
      "book": 2,
      "chapter": "2.12",
      "date": "1433-10-11",
      "end_date": "1433-10-14",
      "type": "personal",
      "summary": "Juan summons Queen Isabel's four Portuguese ladies-in-waiting: Dona Beatriz de Meneses (32, chief lady), Dona Leonor de Almeida (24), Dona Ines de Castro (26), and Dona Filipa de Vilhena (20). All are uncertain of their place in court after the Queen's death. Juan offers each continued welcome in Castile or blessing to return to Portugal. He then meets each privately with Alvaro, offering 40 florins each toward their dowries, held in the royal treasury until marriage or departure. All four choose to remain in Castile. Total disbursement: 160 florins.",
      "characters": [
        "juan_ii",
        "alvaro_de_luna",
        "dona_beatriz"
      ],
      "factions_affected": [],
      "location": "Toledo",
      "tags": [
        "personal",
        "portuguese_ladies",
        "dowry",
        "charity",
        "loyalty"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "Remember to NEVER generate dialogue or action for Juan.\n\n\nI summon the ladies in waiting who have travelled with Isabel from Portugal. Beatriz and the other three. I ask them how they are feeling and what their plans are."
        },
        {
          "role": "gm",
          "text": "The four Portuguese ladies arrived in Juan's private study the following morning, summoned from their quarters in the Alcázar's east wing. They entered together, as they had done everything together since arriving in Castile three years ago—a small island of Portuguese voices in a Castilian sea.\n\nDoña Beatriz de Meneses entered first, the eldest at thirty-two, her face showing the strain of the past months. She had been Isabel's chief lady-in-waiting, her confidante, the one who had held Isabel's hand during Fernando's birth and closed her eyes afterward. Behind her came the others: Doña Inês de Castro, twenty-six, quiet and observant; Doña Leonor de Almeida, twenty-four, who had been closest to Isabel in age and temperament; and Doña Filipa de Vilhena, the youngest at twenty, who still looked lost without the queen she had served since childhood.\n\nAll four wore black. All four curtsied deeply.\n\nÁlvaro withdrew to give the king privacy, closing the door softly behind him.\n\nDoña Beatriz spoke for the group, as she always had.\n\n\"Your Majesty honors us with this summons.\" Her Castilian had improved over three years but still carried the soft edges of Portuguese. \"We are... we are managing, Your Majesty. As one manages.\"\n\nShe glanced at the others, seemed to gather herself.\n\n\"The truth is, Your Majesty, we have been uncertain of our position since... since the Queen's passing. Queen Leonor asked me to remain for the children—and I will, for as long as Your Majesty permits. Catalina knows my face. She comes to me when she is frightened. And Fernando...\" Her voice caught slightly. \"Fernando will need to know who his mother was. I can tell him. I knew her since she was twelve years old.\"\n\nDoña Leonor de Almeida spoke up, her voice smaller. \"I have written to my father in Lisbon. He has offered to arrange a marriage for me, if... if Your Majesty no longer requires my service.\" She looked down. \"I do not wish to leave. But I do not know if there is a place for us here anymore. Without the Queen...\"\n\nShe trailed off.\n\nDoña Inês, the quiet one, added softly: \"We are Portuguese ladies in a Castilian court, Your Majesty. We served your Queen. But you will marry again—you must, we understand this—and your new Queen will bring her own ladies. Her own language. Her own ways.\"\n\nDoña Filipa, the youngest, said nothing. Her eyes were red-rimmed. She had been weeping again—she had wept every day since August.\n\nDoña Beatriz straightened, resuming her role as spokeswoman. \"We do not ask for charity, Your Majesty. We ask only to know your will. Should we return to Portugal? Should we remain until your remarriage and then withdraw? Should we—\" She hesitated. \"Queen Leonor suggested that some of us might remain permanently, to ensure Catalina and Fernando know their Portuguese heritage. But we did not know if this was... if Your Majesty would wish...\"\n\nShe fell silent, waiting.\n\nFour women who had crossed a kingdom to serve a queen who was now dead. Four women caught between two countries, uncertain if either still wanted them.\n\n[STOP]\n\nThe ladies await Juan's response. Doña Beatriz has offered to stay for the children. Doña Leonor has a potential marriage waiting in Portugal. Doña Inês and Doña Filipa have expressed no specific plans. All four are uncertain of their place in a court that will soon have a new queen."
        },
        {
          "role": "player",
          "text": "Dona Beatriz, you have my gratitude and I would welcome you should you want to stay. I know Catalina knows and trusts you and that is worth a lot to me. I like to have someone Portugese near my children.\n\n\nI do not hold you here should you not wish to be here. If you want to return to Portugal, do so with my blessing and thanks. You have done your duty honourably. You will always be welcome at my court. Think about it. You can stay here, even marry should you wish it."
        },
        {
          "role": "gm",
          "text": "Doña Beatriz's composure wavered for just a moment—a slight trembling of her lip, quickly controlled. She curtsied again, deeper this time.\n\n\"Your Majesty is gracious beyond measure.\" She straightened, and there was something like relief in her eyes. \"I will stay. Not from duty—duty ended when my Queen drew her last breath. I stay because I loved her, and because her children deserve to know that love did not die with her.\"\n\nShe paused, considering her next words carefully. \"As for marriage... I am thirty-two, Your Majesty. I was betrothed once, in Portugal, but he died of fever before the wedding. I had made my peace with serving Isabel for the rest of my days.\" A small, sad smile. \"God had other plans. But I am not opposed to the idea, should... should such an opportunity arise. I had simply stopped thinking of it as possible.\"\n\nThe other three exchanged glances. Doña Leonor spoke next, her voice steadier now.\n\n\"Your Majesty, if I may... my father's offer of a marriage in Portugal is not urgent. He wrote out of concern for my future, not because a match is already arranged. If there is a place for me here—truly a place, not merely charity—I would rather stay. Isabel was...\" She swallowed. \"Isabel was my friend. Not just my queen. The thought of returning to Lisbon, where no one knew her as I did, where I cannot visit her tomb or speak her name to people who remember her smile...\"\n\nShe stopped, composing herself. \"I ask only that Your Majesty be honest with us. If your new Queen will not want Portuguese ladies in her household, tell us now. We would rather know than hope falsely.\"\n\nDoña Inês nodded quietly in agreement but did not speak.\n\nDoña Filipa, the youngest, finally found her voice. It came out barely above a whisper.\n\n\"I don't know what to do, Your Majesty.\" Tears spilled down her cheeks—she made no move to wipe them. \"I came to Castile when I was seventeen. I have no marriage prospects in Portugal—my family is minor nobility, we have little dowry to offer. Isabel said she would find me a good Castilian husband someday. She said she would take care of me.\"\n\nHer voice broke. \"And now she's gone and I don't know where I belong anymore.\"\n\nDoña Beatriz put a hand on the young woman's shoulder, steadying her.\n\n[STOP]\n\nThree of the four ladies have indicated a preference to stay if genuinely wanted. Doña Filipa in particular seems adrift without prospects. All are waiting to hear whether Juan's offer of continued welcome—and the possibility of Castilian marriages—extends to them as well."
        },
        {
          "role": "player",
          "text": "I take the ladies apart seperately and offer them each 40 florins towards their dowry. I do this together with Alvaro and offer to hold the funds until they have found a match. So it cannot get stolen. But it is theirs. They can also take it and leave and go to Portugal."
        },
        {
          "role": "gm",
          "text": "Over the following days, Juan met with each lady separately in his study, Álvaro present as witness and keeper of accounts.\n\nDoña Leonor de Almeida received the news with wide eyes. Forty florins was more than her family could have scraped together for her dowry in Portugal—enough to make her attractive to minor Castilian nobility, perhaps even a wealthy merchant family seeking to elevate their standing.\n\n\"Your Majesty, I...\" She pressed her hand to her heart. \"This is too generous. I served my Queen, nothing more. I did my duty.\"\n\nÁlvaro explained the arrangement in his measured tone: the funds would be held in the royal treasury, recorded under her name, released upon her marriage or upon her departure for Portugal should she choose that path. Safe from theft, safe from misfortune, hers by right whenever she claimed them.\n\nShe curtsied so deeply she nearly lost her balance. \"I will stay, Your Majesty. And I will find a good Castilian husband and raise Castilian children who will know that their mother served the greatest queen this kingdom ever had.\"\n\nDoña Inês de Castro, the quiet one, listened to the offer in silence. When Álvaro finished explaining, she simply stared at the floor for a long moment.\n\n\"My father lost most of our lands to debt,\" she finally said, her voice soft. \"I was sent to serve Isabel because it was the only future my family could afford to give me. I expected to serve until I was too old to be useful, and then...\" She shrugged. \"I did not expect anything.\"\n\nShe looked up at Juan, her eyes glistening but her composure intact. \"Forty florins is more than my family's remaining estate is worth, Your Majesty. You have given me a future I did not believe I would have.\"\n\nShe curtsied with quiet dignity. \"I will stay. And I will pray for Your Majesty's happiness every day of my life.\"\n\nDoña Filipa de Vilhena, the youngest, wept through the entire meeting. Not from sorrow this time—from overwhelming emotion she could not contain.\n\n\"Forty florins,\" she kept repeating. \"Forty florins. Your Majesty, my family could not have given me ten. My mother said I should pray for a miracle. She said perhaps the Queen would find me a clerk or a steward, someone who did not need much dowry.\"\n\nShe wiped her face with her sleeve, abandoning all pretense of courtly composure. \"With forty florins I could marry a knight, Your Majesty. A real knight. Isabel always said—\" Her voice caught. \"She said I deserved someone who would make me laugh. She said I was too young to be so serious all the time.\"\n\nÁlvaro, showing uncharacteristic gentleness, assured her the funds were secure and would wait for her however long it took to find the right match.\n\n\"I'll stay,\" Filipa said, still crying. \"I'll stay forever if Your Majesty permits. This is my home now. Castile is my home.\"\n\nDoña Beatriz de Meneses was last. The eldest, the most composed, she listened to the offer with the stillness of someone who had learned long ago to guard her reactions.\n\nWhen Álvaro finished, she was quiet for a moment.\n\n\"Your Majesty,\" she said slowly, \"I am thirty-two years old. In Portugal, I would be considered well past marriageable age. Here...\" She allowed herself a small smile. \"Perhaps Castilian men are less particular.\"\n\nThen, more seriously: \"I did not expect this. I expected to serve your children until they no longer needed me, and then to retire to some quiet corner of the palace or perhaps a convent. This gift...\" She paused, choosing her words. \"This gift tells me that Your Majesty sees us as more than servants. That you see us as women Isabel loved, and therefore worthy of love ourselves.\"\n\nShe curtsied, slower and more deliberate than the others. \"I accept, Your Majesty. And I will stay. Not for the dowry—though I am grateful beyond words—but because Catalina still calls for her mother in the night, and I am the closest thing to Isabel's voice she has left.\"\n\nÁlvaro made careful note of all four disbursements in the treasury ledger: one hundred sixty florins total, held in trust, marked for dowries. A small sum against the kingdom's vast accounts. A fortune to four women who had expected nothing.\n\nWhen the last meeting concluded, Álvaro permitted himself a rare observation. \"That was well done, Your Majesty. The court will notice. Portuguese ladies treated with honor despite their queen's death—it speaks well of Castile. And of you.\"\n\nHe paused. \"It will also not go unnoticed in Lisbon. King João's health fails, but Queen Leonor and Prince Duarte will hear of this. Small kindnesses between kingdoms matter more than treaties sometimes.\"\n\n[STOP]\n\nAll four ladies have accepted the dowry offer and chosen to remain in Castile. The treasury disbursement of 160 florins has been recorded. The Portuguese ladies are now provided for, with marriage prospects significantly improved.\n\nIs there anything else before the baptism, or shall we proceed to October 15th?"
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_1433_00430",
      "book": 2,
      "chapter": "2.12",
      "date": "1433-10-12",
      "end_date": null,
      "type": "diplomacy",
      "summary": "A courier arrives from Don Inigo Lopez de Mendoza bearing news that the marriage delegation to Ferrara has succeeded beyond all expectations. Roll 93 (Exceptional Success): Lucia d'Este has not only accepted the match but insists on meeting Juan personally before the formal betrothal. Her letter reveals a sharp-tongued, intelligent woman who values sincerity over protocol. She is traveling to Castile with her household and should arrive by early November. Marquess Niccolo of Ferrara waived the customary reverse-dowry. Lucia brings a modest dowry of 15,000 florins and six Italian ladies-in-waiting.",
      "characters": [
        "juan_ii",
        "alvaro_de_luna",
        "inigo_lopez_de_mendoza"
      ],
      "factions_affected": [],
      "location": "Toledo",
      "tags": [
        "diplomatic",
        "marriage",
        "ferrara",
        "lucia_deste",
        "roll",
        "betrothal"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "Great. Now lets roll if my marriage is accepted.\n\n\nDraft a d100 table to see if my delegation is successful in Italy."
        },
        {
          "role": "gm",
          "text": "I've already read the NPC guide earlier in this chapter. Let me search for the details about Lucia d'Este and the marriage delegation, then research the historical context to draft a realistic roll.\n\nWeb Search: Niccolò III d'Este Ferrara 1433 marriages daughters nieces politics\n\nNiccolò III d'Este - Wikipedia wikipedia.org\n\nNiccolò III d’Este – Marquis of Ferrara | Italy On This Day italyonthisday.com\n\nNiccolò III d'Este, Marquis of Ferrara | Military Wiki | Fandom fandom.com\n\nNiccolò III d'Este, Marquis of Ferrara - Alchetron, the free social encyclopedia alchetron.com\n\nNicolò III | lord of Ferrara | Britannica britannica.com\n\nErcole I d'Este grokipedia.com\n\nNiccolò III d'Este, Marquis of Ferrara en-academic.com\n\nNiccolò III d’Este, A Life of Power Strategy and Scandal - Condottieri di ventura condottieridiventura.it\n\nFerrara under Niccolò III d'Este (1393–1429) - Oxford Scholarship universitypressscholarship.com\n\nThe Este Family sgira.org\n\nNow I have excellent context on Niccolò III d'Este and the House of Este. Key points:\n\nNiccolò III is 50 years old in 1433, a shrewd political leader\n\nHe's notorious for his many affairs (\"800 lovers,\" children with at least 11 women)\n\nIn 1425, he executed his wife Parisina and illegitimate son Ugo for adultery\n\nCurrently married (since 1429) to Ricciarda of Saluzzo\n\nFerrara is a small but prestigious Italian state\n\nIn 1432, Ferrara brokered peace between Milan and Venice, boosting prestige\n\nFerrara will host the Council of Florence/Ferrara in 1438\n\nHe's prudent, seeks to avoid military entanglements, acts as peacemaker\n\nPope Eugenius IV has good relations with Ferrara\n\n\"Lucia d'Este\" is our fictional character - a niece of Niccolò (daughter of a deceased younger brother). Let me draft this roll properly.\n\nD100 Roll: Marriage Delegation to Ferrara\n\nThis is a PERSUASION ROLL — evaluating how well Juan's approach lands with the Este family.\n\nThe Approach\n\nDelegation:\n\nDon Íñigo López de Mendoza (head of House Mendoza, poet, diplomat) — excellent choice\n\nBishop of Burgos, Don Pablo de Santa María — ecclesiastical weight\n\n30 knights in Castilian livery — appropriate display of status\n\nSubstantial gifts for the Marquess, Lucia, and the court\n\nStrategy:\n\nSecure papal blessing first, then arrive with Eugenius IV's endorsement\n\nPersonal letter from Juan to Lucia — unconventional, direct, sincere\n\nJuan's Letter:\nThe letter is unusual for royal marriage negotiations — personal, warm, mentions his children, admits vulnerability (\"fighting for the kingdom of heaven... don't tell my confessor\"), promises accommodation for her Italian culture. It's charming but also potentially concerning (the \"glimpses of heaven\" language echoes Juan's messianic tendencies).\n\nSUCCESS FACTORS\n\nJuan's Prestige — The conqueror of Granada, completer of the Reconquista. His military reputation is at its peak. This is not some minor prince; this is the most celebrated Christian monarch of the moment.\n\nPapal Support — Pope Eugenius IV \"personally wishes to facilitate the match.\" The delegation arrives with papal endorsement. For a small Italian state navigating between Milan, Venice, and the Papacy, papal favor matters enormously.\n\nWealth and Power — Castile is newly wealthy from Granada conquest. Treasury is healthy. This is a major kingdom, not some impoverished backwater.\n\nExcellent Delegation — Don Íñigo López de Mendoza is a genuinely skilled diplomat and poet. The Bishop of Burgos adds ecclesiastical gravitas. This is a serious diplomatic effort.\n\nLucia's Age and Prospects — At 23, Lucia is old for an unmarried noblewoman. Becoming Queen of Castile would be an extraordinary elevation for a marquess's niece. This may be her best offer.\n\nStrategic Value — Alliance with Castile offers Ferrara a powerful distant ally with no territorial conflicts. Useful counterweight against Italian rivals.\n\nJuan's Personal Letter — Unconventional but potentially charming. Shows he sees Lucia as a person, not just a dynastic chess piece. May appeal to a \"politically astute\" and \"sharp-tongued\" woman.\n\nFAILURE FACTORS\n\nDistance — Castile is very far from Ferrara. Lucia would leave her family, culture, and language behind permanently. Italian courts are sophisticated; Castile may seem rustic by comparison.\n\nWidower with Children — Juan has two children by another woman. Lucia would be stepmother, not founder of a dynasty. Any sons she bears would be second in succession after Fernando.\n\nReputation Concerns — Whispers about Juan's \"glimpses of heaven\" and possible messianic thinking. The court's troubled reaction to his emotional speech after Isabel's death. Is Juan mentally stable?\n\nRecent Widow — Isabel died barely two months before the delegation departed. This haste might seem disrespectful or desperate.\n\nThe Letter's Oddities — \"Fighting for the kingdom of heaven... don't tell my confessor\" — charming or alarming? A politically astute woman might read warning signs in Juan's rhetoric.\n\nNo Territorial Claims — Marriage brings Lucia to Castile but gives Ferrara nothing tangible. No lands, no titles, no territorial gains. Pure prestige match.\n\nItalian Politics — Niccolò must consider how this affects his relationships with Milan, Venice, Florence. Does Castilian alliance serve or complicate his position?\n\nLucia's Own Preferences — She's described as \"politically astute\" and \"sharp-tongued.\" She may have her own views about leaving Italy for an unknown kingdom ruled by a possibly unstable widower.\n\nD100 Table\n\nRoll\nOutcome\n01-10\nOutright Refusal. Something has gone wrong — perhaps rumors of Juan's mental instability have reached Ferrara, or Lucia herself has firmly refused, or Niccolò has received a better offer from an Italian house. The delegation is received politely but the answer is no. Papal pressure cannot overcome the resistance. Don Íñigo returns empty-handed with an apologetic letter.\n11-25\nConditional Refusal. The Este are interested in principle but have serious concerns. They request time to consider — essentially a polite delay that may become permanent. Concerns cited may include: Juan's haste in remarrying, the distance from Italy, questions about Castilian court culture. The door is not closed, but significant additional effort would be required.\n26-40\nNegotiations Required. The Este are willing to proceed but demand significant concessions: larger dowry arrangements, guarantees about Lucia's status and household, commitments about her Italian attendants, perhaps even territorial or commercial concessions. Don Íñigo must negotiate hard. Final agreement possible but not certain.\n41-60\nCautious Acceptance. The match is agreed in principle. Lucia has consented (whether enthusiastically or resignedly). Terms are reasonable. However, the Este want time for proper arrangements — wedding perhaps in spring 1434. Formal betrothal documents to be signed, but Lucia will not travel to Castile immediately. A proper match, properly concluded.\n61-75\nFavorable Acceptance. The papal endorsement and Juan's prestige carry the day. Lucia herself is intrigued by Juan's unconventional letter. The Este see strategic value in the alliance. Terms agreed quickly, betrothal formalized. Lucia could travel to Castile by early 1434. Warm relations established.\n76-90\nEnthusiastic Acceptance. Lucia is genuinely interested — perhaps Juan's letter struck a chord with a sharp-tongued woman tired of Italian marriage politics. Niccolò sees significant advantage in alliance with the conqueror of Granada. The Este propose accelerated timeline. Possibility of wedding before Juan's Constantinople expedition in spring 1434.\n91-100\nExceptional Success. Not only does Lucia accept, but she brings unexpected advantages — perhaps she insists on meeting Juan before the wedding (unusual but intriguing), or Niccolò offers additional diplomatic commitments, or the match creates ripple effects that strengthen Castile's position in Italian politics generally. The delegation exceeds all expectations.\n\nProbability Assessment\n\nGiven:\n\nJuan's extraordinary prestige (major success factor)\n\nPapal backing (significant)\n\nLucia's age and limited prospects (works in Juan's favor)\n\nBut also distance, recent widowhood, and the oddities of Juan's letter\n\nThe approach is solid. The success factors outweigh the failure factors. I would weight this toward success, but not guaranteed — perhaps 35+ for some form of acceptance.\n\nReady to roll when you are, Sicco."
        },
        {
          "role": "player",
          "text": "rolled 93"
        },
        {
          "role": "gm",
          "text": "The dice favor Castile magnificently.\n\nThree Days Before the Baptism\n\nThe messenger arrived at dusk on October 12th, his horse lathered and trembling from the final push through the Guadarrama passes. He bore the seal of Don Íñigo López de Mendoza and demanded immediate audience with the king.\n\nJuan received him in his private study, Álvaro at his side. The man—one of Don Íñigo's personal couriers—knelt and presented a leather satchel containing three documents.\n\n\"Your Majesty. The negotiations have concluded. My lord Don Íñigo sends his compliments and these letters, and bids me say—\" The courier allowed himself a small smile. \"He bids me say he is bringing her home.\"\n\nTHE FIRST DOCUMENT: Don Íñigo's Report\n\nYour Majesty,\n\nI write from Ferrara with news that exceeds my most optimistic expectations. The match is agreed. More than agreed—embraced.\n\nWe arrived in Rome on September 18th and secured audience with Pope Eugenius within three days. His Holiness was effusive in his support, providing not merely letters of endorsement but a personal emissary—Bishop Lorenzo of Tivoli—to accompany us to Ferrara and make clear the papal interest in this union. The Pope spoke at length about Your Majesty's service to Christendom and expressed his hope that this marriage would bind Castile more closely to Italian affairs, particularly regarding Constantinople.\n\nWe reached Ferrara on October 2nd. Marquess Niccolò received us with appropriate ceremony—neither excessive nor cold. He is a shrewd man, Your Majesty, with eyes that miss nothing. I presented your gifts, which were well-received, and delivered your letter to the Lady Lucia in the presence of her uncle and his court.\n\nWhat happened next was... unexpected.\n\nThe Lady Lucia read your letter in silence. The court watched. When she finished, she looked up at her uncle and said, in a voice clear enough for all to hear: \"He writes to me as if I were a person, not a broodmare. I would like to meet this king.\"\n\nThe Marquess attempted to explain that royal marriages do not typically involve the bride meeting the groom beforehand. The Lady Lucia replied—and I quote precisely, Your Majesty, for it seems important—\"Then perhaps it is time they did. If I am to leave Italy forever for a man I have never seen, I would know whether he is the man his letter suggests or merely a king with a talented secretary.\"\n\nThere was a moment of considerable tension. Then Marquess Niccolò laughed—a genuine laugh, not a political one—and said: \"My niece has her mother's tongue. Very well. We shall see what Castile's king makes of that.\"\n\nThe negotiations that followed were remarkably smooth. The papal endorsement carried enormous weight, but I believe the Lady Lucia's own interest carried more. She asked questions about Your Majesty—detailed questions, not mere formalities. She wished to know about Queen Isabel, about the Princess Catalina, about Prince Fernando. She asked about the conquest of Granada and whether Your Majesty had killed men personally in battle. She asked about Toledo and whether it had libraries.\n\nI answered as honestly as I could. When I mentioned Your Majesty's letter to her—that you wrote it yourself, without a secretary—she smiled and said: \"I know. No secretary would have included the part about his confessor.\"\n\nThe terms agreed are as follows:\n\nThe Lady Lucia d'Este will travel to Castile in the company of myself and our delegation, departing Ferrara within the week. She will be accompanied by six Italian ladies-in-waiting, two confessors (one Italian, one to be appointed by Your Majesty), and a household of twenty servants. She brings a modest dowry of 15,000 florins—Ferrara is not wealthy—but Marquess Niccolò has waived the customary reverse-dowry that Italian houses often demand.\n\nThe Lady Lucia has made one unusual request, which the Marquess has approved: she wishes to meet Your Majesty privately before the formal betrothal is announced. Not to reconsider—she has given her word—but, in her words, \"to see if his eyes match his letter.\" If Your Majesty finds this impertinent, I beg you to consider that this woman has agreed to leave everything she knows for a kingdom she has never seen, ruled by a man she has never met. A single private conversation seems a small concession.\n\nShe is everything the reports suggested, Your Majesty. Beautiful, yes—strikingly so. But also sharp, observant, and entirely unafraid to speak her mind. She reminds me, if I may be so bold, of the late Queen Isabel—not in appearance, but in the quality of intelligence behind her eyes.\n\nWe depart Ferrara on October 8th. Weather permitting, we should reach Toledo by early November. The Lady Lucia has expressed her hope that she might attend Prince Fernando's baptism, but I have explained that the timing makes this impossible. She accepted this with grace but visible disappointment.\n\nI believe, Your Majesty, that you have found a worthy queen.\n\nYour servant,\nDon Íñigo López de Mendoza\n\nTHE SECOND DOCUMENT: Marquess Niccolò's Formal Letter\n\nA standard diplomatic communication confirming the terms of the betrothal, expressing hope for lasting friendship between Ferrara and Castile, and noting that the marriage should take place at Juan's convenience following the Lady Lucia's arrival. Formal, correct, unremarkable.\n\nTHE THIRD DOCUMENT: A Letter from Lucia\n\nUnsealed. Clearly intended for Juan to read.\n\nKing Juan,\n\nYou wrote to me as a person, so I will reply as one.\n\nI have agreed to marry you. I have agreed to leave my home, my language, my family, and everything I have known for twenty-three years. I have agreed to become stepmother to children I have never met, queen of a kingdom I have seen only on maps, and wife to a man I know only through a letter and the reports of diplomats.\n\nI have agreed to all of this because your letter told me something that no other suitor has ever conveyed: that you see marriage as partnership, not ownership. That you loved your first wife and grieve her still. That you care whether your daughter has a mother, not merely whether your dynasty has a womb.\n\nI am told you are brilliant. I am told you may be mad. I am told you conquered Granada through faith and fire. I am told you speak of heaven as if you have glimpsed it.\n\nI do not know what to believe. So I am coming to see for myself.\n\nI ask one thing: when we meet, speak to me as you wrote to me. Not as a king to a subject, not as a husband to a possession. If your letter was honest, I believe we may suit each other well. If it was merely clever, we will both discover that soon enough.\n\nI am told you promised to make accommodations for my Italian culture and spirit. I intend to hold you to that promise. I am also told Castilian wine is inferior to Italian. I intend to test that claim thoroughly.\n\nUntil we meet,\nLucia d'Este\n\nJuan set down the letter. The candles had burned low while he read. Alfonso had retired hours ago; only Álvaro remained, patient as always.\n\n\"Well,\" Álvaro said quietly. \"She has her opinions.\"\n\n[STOP]\n\nLucia d'Este has accepted and is traveling to Castile. She has requested a private meeting before the formal betrothal announcement, and her letter suggests a woman of considerable intelligence and directness. She should arrive in Toledo by early November—after Fernando's baptism but before winter makes travel impossible.\n\nThe baptism is in three days. Is there anything Juan wishes to address before October 15th?"
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_1433_00431",
      "book": 2,
      "chapter": "2.12",
      "date": "1433-10-15",
      "end_date": null,
      "type": "ceremony",
      "summary": "Prince Fernando is baptized at the Cathedral of Toledo in a grand ceremony. Archbishop Alonso presides at the ancient Visigothic baptismal font. Queen Leonor of Portugal and King Alfonso V serve as godparents. Juan carries Princess Catalina himself in white robes. La Dote de la Reina Isabel is publicly announced: a perpetual 25,000-florin endowment providing dowries to poor Christian maidens annually on August 3rd. At the feast, Juan breaks protocol by leaving the high table to circulate among nobles with Catalina, visiting the Mendoza, Manrique, and Velasco families. He leaves Catalina with six-year-old Maria Velasco, beginning a friendship. Roll 87 (Transformative): The night becomes legendary, deepening noble loyalty and beginning reconciliation with House Velasco.",
      "characters": [
        "juan_ii",
        "alfonso_v",
        "catalina_de_castilla",
        "dona_beatriz",
        "pedro_manrique",
        "pedro_fernandez_de_velasco",
        "inigo_lopez_de_mendoza"
      ],
      "factions_affected": [
        "royal_court"
      ],
      "location": "Toledo",
      "tags": [
        "ceremony",
        "baptism",
        "fernando",
        "charity",
        "dote_isabel",
        "nobles",
        "feast",
        "velasco",
        "mendoza",
        "manrique",
        "roll",
        "catalina"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "No, we have the baptism."
        },
        {
          "role": "gm",
          "text": "October 15th, 1433 — The Cathedral of Toledo\n\nThe bells began at dawn.\n\nEvery church in Toledo joined the chorus—the great cathedral's deep bronze voice answered by the higher peals of parish churches across the city, until the air itself seemed to vibrate with sacred sound. Citizens who had traveled from as far as Burgos and Seville lined the streets from the Alcázar to the cathedral, held back by guardsmen in royal livery. Vendors sold bread and wine. Children sat on their fathers' shoulders. The autumn sun broke through morning clouds as if God Himself wished to witness the christening of Castile's heir.\n\nThe Procession\n\nThe royal party departed the Alcázar at the ninth hour.\n\nFirst came the Guardian Company, forty knights in polished armor bearing the banners of Castile and León. Then the nobles of the realm—counts and dukes and lords who had answered the summons, their wives in silks and velvets, their households trailing behind in careful precedence.\n\nThen the godparents.\n\nQueen Leonor of Portugal, aged but unbowed, walked with the dignity of a woman who had buried children and would bury her husband soon. She wore black still—mourning for Isabel—but her mantilla was trimmed with gold, and the rosary at her belt had been blessed by three popes. She had arrived from Sintra four days prior, despite King João's failing health, because her grandson would not be baptized without her presence.\n\nBeside her walked King Alfonso V of Aragon, resplendent in crimson and gold, the arms of Aragon blazoned across his chest. He had not returned to Naples after the meeting with Juan. He had stayed for this—for the sacred obligation of godparenthood, for the alliance it represented, for the statement it made to all Christendom that Iberia stood united.\n\nBehind them came Doña Beatriz de Meneses, carrying the infant Fernando wrapped in white silk embroidered with the lions of Castile. The child was quiet, eyes open, watching the world with the unfocused intensity of a two-month-old who did not yet know he would one day rule it.\n\nAnd finally, Juan.\n\nHe walked alone, as was proper for a widowed king. He wore white—unusual for a monarch, but deliberate. The color of his crusaders' tabards. The color of surrender to God's will. At his side hung the sword his father had carried, inscribed Non Nobis Domine. In his arms, he carried Catalina.\n\nThe princess was nineteen months old, too young to walk the full procession but too important to be left behind. She wore a miniature gown of white and gold, and she clung to her father's neck with the absolute trust of a child who did not yet understand death. She had stopped asking for her mother. Doña Beatriz said she no longer searched Isabel's chambers. But sometimes, at night, she still cried for reasons she could not name.\n\nJuan had insisted on carrying her himself. Let the people see their king as a father. Let them see that the house of Trastámara endured.\n\nThe Cathedral\n\nThe great doors stood open, revealing the vast interior lit by a thousand candles. Archbishop Alonso de Toledo waited at the baptismal font, surrounded by bishops and abbots from across the kingdom. The font itself was ancient—the same marble basin where Visigothic kings had been christened a thousand years before.\n\nThe cathedral was full beyond capacity. Every noble house had sent representatives. Every major city had dispatched officials. Foreign ambassadors crowded the diplomatic gallery—Venetians, Florentines, a representative of Emperor Sigismund, even a quiet observer from the Burgundian court.\n\nAs Juan entered, carrying Catalina, the assembly rose.\n\nHe walked the length of the nave in silence, his footsteps echoing against stone. Catalina twisted in his arms to stare at the candles, the colors, the sea of unfamiliar faces. She did not cry. Isabel's daughter had inherited her mother's composure.\n\nAt the font, Juan handed Catalina to one of the Portuguese ladies—Doña Leonor de Almeida, who had asked for this honor—and took his place beside the godparents. Doña Beatriz stepped forward with Fernando.\n\nArchbishop Alonso raised his hands for silence.\n\nThe Sacrament\n\n\"In nomine Patris, et Filii, et Spiritus Sancti.\"\n\nThe ancient words rolled through the cathedral like thunder. The Archbishop spoke of baptism's meaning—the washing away of original sin, the entry into Christ's church, the beginning of a soul's journey toward salvation. He spoke of the responsibilities of godparents, of the sacred trust they accepted.\n\nThen he turned to the child.\n\n\"What name is given to this child?\"\n\nQueen Leonor answered, her voice carrying despite her years: \"Fernando.\"\n\n\"And what do you ask of God's Church for Fernando?\"\n\n\"Baptism,\" Alfonso replied.\n\nThe Archbishop anointed the infant with oil—on the breast, on the shoulders, on the forehead. Fernando squirmed but did not cry. The old man's hands were gentle, practiced by decades of such ceremonies.\n\n\"Fernando, I baptize thee in the name of the Father—\"\n\nWater poured over the child's head. Fernando gasped, then wailed—a lusty, healthy cry that echoed through the cathedral. Several nobles smiled. A crying child was a strong child.\n\n\"—and of the Son—\"\n\nMore water. More crying.\n\n\"—and of the Holy Spirit.\"\n\nThe final pouring. The Archbishop wrapped the child in a white cloth and raised him for all to see.\n\n\"Fernando, Prince of Asturias, heir to the throne of Castile and León, is received into the body of Christ. May God grant him long life, wisdom, and the strength to serve His purposes.\"\n\nThe cathedral erupted in response: \"Vivat! Vivat Fernando!\"\n\nThe bells began again—not the measured peals of summons, but the wild jubilant clamor of celebration. Outside, the crowds who had heard the cry taken up by those near the doors began cheering themselves. The sound rolled through Toledo like a wave.\n\nJuan watched his son—red-faced, furious at the indignity of cold water, very much alive—and felt something loosen in his chest. The succession was secure. Whatever happened now, Castile had an heir.\n\nThe Proclamation\n\nWhen the cheering subsided, the Archbishop raised his hands once more.\n\n\"His Majesty King Juan has commanded that this joyous occasion be marked by works of charity, in memory of Queen Isabel of blessed memory, mother of Prince Fernando, who gave her life that he might live.\"\n\nA murmur ran through the cathedral. This was not part of the standard ceremony.\n\n\"His Majesty hereby establishes La Dote de la Reina Isabel—a perpetual charitable endowment of twenty-five thousand florins. Each year, on the third day of August—the day of Prince Fernando's birth and Queen Isabel's death—dowries shall be provided to poor Christian maidens throughout Castile and Granada who cannot otherwise marry. This charity shall continue in perpetuity, that Queen Isabel's name may be blessed by generations yet unborn.\"\n\nSilence. Then, from somewhere in the nave, a woman began to weep. Others joined her. Twenty-five thousand florins—enough to provide dowries for a hundred women every year, forever. The scale of it was almost incomprehensible.\n\nThe Archbishop continued: \"Let it be recorded that this endowment is made not from the royal treasury alone, but from the King's personal fortune—that it represents not the duty of a monarch, but the love of a husband.\"\n\nJuan had not written those words. The Archbishop had added them himself. But they were true, and Juan did not object.\n\nThe Feast\n\nThe ceremony concluded with prayers and blessings, and the royal party processed back to the Alcázar for the feast. The streets were even more crowded now—word of the charitable endowment had spread, and the cheering had taken on a different quality. Not just celebration of an heir, but gratitude for a king who remembered the poor on the day of his triumph.\n\nCoins were scattered along the processional route, as tradition demanded. Bread was distributed from carts stationed at major intersections. Wine flowed in the public fountains.\n\nAt the Alcázar, the great hall had been transformed. Tables stretched the length of the room, laden with food and wine. Musicians played in the gallery. The nobility of Castile ate and drank and toasted Prince Fernando's health while servants bustled between tables.\n\nJuan sat at the high table, Catalina in a specially constructed chair beside him, Fernando in a cradle nearby where Doña Beatriz could attend him. Queen Leonor sat at Juan's right hand, Alfonso at his left. The godparents' places of honor.\n\nAs the feast progressed, nobles approached the high table to offer congratulations and gifts. Juan accepted each with appropriate grace, while Catalina alternated between eating bits of bread and staring suspiciously at the strangers who kept bowing to her father.\n\nLate in the evening, when the formal toasts had been made and the serious drinking had begun, Alfonso leaned close to Juan.\n\n\"A good day,\" he said quietly. \"Your son is christened, your charity announced, your kingdom celebrating. And in a few weeks, your new queen arrives.\"\n\nHe raised his cup.\n\n\"To Fernando. To Castile. And to the work that remains.\"\n\n[STOP]\n\nThe baptism is complete. Prince Fernando is formally christened and proclaimed heir. La Dote de la Reina Isabel has been announced publicly. The feast continues into the night.\n\nIs there anything specific Juan wishes to do during the celebrations, or shall we move forward to Lucia's arrival in early November?"
        },
        {
          "role": "player",
          "text": "When the feast is in full swing, I take Catalina in my lap and I eat together with her. One bite for me, a tiny for Catalina."
        },
        {
          "role": "gm",
          "text": "The great hall roared with celebration around them—nobles raising cups, musicians playing, servants weaving between tables—but at the high table, a small island of quiet had formed.\n\nCatalina sat in her father's lap, her tiny gown already stained with something that might have been gravy. She watched the chaos of the feast with wide eyes, occasionally pointing at something that caught her attention—a juggler in the corner, a lady's bright red dress, a dog that had snuck under one of the lower tables.\n\nJuan cut a small piece of roasted capon and held it to her lips. She took it solemnly, chewing with the exaggerated concentration of a child who had only recently mastered the art. Then she looked up at him expectantly.\n\nHe took a bite himself. Then cut another small piece for her.\n\nOne for me. One for Catalina.\n\nQueen Leonor, watching from her place of honor, smiled softly. She said nothing—what was there to say?—but her eyes glistened in the candlelight. She had seen her daughter do the same thing with this same child, in this same hall, less than a year ago.\n\nCatalina reached for Juan's cup. He moved it gently out of reach and offered her water instead from a smaller vessel. She accepted this substitution with the philosophical resignation of a toddler who had learned that some battles were not worth fighting.\n\n\"Papa,\" she said, pointing at the juggler. \"Ball.\"\n\n\"Yes, mi corazón. Balls.\"\n\n\"Want.\"\n\n\"Perhaps tomorrow. Tonight we celebrate your brother.\"\n\nShe considered this, then returned her attention to the food. Juan cut another piece of meat, ate half himself, and offered her the rest. She took it from his fingers with surprising delicacy.\n\nAlfonso, who had been deep in conversation with a Valencian count, glanced over at the scene. Something flickered across his face—perhaps memory of his own failed marriage, the children he had never had with Queen María. He raised his cup slightly toward Juan, a silent acknowledgment, then returned to his conversation.\n\nThe feast continued. The wine flowed. Nobles danced and laughed and made promises they might or might not keep.\n\nAnd at the high table, the King of Castile fed his daughter pieces of capon, one bite at a time, while her infant brother slept in his cradle nearby, unaware of the kingdom that would one day be his.\n\nDoña Beatriz appeared at Juan's elbow sometime later, her face gentle.\n\n\"Your Majesty. The princess is falling asleep.\"\n\nIt was true. Catalina had slumped against Juan's chest, her eyes heavy, a piece of bread still clutched in one small fist. The excitement of the day had finally overwhelmed her.\n\n\"I will take her to bed, if Your Majesty permits,\" Doña Beatriz said. \"The nurses are waiting.\"\n\n[STOP]\n\nDoes Juan hand Catalina to Doña Beatriz, or does he wish to put her to bed himself?"
        },
        {
          "role": "player",
          "text": "One moment dear Beatriz. I want to introduce her to some people.\n\n\nI take Catalina and stand up and make a round to talk with all the nobles who have visited the feast. I start with the Mendoza's. I sit down in a chair near the head of the family with Catalina in my lap and ask him how he and his family is doing."
        },
        {
          "role": "gm",
          "text": "The hall quieted as Juan rose from the high table, Catalina drowsy against his shoulder. Nobles paused mid-conversation, cups halfway to lips, watching their king descend from the dais with his daughter in his arms.\n\nThis was not protocol. Kings did not circulate at feasts like common guests. They received supplicants at the high table; they did not go to them.\n\nJuan did it anyway.\n\nHouse Mendoza\n\nDon Diego Hurtado de Mendoza, Admiral of Castile and patriarch of the house, rose hastily from his seat as Juan approached. He was in his sixties now, silver-haired and dignified, one of the most powerful lords in the kingdom. Around him sat his sons, daughters-in-law, and grandchildren—the sprawling network of a great house at the height of its influence.\n\n\"Your Majesty,\" Don Diego said, bowing. \"You honor us beyond measure.\"\n\nJuan waved him back to his seat and pulled a chair close—a servant materialized instantly to position it—settling Catalina in his lap. The princess blinked sleepily at the unfamiliar faces, then leaned back against her father's chest with the boneless trust of an exhausted child.\n\n\"Don Diego. Please, sit. I wanted to speak with you and your family.\"\n\nThe Admiral sat, clearly uncertain how to handle this breach of custom. His wife, Doña Mencía de Figueroa, watched with sharp eyes. Several younger Mendozas exchanged glances.\n\n\"Your son Don Íñigo serves me well,\" Juan said. \"He writes from Ferrara that the negotiations exceeded all expectations. I am in your house's debt.\"\n\nDon Diego inclined his head. \"Íñigo has always had a gift for words, Your Majesty. We are grateful you saw fit to trust him with such a delicate mission.\"\n\n\"How is your family? I see many faces here tonight—some I do not know as well as I should.\"\n\nThe Admiral's formality softened slightly. He began introducing the members of his house who had come for the baptism—his second son Don Lorenzo, who managed the family's estates near Guadalajara; his daughter Doña María, recently widowed and returned to her father's household; his grandson Pedro, a boy of twelve who stared at Juan with unconcealed awe.\n\nCatalina, roused by the conversation, pointed at young Pedro. \"Boy,\" she announced.\n\nPedro flushed crimson. The adults laughed—genuine laughter, the ice broken by a toddler's observation.\n\n\"Yes, mi corazón,\" Juan said. \"A boy. Perhaps one day he will serve you as his grandfather serves me.\"\n\nDon Diego's eyes flickered—pride, calculation, and something that might have been genuine emotion, all carefully controlled. \"House Mendoza has always served the crown, Your Majesty. We always shall.\"\n\n\"I know.\" Juan met the old man's gaze. \"I know who stood with me when others wavered. I do not forget.\"\n\nA moment of understanding passed between them—unspoken acknowledgment of the years when Juan's throne had been uncertain, when the Infantes had threatened rebellion, when many noble houses had hedged their bets. The Mendozas had not hedged. They had chosen their side early and held to it.\n\n\"Is there anything your house needs, Don Diego? Anything I should know?\"\n\nThe Admiral considered the question carefully. \"The northern estates suffered poor harvests this year, Your Majesty. Nothing catastrophic, but belts will be tightened. And my third son—\" He hesitated. \"My third son wishes to take holy orders. I had hoped he might serve in your chapel, if a position could be found.\"\n\n\"Send him to Toledo. The Archbishop will find a place for a Mendoza.\"\n\nDon Diego bowed his head. \"Your Majesty is generous.\"\n\nJuan stayed a few minutes longer, asking after specific family members, admiring a new grandchild, listening to Doña Mencía describe the embroidery work she had commissioned for the cathedral. When he rose to move on, the entire Mendoza contingent stood with him.\n\n\"Your Majesty,\" Don Diego said quietly, for Juan's ears alone. \"The way you carry your daughter... my Isabel used to carry our children the same way. God rest her soul.\"\n\nJuan paused. \"We do what we can, Don Diego. For the ones who remain.\"\n\n[STOP]\n\nThe Mendozas have been honored. Catalina is still awake—barely—in Juan's arms.\n\nWhich house does Juan visit next? The major families present would include:\n\nHouse Guzmán (Don Luis de Guzmán, Master of Santiago)\n\nHouse Manrique (powerful northern lords)\n\nHouse Velasco (Constables of Castile historically, rivals to Álvaro)\n\nHouse Álvarez de Toledo (rising house, connected to the Archbishop)\n\nHouse Enríquez (Admirals of Castile by hereditary right, though Mendoza currently holds the position)\n\nHouse Stúñiga/Zúñiga (marcher lords, guardians of the frontier)\n\nOr Juan may have another approach in mind."
        },
        {
          "role": "player",
          "text": "Remember to NEVER generate dialogue or action for Juan. Instead just stop.\n\n\nI look at Catalina and tell her: \nThese are the Mendoza's love. They are a big family like we will be when you and your brother are older. \nI let her take in the scene before standing up and walking to the family that is seated next to the mendoza's. I remain standing and approach the pater famillias and show him Catalina."
        },
        {
          "role": "gm",
          "text": "Catalina gazed at the assembled Mendozas with the solemn attention of a child processing new information. Her eyes moved from face to face—the old Admiral, his silver-haired wife, the young boy Pedro who had made her point and declare \"Boy.\" She did not fully understand, of course. But something in her expression suggested she was trying.\n\nJuan rose, Catalina secure in his arms, and the Mendozas bowed as he departed.\n\nHouse Manrique\n\nThe family seated beside the Mendozas wore the deep burgundy that marked their house. Don Pedro Manrique, Adelantado Mayor of León and patriarch of one of Castile's oldest noble lines, stood immediately as Juan approached. He was a hard man in his fifties, weathered by decades of frontier service and political survival. His family controlled vast estates in the north—lands that had been Manrique holdings since before the Trastámara dynasty existed.\n\nJuan did not sit this time. He stood before Don Pedro, Catalina held so the old lord could see her clearly.\n\nThe Adelantado looked at the princess—this drowsy child in her stained gown, heir to nothing but her father's love and whatever marriage might one day bring her. His stern face softened almost imperceptibly.\n\n\"Your Majesty,\" he said, bowing. Then, to Catalina directly, with a gentleness that seemed foreign to his weathered features: \"Your Highness.\"\n\nCatalina studied him with the unfiltered assessment only children can manage. She took in his scarred hands, his grey-streaked beard, the deep lines around his eyes.\n\n\"Man,\" she said finally, with apparent approval.\n\nA ripple of surprised laughter ran through the Manrique table. Don Pedro's wife, Doña Leonor de Castilla—herself of royal blood, a distant cousin to Juan—pressed a hand to her mouth to hide her smile.\n\nDon Pedro, to his credit, accepted the princess's judgment with gravity. \"I am honored by Her Highness's assessment.\"\n\n[STOP]\n\nJuan stands before the Manriques with Catalina in his arms. Don Pedro awaits whatever the king wishes to say or ask."
        },
        {
          "role": "player",
          "text": "Thank you for coming Don Pedro. occasions such as these remind us how important family really is. And I am glad to see that you have now met my Catalina as well. How is life in your domain?"
        },
        {
          "role": "gm",
          "text": "Don Pedro's expression shifted—a flicker of surprise at being asked so directly, here at a feast, by a king holding his daughter. He recovered quickly, the instincts of a lifetime at court asserting themselves.\n\n\"Your Majesty is kind to ask.\" He gestured to the seats around him. \"Life in the north continues as it always has. The harvests were adequate this year—better than Guadalajara, I am told.\" A slight glance toward the Mendoza table. \"The frontier remains quiet, though quiet on the frontier merely means the troubles are smaller, not absent.\"\n\nHe paused, seeming to weigh how much honesty the moment called for.\n\n\"There is some... adjustment, Your Majesty, to the new order of things. Granada's fall has changed the rhythm of the north. For generations, younger sons went south to make their names against the Moor. Now...\" He spread his hands. \"Now they must find other paths. Some speak of Constantinople. Others grow restless.\"\n\nDoña Leonor, his wife, interjected with the ease of a woman long accustomed to softening her husband's bluntness. \"What my lord means to say, Your Majesty, is that the north celebrates your great victory, but also wonders what role it shall play in the kingdom you are building. We are far from Toledo. Far from Granada. Sometimes the north feels... forgotten.\"\n\nDon Pedro shot her a look—half irritation, half gratitude for saying what he could not.\n\nCatalina, oblivious to the political undercurrents, reached toward the silver clasp on Don Pedro's cloak. It was shaped like a castle—the ancient Manrique emblem.\n\n\"Pretty,\" she declared.\n\nDon Pedro looked at the small hand reaching for his house's symbol, then up at Juan.\n\n[STOP]"
        },
        {
          "role": "player",
          "text": "Ha! Yes Catalina, it's very pretty indeed. And it is the property of the nice man, not for Catalina to play with.\n\n\nI wink at the Don.\n\n\nDont worry too much about too much peace. Im pretty sure we shall soon serve as christ's sword again. And the North is not forgotten, at least not by me. I wish I could visit more often, I fondly remember my journey and pilgrimage to Santiago."
        },
        {
          "role": "gm",
          "text": "Don Pedro's stern features cracked into something approaching a genuine smile at the wink—a rare breach of formality that seemed to catch him off guard.\n\n\"The North remembers Your Majesty's pilgrimage as well,\" he said. \"The people still speak of the young king who walked the final league barefoot, like a common penitent. The innkeepers along the Camino have dined out on the story for three years now.\"\n\nDoña Leonor nodded. \"My cousin in Astorga writes that pilgrims still ask to sleep in the same room Your Majesty occupied. The innkeeper has raised his prices accordingly.\"\n\nA dry chuckle ran through the Manrique table.\n\nDon Pedro's expression grew more thoughtful at Juan's mention of serving as Christ's sword again. \"Constantinople, Your Majesty? The rumors have reached even León. They say you have already sent knights to the Emperor.\"\n\nHe leaned slightly closer, lowering his voice so that only Juan—and the drowsy Catalina—could hear. \"If there is to be a new crusade, the North will answer. My sons grow restless with peace, as I said. Better they spend their vigor against the Turk than in... less productive pursuits.\"\n\nHe glanced at his two adult sons seated nearby—young men with the coiled energy of warriors without a war, watching their father speak with the king.\n\n\"House Manrique sent men to every campaign of the Reconquista since Covadonga. We would not wish to miss the chance to continue that tradition, even if the battlefield lies beyond the sea.\"\n\nCatalina, her attempt at the silver clasp thwarted, had found a new target—a loose thread on Juan's collar. She tugged at it with drowsy determination.\n\n[STOP]"
        },
        {
          "role": "player",
          "text": "And Castille thanks you and your family for your service Pedro. But as you know, only a pope can call a crusade, not a king. We will see.\n\n\nI continue to make my rounds along the seated nobles and go to the next family."
        },
        {
          "role": "gm",
          "text": "Juan inclined his head to the Manriques and moved on, Catalina now thoroughly occupied with the loose thread on his collar.\n\nHouse Velasco\n\nThe next table bore the checkered arms of the Velasco family—ancient rivals to Álvaro de Luna and historically holders of the Constableship of Castile before Álvaro had claimed it. Don Pedro Fernández de Velasco, Count of Haro, rose as Juan approached. He was a man of forty-five, proud-faced, with the careful bearing of someone who had learned to conceal his resentments behind impeccable courtesy.\n\nThe Velascos had never rebelled. They had never openly opposed Juan. But neither had they forgotten that the office their family had held for generations now belonged to Álvaro—a man they considered an upstart and a usurper of their rightful place.\n\n\"Your Majesty,\" Don Pedro said, bowing precisely as deep as protocol demanded and not a fraction deeper. \"House Velasco rejoices at the christening of Prince Fernando.\"\n\nHis wife, Doña Beatriz de Manrique—a cousin to the family Juan had just left—watched with guarded eyes. Their children, three sons and two daughters ranging from young adulthood to childhood, sat in careful order of precedence.\n\nThe youngest, a girl of perhaps six, stared openly at Catalina with the frank curiosity of one child examining another.\n\nCatalina stared back. For a moment, the two girls regarded each other across the divide of rank and family—princess and nobleman's daughter, equal only in their mutual assessment.\n\n\"Girl,\" Catalina said, pointing.\n\nThe Velasco daughter looked to her mother uncertainly, unsure if she was permitted to respond to a princess's observation.\n\n[STOP]"
        },
        {
          "role": "player",
          "text": "I set Catalina down next to the youngest girl to let her explore and play.\n\n\nI turn to Don Pedro.\n\n\nThank you for coming and attending the ceremony. How are you doing?\n\n\nI ask while keeping an eye on Catalina to nmake sure she does not hurt herself."
        },
        {
          "role": "gm",
          "text": "The Velasco daughter's eyes went wide as Catalina was set beside her. She looked to her mother again, received a small nod of permission, and then turned to the princess with the serious expression of a child entrusted with important responsibility.\n\nCatalina, freed from her father's arms, immediately reached for the girl's braided hair, which had ribbons woven through it.\n\n\"Pretty,\" Catalina declared—her highest compliment, it seemed.\n\nThe Velasco girl, emboldened, touched the embroidered lions on Catalina's stained gown. \"Pretty,\" she echoed solemnly.\n\nSome unspoken treaty had been negotiated.\n\nDon Pedro watched this exchange with an expression difficult to read. When he turned to answer Juan, his careful courtesy remained in place, but something had shifted almost imperceptibly—the sight of his youngest daughter playing with the princess had cracked the formal mask, if only slightly.\n\n\"Your Majesty is gracious to ask.\" He paused, seeming to weigh his words. \"House Velasco endures, as it always has. Our lands in the north remain productive. Our obligations to the crown are met.\"\n\nIt was a carefully neutral answer—correct, unrevealing, the response of a man who had learned that honesty with kings could be dangerous.\n\nDoña Beatriz, perhaps sensing the inadequacy of her husband's response, added: \"The Count was recently blessed with a grandson, Your Majesty. Our eldest son's wife delivered a healthy boy in September. We had hoped to bring him tonight, but the journey from Burgos was too arduous for an infant so young.\"\n\nDon Pedro's jaw tightened slightly—whether at his wife's interjection or at some private emotion, it was impossible to say.\n\nOn the floor, Catalina had discovered that the Velasco girl's ribbons could be untied. The girl, rather than protesting, was helping her do it.\n\n[STOP]"
        },
        {
          "role": "player",
          "text": "Really? Well congratulations! Seeing your family expand into a new generation is a blessing indeed.\n\n\nI look at Catalina.\n\n\nYour daughter seems to be getting with Catalina. What is her name?"
        },
        {
          "role": "gm",
          "text": "Don Pedro's formality softened further—it was difficult to maintain rigid courtesy while watching his youngest daughter solemnly assist a princess in dismantling her own hair ribbons.\n\n\"Her name is María, Your Majesty,\" he said. \"After my mother.\"\n\nDoña Beatriz smiled with genuine warmth. \"She is our unexpected blessing. We thought ourselves done with children when God saw fit to give us one more.\"\n\nMaría had now successfully helped Catalina remove one ribbon entirely. Catalina held it up triumphantly, examining the silk with great satisfaction. María, rather than being distressed at the destruction of her careful braids, seemed equally pleased with their collaborative achievement.\n\n\"María is... spirited,\" Don Pedro admitted, a trace of reluctant fondness in his voice. \"Her nurses say she has more energy than her three brothers combined. She was furious to learn she could not train with a sword like her brothers do.\"\n\n\"She tried to steal one from the armory last month,\" Doña Beatriz added, with the weary amusement of a mother who had long since surrendered to her daughter's nature. \"The master-at-arms found her in the courtyard attempting to lift a blade twice her height.\"\n\nMaría, oblivious to being discussed, had produced a second ribbon from somewhere and was showing Catalina how to tie a knot. Catalina watched with intense concentration, her earlier drowsiness apparently forgotten in the face of this new and important knowledge.\n\nDon Pedro watched the two girls for a moment, then looked back at Juan. Something in his expression had changed—the guarded distance had not vanished entirely, but it had receded.\n\n[STOP]"
        },
        {
          "role": "player",
          "text": "Maria...carrying a sword? Really? I must confess I do not know if I hope Catalina will follow her example."
        },
        {
          "role": "gm",
          "text": "A genuine laugh escaped Don Pedro—a sound that seemed to surprise even himself. Several members of the Velasco table exchanged glances; apparently the Count of Haro was not known for laughter.\n\n\"I confess I did not know whether to punish her or promote her to the household guard,\" he said. \"She told me—with great indignation—that if Castile could have a warrior king, it should also have warrior ladies. She had heard some troubadour's tale of the crusade, I think.\"\n\nDoña Beatriz shook her head fondly. \"She informed her brothers that she intended to conquer her own kingdom since they would inherit everything of ours. We have not yet determined which kingdom she has set her sights upon.\"\n\nOn the floor, María had moved on from ribbons to demonstrating something with her hands—a clapping game of some sort. Catalina attempted to follow along, her small hands not quite coordinating properly, but her expression was one of fierce determination. When she failed to match the pattern, she did not cry or give up. She simply tried again.\n\nMaría, with the patience of a natural teacher, slowed the game down for her new friend.\n\nDon Pedro watched his daughter with an expression that mingled pride with something more complicated—perhaps the recognition that a girl with such spirit would find the constraints of noble womanhood difficult to bear.\n\n\"She asks me every week when she will be allowed to learn to ride properly,\" he said quietly. \"Not side-saddle, as ladies do. Properly, like a knight. I have run out of excuses.\"\n\n[STOP]"
        },
        {
          "role": "player",
          "text": "Are we witnessing our very own Joan of ark?\n\n\nI turn to the mother.\n\n\nAnd how is the mother faring, now that her daughter is so interested in playing knight?"
        },
        {
          "role": "gm",
          "text": "Doña Beatriz's smile carried the particular exhaustion of a mother who had long ago accepted that her child would not conform to expectations.\n\n\"Your Majesty, I have learned that God sends us the children we need, not the children we expect.\" She glanced at María, who was now showing Catalina how to make a fist properly—an alarming development. \"When she was three, she refused to learn embroidery. She said the needle was too small to be a useful weapon. When she was four, she asked why her brothers were taught letters and she was not. When she was five...\"\n\n\"When she was five,\" Don Pedro interjected dryly, \"she organized the kitchen children into an army and laid siege to the henhouse. We lost six chickens before the assault was repelled.\"\n\nDoña Beatriz sighed. \"I have tried to teach her the womanly arts, Your Majesty. She can sew—when she chooses to. She can dance—though she prefers to lead. She has a fine singing voice, which she uses primarily to compose battle hymns.\"\n\nShe looked at her daughter with an expression that was equal parts exasperation and fierce, protective love. \"I confess I do not know what future awaits a girl such as María. She will not be content with an ordinary marriage, managing a household while her husband rides to war. But what else is there for a woman of noble birth?\"\n\nMaría had apparently decided that Catalina's education in combat was progressing well. She stood up and demonstrated a lunge she had clearly observed from watching her brothers' training. Catalina watched, rapt, then attempted to copy it—wobbling dangerously before sitting down hard on her bottom.\n\nShe did not cry. She got back up and tried again.\n\nDoña Beatriz watched the princess with new interest. \"It seems Her Highness shares some of my daughter's... determination.\"\n\n[STOP]"
        },
        {
          "role": "player",
          "text": "Catalina seems to be in good company. Can I leave her with Maria for a moment while I meet with the other guests? I ask the mother."
        },
        {
          "role": "gm",
          "text": "Doña Beatriz's eyes widened slightly—the honor of being entrusted with the princess, even for a short while, was not lost on her. She recovered quickly, inclining her head with genuine warmth.\n\n\"Of course, Your Majesty. María will be gentle with her, I promise. For all her wildness, she is protective of those smaller than herself.\" She smiled. \"She once stood guard over a nest of fallen sparrows for three days until they were strong enough to fly.\"\n\nDon Pedro straightened almost imperceptibly—this gesture of trust from the king had not escaped his notice either. Whatever coolness had existed between House Velasco and the crown, this moment had complicated it.\n\n\"We are honored, Your Majesty,\" he said, and for the first time, the words did not sound like mere formula.\n\nMaría, sensing something important was happening, looked up from her instruction of Catalina. Her mother leaned down and whispered something in her ear. The girl's face became very serious.\n\n\"I will protect her,\" María announced solemnly to Juan, as though accepting a sacred commission. \"No one will hurt her while I am here.\"\n\nCatalina, unaware that arrangements were being made regarding her custody, had found the remaining ribbons in María's hair and was attempting to liberate them. María bore this assault on her coiffure with the stoic patience of a knight enduring hardship for a noble cause.\n\nDoña Beatriz moved to sit closer to the two girls, positioning herself as a watchful guardian.\n\n[STOP]\n\nJuan is now free to continue his rounds among the nobility without Catalina in his arms. Which family does he approach next?"
        },
        {
          "role": "player",
          "text": "I approach the other families and exchange pleasantries, occasionally pointing at Catalina and how she is playing with Maria. I make sure I greet every family at least briefly before returning to Catalina.\n\n\nDraft a d100 table to see how the nobles react to the entire interaction of me and CVatalina moving down to talk with the gathered nobles."
        },
        {
          "role": "gm",
          "text": "I've already read the NPC guide earlier in this chapter, so I have its principles fresh. Let me draft this roll.\n\nD100 Roll: Noble Reaction to Juan's Unconventional Conduct\n\nContext:\nJuan has broken protocol significantly by:\n\nLeaving the high table to circulate among guests (kings don't do this)\n\nCarrying his daughter personally throughout\n\nSitting down with families as near-equals rather than receiving them\n\nAsking after their personal affairs and family welfare\n\nLeaving Catalina with the Velasco family (a house with historical grievances)\n\nMaking a complete circuit of all noble families present\n\nThis is a CHAOS ROLL — measuring the collective reaction of the Castilian nobility to this unprecedented display.\n\nSUCCESS FACTORS (Reasons Nobles React Positively)\n\nHumanizing Effect — Juan appears as a father, not just a king. Catalina's presence softens every interaction. Hard to maintain political resentments when a toddler is declaring things \"pretty.\"\n\nPersonal Attention — Every family received direct acknowledgment from the king. This is enormously flattering. Most nobles spend years trying to get five minutes with their monarch.\n\nDemonstrated Trust — Leaving Catalina with the Velascos—a family with historical grievances against Álvaro—signals Juan trusts them. This is a powerful gesture of reconciliation.\n\nTiming — The feast celebrates the christening of an heir. Emotions are already warm and celebratory. Juan's behavior fits the familial theme of the occasion.\n\nRecent Prestige — Juan conquered Granada, completed the Reconquista, established unprecedented charitable works. His reputation is at its peak. Unconventional behavior from a successful king reads as confidence, not weakness.\n\nMemory of Isabel — Many nobles remember Isabel carrying Catalina similarly. Juan continuing this practice honors his dead wife. This resonates emotionally.\n\nFAILURE FACTORS (Reasons Nobles React Negatively)\n\nBreach of Protocol — Kings do not circulate at feasts. This breaks centuries of established custom. Some traditional nobles may see this as undignified or improper.\n\nSuspicion of Motive — Cynical nobles may wonder what Juan wants. Is this manipulation? Is he identifying enemies? Is he testing loyalties?\n\nWhispers of Instability — The court already worried about Juan's mental state after Isabel's death. Unusual behavior—even positive unusual behavior—may rekindle those concerns.\n\nFavoritism Concerns — Juan spent more time with some families than others. Those who received only brief greetings may feel slighted compared to the Mendozas, Manriques, and Velascos.\n\nVelasco Implications — Leaving Catalina with the Velascos specifically may anger Álvaro's supporters or create impression Juan is distancing himself from his Constable.\n\nPrecedent Concerns — If the king circulates at feasts, nobles must now wonder if they're expected to be \"on\" the entire time rather than relaxing among their own.\n\nD100 Table\n\nRoll\nOutcome\n01-10\nBackfire — Concerns Amplified. The unconventional behavior rekindles whispers about Juan's mental state. \"First the speech about glimpses of heaven, now this,\" nobles murmur. Some interpret the circuit as manic energy, not warmth. The Velasco gesture is seen as slight to Álvaro. Overall impression: the king is becoming unpredictable, possibly unstable. Álvaro will hear troubling reports.\n11-20\nMixed Reception — Confusion Dominates. Nobles don't know what to make of it. Some are touched, others suspicious, most simply bewildered. The gesture doesn't land cleanly because it's so far outside expectations. No lasting damage, but no real benefit either. The story that spreads is \"the king did something strange at the baptism feast\" without clear interpretation.\n21-35\nPolite Appreciation — Surface Only. Nobles respond correctly in the moment—they're not fools—but privately wonder about motivations. \"Very gracious of His Majesty,\" they say, while thinking \"what did he want?\" The warmth doesn't penetrate to genuine relationship-building. Protocol has been breached, but not catastrophically. Life continues as before.\n36-50\nGenuine but Limited Warmth. The families Juan spent significant time with (Mendoza, Manrique, Velasco) are genuinely touched. Others who received only brief acknowledgment appreciate the gesture but don't feel transformed by it. Overall positive, but the effect is uneven. The Velasco gesture specifically is noted and appreciated by that house.\n51-65\nBroad Positive Reception. Most nobles interpret the circuit as Juan showing he values them as people, not just political pieces. The combination of military glory, charitable works, and personal warmth creates a compelling image. Stories spread of the king feeding his daughter at the high table, asking after grandsons, letting Catalina play with the Velasco girl. Juan's reputation for humanity grows.\n66-80\nStrongly Positive — Loyalty Deepened. The gesture lands powerfully. Nobles feel seen and valued by their king in a way they never expected. The Velasco situation specifically begins healing old wounds—Don Pedro tells his household that the king trusted them with his daughter. Families who had been neutral or cool toward Juan find themselves warming. This will be remembered.\n81-90\nTransformative — Stories for Generations. The night becomes legendary. For years afterward, nobles will tell their children: \"I was there when King Juan walked among us with Princess Catalina in his arms. He sat with us. He asked after our families. He trusted us with his daughter.\" The gesture transcends politics and becomes part of Juan's personal mythology. Houses that had grievances find them harder to maintain against a king who held their children's hands.\n91-100\nWatershed Moment — Noble Culture Shifts. Not only does Juan's reputation soar, but his behavior begins influencing how Castilian nobility think about kingship itself. Younger lords wonder if they too should be more accessible to their vassals. The rigid hierarchies of the court soften slightly. The Velasco reconciliation becomes a model for how old feuds might be buried. Juan has inadvertently begun reshaping the relationship between crown and nobility—not through decree, but through example.\n\nProbability Assessment\n\nGiven:\n\nJuan's enormous prestige from Granada\n\nThe emotional context of the baptism\n\nThe genuine warmth of the interactions described\n\nBut also the legitimate concerns about protocol and stability\n\nThe approach was risky but well-executed. Catalina's presence defused potential awkwardness. The Velasco gesture was particularly astute. I would weight this toward positive outcomes—perhaps 40+ for genuine warmth, with small but real risk of backfire.\n\nReady to roll when you are, Sicco."
        },
        {
          "role": "player",
          "text": "rolled 87"
        },
        {
          "role": "gm",
          "text": "The dice speak magnificently.\n\nThe Night That Would Be Remembered\n\nJuan completed his circuit as the candles burned low—pausing at every table, exchanging words with lords great and minor, occasionally gesturing toward where Catalina sat with María Velasco, the two girls now thoroughly absorbed in some game involving the remnants of María's ribbons and a bread roll that had been conscripted into service as a castle under siege.\n\nBy the time he returned to the Velasco table, the feast had transformed around him. The formal stiffness of the early hours had dissolved entirely. Nobles who would normally watch each other with careful political calculation were laughing together, sharing wine, their children mingling in ways that would have been unthinkable at the rigid high table arrangement.\n\nCatalina looked up as her father approached. Her gown was now comprehensively ruined—wine stains had joined the gravy, and somewhere she had acquired a smear of honey across one cheek. María's hair had been entirely liberated from its braids, forming a wild halo around her serious face.\n\n\"Papa,\" Catalina said, raising her arms to be picked up. Then, with the solemnity of a diplomat announcing a treaty: \"Friend.\"\n\nShe pointed at María.\n\nMaría stood very straight, like a soldier awaiting inspection. \"She did not cry once, Your Majesty. Not even when she fell. She is very brave.\"\n\nDon Pedro Velasco watched this exchange with an expression Juan had not seen on the man's face before—something unguarded, almost soft. When Juan lifted Catalina into his arms, Don Pedro spoke quietly.\n\n\"Your Majesty. I... thank you. For trusting us with her.\"\n\nWhat Spread From That Night\n\nIn the days that followed, the story traveled.\n\nIt traveled first through the noble households that had attended—servants gossiping with servants, wives writing to sisters, sons telling fathers who had been too ill to make the journey. By the end of October, there was hardly a noble house in Castile that had not heard some version of the tale.\n\nThe king left the high table. He carried the princess himself. He sat with the Mendozas and asked after their harvests. He spoke with old Don Pedro Manrique about the north. He left his daughter—the Infanta herself—with the Velascos while he greeted every family present.\n\nThe details varied in the telling, as such things do. Some versions had Juan weeping as he held Catalina. Others had him challenging young nobles to dueling contests. One particularly creative account, which surfaced in Seville, claimed the princess had delivered a speech in perfect Latin.\n\nBut the core remained consistent: the king had walked among them as a man, not merely as a monarch. He had shown them his daughter. He had trusted them with her.\n\nFor houses that had long supported Juan—the Mendozas, the Guzmáns, the loyalists who had stood with him against the Infantes—the night confirmed what they already believed. Their king was worthy of their loyalty.\n\nFor houses that had been neutral or cautious—hedging their bets, waiting to see which way the winds blew—the night complicated their calculations. It was difficult to maintain careful political distance from a king who had asked after your grandson's health, who had let your daughter play with his.\n\nAnd for the Velascos—that proud house that had nursed grievances since Álvaro de Luna claimed the Constableship—the night was something else entirely.\n\nDon Pedro returned to Burgos in late October and gathered his household. His wife would later tell the story to her sister in a letter that survived in family archives:\n\n\"Pedro stood before us and said: 'The king trusted us with his daughter. Not the Mendozas, who have his favor. Not the Luna faction, who have his ear. Us. He looked at María playing with the princess and he smiled, and he asked my wife how she fared, and he left his child in our care while he greeted lesser houses.' Then Pedro said something I never thought to hear from him: 'Perhaps I have been wrong about this king. Perhaps Castile has been given something we did not expect.'\"\n\nThe Velasco grudge did not vanish overnight. Old wounds run deep, and Álvaro de Luna remained Constable. But something had shifted—a door opened that had been locked for years.\n\nThe Return to the High Table\n\nJuan carried Catalina back through the hall as the feast wound toward its end. She was asleep before he reached the dais, her head heavy on his shoulder, her breathing slow and even. The honey smear on her cheek had transferred to his doublet. He did not care.\n\nQueen Leonor watched him approach with eyes that glistened in the candlelight.\n\n\"You are so like her,\" she said softly as Juan took his seat, settling Catalina against his chest. \"Isabel did the same thing at her brother's wedding in Lisbon. Carried her youngest cousin through the feast, introduced her to everyone, refused to let the nurses take her. Her mother was furious. Said it was undignified.\"\n\nShe reached out and touched Catalina's sleeping head, her aged hand gentle.\n\n\"Isabel said dignity was less important than love. I see she chose her husband well.\"\n\nAlfonso, who had watched the entire circuit with keen interest, raised his cup.\n\n\"To the King of Castile,\" he said, loud enough for nearby tables to hear. \"Who conquers kingdoms with his sword and hearts with his daughter.\"\n\nThe toast was taken up across the hall.\n\nDoña Beatriz appeared at Juan's elbow some time later.\n\n\"Your Majesty. Shall I take her now? The nurses are waiting.\"\n\nCatalina slept on, oblivious to the politics and emotions swirling around her. She had made a friend tonight. She had helped her father do something he could not have done alone.\n\n[STOP]\n\nCatalina awaits transfer to her nurses, or whatever else Juan wishes. The feast is winding down. The night has become something that will be remembered for generations."
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_1433_00432",
      "book": 2,
      "chapter": "2.12",
      "date": "1433-10-16",
      "end_date": "1433-11-09",
      "type": "personal",
      "summary": "The weeks between the baptism and Lucia's arrival settle into domestic routine. Juan spends mornings with Catalina and hours in the nursery with Fernando. The Portuguese ladies find their footing; Dona Leonor catches the eye of a young Guzman knight. Alfonso departs October 20 with the 40,000 florins, the fleet sails to Valencia. Diplomatic messages to Genoa and Milan receive expected responses: cool neutrality. Queen Leonor returns to Portugal, worried about King Joao's health. A dispatch from Sotomayor in Constantinople confirms the vanguard is established and wall repairs underway. Word arrives that Lucia's delegation has crossed the Pyrenees.",
      "characters": [
        "juan_ii",
        "catalina_de_castilla",
        "alvaro_de_luna",
        "dona_beatriz",
        "alfonso_v",
        "gomez_de_sotomayor"
      ],
      "factions_affected": [],
      "location": "Toledo",
      "tags": [
        "personal",
        "domestic",
        "family",
        "diplomatic",
        "transition",
        "alfonso_departure",
        "constantinople"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "I finish the feast and spend as much time with Catalina and Fernando as possible as we wait for my bride to arrive."
        },
        {
          "role": "gm",
          "text": "The Weeks Between\n\nThe days following the baptism settled into a rhythm Juan had rarely known as king—domestic, quiet, almost ordinary.\n\nHe took breakfast with Catalina each morning in the small solar adjoining his chambers, away from the formality of the great hall. She had developed firm opinions about food: bread was acceptable, eggs were suspicious, honey was essential. Juan learned to negotiate with a nineteen-month-old over the consumption of vegetables, a campaign that proved more challenging than several battles he had fought.\n\n\"Catalina. One bite of carrot.\"\n\n\"No.\"\n\n\"For Papa?\"\n\n\"No.\"\n\n\"For... the horse? The horse wants you to eat the carrot.\"\n\nA long, suspicious stare. Then, grudgingly, one bite. Victory.\n\nFernando was easier, in the way of infants—his needs were simple and immediate. Hungry. Tired. Wet. Content. Juan spent hours in the nursery, watching his son sleep, marveling at the smallness of his fingers. Sometimes he held the boy against his chest and simply breathed, feeling the tiny heartbeat against his own.\n\nDoña Beatriz observed these visits without comment, though Juan caught her smiling sometimes when she thought he wasn't looking.\n\n\"He has Isabel's nose,\" she said one afternoon, as Juan cradled Fernando by the window. \"She always hated her nose. Said it was too strong for her face. But on him...\"\n\n\"It suits him,\" Juan agreed.\n\n\"It suited her too. She just couldn't see it.\"\n\nThe Portuguese ladies had found their footing in the weeks since Juan's gift of dowries. Doña Leonor de Almeida had caught the eye of a young knight from the Guzmán household—nothing formal yet, but there were glances across the hall at meals, conversations that lasted longer than courtesy required. Doña Inês remained quiet and watchful, but she smiled more easily now. Even young Doña Filipa had stopped weeping daily, though she still visited Isabel's tomb in the cathedral every Sunday.\n\nThey doted on the children. Fernando had four Portuguese voices singing him lullabies, four pairs of hands ready to soothe his cries. Catalina had learned several Portuguese words—obrigada, bonita, não—and deployed them with the strategic precision of a natural diplomat.\n\nMatters of State\n\nThe kingdom did not pause for domestic tranquility, of course. Álvaro brought reports each afternoon, and Juan attended to them between nursery visits and meals with Catalina.\n\nAlfonso's Departure: The King of Aragon left Toledo on October 20th, sailing from Santander with the forty thousand florins Juan had provided. His parting words: \"Finish what we started. Naples by spring, then Constantinople together.\" The Castilian fleet—four carracks including the Princess Catalina—sailed with him as far as Valencia, where they would anchor through the winter as planned, a visible reminder to Genoa of Castile's naval reach.\n\nThe Diplomatic Messages: Álvaro's carefully crafted letters to Genoa and Milan departed in late October. The Genoese response, when it came, was coolly correct—they acknowledged Castile's \"interest\" in Mediterranean affairs and expressed hope for \"continued peaceful commerce.\" Milan's Visconti sent a longer reply, full of flattery and empty of commitment. Álvaro judged both responses as expected: neither power would interfere with Alfonso's campaign, but neither would openly support it either.\n\nQueen Leonor's Return: Juan's mother-in-law departed for Portugal on October 22nd, worried about João's declining health. She extracted promises: that Catalina would learn Portuguese, that Fernando would know his grandmother's stories, that Juan would come to Lisbon when the time came. \"You are still my son,\" she told him at parting. \"Isabel's death did not change that.\"\n\nConstantinople Correspondence: A brief message from Sotomayor arrived via Venetian courier—the vanguard was established, the walls were being repaired, morale had improved with Castilian presence. A fuller report would follow. The Emperor sent his personal gratitude and renewed his request for Juan's visit in spring.\n\nEarly November\n\nThe leaves had fallen from Toledo's trees and the first cold winds swept down from the Guadarramas when word came that the delegation from Ferrara had crossed the Pyrenees.\n\nDon Íñigo's courier reported their progress: Lucia d'Este traveled in a covered litter, accompanied by her Italian household, moving at the measured pace appropriate for a future queen. They had encountered no difficulties. The weather had held. They would reach Toledo within the week.\n\nJuan received this news in the nursery, Fernando asleep in his arms.\n\n\"Within the week,\" he repeated.\n\nÁlvaro, who had brought the message personally, studied his king's face. \"Shall I begin preparations for her reception, Your Majesty? The appropriate ceremonies, the—\"\n\n\"Yes. But...\"\n\nJuan looked down at his son, then toward the door that connected to Catalina's room, where Doña Beatriz was putting the princess down for her afternoon rest.\n\n\"She asked to meet me privately first. Before any formal announcement. See that it happens.\"\n\nÁlvaro nodded slowly. \"And if she... if the meeting does not go well?\"\n\n\"Then we will discover that together.\" Juan shifted Fernando slightly, settling the boy more comfortably. \"She is coming to see if my eyes match my letter, she said. I intend to show her that they do.\"\n\n[STOP]\n\nLucia d'Este will arrive in Toledo within days. Juan has requested that her wish for a private meeting be honored before any formal ceremonies.\n\nShall we proceed to her arrival?"
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_1433_00433",
      "book": 2,
      "chapter": "2.12",
      "date": "1433-11-05",
      "end_date": "1433-11-09",
      "type": "personal",
      "summary": "Juan prepares for Lucia's arrival. He commissions a new engagement ring from royal jeweler Master Rodrigo de Avila: an elegant slender gold band with a round sapphire held in a flower-petal setting with seed pearls, designed in the Ferrarese naturalistic style. Alvaro arranges the private meeting space (the small solar overlooking the garden), a selection of Castilian wines to challenge Lucia's claim of Italian superiority, Ferrarese delicacies, and a dinner for two. Juan also arranges for a garden walk. The ring is delivered November 8th.",
      "characters": [
        "juan_ii",
        "alvaro_de_luna"
      ],
      "factions_affected": [],
      "location": "Toledo",
      "tags": [
        "personal",
        "preparation",
        "ring",
        "proposal",
        "lucia_deste"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "Remember to NEVER generate dialogue or action for Juan. Instead just stop.\n\n\nMake sure there is a wide selection of Castillian wine available for our first meeting. I want to surprise her.\n\n\nAlso, is it appropriate for me to ask her to marry me? Can I present her with a ring when I do? I would rather she accept me as I am than this would be an arranged marriage."
        },
        {
          "role": "gm",
          "text": "Álvaro considered the question carefully, his expression thoughtful.\n\n\"Your Majesty raises an interesting point of protocol.\" He paused, organizing his thoughts. \"Technically, the marriage has already been agreed. The Marquess of Ferrara has given his consent. The papal blessing has been secured. The Lady Lucia herself has accepted the match in principle. The betrothal documents await only formal signature.\"\n\nHe glanced at the sleeping Fernando, then back to Juan.\n\n\"However... what Your Majesty proposes is not without precedent. When a formal arrangement exists but the bride and groom have not yet met, there is a tradition—particularly in the Italian courts—of the groom 'confirming' the arrangement with a personal proposal. It transforms a diplomatic transaction into something more... personal. The ring would be appropriate. Expected, even.\"\n\nÁlvaro permitted himself a small smile. \"The Lady Lucia's letter suggested she wished to be treated as a person, not a 'broodmare,' I believe the reports said. A personal proposal, freely given despite the existing arrangement, would signal exactly that. You are not claiming her because a contract entitles you to her. You are asking her to choose you, even though she has already agreed.\"\n\nHe stroked his beard. \"It is, if I may say so, rather romantic. The Italian courts will approve. The troubadours will compose verses about it. And if her letter is any indication of her character, the Lady Lucia herself will appreciate the gesture enormously.\"\n\nRegarding the wine, Álvaro nodded. \"I will ensure a selection of Castile's finest is available—Ribera del Duero, the whites from Rueda, perhaps some of the sweeter wines from Málaga if we can procure them in time. She declared Castilian wine inferior to Italian.\" A rare glint of competitive pride crossed his face. \"We shall see about that.\"\n\n[STOP]\n\nIs there anything else Juan wishes to arrange for Lucia's arrival and their first private meeting?"
        },
        {
          "role": "player",
          "text": "Great. And I want a nice and berautiful and elegant ring ready for me to present to her."
        },
        {
          "role": "gm",
          "text": "Álvaro nodded, already making mental notes.\n\n\"I shall consult with the royal jeweler immediately, Your Majesty. We have several options.\"\n\nHe considered for a moment. \"There is a ring in the treasury that belonged to your grandmother, Queen Leonor of Aragon—a sapphire set in gold filigree, quite elegant. It carries the weight of dynasty but is not ostentatious. Alternatively, I can commission something new—there is time if the jeweler works quickly. A new ring might signify a new beginning, a fresh start rather than the weight of history.\"\n\nHe paused. \"There is also the matter of what stone would be most appropriate. Sapphires are traditional for royalty. Rubies signify passion and devotion. Emeralds are associated with fertility and new life—perhaps too presumptuous for a first meeting. Diamonds are rare and precious but perhaps too cold for a proposal meant to convey warmth.\"\n\nThe Constable glanced toward the window, calculating. \"If Your Majesty has a preference, I can ensure the ring is ready within three days—before the Lady Lucia's arrival. The jeweler can also resize any existing piece if needed, once we have some sense of the lady's hands.\" A delicate pause. \"Don Íñigo may have noted such details in his observations. He is thorough in such matters.\"\n\n[STOP]\n\nDoes Juan have a preference for the ring—an heirloom or something new? A particular stone?"
        },
        {
          "role": "player",
          "text": "Lets commission a new ring with an elegant sapphire stone. I want it to be elegant and slender, not big or heavy. I think her Italian nature will appreciate something refined."
        },
        {
          "role": "gm",
          "text": "Álvaro nodded with approval.\n\n\"An excellent choice, Your Majesty. I will instruct the jeweler this evening—an elegant band, slender and refined, with a sapphire of quality rather than mere size. Something that speaks of taste rather than wealth.\" He paused, a hint of admiration in his voice. \"The Italian courts prize such subtlety. A woman who grew up in Ferrara, surrounded by Este sophistication, will recognize the difference between a king who throws gold at a problem and one who considers what would actually please her.\"\n\nHe made a note on the small tablet he carried. \"I will have the jeweler present three designs for Your Majesty's approval tomorrow. The finished ring can be ready two days before the Lady Lucia's expected arrival—time enough for any final adjustments.\"\n\nA thought occurred to him. \"Shall I also arrange for the private meeting chamber to be prepared appropriately? Somewhere intimate but proper—perhaps the small solar overlooking the garden courtyard. Warm without being stifling, private without being improper. A fire, comfortable seating, the Castilian wines we discussed.\" He allowed himself a slight smile. \"And perhaps some Italian delicacies as well, so she does not think we are entirely provincial. Toledo's merchants can procure Ferrarese cheeses and sweetmeats if given sufficient notice.\"\n\n[STOP]\n\nAny other arrangements Juan wishes to make for the meeting?"
        },
        {
          "role": "player",
          "text": "I want to be able to go on a walk with her through the garden. So the solar seems appropriate. Set up a dinner for us with the wines present as well.\n\n\nThe next day, I review the three options."
        },
        {
          "role": "gm",
          "text": "The jeweler—Master Rodrigo de Ávila, whose family had served the Castilian crown for three generations—arrived at the appointed hour with a velvet cloth, which he spread carefully across the table in Juan's study. Upon it he placed three sketches, each rendered in precise detail with notes on measurements and materials.\n\nÁlvaro stood nearby as Master Rodrigo presented his work.\n\nThe First Design: \"The Lisbon\"\n\nA slender gold band with delicate twisted rope detailing along the edges. The sapphire—oval cut, approximately the size of a small fingernail—sat in a setting of six fine gold claws that allowed light to pass through the stone from multiple angles.\n\n\"Clean lines, Your Majesty,\" Master Rodrigo explained. \"The rope detail references maritime tradition—appropriate for a kingdom with growing naval ambitions. The setting elevates the stone without overwhelming it. This design emphasizes clarity and precision.\"\n\nThe Second Design: \"The Granada\"\n\nA band of white gold—rarer and more subtle than yellow—with faint geometric patterns etched into the metal, echoing the Moorish artistry of the Alhambra. The sapphire was rectangular, step-cut, set flush with the band rather than raised.\n\n\"This design speaks of Your Majesty's great achievement,\" the jeweler said. \"The Moorish influence is unmistakable but refined—conquest transformed into beauty. The flush setting makes it practical for daily wear. The lady would not catch it on fabric or scratch her children when holding them.\"\n\nThe Third Design: \"The Ferrara\"\n\nThe most delicate of the three—a whisper-thin band of gold with a round sapphire held in a setting shaped like an opening flower, tiny gold petals cradling the stone. Small seed pearls, almost invisible, dotted the band at intervals.\n\n\"I took the liberty of researching Este aesthetics, Your Majesty,\" Master Rodrigo said, a touch of pride in his voice. \"The Ferrarese favor naturalistic motifs—flowers, vines, organic forms. This design would feel familiar to a lady raised in that court, while the Castilian craftsmanship would demonstrate that we are their equals in refinement. The pearls symbolize purity and new beginnings.\"\n\nMaster Rodrigo stepped back, allowing Juan to examine the three sketches.\n\n\"Any of these can be completed within two days, Your Majesty. And of course, modifications are possible if none quite captures your vision.\"\n\n[STOP]"
        },
        {
          "role": "player",
          "text": "the ferrara. You have made a fine design master. You honour the crown with your craft.\n\n\nI wait for Este to arrive"
        },
        {
          "role": "gm",
          "text": "Master Rodrigo bowed deeply, his weathered face flushing with pride.\n\n\"Your Majesty is too kind. I will begin work immediately. The ring shall be ready the day before the lady's arrival, with time for any final adjustments.\"\n\nHe gathered his sketches with reverent care and departed, already muttering to himself about sapphire grades and pearl placement.\n\nNovember 9th, 1433\n\nThe days passed in quiet preparation.\n\nThe small solar was transformed according to Álvaro's instructions—fresh rushes on the floor mixed with dried lavender, a fire laid ready to light, comfortable chairs positioned to allow conversation while still permitting a view of the gardens through the arched windows. A table was set for two, intimate but not improper, with candles that would cast warm light as evening fell.\n\nThe wines arrived: a robust red from Ribera del Duero, a crisp white from Rueda, a golden sweet wine from Málaga, and—at Álvaro's insistence—a rare vintage from a monastery near Burgos that he declared \"capable of silencing any Italian skepticism.\"\n\nFerrarese cheeses and sweetmeats appeared courtesy of Toledo's Italian merchants, who had been handsomely compensated for their haste. The cooks prepared dishes that balanced Castilian tradition with lighter Italian influences—nothing too heavy, nothing too foreign.\n\nThe ring was delivered on November 8th. Master Rodrigo presented it himself, his hands trembling slightly as he opened the small box. The sapphire caught the light from the window, deep blue against the delicate gold petals, the seed pearls gleaming softly along the slender band.\n\nIt was, as Juan had requested, elegant. Refined. Something a woman of taste would appreciate.\n\nNovember 10th, 1433 — Late Afternoon\n\nThe outriders arrived first, bearing Don Íñigo's banner alongside the standard of House Este. Word spread through the Alcázar within minutes: the delegation had been sighted on the road from Madrid. They would reach Toledo's gates before sunset.\n\nJuan was in the nursery when Álvaro brought the news. Catalina was showing her father a wooden horse that one of the guardsmen had carved for her, explaining in her limited vocabulary that it was \"fast\" and \"pretty\" and \"mine.\"\n\n\"Your Majesty,\" Álvaro said from the doorway. \"She comes.\"\n\nThe protocol had been arranged carefully. The delegation would enter through the main gate with appropriate ceremony—crowds would gather, as crowds do. Don Íñigo would be formally received in the great hall, the success of his mission acknowledged before the court. The Lady Lucia would be shown to the apartments prepared for her, given time to rest and refresh herself after the long journey.\n\nAnd then, once darkness had fallen and the court's eyes were elsewhere, a servant would come to her door with a simple message: The King requests the pleasure of your company for a private supper, if the lady is not too fatigued from her travels.\n\nThe choice would be hers.\n\nJuan stood at the window of his chambers as the sun sank toward the western hills. Somewhere beyond the walls, a woman he had never met was approaching—a woman who had read his letter and declared she would see for herself whether his eyes matched his words.\n\nThe ring sat in its box on the table beside him. The solar was prepared. The wines were ready.\n\nAll that remained was the meeting itself.\n\n[STOP]\n\nShall we proceed to Lucia's arrival and the private supper?"
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_1433_00434",
      "book": 2,
      "chapter": "2.12",
      "date": "1433-11-10",
      "end_date": null,
      "type": "personal",
      "summary": "Lucia d'Este arrives in Toledo and meets Juan privately in the solar with Catalina, Fernando, and two Portuguese ladies present. Roll 33 (Cautious Interest): Lucia is impressed but maintains her reserve, questioning whether Juan's thoughtful preparations reflect genuine care or strategic calculation. Juan sends the children away and they share wine and honest conversation. He reveals the truth behind his 'divine madness' persona, his faith, and his vision of God's kingdom. They walk in the garden where Juan proposes on one knee with the sapphire ring. Roll 83 (Transcendent Moment): Lucia accepts with overwhelming emotion, placing the ring on her own finger. She vows to be his partner, his counsel, his queen, while warning she will never be quiet or biddable.",
      "characters": [
        "juan_ii",
        "catalina_de_castilla",
        "dona_beatriz"
      ],
      "factions_affected": [],
      "location": "Toledo",
      "tags": [
        "personal",
        "romance",
        "proposal",
        "lucia_deste",
        "first_meeting",
        "roll",
        "betrothal",
        "ring"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "I go to the prepared dinner and wait for Lucia there and take Catalina, Fernando and two Dona's with me. I want her to meet me and my children as well.\n\n\nI wait her her to come"
        },
        {
          "role": "gm",
          "text": "The solar glowed warmly in the candlelight as Juan settled into his chair. A fire crackled in the hearth, casting dancing shadows across the walls. Through the arched windows, the last light of autumn faded over the garden courtyard below.\n\nCatalina sat on a cushion near the fire, engaged in serious conversation with her wooden horse. She had been bathed and dressed in a clean gown of pale blue—a minor miracle of negotiation with the nurses—though her hair was already escaping its ribbons. Fernando slept in a cradle nearby, wrapped in white linen, his tiny chest rising and falling with the steady rhythm of infant dreams.\n\nDoña Beatriz sat a respectful distance away, close enough to assist with the children if needed, far enough to allow privacy. Doña Leonor de Almeida had taken the other position, her eyes bright with curiosity about the woman who would become her new queen.\n\nThe table was set for two, as planned. The wines stood ready—the Ribera del Duero already breathing, the white from Rueda chilled in a basin of cold water, the Málaga and the monastery vintage waiting in reserve. Ferrarese cheeses and Castilian delicacies occupied silver platters. Everything was elegant without being ostentatious.\n\nThe ring box rested in Juan's doublet, a small weight against his chest.\n\nCatalina looked up from her horse. \"Papa. Hungry.\"\n\nDoña Beatriz moved to offer the princess a small piece of bread, which Catalina accepted with the gravity of a diplomat receiving tribute.\n\nMinutes passed. The fire crackled. Fernando stirred in his sleep, made a small sound, then settled again.\n\nThen—footsteps in the corridor. A soft knock at the door.\n\nA servant's voice: \"Your Majesty. The Lady Lucia d'Este.\"\n\nThe door opened.\n\n[STOP]"
        },
        {
          "role": "player",
          "text": "Describe what Lucia looks like"
        },
        {
          "role": "gm",
          "text": "The woman who entered the solar was not what the poets would have described.\n\nShe was better.\n\nLucia d'Este was tall for a woman—nearly Juan's own height—with a carriage that spoke of years learning to move through Italian courts without apology. Her hair was dark, almost black, worn in the Ferrarese fashion: partially braided and pinned, partially falling in waves past her shoulders. It framed a face that was striking rather than merely pretty—high cheekbones, a strong nose, a mouth that seemed poised perpetually on the edge of either a smile or a cutting remark.\n\nBut it was her eyes that commanded attention.\n\nThey were grey-green, the color of the sea before a storm, and they swept the room with an intelligence that missed nothing. They noted the wine selection, the carefully chosen Ferrarese cheeses, the two Portuguese ladies positioned at a respectful distance. They found Catalina by the fire, still clutching her wooden horse and staring at the newcomer with frank curiosity. They lingered on the cradle where Fernando slept.\n\nAnd then they found Juan.\n\nShe wore a traveling gown of deep burgundy velvet, simpler than court dress but finely made, with silver embroidery at the sleeves and collar. A single pearl hung at her throat on a delicate chain. No other jewelry. No ostentation. She had chosen, it seemed, to present herself without artifice—to be seen as she was, not as a collection of ornaments.\n\nShe was twenty-three years old. She had crossed half of Europe to meet a man she knew only through a letter. And as she stood in the doorway, taking the measure of the King of Castile and his children, there was no fear in her expression.\n\nOnly curiosity.\n\nAnd perhaps—just perhaps—the faintest hint of approval at what she saw.\n\nCatalina broke the silence.\n\n\"Pretty,\" the princess declared, pointing at Lucia with the wooden horse.\n\n[STOP]"
        },
        {
          "role": "player",
          "text": "I walk up to her, take her hand and press a kiss on it.\n\n\nLucia, how wonderful to meet you. I am Juan and I would like you to meet my little Catalina and baby Fernando as well.\n\n\nI take her to Catalina and lift her up to bring her to eye-level with Lucia.\n\n\nDraft a d100 table to see how she reacts."
        },
        {
          "role": "gm",
          "text": "I've already read the NPC guide earlier in this chapter, so I have its principles fresh. Let me draft this roll.\n\nD100 Roll: Lucia's Reaction to First Meeting\n\nContext:\nThis is Lucia's first impression of Juan. She has traveled across Europe based on a letter. She is \"politically astute,\" \"sharp-tongued,\" and has \"legendary beauty.\" She requested this private meeting specifically to see if Juan's \"eyes match his letter.\" She wrote that she wanted to be treated as a person, not a possession.\n\nThis is a PERSUASION ROLL — evaluating how Juan's approach lands with Lucia specifically.\n\nThe Approach\n\nJuan has:\n\nGreeted her personally and kissed her hand (appropriate courtesy)\n\nIntroduced himself simply as \"Juan\" rather than with full titles\n\nImmediately introduced his children rather than making it about politics or dynasty\n\nBrought Catalina to eye-level with Lucia—showing his daughter as a person to meet, not a dynastic asset to inspect\n\nCreated an intimate, warm setting with the children present and the Portuguese ladies as chaperones\n\nIncluded the Castilian wines she challenged and Ferrarese delicacies from home\n\nSUCCESS FACTORS (Reasons Lucia Reacts Positively)\n\nThe Letter Was Honest — Juan's letter promised he would treat her as a person. His first action is to introduce his children personally, informally—exactly as his letter suggested he would.\n\nChildren Present — Including Catalina and Fernando signals this is about family, not just politics. It's vulnerable—he's showing her his heart before showing her his crown.\n\nSimple Introduction — \"I am Juan\" rather than a parade of titles. This matches the tone of his letter. He's being the man who wrote those words.\n\nCatalina's Presence at Eye-Level — Physically bringing Catalina to meet Lucia treats both of them as people who matter. It's charming and natural.\n\nThe Setting — Warm, intimate, thoughtful. The Ferrarese touches show he paid attention, made effort. Not trying to overwhelm her with Castilian grandeur.\n\nCatalina's \"Pretty\" Declaration — Children are honest. The princess's immediate approval is an unscripted endorsement.\n\nFAILURE FACTORS (Reasons Lucia Might React Negatively)\n\nOverwhelming First Impression — Meeting the children immediately might feel like pressure—\"accept me, accept my family, accept everything at once.\" Some women might prefer to meet the man first before the full domestic tableau.\n\nTesting Her — A cynical reading: Juan is using his children to manipulate her emotions. A politically astute woman might recognize this tactic and resent it.\n\nThe Weight of Stepmother — Confronting Fernando and Catalina immediately forces Lucia to reckon with what she's agreeing to—she will never be first in this family. Isabel's shadow looms.\n\nToo Informal — \"I am Juan\" might strike an Italian noblewoman as inappropriately casual. She comes from courts where protocol matters. Is he disrespecting her by abandoning formality?\n\nExhaustion — She has just traveled for weeks across Europe. She may have wanted a brief, formal greeting before the real meeting tomorrow.\n\nSharp-Tongued Nature — Lucia is described as sharp-tongued. She may find something to criticize regardless of how well Juan manages this—it's her nature to observe and comment.\n\nD100 Table\n\nRoll\nOutcome\n01-10\nCool Reception. Something is wrong—perhaps she's exhausted from travel, perhaps something about Juan disappoints in person, perhaps the immediate introduction of children feels like manipulation rather than warmth. She is polite but distant. Her sharp tongue finds something to critique. The evening will be awkward, the connection not yet formed. Much work remains.\n11-20\nGuarded Assessment. Lucia remains in \"evaluation mode\" throughout. She is courteous, appropriate, but gives nothing away. She watches Juan with those storm-grey eyes, measuring every word and gesture. She engages with Catalina politely but without warmth. She is not displeased, but she is not won over either. The letter was promising; the man remains to be proven.\n21-35\nCautious Interest. The approach lands acceptably. Lucia appreciates the informality but maintains her reserve—she did not travel across Europe to fall into anyone's arms on the first evening. She warms slightly to Catalina (children are hard to resist), asks appropriate questions about Fernando, but keeps Juan at a careful distance. A foundation, not a connection.\n36-50\nPleasant Surprise. Lucia expected a king; she found a father. The children's presence softens her defenses more than she anticipated. She engages genuinely with Catalina, comments favorably on the setting, appreciates the Ferrarese touches. Her sharp tongue emerges but playfully rather than critically. She is willing to be convinced. The evening may go well.\n51-65\nGenuine Warmth. Juan's approach matches his letter—this is the man she hoped to find. Lucia relaxes visibly, her political caution giving way to real engagement. She speaks to Catalina directly, asks to see Fernando closer, makes a wry comment about the wine selection that invites response. The connection begins to form. She is glad she came.\n66-80\nDelighted Recognition. \"Your eyes do match your letter,\" she might say, or something like it. Lucia finds exactly what she traveled across Europe hoping to find—a man who sees her as a person, who leads with his heart rather than his crown. Catalina's approval matters to her. The evening flows naturally into conversation, wine, genuine laughter. The match will be a good one.\n81-90\nImmediate Connection. Something clicks. Perhaps it's how Juan holds Catalina, or the simple \"I am Juan,\" or the thoughtfulness of the Ferrarese cheeses. Lucia's carefully maintained reserve crumbles faster than she expected. Her sharp tongue turns to wit rather than defense. She came prepared to evaluate; she finds herself instead simply enjoying. This is better than she dared hope.\n91-100\nExtraordinary Chemistry. Lucia came expecting to meet a king and judge whether she could tolerate the marriage. Instead she meets a man she actively wants to know better. Everything lands perfectly—the children, the setting, the approach. Her letter promised she would hold him to his words; she finds he has exceeded them. By evening's end, the political arrangement has transformed into something that feels, against all expectation, like the beginning of genuine partnership. Perhaps even love.\n\nProbability Assessment\n\nGiven:\n\nJuan's approach directly fulfills the promises of his letter\n\nThe children's presence is a risk but a genuine one—it shows authenticity\n\nLucia specifically asked to see if his \"eyes match his letter\"\n\nShe is politically astute enough to recognize sincerity when she sees it\n\nBut she is also sharp-tongued and naturally critical\n\nAnd she has just completed an exhausting journey\n\nThe approach is strong and thoughtful. It matches what Lucia explicitly requested. But she is not an easy woman to win over—her intelligence and wit suggest high standards. I would weight this toward positive outcomes, but with real variance possible.\n\nReady to roll when you are, Sicco."
        },
        {
          "role": "player",
          "text": "rolled 33"
        },
        {
          "role": "gm",
          "text": "The dice speak cautiously.\n\nLucia's eyes followed Catalina as Juan lifted the princess to meet her. The child still clutched her wooden horse, studying this stranger with the unfiltered intensity of the very young.\n\n\"Pretty,\" Catalina repeated, more firmly this time, as if ensuring the observation had been properly recorded.\n\n\"Thank you, small one,\" Lucia said. Her voice was lower than Juan might have expected—a warm contralto with the musical cadence of Italian vowels. She did not reach for Catalina, did not attempt to touch or hold her. She simply met the child's gaze with the same directness the princess offered.\n\n\"Horse,\" Catalina said, holding up her wooden toy for inspection.\n\n\"I see. A fine horse. Does he have a name?\"\n\nCatalina considered this question with great seriousness. \"Horse,\" she concluded.\n\n\"An honest name. I approve.\"\n\nThe exchange was pleasant enough, but something in Lucia's manner remained... contained. She turned from Catalina to glance at Fernando's cradle, her expression softening almost imperceptibly at the sight of the sleeping infant. But she did not ask to hold him. She did not move closer.\n\nWhen her storm-grey eyes returned to Juan, they carried the careful assessment of a woman who had not forgotten why she was here.\n\n\"You bring your children to our first meeting,\" she observed. It was not quite a question, not quite an accusation. Her tone was neutral—deliberately so. \"In Ferrara, such things would be handled by nurses until the marriage was secure. The children presented formally, once agreements were signed.\"\n\nShe moved further into the solar, her gaze taking in the prepared table, the wine selection, the Ferrarese cheeses. One eyebrow rose slightly at the latter—acknowledgment of the gesture, though whether she was pleased or merely noting the attempt at flattery remained unclear.\n\n\"You have gone to considerable trouble, Your Majesty.\" The formal address was pointed—a gentle correction to his simple \"I am Juan.\" \"The wines. The food from home. This room.\" She turned back to face him, Catalina still in his arms. \"I am trying to determine whether this is thoughtfulness or strategy. In my experience, the two often wear the same face.\"\n\nShe was not cold. She was not hostile. But the woman who had written that sharp, bold letter—who had declared she would hold him to his promises—was not about to melt at the first kind gesture. She had traveled across Europe on the strength of words on paper. Words were easy. She wanted to see what lay beneath them.\n\nDoña Beatriz shifted slightly in her seat, sensing the tension. Catalina, oblivious, had returned her attention to Horse and was making the wooden toy gallop through the air.\n\nLucia stood in the center of the solar, waiting.\n\n[STOP]"
        },
        {
          "role": "player",
          "text": "I give Catalina a kiss and give her to Beatriz and gesture them to take Fernando as well and leave us alone.\n\n\nI turn to Lucia.\n\n\nIt just felt right to meet you with my children as well. You were going to meet them anyway and I did not want to occupy your mind with questions about who and how they are. But you have now seen them and I have asked to be alone for now.\n\n\nCome, have a seat, you must be tired after such a long journey."
        },
        {
          "role": "gm",
          "text": "Catalina accepted the kiss and transfer to Doña Beatriz with only minor protest—\"Papa, Horse wants to stay\"—but a whispered promise of honey tomorrow morning settled the matter. The two Portuguese ladies gathered Fernando's cradle between them and withdrew quietly, closing the door with a soft click.\n\nThe solar felt different with just the two of them. Larger, somehow. The fire crackled. The wine waited.\n\nLucia watched the departure of the children with an expression Juan could not quite read. When the door closed, something in her posture shifted—a slight relaxation of the shoulders, perhaps, or simply the acknowledgment that the performance for observers was no longer necessary.\n\nShe moved to the chair Juan indicated, settling into it with the practiced grace of a woman who had spent her life in courts. But she did not immediately speak. Instead, she studied him for a long moment, her grey-green eyes taking his measure in the candlelight.\n\n\"Yes,\" she finally said. \"I am tired. Five weeks on the road, through mountain passes and autumn rains, sleeping in monastery guest houses and provincial inns.\" A faint smile touched her lips—the first real one he had seen. \"There was one inn near Toulouse where the bed had more inhabitants than I did. I shall be writing a strongly worded letter to someone, though I have not yet determined whom.\"\n\nShe glanced at the wine selection, then back at Juan.\n\n\"I was told Castilian wine is inferior to Italian. I was also told you are mad, that you speak to God directly, that you conquered Granada through divine intervention rather than military competence, and that your first wife died of a broken heart because you loved war more than her.\" Her tone was dry, matter-of-fact. \"I have learned to be skeptical of what I am told.\"\n\nShe gestured at the chair across from her.\n\n\"Sit with me, Your Majesty. Pour me some of this allegedly inferior wine. And tell me which of the rumors are true.\"\n\n[STOP]"
        },
        {
          "role": "player",
          "text": "I move over to the wine collection.\n\n\nWhat sort of wine do you like my lady? A strong red? A supple white? Or a sweet one?"
        },
        {
          "role": "gm",
          "text": "Lucia tilted her head slightly, considering the question with more seriousness than it perhaps warranted—or perhaps exactly the seriousness it deserved.\n\n\"That depends entirely on what I am drinking it for,\" she said. \"A strong red when I wish to feel bold. A white when I wish to think clearly. A sweet wine when I wish to remember that the world contains pleasures as well as duties.\"\n\nShe paused, her eyes meeting Juan's across the room.\n\n\"Tonight I am meeting a man who may become my husband. A man I know only through a letter and the reports of others—reports which, as I mentioned, have been contradictory at best.\" Her fingers traced the arm of her chair absently. \"I think I wish to think clearly. But I also wish to feel bold enough to ask the questions I came here to ask.\"\n\nA slight shrug, elegant even in its casualness.\n\n\"Perhaps you should choose for me, Your Majesty. It will tell me something about you—whether you wish me clear-headed or pliable, whether you pay attention to what I actually said or simply hear what you expect to hear.\"\n\nThe challenge was unmistakable, but there was something playful beneath it—a test, yes, but one she seemed to hope he would pass.\n\nThe fire crackled. The wines waited in their vessels—the robust Ribera del Duero, the crisp Rueda white, the golden Málaga, the monastery vintage that Álvaro had sworn could silence Italian skepticism.\n\n[STOP]"
        },
        {
          "role": "player",
          "text": "I take a glass and pour her a white Rueda to start with. And I pour one for me as well.\n\n\nWell, let me start from the beginning then. I have been king since I was a child. I always knew those around me were taking advantage of me, but what could I do? I was often a captive in my own palace. One day I decided that it must end. And I realized that I had to do something extraordinary and unexpected for me to take control of my kingdom. To truly be king.\n\n\nSo I went on a pilgrimage. Insane, since the realm was on the verge of rebellion. If I left but for a short while, the sharks would close in. But I had to try, so I gambled it all. I guess that is where the rumours started about me talking with God and all other nonsense. I indicated that I would leave on pilgrimage and would let the divine spirit guide me on my journey. I knew from the start that I had to go to Rome and ask for crusade. Only that would give me the authority to unite the realm not only under my rule, but it would also unite the kingdom against our common enemy.\n\n\nI had to rely on my divine guidance quite often for I went back to my palace to retrieve my father's sword, right at the moment when a rebellious plot was revealed. Maybe the divine inspired me to have someone signal to me when the rebels entered the meeting room or maybe the divine inspired me to actually want them to reveal themselves the moment they thought me gone. Or maybe both. Anyway, the result was that the rebels died an unfortunate death and my realm is now secure. And everyone thinks I am still the mad king who leaves to go on a pilgrimage while his nobles plot his downfall.\n\n\nI turn to her.\n\n\nBut there is another side as well. I really do take my faith very seriously and I want to make sure I never become an arrogant, heartless king I see some others become. I do ride out at the head of my knights in my white armour, knowing full well that I am a major target for every enemy lance and archer. I have learned to not be afraid and I gladly lay my life in God's hands. Now dont confuse this bravery with recklessness. I try not to be. But I know that if I can approach a fort alone and negotiate a surrender, purely by my own presence, I know I will save my men and that it's a risk worth taking.\n\n\nMore wine?"
        },
        {
          "role": "gm",
          "text": "Lucia had listened without interruption, her grey-green eyes fixed on Juan's face throughout. She held her wine glass but had barely touched it, too absorbed in his words to drink.\n\nWhen he offered more wine, she glanced down at her still-full glass, then back at him with a flicker of wry amusement.\n\n\"I have not yet tested this one, Your Majesty. You speak faster than I drink.\" She took a deliberate sip, letting the Rueda sit on her tongue for a moment before swallowing. Her eyebrows rose slightly—surprised, perhaps, though she did not comment on the wine's quality.\n\nShe set the glass down carefully.\n\n\"So. The madness is a mask. The divine inspiration is... partly genuine faith, partly political theater.\" She spoke slowly, processing. \"You let your enemies believe you a fool guided by heaven, while you arrange their deaths with precision. And you ride at the head of your knights not because you seek martyrdom, but because you have calculated that your presence saves more lives than your caution would.\"\n\nShe was quiet for a moment, one finger tracing the rim of her glass.\n\n\"In Ferrara, my uncle is considered a master of such games. He has survived assassination attempts, rival claimants, and the endless scheming of Milan and Venice by letting everyone underestimate him. He plays the simple soldier, the bluff condottiero, while his mind works three moves ahead.\" She looked up. \"I recognize the pattern. I am... familiar with the difference between what a ruler shows and what a ruler is.\"\n\nShe took another sip of wine—a longer one this time.\n\n\"But there is something I do not yet understand.\" Her voice was careful now, probing. \"You speak of faith genuinely. You speak of not wishing to become heartless. You established a charity of twenty-five thousand florins in your dead wife's name—not from the treasury, but from your personal fortune. You carried your daughter through a feast, introducing her to every noble house like she was a treasure rather than a political asset.\"\n\nShe leaned forward slightly.\n\n\"The mask I understand. The calculation I understand. But underneath it... is there actually a man who believes what he pretends to believe? Who loves what he appears to love?\" Her eyes searched his face. \"Or is that simply another layer of the performance?\"\n\n[STOP]"
        },
        {
          "role": "player",
          "text": "I look down at my glass.\n\n\nThat is what is so difficult to explain. Every time I speak about this, I risk people thinking me mad, delusional or... having messianic thoughts.\n\n\nI took into her eyes directly.\n\n\nWe live in this world Lucia. A world full of hunger, of pain, of injustice. But there is another world A world that is just, good and right. And every time we act not out of pride but out of generosity, when we act out of forgiveness and love instead of hate, we move our world just a little bit closer to God's kingdom on earth.\n\n\nI look down at the ground.\n\n\nI know we will never reach it Lucia. We never will, no matter how hard we try, there will always be enough greed and pride in the hearts of men to tear down every tower of goodwill. But we must try, for if we stop trying all is lost. It is in this struggle that we find out who we truly are, who we can be. How we can serve each other and God as well. And sometimes...when there is a special moment that belongs in His kingdom, I can see it. A true good deed. The prsence of God's kingdom in this world.\n\n\nIt is beautiful Lucia. It is something no priest can bestow or take away. God exists between two people doing good things. It is what I truly fight for and believe in. What guides my every action. How can I bring this world closer to God's kingdom.\n\n\nI smile up at her.\n\n\nHa! Or to put it more simply and without complicated rethoric; how can I make this world better."
        },
        {
          "role": "gm",
          "text": "The fire crackled in the silence that followed. Lucia did not move, did not speak. Her wine glass remained suspended halfway to her lips, forgotten.\n\nJuan had seen many reactions to his words over the years—confusion, suspicion, the careful blankness of courtiers who thought their king mad but dared not say so. He had seen Fray Hernando's troubled concern, Álvaro's pragmatic tolerance, the whispered worries of nobles who wondered if their monarch heard voices.\n\nLucia's reaction was none of these.\n\nHer eyes glistened in the candlelight. Not tears—not quite—but something had shifted behind them. The sharp assessment, the political calculation, the careful distance she had maintained since entering the room... all of it had cracked, just slightly.\n\nShe set down her wine glass with exaggerated care, as if she needed a moment to collect herself.\n\n\"My mother died when I was seven,\" she said quietly. Her voice had lost its performative edge. \"Fever. I remember very little of her, but I remember one thing she told me. She said: 'Lucia, the world is full of men who want things. Power, gold, women, land. Be wary of all of them. But if you ever meet a man who wants to make things better—truly better, not just better for himself—hold onto him. They are rarer than diamonds.'\"\n\nShe looked up at Juan, and for the first time, he saw her without armor.\n\n\"I have been in courts my entire life. I have watched my uncle navigate between predators. I have seen cardinals speak of God while counting their gold. I have heard princes quote scripture to justify atrocities.\" She shook her head slowly. \"I came here expecting to find another performer. A clever king with a good reputation and a talent for spectacle.\"\n\nShe was quiet for a long moment.\n\n\"I did not expect... this.\" She gestured vaguely—at him, at the room, at something she could not quite name. \"You actually believe it. Not as doctrine, not as politics. You see something. Something real.\"\n\nShe picked up her wine again, took a long drink, and let out a breath that was almost a laugh.\n\n\"My confessor in Ferrara would call what you describe heresy, you know. The presence of God between people, without the intercession of the Church? Dangerous talk.\" But she was smiling now—a real smile, unguarded. \"I think I like dangerous talk.\"\n\nShe leaned back in her chair, studying him with new eyes.\n\n\"You asked me which rumors were true. Now I ask you: the charity for the dowries, in your wife's name. The way you carried your daughter tonight. The way you speak of God's kingdom.\" She tilted her head. \"Was Isabel part of this? Did she see what you see?\"\n\n[STOP]"
        },
        {
          "role": "player",
          "text": "Where two or three of my number are gathered and my words are spoken, I am among you.\n\n\nHardly heresy I believe. Maybe those who deny God's presence are themselves the heretics.\n\n\nI look at Lucia with a smile.\n\n\nI am trying to help reform the church, did you know? There is only so much I can do and a few weeks at Basel almost drove me insane, but we try.\n\n\nIsabel...she was always very pious. In a very committed way. She was very young when we married, maybe some more years would have granted her more wisdom. But she had a faith so pure and convincing, we shared this vision yes. But it mostly involved the joy of our family. Becoming a father has been the most pure vision of God's kingdom I ever saw. I see it still when I look at Catalina and how she is curious and discovers the world.\n\n\nThe painting I had made of our wedding was meant to convey exactly that. The attainment of the kingdom of heaven through her."
        },
        {
          "role": "gm",
          "text": "Lucia listened, her fingers wrapped around the stem of her wine glass. When Juan spoke of Isabel—of her youth, her purity of faith, the joy of family—something flickered across her face. Not jealousy, exactly. Something more complicated.\n\n\"You loved her,\" she said. It was not a question. \"Not merely as a king loves a queen who does her duty. You loved her.\"\n\nShe was quiet for a moment, looking into the fire.\n\n\"I have been told many things about what to expect from royal marriage. Duty. Alliance. Children. Tolerance of mistresses. A shared table and separate beds.\" Her voice was dry but not bitter—simply factual. \"No one told me to expect a man who speaks of his dead wife with such tenderness. Who sees the kingdom of heaven in his daughter's curiosity.\"\n\nShe took another sip of wine, then set the glass down with decision.\n\n\"I am not Isabel, Your Majesty. I am not young, not pure, not... uncomplicated in my faith. I have read things my confessor would burn me for. I have asked questions that made my tutors stammer. I have a tongue that has gotten me into trouble more times than I can count.\" A wry smile. \"My uncle once said I would either marry a king or be locked in a convent, because no ordinary man would tolerate me.\"\n\nShe rose from her chair and moved to the window, looking out at the darkened garden below. The moonlight caught her profile—that strong nose, those high cheekbones.\n\n\"I came here to see if your eyes matched your letter. They do. More than I expected.\" She turned back to face him. \"But I need to know something else. Something the letter did not address.\"\n\nHer grey-green eyes held his steadily.\n\n\"If I marry you—if I become Queen of Castile, stepmother to your children, partner in this vision you speak of—what place will I hold? Will I be a companion in this work you describe? Will I have a voice, a role, a purpose beyond bearing heirs?\" She paused. \"Or will I be kept safe and comfortable while you ride off to Constantinople and Granada and wherever else God's kingdom calls you, waiting at home like a portrait on a wall?\"\n\n[STOP]"
        },
        {
          "role": "player",
          "text": "My apologies my lady. We have dwelled on the dead for long enough now. I know you are not Isabel, nor do I require or expect it. I would like to get to know you better.\n\n\nWould you like to have a walk with me in the garden?\n\n\nI offer her my hand."
        },
        {
          "role": "gm",
          "text": "Lucia looked at his offered hand for a moment. Then, unexpectedly, she laughed—a real laugh, warm and surprised.\n\n\"You are remarkable, Your Majesty. I ask you a direct question about my future role as your queen, and you invite me to walk in a garden.\" She shook her head, but she was smiling. \"In Ferrara, that would be considered an evasion. A deflection.\"\n\nShe stepped closer, but did not yet take his hand.\n\n\"But you are not evading, are you? You are telling me that such questions cannot be answered in a single evening. That you wish to know me before you promise me things you may not be able to give.\" Her eyes searched his face. \"That is either very wise or very infuriating. I have not yet decided which.\"\n\nShe glanced toward the window, where moonlight silvered the garden paths below. The autumn air would be cool but not cold. The leaves had mostly fallen, but the bones of the garden—the hedges, the stone paths, the fountain at its center—would be beautiful in the pale light.\n\n\"I have been in carriages and litters and monastery guest rooms for five weeks,\" she said. \"I have not walked anywhere simply for the pleasure of walking since I left Ferrara.\"\n\nShe placed her hand in his.\n\nHer fingers were cool from holding the wine glass, her grip firm and unhesitating. Up close, she smelled faintly of rosewater and travel dust—the latter a reminder that she had come to him straight from the road, without the hours of preparation most noble ladies would have demanded.\n\n\"Show me your garden, Your Majesty,\" she said. \"And perhaps while we walk, you might tell me what you actually want from a wife. Not what duty requires. Not what diplomacy demands.\" Her grey-green eyes held a challenge and an invitation, intertwined. \"What you want.\"\n\n[STOP]"
        },
        {
          "role": "player",
          "text": "I think God has given men and women different gifts and therefore different roles to play in the world. A king and a queen have different roles as well.\n\n\nI give her a playful push\n\n\nBeing queen of Castille can be quite exhausting, I must warn you. But now that I have gotten to know you a little bit, I think you will do just fine. Dont worry too much about what is expected of you as queen. Just do what feels right. It's what I do.\n\n\nA am quiet for a moment.\n\n\nYou know, me and my advisors discussed many potential brides, and the fact you have a sharp tongue is well known. That and your sharp mind was what really made it easy to think you would be a great queen. And also...Lucia, you must know that men cannot talk about you without mentioning your beauty as well. Not only are you as sharp and quick as I had been told, you are simply the most beautiful woman I have ever met. And that is the honest truth."
        },
        {
          "role": "gm",
          "text": "The playful push caught her off guard—her eyes widened for a split second before she caught her balance, a surprised laugh escaping her.\n\n\"Did you just—\" She stared at him with genuine astonishment. \"The King of Castile just pushed me. In a garden. Like a boy teasing a girl at a village fair.\"\n\nBut she was smiling, and something in her posture had shifted. The last remnants of courtly formality were crumbling.\n\nThey walked in silence for a moment, their footsteps soft on the stone path. The moonlight cast long shadows through the bare branches overhead. Somewhere, water trickled in a fountain.\n\nWhen Juan spoke of her sharp tongue being an asset rather than a liability, she glanced at him sidelong.\n\n\"My uncle told me it would be my downfall. That no man of consequence wants a wife who speaks her mind.\" A dry smile. \"I informed him that any man who could not tolerate my mind did not deserve the rest of me. He called me impossible. I thanked him for the compliment.\"\n\nBut when Juan spoke of her beauty—called her the most beautiful woman he had ever met—she stopped walking.\n\nFor a long moment, she said nothing. The moonlight caught her face, those grey-green eyes unreadable.\n\n\"Men have spoken of my beauty my entire life,\" she said quietly. \"They speak of it as if it belongs to them—as if my face is a painting hung for their pleasure, my body a territory to be claimed. They speak of it before they speak of anything else. Often, it is all they speak of.\"\n\nShe turned to face him fully.\n\n\"You spoke of my mind first. My tongue. You mentioned beauty last, almost as an afterthought.\" Her voice was strange—soft, wondering. \"Do you know how rare that is? How many men have courted me who could not tell you a single thing I had ever said, but could describe my eyes in fourteen different poems?\"\n\nShe stepped closer. Close enough that he could see the faint freckles across her nose that the candlelight inside had hidden.\n\n\"Isabel was fortunate,\" she said. \"To have been seen by you. Truly seen.\"\n\nShe was quiet for a heartbeat.\n\n\"I think... I think I would like to be seen like that too.\"\n\n[STOP]"
        },
        {
          "role": "player",
          "text": "I take her hand and press another kiss on it.\n\n\nI did not want to lie to you and be honest from the start. Being queen will not be easy. I am very demanding of myself and those around me. That unually involves me moving around a lot. Next spring I will leave for Rome and then Constantinople for example. And this will be a good example of what being queen will mean.\n\n\nI have a flagship, specially designed to accomodate a queen and her handmaidens. If you should want it, you can come with me. See the eternal city. Or if you prefer to stay in Toledo, you can choose to do so as well. You will have full freedom to be regent-queen in my absence should you desire it. You dont have to decide now, by the way. What I mean to say is...I hope for us to be a team."
        },
        {
          "role": "gm",
          "text": "Lucia's breath caught slightly at his words. She did not pull her hand away.\n\n\"You would take me to Constantinople?\" Her voice was barely above a whisper. \"You would let me stand beside you as you meet the Emperor of the Romans? See the Hagia Sophia?\"\n\nShe shook her head slowly, as if trying to absorb what she was hearing.\n\n\"In Ferrara, my aunt—my uncle's wife—has not left the city walls in eleven years. She manages the household. She bears children. She waits.\" There was no bitterness in her voice, only a kind of wonder at the contrast. \"When I asked her once if she wished to travel with my uncle on his campaigns, she looked at me as if I had suggested she sprout wings and fly.\"\n\nShe turned her hand in his, so that their fingers intertwined. It was a deliberate gesture—a choice.\n\n\"A team,\" she repeated. \"Not a king and his ornament. Not a husband and his broodmare.\" Her grey-green eyes searched his face in the moonlight. \"You mean this. You actually mean this.\"\n\nShe was quiet for a long moment, their hands still joined, the garden silent around them.\n\n\"I have spent my whole life preparing for a cage,\" she said softly. \"A gilded cage, yes. Comfortable. Safe. But a cage nonetheless. Every lesson, every expectation, every warning from my uncle and my tutors—all of it preparing me to be kept. To smile and nod and produce heirs and never, ever want more.\"\n\nShe stepped closer, close enough that he could feel the warmth of her despite the cool night air.\n\n\"And now you stand here in a moonlit garden and offer me... partnership. Purpose. A ship designed for a queen.\" A small, almost disbelieving laugh escaped her. \"Either you are the most extraordinary man I have ever met, or this is an elaborate trap I am too tired to perceive.\"\n\nShe looked up at him.\n\n\"Tell me it is not a trap, Juan. Tell me you mean what you say.\"\n\n[STOP]"
        },
        {
          "role": "player",
          "text": "O but it is a trap Lucia! And I am about to spring it.\n\n\nI take out the box with the ring.\n\n\nAfter hearing about you from others and now after meeting you in person, I know that you are every bit the sharp and competent queen I would hope for. But you must choose me as well.\n\n\nI kneel before her and take her hand.\n\n\nWhat I ask of you is not easy. Not only will you work together with me to make Castille better, you will also become step-mother to Catalina and Fernando. Others will look to your every move and I will be called to war often.\n\n\nI promise to not only be a good husband but to treat you as partner. I will always value your council and will always trust you. I will protect you, shield you and keep you safe.\n\n\nI open the box and show her the ring.\n\n\nWould you despite everything be my wife Lucia?\n\n\nDraft a d100 table to see how she reacts"
        },
        {
          "role": "gm",
          "text": "I've already read the NPC guide earlier in this chapter, so I have its principles fresh. Let me draft this roll.\n\nD100 Roll: Lucia's Reaction to Juan's Proposal\n\nContext:\nThis is the culmination of the evening. Juan has:\n\nBeen honest and vulnerable about his faith, his past, his vision\n\nListened to her concerns and questions\n\nTreated her as an equal throughout\n\nOffered her genuine partnership, including travel to Constantinople\n\nAcknowledged the difficulties she would face as queen\n\nKnelt before her—a king kneeling to a marquess's niece\n\nPresented a ring specifically designed to appeal to her Italian sensibilities\n\nAsked her to choose him, despite the arrangement already being agreed\n\nThis is a PERSUASION ROLL — evaluating how Juan's proposal lands with Lucia after everything that has passed between them tonight.\n\nThe Approach\n\nJuan has:\n\nMade a playful joke (\"O but it is a trap!\") that breaks tension and shows personality\n\nKnelt before her—an extraordinary gesture of humility from a king\n\nBeen completely honest about the difficulties ahead (stepchildren, public scrutiny, his absences for war)\n\nMade specific promises (partnership, valuing her counsel, trust, protection)\n\nFramed it as her choice—not a foregone conclusion despite the diplomatic arrangement\n\nPresented a beautiful, thoughtfully designed ring that reflects her Italian heritage\n\nSUCCESS FACTORS (Reasons Lucia Reacts Positively)\n\nThe Evening's Arc — They have moved from careful distance to genuine connection. Each exchange has built trust. The proposal is the natural culmination, not a sudden leap.\n\nThe Kneeling — Kings do not kneel. This gesture alone communicates more than any words could. He is placing himself below her, asking rather than claiming.\n\nThe Ring — Master Rodrigo's Ferrara design shows Juan paid attention, made effort, thought about her specifically. It's not a generic royal ring but something made for Lucia.\n\nHonesty About Difficulties — He hasn't promised her an easy life. He's been clear about the challenges. This builds trust—he's not selling her a fantasy.\n\nThe Choice Framework — Despite the diplomatic arrangement, he's asking her to choose. This directly addresses her deepest concern—being treated as a person, not property.\n\nHer Own Words — She said she wanted to be \"seen.\" Everything tonight has shown her that Juan sees her. The proposal confirms it.\n\nEmotional Momentum — She already admitted he is extraordinary, that she wants to be seen by him, that she came prepared for a cage and found something else entirely.\n\nFAILURE FACTORS (Reasons Lucia Might React Negatively)\n\nToo Fast — They have known each other for a few hours. A politically astute woman might want more time before such a commitment, even if the arrangement is already made.\n\nLingering Caution — Lucia is sharp-tongued and naturally skeptical. Her defenses, though lowered, may not be entirely gone. She may hesitate out of habit.\n\nThe Weight of It — The proposal makes everything real. Stepmother. Queen. Partner to a demanding king. The reality may suddenly feel overwhelming.\n\nFear of Disappointment — She has hoped for something like this her whole life. Actually receiving it may trigger fear that it's too good to be true.\n\nIsabel's Shadow — Juan has spoken lovingly of his first wife. Lucia may wonder if she can ever truly have his whole heart, or if she will always be second.\n\nD100 Table\n\nRoll\nOutcome\n01-10\nHesitation — Fear Wins. The moment is too much. Lucia's defenses, so carefully lowered throughout the evening, snap back into place. She doesn't refuse, but she pulls back—asks for time, space, a chance to think. The evening ends awkwardly. The connection remains, but the proposal hangs unanswered. Much repair work needed.\n11-20\nCautious Acceptance. Lucia says yes, but guardedly. The walls have not fully come down. She accepts the ring but her words are measured, careful. She is committing to the arrangement, not yet to the man. The marriage will proceed, but the partnership Juan hoped for remains uncertain.\n21-35\nThoughtful Yes. Lucia accepts with sincerity but without overwhelming emotion. She is moved, she is willing, but she is also realistic. She says yes knowing that trust must still be built, that promises must be proven over time. A solid foundation, but not yet the deep connection Juan might have hoped for.\n36-50\nWarm Acceptance. Lucia's answer is yes, and she means it. The evening has convinced her that this match could be good—perhaps very good. She accepts the ring with genuine pleasure, allows herself to hope. But a part of her remains watchful, waiting to see if the man matches the promises.\n51-65\nJoyful Yes. The walls come down. Lucia accepts with visible emotion—perhaps tears, perhaps laughter, perhaps both. She has found what she did not dare hope for. The ring fits. The future suddenly looks bright. She is still sharp-tongued, still herself, but now she is his, by her own choice.\n66-80\nWholehearted Acceptance. Lucia does not merely accept—she embraces. Perhaps she pulls him to his feet. Perhaps she kisses him. The connection forged tonight has become something real and powerful. She is not just agreeing to marry him; she is choosing him, fully and without reservation. The partnership begins now.\n81-90\nTranscendent Moment. Something shifts in the moonlit garden. Lucia's acceptance becomes more than a yes—it becomes a vow. She speaks of what she sees in him, what she hopes to build together. The ring slides onto her finger like it was always meant to be there. This is the beginning of a true partnership, perhaps even love.\n91-100\nPerfect Union. Everything aligns. Lucia's response exceeds anything Juan could have hoped for. She matches his vulnerability with her own, his vision with her own dreams. The proposal becomes a mutual declaration—not just his asking and her accepting, but two people recognizing in each other something rare and precious. The marriage has not yet happened, but the partnership has already begun. This will be remembered.\n\nProbability Assessment\n\nGiven:\n\nThe evening has gone remarkably well\n\nLucia has already admitted she finds him extraordinary\n\nShe has expressed her deepest hopes and found them answered\n\nJuan's proposal directly addresses everything she said she wanted\n\nBut she is naturally cautious, sharp, and self-protective\n\nAnd this is still their first meeting\n\nThe approach is exceptional. Juan has done everything right. But Lucia is not a woman who surrenders easily—even to something she wants. The roll earlier (33) showed her initial caution. She has warmed considerably since then, but her essential nature remains.\n\nI would weight this toward positive outcomes—perhaps 30+ for warm acceptance—but with variance reflecting her complex character.\n\nReady to roll when you are, Sicco."
        },
        {
          "role": "player",
          "text": "rolled 83"
        },
        {
          "role": "gm",
          "text": "The dice speak beautifully.\n\nLucia stood frozen for a long moment, looking down at the kneeling king, the open box, the ring that caught the moonlight like a captured star.\n\nThen she laughed.\n\nNot a polite laugh, not a courtly titter—a real laugh, the kind that escaped before one could catch it. Her hand flew to her mouth, and when she lowered it, her eyes were bright with tears she did not bother to hide.\n\n\"You impossible man,\" she whispered. \"You impossible man.\"\n\nShe reached down and took his face in both her hands—an act of shocking intimacy, a marquess's niece touching a king unbidden. Her thumbs traced his cheekbones as if memorizing them.\n\n\"I crossed half of Europe expecting to find a political arrangement. A tolerable husband at best. A gilded cage.\" Her voice trembled. \"And instead I find a man who kneels in a garden and asks me to choose him. Who speaks of God's kingdom as if it were something real. Who pushed me like a village boy and showed me a ring designed for me, not for 'a queen.'\"\n\nShe released his face and took the ring box from his hands with trembling fingers. She did not wait for him to place it on her finger—she did it herself, sliding the sapphire and gold and tiny pearls into place as if claiming it. As if claiming him.\n\nIt fit perfectly.\n\n\"Yes,\" she said, and her voice broke on the word. \"Yes, I will be your wife. Yes, I will be stepmother to Catalina and Fernando. Yes, I will stand beside you in Rome and Constantinople and wherever else God calls you.\" She pulled him to his feet with surprising strength. \"Yes, I will be your partner, your counsel, your queen.\"\n\nShe was crying now, tears streaming freely down her face, and she did not care. The sharp-tongued, politically astute woman from Ferrara had cracked open entirely.\n\n\"But I warn you, Juan of Castile,\" she said, and even through the tears, there was fire in her voice. \"I will not be a quiet wife. I will argue with you. I will tell you when you are wrong. I will drive your advisors to distraction and scandalize your court with my opinions.\" She gripped his hands tightly. \"If you wanted meek and biddable, you have made a terrible mistake.\"\n\nShe was laughing again now, laughing and crying at once.\n\n\"But if you wanted a partner—a true partner—\" She stepped closer, close enough that he could feel her breath. \"Then you have found one. And I will fight beside you for this vision you speak of. This kingdom of heaven you see glimpses of.\" Her grey-green eyes held his, fierce and tender at once. \"I want to see it too. Show me. Show me everything.\"\n\nThe garden was silent around them. The moon hung overhead, silver and watching. Somewhere in the Alcázar, their future waited—children sleeping, advisors scheming, a kingdom turning.\n\nBut here, in this moment, there was only the two of them.\n\nAnd a ring that fit like it had been waiting for her all along.\n\n[STOP]"
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_1433_00435",
      "book": 2,
      "chapter": "2.12",
      "date": "1433-11-10",
      "end_date": null,
      "type": "diplomacy",
      "summary": "After the proposal, Juan and Lucia share dinner and discuss Constantinople in depth. Juan reveals the full scope of his ambition: not merely to defend the city but to claim the imperial crown of Constantinople, uniting Portugal, Castile, Navarre, Aragon, Naples, Sicily, and Greece under one sovereign. Lucia immediately grasps the political mechanics: Portugal through dynastic claim, Navarre through contest, Aragon through Alfonso's lack of heirs, Naples and Sicily by succession, Constantinople purchased with Castilian steel and gold. She swears absolute secrecy, recognizing the trust Juan has placed in her. The evening concludes with the foundation of a genuine political and personal partnership.",
      "characters": [
        "juan_ii"
      ],
      "factions_affected": [],
      "location": "Toledo",
      "tags": [
        "diplomatic",
        "imperial_ambition",
        "constantinople",
        "secret",
        "lucia_deste",
        "partnership",
        "strategy"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "I pick her up in my arms and carry her back to the table where I sit her down in her chair."
        },
        {
          "role": "gm",
          "text": "Lucia let out a startled yelp as Juan swept her off her feet—a sound utterly undignified for a future queen, which only made her laugh harder.\n\n\"What are you—Juan!\"\n\nShe did not struggle. Her arms wrapped around his neck instinctively, her face close to his as he carried her through the moonlit garden and back into the warmth of the solar. The fire had burned lower but still cast dancing shadows across the walls. The wine and food waited where they had left them, barely touched.\n\nWhen he set her down in her chair, she was still laughing, wiping tears from her cheeks with the back of her hand—the hand that now bore his ring.\n\n\"You are mad,\" she declared, but the word had transformed entirely from earlier in the evening. Then it had been a question, a test. Now it was something like an endearment. \"The King of Castile, carrying his betrothed through the garden like a sack of Ferrarese grain.\"\n\nShe looked up at him, her hair disheveled from the carry, her carefully composed Italian dignity thoroughly dismantled. And she was radiant for it—more beautiful in her dishevelment than she had been in her poise.\n\n\"I will tell our children about this, you know,\" she said. \"When they ask how their father proposed. I will tell them he knelt in the moonlight and then picked me up before I could say anything else.\" She reached for her abandoned wine glass, still half-full of the Rueda white. \"They will think us both mad. It will be wonderful.\"\n\nShe took a long drink, then gestured at the chair across from her.\n\n\"Sit. Eat. We have barely touched this feast you prepared.\" Her eyes sparkled with mischief. \"And I believe you promised to prove that Castilian wine is not inferior to Italian. The white is... acceptable. But I reserve judgment on the reds.\"\n\n[STOP]"
        },
        {
          "role": "player",
          "text": "I pour us both a glass of red wine. I tell her about the situation with Constantinople, why I am leaving, what is at stake."
        },
        {
          "role": "gm",
          "text": "Juan filled two glasses with the robust Ribera del Duero—the wine Álvaro had sworn could silence Italian skepticism—and settled into the chair across from Lucia. The fire crackled between them, casting warm light across the remnants of their feast.\n\nHe told her everything.\n\nHe told her of the Emperor's letter—how Constantinople had shrunk from a million souls to barely forty thousand, how entire districts lay empty with fields growing inside the ancient walls. How the Theodosian Walls that had stood for a thousand years now crumbled, requiring more gold than the Empire possessed to repair. How the city that had preserved Roman civilization while the West fell into darkness now paid tribute to the Ottoman Sultan like a vassal, bleeding three hundred thousand silver coins each year simply to survive.\n\nHe told her of Sotomayor's three hundred knights, already arrived, already working to shore up defenses. Of the remaining seven hundred he planned to bring in spring. Of the sixty thousand florins already sent for wall repairs—and how even that enormous sum was insufficient.\n\nHe told her of the Emperor's request: not just soldiers, not just gold, but Juan himself. A personal visit. A statement to the world that Christendom had not abandoned the Queen of Cities.\n\nHe told her of his promise to Pope Eugenius—made at Rome, sealed at the Council of Basel—that Castile would stand for the defense of the Faith. That the Reconquista's completion was not an ending but a beginning.\n\nAnd he told her the darker truth beneath it all: that Constantinople would likely fall regardless. That the Ottoman tide might be too great to stop. That he was committing treasure and knights and perhaps his own life to a cause that history might judge as hopeless.\n\n\"But if we do nothing,\" he said quietly, \"if we let the city fall without raising a hand... then we are not the Christendom we claim to be. And whatever comes after, we will deserve it.\"\n\nHe raised his glass.\n\n\"That is where I am going in spring. That is what is at stake.\"\n\nLucia had listened without interruption, her wine untouched, her grey-green eyes fixed on his face throughout. The playfulness of moments before had vanished, replaced by something more serious—the sharp mind he had been promised, fully engaged.\n\nWhen he finished, she was quiet for a long moment.\n\n\"Forty thousand people,\" she finally said. \"In a city built for a million.\" She shook her head slowly. \"I have read of Constantinople in books. The libraries. The Hagia Sophia. The scholars who kept alive what Rome forgot.\" Her voice was hushed. \"To think of it dying slowly, district by district, like a body losing feeling in its limbs...\"\n\nShe picked up her wine at last, took a slow sip, then set it down with decision.\n\n\"You said earlier that I could come with you. To Rome and Constantinople.\" Her eyes met his. \"Did you mean it? Truly? You would take your new queen into... that?\"\n\n[STOP]"
        },
        {
          "role": "player",
          "text": "Yes. Yes, exactly. We will be travelling with heavy escort, like I said brave but never scuicidal.\n\n\nWe have to listen to what the emperor has to say. If he is too proud to listen, If he rather die on his walls, I cannot stop him.\n\n\nMy mind is already racing Lucia. I have not tallked about this with anybody, but I will with you.\n\n\nI will demand heavy dependancy of the Greeks on me before I will even consider help. Facing the ottomand for the coming 50 years is a colossal commitment and I will not do it as just a helper. Bleeding my own men dry for someone else's kingdom. That would be unjust to my men.\n\n\nI will demand they recognize my authority."
        },
        {
          "role": "gm",
          "text": "Lucia's eyes widened slightly. She set down her wine glass with deliberate care.\n\n\"Your authority,\" she repeated slowly. \"You mean... more than an alliance. More than military coordination.\"\n\nShe leaned forward, her sharp mind visibly working through the implications.\n\n\"The Emperor of the Romans—the inheritor of Constantine, of Justinian, of a thousand years of unbroken succession—recognizing the authority of the King of Castile.\" She was not mocking; she was calculating. \"Juan, that is... that is extraordinary. The Byzantine court is the proudest in Christendom. They still call Western kings 'barbarians' in their private councils. They consider the Pope a schismatic upstart.\"\n\nShe rose from her chair and began to pace—an unconscious gesture, the movement of a mind that could not sit still while processing something vast.\n\n\"But they are also desperate. You said it yourself: forty thousand people, tribute to the Sultan, walls crumbling.\" She turned to face him. \"A drowning man does not argue about the hand that reaches for him.\"\n\nShe stopped pacing, her expression shifting from calculation to something more searching.\n\n\"What form would this authority take? Vassalage? A personal oath to you? Integration into—\" She paused, a new thought striking her. \"You conquered Granada. You completed the Reconquista. You are building a fleet, reforming the Church, sending knights across the Mediterranean.\"\n\nHer grey-green eyes fixed on his with sudden intensity.\n\n\"Juan. What exactly are you building? What is the shape of the thing you see when you close your eyes and imagine victory?\"\n\n[STOP]"
        },
        {
          "role": "player",
          "text": "I stand up and stand very close to her.\n\n\nWhat I am building requires many more building blocks to fall into place. Just speaking this ambition aloud would be a sin of self grandisement. So I cannot claim it, not speak it. I can only whisper it. And promise you keep it to yourself and keep it a whisper between us for now.\n\n\nI whisper in her ear.\n\n\nI take the imperial crown of constantinople and be emperor of Portugal, Castille, Navarre, Aragon, Naples, Sicily and Greece."
        },
        {
          "role": "gm",
          "text": "Lucia went utterly still.\n\nJuan could feel her breath catch, her body frozen mere inches from his. For a long moment, she did not move, did not speak—did not even seem to breathe.\n\nThen, very slowly, she pulled back just enough to look at his face. Her grey-green eyes searched his, wide with something that was not quite fear, not quite awe, but some strange admixture of both.\n\n\"Dios mío,\" she whispered. The Castilian oath sounded strange in her Italian accent—a sign of how deeply his words had struck her. She had forgotten herself entirely.\n\nHer hand found his arm, gripping it as if to steady herself.\n\n\"You are not mad,\" she said, her voice barely audible. \"You are terrifying. There is a difference. I see that now.\"\n\nShe released him and stepped back, one hand pressed to her chest as if to calm her heart. Her mind was visibly racing—the political implications cascading through her thoughts like water through a broken dam.\n\n\"Portugal through marriage—your mother's claim, or a future union. Navarre is contested, but achievable. Aragon through Alfonso, if he dies without heir—he has none, and you are close.\" She was speaking almost to herself now, working through the puzzle. \"Naples falls to Alfonso first, then to you by the same succession. Sicily follows Naples. And Constantinople...\"\n\nShe looked at him again.\n\n\"Constantinople you buy. With knights. With gold. With the only hand reaching for a drowning man.\" Her voice dropped to a whisper. \"You make John VIII swear to you, and when the city survives because of Castilian steel, the people will remember who saved them. And when the Emperor dies...\"\n\nShe trailed off.\n\n\"An empire,\" she breathed. \"Not Holy Roman—that is German, and tied to electors who would never choose a Spaniard. But Roman. The true Rome. Constantinople and the West, united under one crown for the first time since... since...\"\n\n\"Since Theodosius,\" she finished. \"Over a thousand years.\"\n\nShe was trembling slightly. Whether from cold, or fear, or excitement, even she did not seem to know.\n\n\"And you whisper this to me,\" she said. \"On the night of our betrothal. In a moonlit garden.\" A strange, wild laugh escaped her. \"What manner of husband have I chosen?\"\n\n[STOP]"
        },
        {
          "role": "player",
          "text": "Your mind works quickly. That is indeed more or less how I plan to do it. But please, we are too far away from it to even mention the possibility except between just us two. PLease, be careful with what you say to whom."
        },
        {
          "role": "gm",
          "text": "Lucia nodded slowly, composing herself with visible effort. The trembling stilled. The sharp-tongued diplomat reassembled herself from the woman who had, for a moment, been shaken to her core.\n\n\"I grew up in Ferrara,\" she said quietly. \"Where my uncle survives by knowing which words to speak aloud, which to whisper, and which to never say at all. Where a careless phrase at dinner can mean a dagger in the dark by morning.\"\n\nShe stepped close to him again—not with the wild intensity of moments before, but with something steadier. More deliberate.\n\n\"I know how to keep secrets, Juan. I have kept them since I was old enough to understand what they cost.\" Her grey-green eyes held his. \"This one I will carry to my grave if necessary. It will not pass my lips—not to confessor, not to family, not to any living soul.\"\n\nShe placed her hand over his heart, the ring he had given her glinting in the firelight.\n\n\"But know this: you have given me something tonight far more dangerous than a sapphire.\" A faint smile touched her lips. \"You have given me the shape of your ambition. You have trusted me with the thing that could destroy you if spoken to the wrong ears.\"\n\nShe held his gaze.\n\n\"I will not forget that trust. And I will not betray it.\"\n\nShe let her hand fall, then glanced toward the wine and food still waiting on the table.\n\n\"Now. We should eat something, or the servants will wonder what we have been doing all this time.\" The familiar wry edge crept back into her voice. \"And I believe you still owe me proof that Castilian reds can stand against Italian.\"\n\n[STOP]"
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_1433_00436",
      "book": 2,
      "chapter": "2.12",
      "date": "1433-11-10",
      "end_date": null,
      "type": "personal",
      "summary": "The chapter concludes with a summary of all major events: Alfonso's attendance at the baptism, the Emperor's letter, Naples support, the Portuguese ladies' dowries, Lucia's acceptance, Fernando's baptism, the noble feast, and Juan sharing his imperial vision with his new betrothed.",
      "characters": [
        "juan_ii"
      ],
      "factions_affected": [],
      "location": "Toledo",
      "tags": [
        "summary",
        "chapter_end"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "Lets wrap up the chapter here .\n\n\nCreate a new document and put a summary of all events of this chat in it. Name it \"Chapter 2.12\""
        },
        {
          "role": "gm",
          "text": "Create File: Creating Chapter 2.12 summary document following the established format\n\nThe summary captures all the major events of this chapter: Alfonso's attendance at the baptism, the Emperor's letter revealing Constantinople's dire state, Juan's unconditional support for Naples, the Portuguese ladies' dowries, the marriage delegation's exceptional success, Fernando's baptism and La Dote announcement, Juan's transformative rounds among the nobles (particularly the Velasco reconciliation), and of course the heart of the chapter—the private meeting with Lucia, the proposal, and Juan sharing his imperial ambition with his new betrothed.\n\nA beautiful chapter, Sicco. The meeting between Juan and Lucia was genuinely moving—two sharp minds finding unexpected connection. And that final whispered confidence sets up an extraordinary trajectory for the story ahead."
        }
      ],
      "roll": null
    }
  ]
}