{
  "chapter": "1.23",
  "book": 1,
  "event_count": 11,
  "date_range": "1431-09-14 / 1431-10-17",
  "events": [
    {
      "event_id": "evt_PLACEHOLDER_001",
      "book": 1,
      "chapter": "1.23",
      "date": "1431-09-14",
      "end_date": null,
      "type": "personal",
      "summary": "Juan prepares to leave Jaen for Malaga to take personal command against Granada raiders plaguing supply lines. He calls Isabel to say goodbye. The couple shares an emotional farewell scene: Isabel, six months pregnant, expresses her fear and love. They pray together at the small Portuguese-style chapel in their chambers, Juan asking God to protect Isabel as she becomes a mother. Isabel promises to pray every day until his return.",
      "characters": [
        "juan_ii",
        "isabel_of_portugal",
        "dona_beatriz"
      ],
      "factions_affected": [],
      "location": "Jaen",
      "tags": [
        "personal",
        "farewell",
        "prayer",
        "pregnancy"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "Hi,\n\n\nI prepare to leave 'for Malaga to take command of the armies there to smoke out the raiders who have been plaguing our supply lines for months.\n\n\nI ask for Isabel to come say goodbye to me"
        },
        {
          "role": "gm",
          "text": "- Date: Early/mid-September 1431 (since Chapter 22 covered July-September)\n- Juan is in Jaén, preparing to leave for Málaga to take command\n- Isabel is pregnant (revealed in Chapter 22, baby due January/February)\n- The counter-raiding operation under Enrique failed catastrophically\n- Granada raiders are plaguing supply lines\n- Isabel was in Jaén with Juan, but they discussed her departing for Toledo for safety\n\nNow Juan is preparing to leave for Málaga to personally deal with the raider problem. He's asking Isabel to come say goodbye.\n\nI need to:\n1. Set the scene briefly (2-4 paragraphs during dialogue)\n2. Have Isabel come to say goodbye\n3. STOP after she speaks/appears so the player can respond as Juan\n4. Never write Juan's dialogue or actions\n\nThis is a farewell scene between husband and pregnant wife before he goes to war. It should be emotional but brief. Isabel knows he's leaving, she's worried but supportive. She's several months pregnant now.\n\nLet me set the scene in the royal apartments in Jaén, then have Isabel arrive, and stop so the player can have Juan speak/act.\n\nNow the scene: Juan is preparing to leave Jaén for Málaga to take personal command against the raiders. He's asked Isabel to come say goodbye. This is an emotional moment - he's going into danger, she's pregnant, they've grown to genuinely love each other.\n\nI should:\n1. Set the scene briefly in Juan's chambers or a private space\n2. Have Isabel arrive for the goodbye\n3. Show her pregnancy, her concern, her love\n4. STOP after she speaks so the player can respond as Juan\n5. Keep it SHORT - 2-4 paragraphs for a dialogue scene\n\nCHAPTER 23: THE COUNTER-RAID\n\nDate: September 14, 1431\nLocation: Royal Apartments, Jaén\n\nThe afternoon sun slants through the narrow windows of your chambers as you finish checking your armor and weapons. Your squires have already loaded your traveling chests—lighter kit than usual for mobile operations against raiders. The expedition to Málaga will be swift; you plan to join the forces there, assess the situation firsthand, and personally take command of operations to crush the harassment that has plagued your supply lines for weeks.\n\nA soft knock at the door, then it opens. Isabel enters, moving with the careful grace of a woman six months pregnant. Her belly is unmistakably rounded now beneath her deep blue gown, and her face—while still plain by courtly standards—carries a luminous quality you've come to recognize. She's frightened, trying not to show it.\n\nDona Beatriz follows a respectful distance behind, then quietly withdraws, closing the door to give you privacy.\n\nIsabel stops a few paces away, hands clasped over her belly. Her eyes search your face. When she speaks, her voice is steady despite the fear behind it: \"Your Majesty asked for me. I... I wanted to see you before you left.\""
        },
        {
          "role": "player",
          "text": "Isabel. I will leave for the war again and we will not see each other again for a few months I think. I will miss you terribly, love. Especially now that you are pregnant.\n\n\nI dont want to say goodbye at all."
        },
        {
          "role": "gm",
          "text": "Given Juan's vulnerable statement here - expressing he'll miss her terribly, doesn't want to say goodbye - Isabel would likely:\n1. Be deeply moved by his honesty\n2. Share her own fears\n3. Try to be brave for him but struggle\n4. Express her love\n5. Worry about him\n\nThis is an emotional scene. I should keep it relatively short (2-4 paragraphs as per instructions for active dialogue scenes) and stop after Isabel responds, letting the player continue the conversation.\n\nIsabel's composure wavers. Her eyes glisten, and she takes a step closer, then another, until she's standing before you. One hand reaches out to touch your arm—a gesture that would have been unthinkable in the dutiful bride who arrived from Portugal nine months ago.\n\n\"I don't want you to go,\" she whispers, and the admission costs her something. Her voice breaks slightly. \"I know that's selfish. I know the kingdom needs you, and the crusade, and... I know all of that. But Juan—\"\n\nShe looks up at you, tears now spilling down her cheeks. \"Every night since you left for the east, I pray the rosary until my hands hurt. I pray that God will protect you, that you'll come back whole. And every time a messenger arrives, my heart stops until I know it's not... not bad news.\" Her hand moves from your arm to rest over her rounded belly. \"The baby moves now. Every day. And I think about how I want them to know their father. How I want you to hold them.\"\n\nShe draws a shaking breath. \"I'm frightened, my lord. Frightened that something will happen to you and I'll...\" She can't finish the sentence. Instead, she steps fully into your arms, burying her face against your chest, her pregnant belly pressed between you both.\n\n\"I'll miss you every moment you're gone,\" she says into your tunic, voice muffled. \"Please come back to us.\""
        },
        {
          "role": "player",
          "text": "I hold her tight.\n\n\nI will Isabel. I promise. Im sure of it.\n\n\nWill you pray with me for a moment, and will you pray for me until I get back?"
        },
        {
          "role": "gm",
          "text": "Isabel pulls back just enough to look up at you, wiping at her tears with one hand. She nods fiercely. \"Yes. Yes, of course.\"\n\nShe takes your hand and leads you to the small Portuguese-style chapel corner you'd had installed in these chambers—the carved wooden prie-dieu, the icon of the Virgin Mary you'd given her in August, fresh flowers in a simple clay vase. The Virgin figure has pride of place on a small shelf, clearly well-used; the wood is smooth from Isabel's hands.\n\nShe kneels carefully, one hand steadying herself as she lowers her pregnant body, then reaches for your hand as you kneel beside her. Her fingers lace through yours, gripping tightly.\n\n\"Holy Mother,\" Isabel begins in Portuguese, her voice soft but steady now that she's in this familiar territory, \"watch over my husband. Keep him safe from harm. Guide his decisions, protect him in battle, bring him home to us whole and well.\"\n\nShe pauses, then switches to Castilian—a deliberate choice, speaking your language for this. \"Blessed Virgin, you know what it means to fear for someone you love. You stood at the foot of the Cross. Please... please don't let me know that pain. Let our child know their father. Let me have more years with him. Keep him safe.\"\n\nHer grip on your hand tightens almost painfully. \"I will pray every day,\" she whispers. \"Every single day until you return. Morning prayers, evening prayers, the rosary. I'll light candles. I'll make offerings. Whatever God asks of me, I'll do it, if He'll only bring you back.\"\n\nShe falls silent then, head bowed, waiting for you to pray with her."
        },
        {
          "role": "player",
          "text": "O merciful father in heaven. Grant us strength in the days and weeks ahead. We all have our role to play. Protect Isabel as she takes on a role of mother. Be with her when she feels alone and lost. And lord, you know the secrets of our hearst. You know that we want nothing more than to serve you together. May we wake up in the morning together so we may sing your praises forever.\n\n\nAmen."
        },
        {
          "role": "gm",
          "text": "Isabel would be deeply moved by this. Juan is:\n1. Thinking of her needs (protection, comfort when alone)\n2. Acknowledging her new role as mother\n3. Expressing their shared faith and partnership\n4. Implicitly promising to return by asking God to let them wake together\n\nThis is exactly the kind of prayer that would resonate with Isabel - personal, specific, acknowledging both their individual struggles and their partnership. It shows Juan has learned how to reach her heart through their shared faith.\n\nI should show Isabel's emotional response, then have them conclude this farewell scene. She would be crying again, but comforted. This is a deeply intimate moment between them.\n\nI need to stop after their farewell is complete and wait for the player to indicate what Juan does next (leaves immediately, says something else, etc.).\n\n\"Amen,\" Isabel whispers, her voice thick with tears.\n\nFor a long moment she stays kneeling beside you, head bowed, your hands still clasped together. Her shoulders shake with silent weeping. Then she turns toward you, still on her knees, and throws her arms around your neck.\n\n\"Thank you,\" she breathes against your ear. \"Thank you for understanding. For knowing what I needed to hear.\" She pulls back enough to look at you, tears streaming down her face, but there's something like peace mixed with the sorrow now. \"You're not just leaving me for the war. You're trusting God to keep us both safe until we're together again. That's... that's what I needed.\"\n\nShe kisses you then—desperate, clinging, trying to memorize the moment. When she finally pulls away, she touches your face with both hands, studying you as if to commit every detail to memory.\n\n\"I'll be here when you return,\" she says, steadying her voice with visible effort. \"I'll be praying every day. And...\" She places your hand on her swollen belly, pressing it there. \"We'll both be waiting for you. Your son or daughter will know their father's voice the moment they hear it, because I'll tell them stories about you every day.\"\n\nShe takes a shaking breath, then rises awkwardly to her feet. You stand and help steady her.\n\n\"Go,\" she says, though it clearly costs her everything to say it. \"Go and do what you must. Win your battles. End this war. Come home to us.\"\n\nShe's trying so hard to be brave, to be the queen she's learned to become. But her eyes plead with you not to leave even as her words release you."
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_PLACEHOLDER_002",
      "book": 1,
      "chapter": "1.23",
      "date": "1431-09-14",
      "end_date": "1431-09-19",
      "type": "military",
      "summary": "Juan departs Jaen with 50 royal guards under Captain Fernan Alonso de Robles for Malaga. Roll 18 (Bad Complications): On day 3, the column is ambushed by 30-40 Granada light cavalry in hill country south of Jaen. Ten guards killed in the initial attack. Juan rallies his men with a speech about perseverance, orders tight formation with no chasing. Roll 89 (Strong Push): The disciplined formation absorbs further attacks, losing only one more man. They break through to open ground and the raiders withdraw. Two more days of uneventful travel follow before reaching Malaga with 40 men remaining.",
      "characters": [
        "juan_ii",
        "fernan_alonso_de_robles"
      ],
      "factions_affected": [],
      "location": "Road to Malaga",
      "tags": [
        "military",
        "ambush",
        "travel",
        "roll",
        "leadership"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "Ill do what must be done Isabel. Until I see you again, goodbye.\n\n\nI go to my escort, mount up and leave for Malaga at best speed.\n\n\nNow, draft a d100 table to see how our journey goes."
        },
        {
          "role": "gm",
          "text": "**In Favor (pros):**\n- Juan has experienced royal guard escort (Captain Fernán Alonso de Robles)\n- Traveling through mostly Castilian-controlled territory\n- Main roads should be relatively secure\n- Urgency of the mission means good preparation\n- It's only about 100-120 miles, maybe 3-4 days of travel\n- Royal authority means good horses, supplies\n\n**Against (cons):**\n- Granada raiders have been very active in this region\n- The whole point of going is that supply lines are being harassed\n- Raiders are emboldened after ambushing Enrique\n- They know Castilian patterns and routes\n- Speed might mean less security screening\n- September weather could be hot but generally favorable\n\nThe journey should probably be mostly uneventful given it's through largely controlled territory, but there's real risk given the raider activity that's the whole reason for the trip.\n\nLet me create a d100 table:\n\n1-10: Catastrophic - Major ambush, significant casualties or Juan endangered\n11-25: Bad complications - Raiders encountered, delays, casualties among escort\n26-45: Minor issues - Signs of raiders, nervous encounters, route changes needed\n46-75: Uneventful journey - Arrive safely without incident\n76-90: Good journey - Quick travel, gather useful intelligence on the way\n91-100: Excellent - Very quick travel, capture raiders/scouts, valuable intelligence gained\n\nThis gives:\n- 10% catastrophic\n- 15% bad\n- 20% minor issues\n- 30% uneventful\n- 15% good\n- 10% excellent\n\nThat seems reasonable given the circumstances - mostly safe but real danger exists.\n\nJourney to Málaga - d100 Resolution Table\n\nFactors in Favor:\n\nExperienced royal guard escort under Captain Fernán Alonso de Robles\n\nTraveling through mostly Castilian-controlled territory\n\nGood horses and supplies for rapid travel\n\nRoyal authority allows requisitioning of fresh mounts at towns\n\nMain roads relatively well-patrolled\n\nDistance manageable (100-120 miles, 3-4 days hard riding)\n\nFactors Against:\n\nGranada raiders extremely active in this exact region\n\nSupply convoys have been repeatedly hit along these routes\n\nRaiders emboldened after successful ambush of Enrique's force\n\nSpeed might compromise careful scouting\n\nRaiders know Castilian movement patterns\n\nSeptember heat still significant for hard riding\n\nD100 JOURNEY OUTCOME TABLE:\n\n1-8: Catastrophic Journey - Major ambush by large raider force. Significant casualties among escort, Juan's life endangered. Either serious injury to Juan or loss of 30-50% of escort. Potential capture attempt. Major intelligence failure.\n\n9-23: Bad Complications - Encounter with raiders. Fighting withdrawal necessary. 5-15 casualties among escort, delays of 1-2 days, lose supplies/horses. Arrive shaken and depleted.\n\n24-43: Minor Issues - Near-misses with raider scouts, evidence of recent attacks, forced detours around dangerous areas. Arrive 1 day delayed, troops nervous, but no combat. See aftermath of raids (burned wagons, bodies).\n\n44-72: Uneventful Journey - Reach Málaga safely in 3-4 days without incident. Standard travel, no encounters beyond distant sightings. Professional journey but nothing notable.\n\n73-88: Good Journey - Swift travel (3 days), gather useful intelligence from patrols along route. Learn raider patterns, locations of recent attacks. Arrive fresh and well-informed.\n\n89-100: Excellent Journey - Very fast travel (2.5 days), encounter and capture raider scouts, extract valuable intelligence about raider base locations and numbers. Arrive with actionable information and momentum.\n\nPlease roll your d100 and report the result."
        },
        {
          "role": "player",
          "text": "I roll 18. Draft what happens until Juan should intervene or take action."
        },
        {
          "role": "gm",
          "text": "I SHOULD:\n- Describe the ambush\n- Show the fighting from Juan's perspective (what he sees/hears)\n- Narrate the escort's actions and casualties\n- Create a situation requiring Juan's decision\n- Stop and wait for player input\n\nThis should be kept relatively short since it's an active combat scene - maybe 4-6 paragraphs describing the ambush and its immediate aftermath, then stopping when Juan needs to decide what to do.\n\nThe Ambush on the Road to Málaga\n\nDay 3 - September 17, 1431\nAfternoon - Hill Country South of Jaén\n\nThe afternoon heat presses down as your column winds through the broken terrain forty miles south of Jaén. Captain Fernán Alonso de Robles rides beside you, fifty royal guards spread in protective formation—twenty ahead, twenty behind, ten flanking. Good discipline. Professional spacing.\n\nThe arrow takes the lead scout in the throat.\n\nHe topples from his saddle without a sound. Then the hillside erupts—thirty, forty Granada light cavalry pouring from concealed positions in the scrub-covered ravines on both sides of the road. They're already at full gallop, screaming their war cries, lances leveled.\n\n\"AMBUSH! CLOSE ON THE KING!\" Fernán's roar cuts through the chaos. The guards react instantly, spurring toward you, but the raiders are fast—terrifyingly fast. They hit your forward element before half your men can respond.\n\nSteel rings on steel. A Castilian guardsman goes down with a lance through his ribs. Another's horse collapses, arrows bristling from its neck. The raiders aren't trying to hold ground—they wheel and strike, wheel and strike, flowing like water around your formation's attempts to consolidate.\n\n\"They're trying to separate you from the column!\" Fernán shouts, his sword already red. \"We need to—\"\n\nA cluster of raiders surges toward your position specifically. Six men, well-mounted, lances aimed directly at you. Your guards intercept them—Fernán personally cuts down the lead rider—but in the swirling melee, you're being pushed away from the main body of your escort. More of your men are falling. You can see at least eight Castilians down already, dead or dying.\n\nThe raiders break off as suddenly as they struck, galloping back into the hills. But they don't flee far—you can see them regrouping on the ridgelines, just out of bowshot, watching. Counting your numbers. Planning the next strike.\n\nFernán pulls his horse alongside yours, breathing hard. Blood runs from a cut on his arm. \"Your Majesty, we've lost nine men. Maybe ten if Pedro doesn't stop bleeding. They'll hit us again—this is how they fight. Wear us down attack by attack.\" He gestures at the terrain ahead—three more miles of broken country before the road descends to more open ground. \"We can try to push through fast and hope they don't hit us again. Or we can turtle up, move slow and defensive. Or...\" He glances back north. \"We could retreat to the last town, get reinforcements.\"\n\nOn the ridgeline, the raiders sit their horses, waiting. You can see more movement in the ravines—possibly more groups positioning for another ambush if you continue forward.\n\nCaptain Fernán looks at you, waiting for orders."
        },
        {
          "role": "player",
          "text": "Can we charge at them?"
        },
        {
          "role": "gm",
          "text": "Juan is asking if they can charge at the raiders on the ridgeline. This is a tactical question I should answer as the GM based on military reality and Captain Fernán's expertise.\n\nKey factors:\n1. The raiders are Granada light cavalry - their entire tactical doctrine is built around mobility and hit-and-run\n2. They're on ridgelines, higher ground\n3. They're specifically designed to bait charges and then flee, leading pursuers into worse terrain or splitting forces\n4. Juan's force is royal guards - heavier cavalry, good fighters but not as mobile as light cavalry\n5. The terrain is broken hill country with ravines - terrible for charging\n6. The raiders have already shown they know this terrain intimately\n7. Splitting the force to chase them would leave Juan vulnerable to other raider groups\n\nFernán would absolutely advise against this - it's exactly what the raiders want. But I should present it as his expert opinion and let Juan decide.\n\nFernán follows your gaze to the raiders on the ridgeline, then shakes his head sharply. \"Your Majesty, that's exactly what they want us to do.\"\n\nHe points at the terrain. \"Look at the ground between us and them. Broken, rocky, full of gullies and ravines we can't see from here. They're light cavalry on horses bred for this country—we're heavy horse built for shock charges on flat ground. We'd be climbing toward them at half speed while they pepper us with arrows, then the moment we got close, they'd scatter in six directions through terrain they know like their own homes.\"\n\nHe gestures to the other groups of raiders visible on different hilltops. \"And the second we committed to chasing that group, these others would hit our rear. Or worse—they'd circle around and hit wherever you're not. That's their entire way of fighting, Majesty. Make you chase, split your forces, bleed you piece by piece.\"\n\nOne of your guards rides up. \"Captain, Pedro's dead. That makes ten.\" His voice is tight with anger. \"And the bastards are just sitting up there watching us.\"\n\nFernán's jaw clenches. You can see he wants to kill them as badly as his men do. But he turns back to you. \"I've fought these raiders before, Your Majesty. Never, ever chase them into broken ground. That's how Infante Enrique lost forty men in his ambush—they baited his cavalry into a pursuit and had three more groups waiting.\"\n\nOn the ridge, one of the raiders raises his lance mockingly, as if inviting exactly what you suggested.\n\n\"We need a decision, Your Majesty,\" Fernán says quietly. \"Push through fast and accept they might hit us again? Move slow and defensive? Pull back north? But charging up those hills...\" He shakes his head. \"That's suicide, and they know it.\"\n\nWhat are your orders?"
        },
        {
          "role": "player",
          "text": "Our fight starts here. If we retreat, can we call up more reinforcements?"
        },
        {
          "role": "gm",
          "text": "Juan is asking a practical question about whether retreat would allow him to gather reinforcements. This is a reasonable strategic consideration. Fernán would have knowledge about what forces might be available in the area and how long it would take to gather them.\n\nLet me think about the tactical situation:\n- They're about 40 miles south of Jaén\n- The last town they passed would have been maybe 5-10 miles back\n- There might be small garrisons in towns, or patrols in the area\n- But gathering significant reinforcements would take time - maybe a day or two\n- During which the raiders could disappear or reposition\n\nFernán would give Juan a realistic assessment of their options.\n\nFernán considers this, glancing back north toward where you came from. \"The last town was eight miles back—Alcaudete. Small garrison, maybe thirty men-at-arms. We could reach it in an hour, consolidate there.\"\n\nHe pauses, calculating. \"From there, we could send riders to Jaén for proper reinforcements. Don Álvaro de Estúñiga could send a hundred cavalry, maybe two hundred. But that's a full day's ride each way—so two days minimum before they arrive. Maybe three to organize properly.\"\n\nOne of his sergeants speaks up. \"By which time these goat-fuckers will be long gone, Captain. They're not going to sit around waiting for us to come back with an army.\"\n\nFernán nods grimly. \"He's right, Your Majesty. If we retreat, we save our remaining men and get you safely back. But these specific raiders will vanish into the hills. We'd have to start the whole hunt over again.\" He gestures at the watching horsemen. \"Right now, we know where they are. We're wounded, but they think they have us.\"\n\nHe meets your eyes. \"If our fight truly starts here, then we push through. Take more casualties, probably, but reach Málaga with most of your escort intact. From there, you'll have twelve thousand men to hunt these bastards properly.\"\n\nAnother option crosses his face. \"Or... Your Majesty, you could retreat to Alcaudete with ten guards while the rest of us push through. Get you safe, then—\"\n\n\"No.\" The sergeant cuts him off flatly. \"We don't split the king from his escort in raider country. That's how kings get captured.\"\n\nOn the ridge, the raiders haven't moved. Still watching. Still waiting for your decision."
        },
        {
          "role": "player",
          "text": "When we push through, what will happen? How can we best defend ourselves?"
        },
        {
          "role": "gm",
          "text": "This is good military advice from an experienced captain who has fought raiders before. I should have Fernán lay out the tactical situation clearly.\n\nFernán leans forward in his saddle, studying the terrain ahead. \"If we push through, they'll hit us at least once more, maybe twice. They'll wait for another choke point—narrow section of road, a ford, anywhere our formation has to compress. Then strike fast, kill a few men, and break off before we can counter.\"\n\nHe points to your remaining guards. \"We have forty-one men left. Here's how we defend against it:\"\n\n\"Tight formation—no one more than two horse-lengths from the next man. When they charge, we don't chase. We receive their attack, kill who we can, let them break off. They want to pull us apart; we stay together like a fist.\"\n\n\"You in the center—ten best men around you at all times, shields ready. When arrows fly or lances come, they protect you first. Everyone else fights outward from that core.\"\n\n\"Fast but not reckless—we push hard through the dangerous ground, don't give them time to set perfect ambushes. But we don't gallop blind into another trap either. Scouts ahead but not too far.\"\n\n\"No heroics—if someone falls, we don't stop to retrieve bodies. Sounds harsh, but that's what gets everyone killed. We push through to open ground, regroup there.\"\n\nHe looks at you directly. \"Realistically, Your Majesty? We'll lose another five to ten men getting through these three miles. Maybe more if we're unlucky. But the core around you should hold, and once we reach open country, they can't touch us—their horses won't catch ours in a straight run.\"\n\nThe sergeant adds quietly: \"And every man here knew the risks when we rode south, Your Majesty. We'll get you through.\"\n\nFernán waits for your decision. Push through with these tactics? Or choose differently?"
        },
        {
          "role": "player",
          "text": "Men, God is testing our resolve right now. But I know we will preservere. We must preservere.\n\n\nStay together, keep close ranks and do not chase these Moor bastards. Remember that we are on the winning side and soon their kingdom will be trampled into the dust. They cannot win, they can only hinder and slow the inevitable.\n\n\nNo heroics. And we keep moving. Share horses if you must to carry the wounded, but we must push through to open ground.\n\n\nGod is with us!\nWe move out.\n\n\nDraft another d100 table to determine what happens next."
        },
        {
          "role": "gm",
          "text": "Juan has given a rousing speech to his men and issued clear tactical orders - tight formation, no chasing, keep moving, share horses for wounded. Now they're going to push through the dangerous terrain.\n\nI need to create a d100 table for this tactical decision.\n\nFactors in favor:\n- Clear tactical plan (tight formation, no chasing)\n- Juan's leadership and morale boost\n- Professional royal guards, disciplined\n- They're aware of the danger now, not surprised\n- Central protection around Juan\n- Orders to keep moving and not stop for fallen\n- They know they only need to reach open ground (3 miles)\n- Guards motivated by protecting their king\n\nFactors against:\n- Already lost 10 men (down to 41 from 51)\n- Raiders still have numbers advantage (40+ raiders vs 41 guards)\n- Raiders know the terrain intimately\n- 3 miles of broken ground still to cover\n- Raiders are emboldened by first success\n- Horses tired from the first attack\n- Some wounded men slowing formation\n- Raiders can choose when/where to strike next\n- Multiple raider groups can coordinate\n\nThis should be weighted toward taking more casualties but getting through. The speech and tactics help, but the situation is still bad. Let me create a table:\n\n1-12: Catastrophic - Major second ambush, raiders coordinate perfectly, many casualties, Juan endangered\n13-30: Severe - Heavy second ambush, 12-18 more casualties, barely make it through\n31-55: Moderate - One more solid attack, 6-10 casualties, reach open ground battered\n56-78: Acceptable - Harassing attacks, 3-5 casualties, get through reasonably intact  \n79-92: Good - Raiders test them but discipline holds, 1-2 casualties, strong push through\n93-100: Excellent - Discipline and speed overwhelm raiders, minimal/no further casualties, impressive march\n\nThis feels right - most likely outcomes are in the moderate to acceptable range, with chances for worse or better.\n\nPush Through to Open Ground - D100 Resolution Table\n\nFactors in Favor:\n\nClear tactical orders (tight formation, no chasing, keep moving)\n\nJuan's morale boost and leadership\n\nProfessional, disciplined royal guards\n\nNow alert and prepared for another attack\n\nStrong central protection around Juan\n\nOrders to share horses and not stop for fallen\n\nOnly 3 miles to open ground\n\nGuards deeply motivated to protect their king\n\nFactors Against:\n\nAlready lost 10 men (down to 41 from 51)\n\nRaiders still outnumber them (~40+ vs 41)\n\nRaiders know terrain intimately, can choose ambush points\n\nMultiple raider groups can coordinate attacks\n\nHorses tired from first engagement\n\nSome wounded men slowing formation\n\n3 miles of broken, dangerous terrain ahead\n\nRaiders emboldened by successful first strike\n\nFormation compressed on narrow roads creates vulnerability\n\nD100 TACTICAL OUTCOME TABLE:\n\n1-12: Catastrophic Second Ambush - Raiders coordinate major attack at ford crossing. Heavy casualties (15-20 more men), formation nearly breaks. Juan personally endangered, takes minor wound. Barely escape with 20-25 survivors. Devastating.\n\n13-30: Severe Fighting - Raiders hit hard at two points. Lose 10-15 more men in brutal fighting. Formation holds but badly mauled. Reach open ground with ~26-31 survivors, multiple wounded. Mission capability seriously compromised.\n\n31-55: Moderate Casualties - One more solid raiding attack at choke point. Lose 6-10 additional men despite tactics. Discipline holds, reach open ground with 31-35 survivors. Battered but functional.\n\n56-78: Acceptable Losses - Harassing attacks, arrows and quick strikes. Lose 3-5 more men but formation stays tight. Raiders can't break discipline. Reach open ground with 36-38 survivors, mission continues.\n\n79-92: Strong Push - Raiders test them but tight formation and determination work. Lose only 1-2 men to arrows. Discipline impressive, reach safety with 39-40 men. Morale holds.\n\n93-100: Excellent March - Perfect execution. Raiders attempt attacks but formation so tight they can't exploit. Speed and discipline overwhelming. Minimal/no additional casualties. Reach open ground at strength, raiders discouraged.\n\nRoll your d100 and report the result."
        },
        {
          "role": "player",
          "text": "Rolled 89; Strong Push. Describe what happens based on this outcome."
        },
        {
          "role": "gm",
          "text": "The Push Through\n\nYour words ripple through the remaining guards. Spines straighten. Hands tighten on weapons. Captain Fernán nods once, then bellows: \"You heard His Majesty! Tight formation! Move out!\"\n\nThe column reforms with professional speed—ten guards in a tight ring around you, the rest forming a compact mass fore and aft. No gaps. No stragglers. When a young guardsman's horse limps badly from an arrow wound, another man pulls him up behind his saddle without breaking stride. The formation moves as one.\n\nThe raiders see it. On the ridgeline, their leader gestures sharply. They begin shadowing your column, looking for an opening that never comes.\n\nAt the first choke point—a narrow defile where the road cuts between two rocky outcrops—arrows hiss down from above. One catches a guard in the shoulder, but he stays in saddle, shield raised. The formation doesn't slow, doesn't waver. The raiders start to close for a charge, but Fernán roars \"HOLD FORMATION!\" and your men stay locked together like a moving fortress. The raiders wheel away, frustrated.\n\nTwo miles. The raiders try again at a ford crossing, splashing in from both flanks. This time they commit harder—eight men with lances driving at your left flank. Steel clashes. One of your guards goes down, trampled in the shallow water, but the man beside him immediately closes the gap. The raiders break off as your formation simply absorbs the attack and keeps moving, implacable as the tide.\n\nOne mile. The raiders make a final attempt, trying to bait your rearguard into pursuit by riding close and hurling insults. Not one man breaks ranks. The discipline holds absolutely.\n\nThen the terrain opens. The broken hills give way to rolling grassland, and suddenly there's nowhere for light cavalry to hide, nowhere to ambush from. Your column emerges onto the open road to Málaga.\n\nBehind you, the raiders pull up on the last ridgeline, watching. They don't follow into the open country. One by one, they turn their horses and disappear back into the hills.\n\nCaptain Fernán rides up beside you, breathing hard. Blood stains his surcoat but he's grinning fiercely. \"Forty men remaining, Your Majesty. Two wounded but riding. The bastards couldn't break us.\" He looks back at his guards with obvious pride. \"Your Majesty's words held them together. They fought like they were worth twice their number.\"\n\nThe road to Málaga stretches ahead, clear and safe in the afternoon sun. Two more days of easy riding.\n\nWhat do you do?"
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_PLACEHOLDER_003",
      "book": 1,
      "chapter": "1.23",
      "date": "1431-09-19",
      "end_date": null,
      "type": "military",
      "summary": "Juan arrives at Malaga after five days of travel. Master of Santiago Don Luis de Guzman greets him with a reception party at the gates, noting the reduced and bloodstained escort. Don Luis reports the situation is 'challenging' and requests a private briefing. The city bustles with military activity as an army under occupation.",
      "characters": [
        "juan_ii",
        "luis_de_guzman",
        "pietro_calabrese",
        "fadrique_enriquez"
      ],
      "factions_affected": [],
      "location": "Malaga",
      "tags": [
        "military",
        "arrival"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "We finish the journey."
        },
        {
          "role": "gm",
          "text": "Juan is arriving to take personal command and deal with the raider problem. I should set up the situation at Málaga - the commanders there, the current military disposition, the challenges they're facing, and present this so Juan can assess and make decisions.\n\nI should keep this relatively concise (not too long) and stop at a natural point where Juan would need to make decisions or interact with the commanders.\n\nArrival at Málaga\n\nDay 5 - September 19, 1431\nAfternoon - Málaga\n\nThe final two days pass without incident. Open roads, good weather, fresh horses requisitioned at towns along the way. Captain Fernán keeps the formation tight anyway—no one taking chances after the ambush—but the raiders don't reappear.\n\nMálaga rises from the coastal plain ahead, its white walls gleaming in the Mediterranean sun. The Moorish architecture still dominates the skyline despite three months of Castilian occupation—minarets and domes alongside the new Christian banners flying from the Alcazaba fortress. The harbor bristles with ships: Castilian galleys, Portuguese carracks, supply vessels. The smell of salt air and fish markets carries on the breeze.\n\nYour approach is spotted. Trumpets sound from the walls. By the time you reach the gates, a reception party has assembled—Master of Santiago Don Luis de Guzmán at its head, surrounded by his officers and household knights.\n\nDon Luis dismounts and kneels as you enter. \"Your Majesty. We received word you were coming, but not that you'd been engaged on the road.\" His eyes take in your reduced escort, the bloodstains, the exhausted horses. \"I see the raiders found you as well.\"\n\nHe rises at your gesture. The Master of Santiago is in his late forties, weathered and competent—a career soldier who's spent the summer grinding out fortress captures along the coast. He looks tired. Behind him, you recognize Master Gunner Pietro Calabrese, several household knights, and garrison commanders.\n\n\"Your Majesty, the city is yours,\" Don Luis continues, gesturing toward the Alcazaba. \"I've prepared quarters in the fortress. But I confess, I'm glad you've come. The situation is...\" He pauses, choosing words carefully. \"Challenging. The fortresses fall, but holding what we take grows harder by the week.\"\n\nHe glances at his officers, then back to you. \"Perhaps we should discuss this in private, Your Majesty? There's much to report, and not all of it good news.\"\n\nThe guards are already moving toward the Alcazaba, your escort desperate for rest, food, and medical attention for the wounded. The city around you bustles with military activity—supply wagons, patrols organizing, blacksmiths hammering at forges. A city under occupation, functioning but tense.\n\nWhat do you do?"
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_PLACEHOLDER_004",
      "book": 1,
      "chapter": "1.23",
      "date": "1431-09-19",
      "end_date": "1431-09-24",
      "type": "council",
      "summary": "War council at the Alcazaba. Don Luis, Don Rodrigo de Perea, Pietro Calabrese, and Admiral Fadrique brief Juan on the raider crisis: 1,500-2,000 Granada light cavalry systematically ambushing convoys, killing 200+ men since July. Infante Enrique's counter-raiding force failed catastrophically (47 dead, 63 wounded). Juan identifies the key vulnerability: the raiders' supply lines, requiring 40,000 lbs of fodder daily. He proposes marching on Ronda, the raiders' main fortress and supply hub, with a slow deliberate advance protected by massed crossbowmen. The council agrees this inverts the tactical equation. Force composition set at 6,000 men (2,000 cavalry, 4,000 infantry with 1,600 crossbowmen, 6 bombards). Juan writes a letter to wounded Infante Enrique ordering rest and recovery. Five days of preparation transform Malaga into a staging ground.",
      "characters": [
        "juan_ii",
        "luis_de_guzman",
        "rodrigo_de_perea",
        "pietro_calabrese",
        "fadrique_enriquez",
        "infante_enrique_de_aragon"
      ],
      "factions_affected": [
        "royal_court"
      ],
      "location": "Malaga",
      "tags": [
        "council",
        "strategy",
        "military",
        "ronda_campaign",
        "supply_lines"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "Yes, summon the war council. Lets make a plan to fight these devils."
        },
        {
          "role": "gm",
          "text": "1. Set the scene - war council chamber in the Alcazaba\n2. Present the key commanders and their reports\n3. Outline the current situation with the raiders\n4. Present the strategic challenges\n5. Stop before Juan makes decisions or speaks extensively - let the player decide the strategy\n\nI should include:\n- Master of Santiago (Don Luis de Guzmán) - overall western commander\n- Master Gunner Pietro Calabrese - artillery perspective\n- Don Rodrigo de Perea - scout commander who was with Enrique's failed mission\n- Other relevant officers\n- Intelligence about the raiders' tactics, numbers, bases\n- The supply line problem\n- Western campaign progress despite raiders\n\nKeep it 5-6 paragraphs since this is scene-setting for a strategic discussion. Present the problems clearly so Juan can formulate responses.\n\nWar Council at Málaga\n\nEvening - September 19, 1431\nAlcazaba Fortress, Málaga\n\nThe council chamber overlooks the harbor, Mediterranean sunset painting the water gold and crimson. Maps spread across a heavy oak table—the coastal region from Málaga to Gibraltar, the interior hills, supply routes marked in red ink with crosses noting ambush sites. Too many crosses.\n\nMaster of Santiago Don Luis de Guzmán stands at the head of the table. Flanking him: Master Gunner Pietro Calabrese, still dust-stained from recent siege work; Don Rodrigo de Perea, the scout commander who survived Infante Enrique's disastrous ambush last month; Admiral Don Fadrique Enríquez, commanding the naval elements; and half a dozen garrison commanders from captured fortresses.\n\nDon Luis begins without preamble. \"Your Majesty, since June we've captured six coastal fortresses—Marbella, Estepona, Casares, Manilva, and two smaller positions. The Master Gunner's artillery has been devastating. We control forty miles of coastline.\" He taps the map. \"But holding these positions bleeds us constantly.\"\n\nDon Rodrigo leans forward, voice bitter. \"The raiders, Your Majesty. Granada has fifteen hundred to two thousand light cavalry deployed in bands of fifty to three hundred. They've abandoned trying to stop our sieges. Instead, they hit supply convoys, isolated garrisons, foraging parties, messenger patrols. We've lost over two hundred men since July—not in glorious battle, but murdered on the roads in ones and twos.\"\n\nPietro Calabrese adds in his Italian-accented Castilian: \"Every convoy needs hundred men escort now, Majesty. Still they hit us. My bombards sit idle for days waiting for enough powder because the supply train was ambushed. We take fortresses, but cannot maintain tempo.\"\n\nDon Luis gestures at the map's interior. \"They have bases in the hill country—Ronda, Gaucín, perhaps others. They strike from there, fade back into terrain where heavy cavalry cannot follow. Infante Enrique's counter-raiding force attempted to hunt them in August.\" He glances at Don Rodrigo. \"You know how that ended.\"\n\nDon Rodrigo's jaw tightens. \"Three thousand cavalry. Forty-seven dead, sixty-three wounded in a single ambush. The Infante himself took a lance wound. They knew we were coming, knew our route, had positions prepared. Our intelligence network in the interior is...\" He stops. \"Non-existent, Your Majesty. We're fighting blind.\"\n\nAdmiral Fadrique speaks up: \"The coastal fortresses we've taken are supplied by sea now—it's the only reliable method. But that means our land supply lines to the eastern army, to Jaén, remain vulnerable. Every wagon train risks attack.\"\n\nDon Luis meets your eyes. \"Your Majesty, we can continue capturing fortresses. With the bombards and our numbers, Granada cannot stop us. But we're taking a fortress every three weeks instead of every week because of these raiders. And our casualties from ambushes now exceed our casualties from sieges.\"\n\nHe places both hands on the table. \"We need a solution. Infante Enrique tried to hunt them with cavalry—failed. We've tried larger escorts—they simply hit different targets. We've tried occupying suspected base areas—they melt away and strike elsewhere.\"\n\nThe room falls silent. Maps, crosses marking ambush sites, the faces of tired commanders who've been grinding through this problem for months without answer.\n\nDon Luis looks at you. \"Your Majesty has come to take personal command. What are your orders?\""
        },
        {
          "role": "player",
          "text": "Can infantry support our efforts? Do we have bows or crossbows we can use to drive them off?"
        },
        {
          "role": "gm",
          "text": "1. Infantry capabilities and limitations against light cavalry\n2. Availability of ranged troops (crossbowmen, archers)\n3. Tactical considerations - infantry movement speed vs cavalry mobility\n4. Potential applications where infantry COULD help\n5. Why this hasn't been the solution so far\n\nThe discussion should be technically competent and reflect 15th century military realities. Light cavalry's main advantage is mobility - they can choose when and where to fight. Infantry (even with ranged weapons) are slow and can be avoided. However, infantry might have specific applications in defensive roles or terrain-dependent situations.\n\nThis should lead to a productive tactical discussion where Juan can hear expert opinions and then decide on a strategy.\n\nDon Rodrigo de Perea, the scout commander, responds first. \"Your Majesty asks the right question. We have crossbowmen—perhaps eight hundred across our western forces. Good Castilian professionals. The problem is mobility.\"\n\nHe stands and gestures at the map. \"These raiders move at thirty, forty miles per day. A crossbowman on foot makes twelve miles, maybe fifteen if you push hard. By the time infantry marches to where raiders struck yesterday, they're fifty miles away hitting a different target.\"\n\nMaster of Santiago nods. \"We've tried mixed forces—cavalry with crossbowmen mounted on mules or riding double. Somewhat better. The infantry can dismount and provide covering fire when raiders attack. But the moment we stop to deploy crossbows, the raiders simply... leave. They won't engage infantry on ground that favors missile troops.\"\n\nPietro Calabrese adds: \"Is like hunting wolves with ox cart, Majesty. The wolves, they run faster than cart. They bite the ox from behind, then run when you turn to face them.\"\n\nDon Rodrigo continues: \"Where infantry does help—we've reinforced all convoy escorts with fifty to hundred crossbowmen now. When raiders hit, the crossbowmen form hedgehog while cavalry counter-charges. It's made convoys harder targets. Raiders still probe, but casualties are fewer.\" He grimaces. \"They've adapted. Now they hit smaller targets instead—isolated messenger riders, foraging parties of twenty men, scouts. Anything too small for heavy escort.\"\n\nAdmiral Fadrique speaks: \"Infantry also works for fortress garrisons, obviously. Every fortress we take, we leave three hundred to five hundred men—mostly infantry with crossbows. The raiders don't assault fortresses. But between those fortresses, on the roads? Infantry cannot patrol effectively.\"\n\nDon Luis taps the map thoughtfully. \"However, Your Majesty, if we knew where the raiders were based—Ronda, for instance—infantry would be invaluable for an assault. Their hill fortresses are strong, but not against artillery and determined infantry assault. The trick is...\" He looks frustrated. \"Finding them. Pinning them. Making them fight on ground we choose instead of ground they choose.\"\n\nHe meets your eyes. \"We have the troops. Eight thousand infantry here in the west, many with crossbows. But how do we use them against an enemy that refuses to be where we are?\"\n\nThe council waits for your response. The tactical problem is clear: mobility versus firepower, hunters versus prey that won't stand still.\n\nWhat's your strategy?"
        },
        {
          "role": "player",
          "text": "Another question, we think they are numbered a few thousand. How are they supplying these forces? That's many mouths to feed. The area should not be too fertile"
        },
        {
          "role": "gm",
          "text": "Granada's raiders are estimated at 1,500-2,000 light cavalry. That's:\n- 1,500-2,000 men\n- 1,500-2,000 horses (probably more with remounts)\n- Daily needs for both\n\nMedieval cavalry requirements:\n- A man needs ~2 lbs of bread/grain + other food per day\n- A horse needs 20-25 lbs of fodder per day (grain + hay)\n- Water for both\n- Fodder for horses is HUGE - 30,000-40,000 lbs per day for 2,000 horses\n\nThe southern/western hill country of Granada:\n- Mountainous, less fertile than the Vega\n- Some valleys with agriculture\n- Primarily suited for grazing, olives, some grain\n- NOT the breadbasket of Granada\n\nSo where are they getting supplies?\n\nOptions:\n1. Ronda and other hill fortresses have stockpiles\n2. They're raiding and foraging from local villages (Moorish population)\n3. Supply caravans from Granada city\n4. Combination of all three\n\nThis is a GREAT vulnerability to exploit. Don Luis and the council should recognize this as insightful.\n\nThe player is onto something - if you can cut their supply lines or identify supply routes, you can find their bases or starve them out.\n\nDon Luis's eyes sharpen. He straightens, exchanging glances with Don Rodrigo. \"Your Majesty cuts to the heart of it. That is the question we should have been asking.\"\n\nDon Rodrigo steps to the map, pointing at the interior hill country. \"Fifteen hundred to two thousand cavalry, Your Majesty. Each man needs two pounds of grain daily, plus meat, wine, other supplies. Each horse needs twenty to twenty-five pounds of fodder—grain and hay—every single day. That's...\" He calculates quickly. \"Forty thousand pounds of horse fodder alone. Daily. Plus food for the men.\"\n\nPietro Calabrese whistles low. \"Forty thousand pounds. Every day. This is... this is massive supply operation.\"\n\nDon Luis nods slowly. \"The hill country around Ronda, Gaucín—it's poor land, Your Majesty. Olives, some grazing, scattered grain valleys. Nothing like the Vega. It cannot possibly support two thousand horses and their riders for months on end.\"\n\nDon Rodrigo continues, animated now: \"Which means they're being supplied. Either from Granada city via supply caravans, or from stockpiles in their fortresses—Ronda probably has magazines—or they're foraging heavily from local Moorish villages. Likely all three.\"\n\nAdmiral Fadrique leans forward. \"If they're receiving supply caravans from Granada, those caravans have to travel routes. Through passes, along certain roads. And a convoy carrying forty thousand pounds of fodder daily...\" He smiles grimly. \"That's not subtle. Dozens of wagons. Hundreds of pack animals.\"\n\nDon Luis starts pacing, thinking aloud. \"We've been trying to hunt the raiders themselves. But Your Majesty is right—we should be hunting their supply lines. Cut those, and two thousand cavalry become useless in a week. Horses can't raid if they're starving.\"\n\nDon Rodrigo adds: \"And supply convoys can't run and hide like light cavalry. They have to use roads, move slowly. They're vulnerable.\"\n\nThe Master of Santiago turns to you. \"Your Majesty, this changes our approach entirely. Instead of chasing raiders through hills, we find and destroy their supplies. Blockade Ronda. Intercept caravans from Granada city. Burn the villages supplying them.\" He pauses. \"It's ruthless, but it might actually work.\"\n\nThe council is energized now, seeing a different angle of attack.\n\n\"The question,\" Don Rodrigo says carefully, \"is finding those supply routes. We'd need intelligence. Scouts, perhaps interrogation of prisoners, tracking...\" He looks at you. \"Your Majesty, this could work. But we need information first. Where are they based? How are they supplied? What routes do they use?\"\n\nWhat are your thoughts?"
        },
        {
          "role": "player",
          "text": "You mentioned Ronda a few times now. It this a known fortress in their operating area?"
        },
        {
          "role": "gm",
          "text": "Ronda historically was an important Moorish fortress in the mountains inland from the coast. It would make perfect sense as a raider base - defensible position in the hills, controls key routes, etc.\n\nDon Luis nods emphatically. \"Yes, Your Majesty. Ronda is the key fortress in the interior hill country, perhaps thirty-five miles northeast of here.\" He points to its location on the map—a position dominating the mountains between the coast and Granada's interior.\n\n\"It's one of Granada's strongest positions,\" he continues. \"Built on a plateau with a deep gorge—the Tajo de Ronda—cutting through the center. The fortress sits on cliffs, practically unassailable on three sides. Only approachable from the north, and even that approach is narrow and well-defended.\"\n\nDon Rodrigo adds: \"We've captured prisoners who mention Ronda constantly. Scouts report heavy cavalry presence there. The raiders we've encountered—when we track their movements backward—the trails often lead toward Ronda's general direction before we lose them in the hills.\"\n\nAdmiral Fadrique taps the map. \"Ronda also controls the main road between the coast and Granada's interior. Any supply convoy from Granada city to the coastal region would likely pass through or near Ronda. It's the natural hub for coordinating operations in this area.\"\n\nDon Luis continues: \"We haven't assaulted it yet because it's... formidable, Your Majesty. We'd need the full artillery train, a major siege effort, perhaps six thousand men minimum. And while we're tied down besieging Ronda, the raiders would simply operate from elsewhere—Gaucín, or other hill positions.\"\n\nHe meets your eyes. \"But if Your Majesty is right about supplies being the key... Ronda is likely where those supplies are stored. The fortress certainly has the magazines and infrastructure to support a large raider force. Take Ronda, and we might cripple their entire operation.\"\n\nDon Rodrigo adds carefully: \"The problem is getting there, Your Majesty. It's thirty-five miles through raider country. Moving an army with artillery to Ronda would be... well, exactly the kind of slow-moving target these raiders love to hit.\"\n\nThe council looks at you, waiting to see where you take this line of thinking.\n\nWhat do you propose?"
        },
        {
          "role": "player",
          "text": "But we know they are coming and this forces them to come to us. We use this to our advantage and take enouth crossbow men with us. We walk slow but determined, and shoot them down if they come too close. We keep a good watch and take the cannons with us.\n\n\nWe almost have them surrounded. To their north lie our own Castillian lands, and we have taken the southern ports. If we take Ronda we have another base of operations we can use to patrol and secure the area. There will be nowhere left for them to hide.\n\n\nAfter we take out Ronda, can we also strike their villages in the surrounding area? They cannot keep their horses fed on air."
        },
        {
          "role": "gm",
          "text": "1. March to Ronda slowly and deliberately with heavy crossbow escort\n2. Use the march as bait - the raiders will be forced to either let them through or attack into prepared formations with missile support\n3. Take Ronda to establish a base of operations in the interior\n4. Use Ronda as a hub to patrol and control the region\n5. Strike the villages that support the raiders to cut off their supply base\n\nThis is actually quite sound militarily. The slow, defended advance with massed crossbows addresses the mobility problem. The strategic goal of taking Ronda makes sense - it would give them control of the interior. And targeting the supply infrastructure (villages) is exactly what's needed to make the raider force unsustainable.\n\nThe commanders should react positively to this - it's a coherent plan that addresses their concerns. They might raise some practical questions about timing, force composition, etc., but the basic strategy is solid.\n\nJuan is also asking about striking villages - this gets into the harsh reality of medieval counter-insurgency warfare. Historically, this kind of scorched earth approach was common and effective, though brutal. The commanders would likely acknowledge this as necessary, though some might have concerns about the morality or practicality.\n\nI should have the commanders respond positively but also discuss the practical details and implications.\n\nDon Luis's face lights up with understanding. \"Your Majesty sees it clearly. We've been reacting to them—they choose when and where to strike. But a march on Ronda inverts the equation entirely. They must react to us.\"\n\nDon Rodrigo stands, excited now. \"Exactly. If we march toward Ronda with artillery and an army, they face an impossible choice: Let us take their main fortress and supply hub, or attack us on ground we've prepared. And if they attack...\" He gestures to the crossbowmen discussion. \"They attack into massed missile fire with our cavalry ready to counter-charge.\"\n\nPietro Calabrese nods vigorously. \"Is perfect, Majesty. We bring five, six bombards. March slow—eight, ten miles per day. Every night, we make camp like fortress. Wagons in circle, crossbowmen on perimeter, cavalry inside ready to sally. The raiders, they must watch us get closer, closer to Ronda. If they do nothing, we take their stronghold. If they attack...\" He smiles grimly. \"We kill many.\"\n\nDon Luis paces, thinking through logistics. \"We'd need six thousand men minimum. Two thousand cavalry, four thousand infantry—half with crossbows. The artillery train with full ammunition. Supplies for two weeks on the march, then sustained siege operations.\" He looks at you. \"It's a major commitment, Your Majesty, but the strategic logic is sound. Ronda is the linchpin of their entire raiding operation.\"\n\nAdmiral Fadrique adds: \"And Your Majesty is right about the geography. We hold the coast—they can't escape south. Castile proper is north—they can't retreat there. If we take Ronda and establish a garrison strong enough to patrol eastward...\" He traces lines on the map. \"We've effectively boxed them into an ever-shrinking area.\"\n\nThen you raise the question of villages.\n\nThe room falls briefly quiet. Don Rodrigo speaks carefully: \"Your Majesty asks about the surrounding villages. Yes, they must be addressed. Two thousand horses cannot survive without local support—the Moorish villages in the hill country are feeding them, providing fodder, intelligence, shelter.\"\n\nDon Luis meets your eyes directly. \"If we're serious about ending the raiding, we must cut their supply base. That means...\" He chooses words precisely. \"Destroying the villages' capacity to support military operations. Burning stored grain and fodder. Taking or scattering livestock. Making it impossible for those villages to feed raiders.\"\n\nDon Rodrigo adds: \"After we take Ronda, cavalry columns could sweep the surrounding valleys. Any village supporting the raiders—we give them one chance to submit to Castilian authority, provide hostages, swear fealty. If they refuse or if we find evidence they've been supplying raiders...\" He doesn't finish the sentence.\n\nAdmiral Fadrique speaks quietly: \"It's harsh, Your Majesty. But this is how occupations work. The villages will support whoever controls them—through loyalty or fear. Right now they support the raiders because Granada still seems strong. Once Ronda falls and we demonstrate we control the region...\" He shrugs. \"Most will submit rather than be destroyed.\"\n\nDon Luis concludes: \"Your Majesty's strategy addresses every element: Take Ronda to eliminate their stronghold and supply hub. Use the march to force them into unfavorable battles. Then systematically deny them the local support network that makes raiding sustainable. Within weeks, their cavalry force becomes unsustainable. They either disperse, retreat to Granada city, or starve.\"\n\nHe places both hands on the table. \"It's a complete operational plan, Your Majesty. We've been fighting symptoms for months. You've identified how to eliminate the cause.\"\n\nThe council waits. This is a major strategic decision—committing the western army to an interior campaign rather than continuing coastal fortress captures.\n\nWhat are your orders? Should they begin preparations for the march on Ronda?"
        },
        {
          "role": "player",
          "text": "Are we ready to put this plan into action? Are there still things we need to discuss?"
        },
        {
          "role": "gm",
          "text": "1. Timeline - when to launch this operation\n2. Force composition - exact numbers of troops, artillery, supplies\n3. What happens to current operations (fortress captures along coast)\n4. Communications with eastern army/Jaén\n5. What if Granada sends reinforcements from the capital\n6. Garrison requirements for Ronda after capture\n7. Duration estimates\n8. Contingency plans if things go wrong\n\nI should have the council raise these practical questions that need answers before launching a major campaign. This gives the player a chance to think through details and make informed decisions.\n\nDon Luis exchanges glances with his commanders, then addresses you: \"Your Majesty, the strategy is sound. But before we commit, there are practical matters we should resolve.\"\n\nHe ticks off points on his fingers:\n\n\"First—timing and readiness.\" Don Rodrigo speaks up: \"We'd need four to five days to organize this properly. Recall garrisons to concentration points, redistribute troops for optimal composition, pack artillery and ammunition, assemble wagon trains. We can't just march tomorrow.\"\n\n\"Second—force allocation.\" Don Luis continues: \"We have twelve thousand men total in the west. If we commit six thousand to Ronda, that leaves six thousand holding our coastal fortresses and maintaining operations here in Málaga. Is that acceptable, Your Majesty? It means coastal fortress captures stop during the Ronda campaign.\"\n\n\"Third—duration.\" Pietro Calabrese: \"The march—ten days, maybe twelve to reach Ronda through that terrain. The siege—if they resist, maybe two to three weeks with the bombards. Then consolidation, garrison establishment, village-clearing operations—another two weeks minimum. We're discussing five to seven weeks total, Majesty. Well into November.\"\n\nDon Rodrigo adds: \"Which raises the question—if this extends into late November or December, do we continue despite weather? Or do we complete the Ronda operation and then consider winter quarters?\"\n\n\"Fourth—communications.\" Admiral Fadrique: \"Your Majesty, what of the eastern army? Don Álvaro de Estúñiga and the forces at Jaén? Should they be informed of this operation? Coordinated actions? They're facing the same raiders on their supply lines.\"\n\n\"Fifth—Granada's response.\" Don Luis's face is serious: \"Your Majesty, when we march on Ronda with six thousand men and artillery, Granada city will notice. Sultan Yusuf might send reinforcements—perhaps a relief force to break our siege. Do we have contingencies if a major enemy army approaches while we're committed to besieging Ronda?\"\n\n\"Sixth—what happens after.\" Don Rodrigo: \"Once we take Ronda, how large a garrison do we leave? A fortress that size, in hostile territory, needs at least a thousand men to hold securely. That further reduces our mobile forces.\"\n\nDon Luis concludes: \"Your Majesty, these aren't obstacles—they're just details we need to settle before beginning. The plan is excellent. We simply need to ensure everyone understands the commitment we're making.\"\n\nHe looks at you expectantly. \"Should we go through these points now? Or does Your Majesty need time to consider before issuing final orders?\"\n\nWhat do you want to address?"
        },
        {
          "role": "player",
          "text": "Lets adress them one by one.\n\n\nWe prepare, then we march.\n\n\nWe have started 32.000 men on the campain. We have taken some casualties and have garrissoned the forts we have taken. But that leaves us with about 28.000 men ready to serve. Most are concentrated here near Loja and Malaga. We have sent 11.000 west to take the coastal forts, but we pause these operations while we deal with the raiders. The ports will be supplied by sea or by land transport under heavy guard. So these men are now available for either garisson duty on ports or something else. We march 6.000 to Ronda and keep a decent force in Malaga and Loja. About 12.000 troops. More than enough to counter any relief force the sultan sends. These numbers are my estimates, not the real situation.\n\n\nThe campain ends in November. I have called for an assembly of the Cortes in Jaen this November. So we have to take Ronda before that. After that, we hunker down for winter quarters and consolidate our gains. They can no longer hurt us then.\n\n\nWe move out and inform the other armies to be alert and to destroy any caravan carrying supplies to the raiders and to intercept any reinforcements the sultan sends.\n\n\nWe leave 1000 men in Ronda and go into winter quarters.\n\n\nAny more questions?"
        },
        {
          "role": "gm",
          "text": "1. **Timing and readiness**: \"We prepare, then we march\" - acknowledged, will take 4-5 days\n2. **Force allocation**: He's working with estimates but basically saying:\n   - Started with 32,000\n   - Now ~28,000 available after casualties/garrisons\n   - 11,000 in western operations (coastal forts) - these pause and become available\n   - 6,000 march to Ronda\n   - 12,000 stay in Málaga/Loja area for defense/reserves\n3. **Duration**: Campaign ends November, must finish before Cortes assembly in Jaén\n4. **Communications**: Inform other armies to be alert, intercept supplies/reinforcements\n5. **Granada's response**: 12,000 troops in reserve can counter any relief force\n6. **What happens after**: 1,000 man garrison in Ronda, then winter quarters\n\nThe user is being decisive and strategic. The council should respond to this. They might:\n- Point out any issues with his numbers/estimates\n- Ask for clarification on specific points\n- Generally approve the plan\n- Maybe raise one or two remaining practical concerns\n\nI should have Don Luis and the commanders respond to this comprehensive directive. They'd likely be impressed by the strategic thinking, maybe offer some corrections to numbers based on actual current status, and then move toward implementation.\n\nLet me have them respond realistically - they know the actual troop dispositions better than Juan's estimates.\n\nDon Luis listens intently, nodding as you lay out each point. When you finish, he exchanges glances with his commanders—there's visible respect in their faces. The Master of Santiago speaks:\n\n\"Your Majesty has thought this through comprehensively. Let me confirm our actual numbers so we're working with precision.\"\n\nHe consults briefly with Don Rodrigo, then continues:\n\n\"Current Western Forces:\"\n\nTotal under my command: approximately 10,500 combat-effective\n\nMálaga garrison and immediate area: 3,800 men\n\nCoastal fortress garrisons (Marbella, Estepona, etc.): 2,200 men spread across six positions\n\nField forces available for mobile operations: 4,500 men\n\n\"So we're somewhat under Your Majesty's estimates for the west, but the principle holds—we can field six thousand for Ronda by drawing from garrisons and concentrating forces. We'd leave bare-minimum fortress garrisons, supplied by sea as Your Majesty suggests.\"\n\nDon Rodrigo adds: \"The eastern army under Don Álvaro de Estúñiga at Loja—last report showed approximately 17,800 combat-effective after summer casualties and garrison commitments. More than sufficient to counter any relief force the Sultan sends, as Your Majesty says.\"\n\nAdmiral Fadrique nods: \"Naval supply to coastal fortresses is already functioning. We can maintain those garrisons indefinitely by sea without land convoys.\"\n\nDon Luis continues: \"So the refined plan: We take four to five days to concentrate six thousand men—I'm thinking two thousand cavalry, four thousand infantry with heavy crossbow component. March to Ronda, besiege and take it, leave one thousand garrison as Your Majesty orders. This must complete by early November for the Cortes assembly in Jaén.\"\n\nPietro Calabrese interjects: \"Is tight timing, Majesty. Today is September 19th. We start march September 24th, maybe 25th. Reach Ronda by October 7th or 8th. Siege two to three weeks—that brings us to November 1st, maybe sooner if they surrender quickly. Is possible, but no delays allowed.\"\n\nDon Luis nods. \"Tight but achievable. And Your Majesty's point about winter quarters is well-taken. After Ronda falls and we establish the garrison, the raiding threat is broken. We can consolidate through winter, prepare for spring 1432 campaign against Granada city itself.\"\n\nHe looks around the council table. \"Any remaining concerns?\"\n\nDon Rodrigo speaks carefully: \"Your Majesty, one practical matter. The march to Ronda—who commands? You've taken personal command of operations here. Will Your Majesty lead the march, or delegate to myself or another commander?\"\n\nThe question hangs in the air. The assembled commanders watch you. This is a significant decision—whether you personally lead this dangerous march through raider country, or remain in Málaga coordinating while a subordinate executes.\n\nWhat is your decision, Your Majesty?"
        },
        {
          "role": "player",
          "text": "I will lead this army bound for Ronda myself. Everything hinges on the success of this operation. I take Don Rodrigo with me to function as second in command.\n\n\nCrusaders, you have your orders.\n\n\nNow, I must speak to my cousin who has been wounded. Is he nearby?"
        },
        {
          "role": "gm",
          "text": "Given the geography and military situation:\n- Enrique was operating from the eastern positions (near Loja)\n- He was wounded in August\n- It's now mid-September\n- Málaga is the western command, Loja is the eastern command\n\nMost likely Enrique would have recovered near the eastern army positions, not at Málaga. But let me check if there's any indication he might have been moved...\n\nActually, looking at the character tracker and summaries, there's no specific mention of where Enrique went after being wounded. It's reasonable that he might have been sent to Málaga for better medical care and to report on the failure, or he might still be with the eastern forces.\n\nI think the most logical scenario is that Enrique is NOT currently at Málaga - he would be with the eastern forces near Loja, or possibly sent back to Jaén. Juan just came from Jaén, so he might have seen him there, but the question implies Juan doesn't know where Enrique is.\n\nI should have Don Luis or someone tell Juan where Enrique currently is located. Given that this is September and Enrique was wounded in August, he's probably recovered enough to be active again but might still be recuperating.\n \nDon Luis clarifies Enrique's location, explaining he's currently recuperating with the eastern military units near Loja, not in Málaga as Juan initially wondered.\n\nDon Luis bows his head. \"Your Majesty will lead personally. Understood.\" There's no hesitation in his voice—just acknowledgment. Don Rodrigo straightens, clearly honored to serve as second-in-command. \"I will not fail you, Your Majesty.\"\n\nThe other commanders rise, bowing. \"We have our orders, Your Majesty. Preparation begins immediately.\" They file out, already calling for their subordinates, the machinery of the campaign beginning to turn.\n\nDon Luis remains a moment longer. At your question about Infante Enrique, he shakes his head. \"No, Your Majesty. The Infante is not here. After his wound in August, he remained with the eastern forces near Loja under Don Álvaro de Estúñiga's care. Last report I received—perhaps ten days ago—indicated he'd recovered from the lance wound well enough. Participating in command councils, but not yet riding on patrol.\"\n\nHe pauses. \"I believe he's still at Loja with the eastern army, Your Majesty. The wound wasn't life-threatening, but it was serious enough to keep him from active field operations for several weeks. From what I understand...\" Don Luis chooses his words carefully. \"The Infante took the ambush failure hard. He's been keeping to his duties but hasn't volunteered for any independent commands since.\"\n\nThe Master of Santiago meets your eyes. \"If Your Majesty wishes to see him, it's two days' ride north to Loja. Or we could send a fast messenger summoning him here to Málaga before the Ronda march begins. That would take four to five days—he could arrive just as we're ready to depart.\"\n\nHe waits for your decision. The sun has fully set now; torches are being lit throughout the fortress. Outside, you can hear the sounds of an army camp coming to life with new purpose—orders being shouted, equipment being gathered, the first stirrings of the campaign to come.\n\nWhat do you wish to do about Enrique?"
        },
        {
          "role": "player",
          "text": "I write a letter to Enrique,\n\n\nDear Cousin,\n\n\nI have taken command of an army to strike against Ronda. I am relieved to hear that you are recovering well from your wound. Don't be too harsh on yourself as I know you feel responsible for the ambush. God has granted you another chance to serve his cause.\n\n\nI am ordering you to rest and recover for now. When you are healed, I am looking forward to fight alongside you again on the field of battle.\n\n\nKeep faith,\n\n\nJuan.\n\n\nThen I help prepare the army until it is ready."
        },
        {
          "role": "gm",
          "text": "Your letter is dispatched that night with a fast rider north to Loja. The messenger departs with instructions to deliver it personally to Infante Enrique and return with any reply.\n\nThe next five days transform Málaga from a garrison city into a staging ground for major offensive operations.\n\nDay One - September 20th:\n\nDon Rodrigo de Perea takes charge of troop concentration. Messengers ride to every coastal fortress with orders: strip garrisons to minimum holding forces, send all spare troops to Málaga. Admiral Fadrique coordinates naval supply schedules to ensure the reduced coastal garrisons can be sustained by sea.\n\nPietro Calabrese personally inspects his bombards. Six medium guns are selected for the march—powerful enough to breach Ronda's walls, light enough to move through hill country. Ammunition wagons are loaded: stone shot, powder kegs wrapped in oiled canvas, slow-match, tools for repairs. His Italian gun crews work with quiet efficiency.\n\nDay Two - September 21st:\n\nThe first reinforcements arrive from Marbella—eight hundred infantry, two hundred cavalry, looking grateful to be moving against the raiders who've tormented them for months. Camp spreads outside Málaga's eastern walls. You walk among the assembling troops, and word spreads quickly: the king himself will lead this march.\n\nCrossbowmen are organized into specialized companies. Sixteen hundred crossbowmen total, formed into units of two hundred each with their own sergeants. Windlass crossbows for maximum penetration, pavise shields for protection while reloading. These men will be the backbone of your defensive formations.\n\nDay Three - September 22nd:\n\nMore troops pour in. Estepona's garrison, Casares, the smaller coastal positions. The cavalry components are sorted—heavy horse for shock charges, light cavalry for scouting and pursuit. Two thousand cavalry in total, divided into ten squadrons of two hundred each under experienced captains.\n\nSupply trains are organized with obsessive care. This army must be self-sufficient for two weeks on the march through hostile territory. Grain, salted meat, wine, fodder for thousands of horses, tools, rope, medical supplies. The wagon train stretches for half a mile.\n\nDay Four - September 23rd:\n\nDon Luis holds a final strategic conference. The march order is established: scouts in front, then vanguard of cavalry and crossbowmen, then the main body with you and the artillery train in the center, then rearguard. Defensive camp protocols are drilled—every man knows his position when forming laager at night.\n\nYou review the infantry companies personally. These are professionals—veterans of the spring and summer campaigns, men who've already fought Granada and won. They look at you with confidence, not just duty. The Alcalá la Real victory, the coastal conquests—these men believe they're winning this war.\n\nDay Five - September 24th:\n\nDawn breaks clear and cool. The army stands assembled in marching order outside Málaga's eastern gate. Six thousand men, six bombards, supply train, everything organized and ready.\n\nDon Rodrigo de Perea rides up to report: \"Your Majesty, all units accounted for. Scouts are ready to advance. The artillery train is prepared. We await only your command to march.\"\n\nDon Luis approaches as well. He'll remain in Málaga as overall western commander, coordinating the garrisons and maintaining naval supply. \"Your Majesty, may God grant you victory at Ronda. We'll hold everything here until you return.\"\n\nThe army waits. Málaga's walls are lined with those staying behind—garrison troops, sailors, civilians—watching the largest military operation they've seen in months prepare to march into the interior.\n\nThe road to Ronda stretches northeast, leading into the hill country where Granada's raiders have operated with impunity for months.\n\nWhat do you do?"
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_PLACEHOLDER_005",
      "book": 1,
      "chapter": "1.23",
      "date": "1431-09-24",
      "end_date": "1431-10-03",
      "type": "military",
      "summary": "Juan rides out in white armor, delivers rousing speech invoking 'Non Nobis Domine', and leads 6,000 men northeast toward Ronda. Intelligence gathered from converts and Mozarab guides about terrain, water sources, and raider positions. Village policy established: one chance to submit, refusal means destruction. Roll 74 (Good Progress): 10-day march with raiders shadowing but unable to break crossbow-defended formation. Village of Alozaina submits peacefully. Village of Yunquera resists and is stormed after bombardment, destroyed as example. Two more villages submit after Yunquera's fate. Total casualties approximately 65 men. Army arrives at Ronda intact and ready for siege.",
      "characters": [
        "juan_ii",
        "rodrigo_de_perea",
        "pietro_calabrese",
        "fernan_alonso_de_robles"
      ],
      "factions_affected": [],
      "location": "Road to Ronda",
      "tags": [
        "military",
        "march",
        "roll",
        "villages",
        "ronda_campaign",
        "speech"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "I walk out in my white armouor and mount my horse with white banners and ride out in front of the troops.\n\n\nMen of Castille!\n\n\nMany victories have we won already against the infidels, and many more will be added to our tally. They cannot stop us, only delay us and they know it. For months they have been harassing our supply convoys, too afraid to meet us in open battle like honourable combat would demand. Afraid because they know they can never stand against us in the open. The devil hides in the darkness.\n\n\nBut that is where I will lead you. Today we set out to strike straight into the enemy's main fort. We will find them and we will kill them. And we will march on until there is no field left to hide in, no bush to cower behind. Until there is nothing left but the light of the lord.\n\n\nI draw my sword.\n\n\nMen of Castille, non nobis domine!\n\n\nI ride out."
        },
        {
          "role": "gm",
          "text": "The speech hits several key notes:\n1. References past victories\n2. Calls out the raiders' tactics as cowardly/dishonorable\n3. Frames this as bringing light vs darkness (religious framing)\n4. Uses his father's sword motto \"Non Nobis Domine\" (Not unto us, O Lord)\n5. Leads from the front in his distinctive white armor\n\nThe army would respond enthusiastically - these are veterans who've won battles, who are frustrated by the raiding, and who are seeing their young king personally lead them into danger.\n\nI should describe:\n- The visual of Juan in white armor with white banners\n- The army's response to the speech\n- The beginning of the march\n- Perhaps the mood/atmosphere as they set out\n\nI should NOT narrate what Juan thinks or does beyond what the player stated. Stop after describing the march beginning and the immediate atmosphere.\n\nThe March Begins\n\nYour white armor catches the morning sun like a beacon as you ride before the assembled host. The white banner snaps in the breeze above you—that same banner carried at Alcalá la Real, symbol of the crusade's sacred purpose. Your father's sword gleams in your hand, the inscription Non Nobis Domine visible to those closest.\n\nThe speech rings across the formation. Six thousand men stand in absolute silence as your words carry—victories won, cowards hiding, the march into darkness to bring light.\n\nWhen you draw the sword and cry \"Non Nobis Domine!\" the response is instantaneous and thunderous:\n\n\"NON NOBIS DOMINE!\"\n\nSix thousand voices roar it back. The words echo off Málaga's walls. Men raise weapons, beat sword on shield, stamp feet. The crossbowmen pound their pavises against the ground in rhythm. The cavalry horses dance and snort, catching their riders' energy.\n\n\"NON NOBIS DOMINE! NON NOBIS DOMINE!\"\n\nThe chant becomes a battle cry, a prayer, a promise. On the walls, the watching garrison takes it up. Even the civilians join—washerwomen, merchants, children, everyone shouting the ancient crusader motto.\n\nYou turn your horse toward the northeast road and spur forward. The white banner streams behind you.\n\nThe army follows.\n\nThe vanguard cavalry moves first—two hundred horsemen forming protective screen. Then the scouts fan out ahead, already alert for raiders. The main column begins its march: crossbowmen in tight formation, infantry companies in marching order, the rumble of artillery wagons, thousands of boots and hooves churning dust from the coastal road.\n\nDon Rodrigo rides near you, his face set with fierce determination. Captain Fernán and your royal guard form a protective ring. Pietro Calabrese shouts instructions in Italian-accented Castilian as his gun crews maneuver the bombards into the column.\n\nThe army stretches behind you like a great serpent—white banners, red crosses, the glint of steel and the forest of spears. Not raiders to be hunted through hills, but an army—disciplined, purposeful, terrible.\n\nBy noon, Málaga has vanished behind the coastal hills. The road climbs into rougher country—olive groves, scattered cork oak forests, rising terrain. This is the beginning of the hill country, the approaches to the mountains where Ronda sits.\n\nThe scouts report no contact yet. The raiders surely know you're coming by now—six thousand men cannot move invisibly—but they haven't shown themselves.\n\nThe march continues through afternoon heat. No incidents. Professional, steady progress. By evening, you've covered twelve miles—good time for an army with artillery.\n\nDon Rodrigo selects the night's camp position: a hilltop with good sightlines, near water. The wagons are drawn into defensive circle. Crossbowmen deploy on the perimeter. Cavalry remains saddled and ready inside the laager. Camp fires are lit as sentries take their posts.\n\nYou stand on the hilltop as darkness falls, looking northeast toward where Ronda lies—still thirty miles away through increasingly hostile country. Somewhere out there, the raiders watch and plan.\n\nWhat do you do?"
        },
        {
          "role": "player",
          "text": "We have taken what is left of the converts and hired garissons with us. What can they tell us of the terrain ahead and what we may expect?"
        },
        {
          "role": "gm",
          "text": "Don Rodrigo would be the right person to organize this intelligence briefing since he's the scout commander and second-in-command. I should provide useful tactical intelligence about:\n- Terrain features\n- Known raider positions or patterns\n- Villages in the area\n- Water sources\n- Defensive positions\n- The approach to Ronda\n- Any ambush likely spots\n\nThis should be realistic medieval intelligence - imperfect, sometimes contradictory, but useful.\n\nDon Rodrigo responds to your summons, bringing three men with him to the command tent: a converted Moor from Málaga's garrison who served Granada before his baptism, a Mozarab merchant who traveled these roads for years, and a former prisoner—a minor Moorish knight captured at Marbella who accepted baptism and service rather than ransom.\n\nThe converted garrison soldier speaks first, kneeling. His Castilian is heavily accented but clear: \"Your Majesty, the road ahead—is not one road. Many paths through the hills, but only two good for wagons and cannons.\"\n\nHe sketches in the dirt with a stick. \"The main route goes through valley here—follows the Guadalhorce River part of way. Is easier for artillery, but...\" He hesitates. \"Many places where road narrows. Passes, fords, bridges. Good places for ambush. The raiders, they know this road well.\"\n\nThe Mozarab merchant adds: \"I traveled to Ronda many times before the war, Your Majesty. The route the soldier describes takes perhaps eight to ten days with heavy wagons. There are Moorish villages along the way—six or seven substantial ones. They've been supporting the raiders with food, fodder, information. Some have fortified watchtowers that can signal our approach.\"\n\nDon Rodrigo interjects: \"We've confirmed this from other sources. The villages serve as the raiders' eyes and supply network.\"\n\nThe converted knight speaks—his Castilian is better, suggesting education: \"Your Majesty, Ronda itself sits on plateau cut by deep gorge. The fortress complex guards the northern approach—only practical route for artillery. The southern and eastern sides...\" He shakes his head. \"Cliffs, Majesty. Hundreds of feet down to the Guadalevín River. Cannot bring cannons those ways.\"\n\nHe continues: \"The raiders operate from multiple positions. Ronda is main base, yes, but also Gaucín to the west, and smaller fortified positions in the hills. Perhaps five hundred cavalry at Ronda itself, the rest spread among these positions. They rotate—some raid while others rest and refit.\"\n\nThe garrison soldier adds: \"Water is problem in these hills, Your Majesty. Not like the Vega. Springs and streams, but must know where they are. The raiders, they know every water source. An army that does not find water...\" He makes a throat-cutting gesture.\n\nThe Mozarab elaborates: \"There are three reliable water sources on the main route—one at two days' march, another at five days, the third at seven days near Ronda's approaches. The villages also have wells, but if they're hostile...\"\n\nDon Rodrigo speaks: \"Your Majesty, based on all intelligence, I expect the raiders will do several things: First, the villages ahead will send warning signals the moment they see us. Second, the raiders will shadow our march, looking for opportunities—stragglers, foraging parties, vulnerable moments. Third, they'll likely attempt at least one major attack at a chokepoint where our formation is compressed. Fourth, the villages may hide their supplies or even evacuate ahead of us.\"\n\nThe converted knight adds quietly: \"Your Majesty should also know—some of these hill villages are fanatic. They will not surrender even when defeat is certain. The people there...\" He searches for words. \"They hate Christians more than they fear death. Not all villages, but some.\"\n\nHe meets your eyes. \"Ronda's garrison is perhaps three thousand men, including the raiders based there. The fortress can withstand long siege if supplied. But Your Majesty's cannons...\" He nods toward where the bombards are positioned. \"Those walls were built when gunpowder was new. They will not hold long against sustained bombardment.\"\n\nDon Rodrigo summarizes: \"So we face: eight to ten days march through increasingly hostile terrain, multiple ambush opportunities, villages that will resist or flee, water sources we must secure, and finally a fortress with three thousand defenders on nearly impregnable ground—but vulnerable to artillery if we can get the guns into position.\"\n\nHe looks at you. \"Your Majesty, is there anything specific about the route or the enemy you wish to know more about?\"\n\nWhat do you ask?"
        },
        {
          "role": "player",
          "text": "What should we do with these villages we pass along the way? They are operating for the raiders, we cannot let that continue. We shoud destroy their livestock and take their food. Muslims may fend for themselves, we take anyone friendly to us with us to live in Ronda once we take it."
        },
        {
          "role": "gm",
          "text": "Thought process\n\nThe user is asking about how to treat villages in the context of a historical roleplay set in medieval 15th century crusade. This involves military strategy against civilian populations.\n\nI need to be careful here. The context is:\n1. This is a historical roleplay/game set in 1430 Castile during the Granada crusade\n2. The user is asking about military strategy regarding villages supporting enemy forces\n3. This involves questions about forced displacement, destruction of property, and treatment of Muslim populations\n\nThe instructions say I should not moralize with modern standards for this historical setting, and that the game includes \"savage aspects like violence, religious conflict, and crusader messiness without modern moralizing.\"\n\nHowever, I still need to be careful not to:\n- Provide detailed guidance on harming civilians\n- Glorify or endorse ethnic cleansing or religious violence\n- Make this gratuitously graphic or celebratory\n\nI should:\n- Keep it in the historical context\n- Have the NPCs respond realistically to a medieval military strategy question\n- Not be preachy about modern values\n- But also not be gratuitously detailed about violence against civilians\n\nThe user's proposal involves:\n- Taking livestock and food (standard medieval warfare practice)\n- Forced displacement (Muslims \"fend for themselves\", Christians taken to Ronda)\n- Essentially destroying the villages' ability to support the raiders\n\nI can have the NPCs discuss this as a military strategy in the medieval context, with some acknowledging the harsh realities and practical considerations, without making it graphic or providing detailed instructions on harm. I'll keep it tactical and strategic rather than getting into graphic details of violence.\n\nDon Rodrigo nods slowly, understanding the military logic. \"Your Majesty speaks of denying the raiders their supply base. It's harsh, but effective.\"\n\nThe converted knight speaks carefully: \"Your Majesty, this is... standard practice in these wars. What you describe—taking livestock, seizing grain stores, removing the villages' ability to support enemy forces—Granada has done the same to Christian villages for centuries. The difference is how thoroughly it's executed.\"\n\nDon Rodrigo elaborates: \"We have several options for each village we encounter:\n\nFirst approach—offer terms: Demand immediate submission. Those who swear fealty to Your Majesty and convert may remain under Castilian protection. Those who refuse conversion but agree to vassalage pay tribute and provide hostages. Any who resist...\" He pauses. \"Face the consequences of supporting the rebellion.\"\n\nThe Mozarab merchant adds: \"Your Majesty, some villages may submit immediately when they see six thousand men with cannons. Fear is a powerful negotiator. But others, especially the fanatic ones...\" He shakes his head.\n\nThe garrison soldier speaks bluntly: \"Your Majesty, if you want to break the raiders, must break their support. Take the food, take the animals, burn what cannot be carried. The people—give them choice: submit to Castile or leave with nothing. Those who choose neither...\" He shrugs. \"Cannot allow enemy in rear while army marches to Ronda.\"\n\nDon Rodrigo continues more carefully: \"The practical execution, Your Majesty: As we approach each village, we send emissaries with terms. Immediate surrender, swear fealty, hand over all supplies and livestock. Christians and those willing to convert come under our protection—they can resettle in Ronda or coastal cities after we take it. Those who refuse to submit are given time to leave—take their families and go to Granada city or wherever they wish, but they leave with nothing. The village's resources become ours.\"\n\nHe meets your eyes. \"Those who resist or attack our forces forfeit mercy. Standard rules of war.\"\n\nThe converted knight adds: \"Your Majesty should know—the civilians in these villages are not warriors. Mostly farmers, shepherds, craftsmen. The raiders themselves are soldiers based at Ronda and other fortresses. The villages just... support them because Granada tells them to. Give them a way to submit, and many will take it rather than die for a losing cause.\"\n\nDon Rodrigo nods. \"I recommend this approach: Each village gets one chance. Submit immediately, hand over supplies, accept Castilian authority. Those who cooperate are treated fairly—no massacre, no enslavement, just requisition of military supplies and livestock. But villages that resist, that fight, or that we find have been actively collaborating with raids...\" His voice hardens. \"Those face destruction. We cannot leave hostile populations in our rear while besieging Ronda.\"\n\nThe Mozarab adds practically: \"The livestock and grain we take will help feed our army, Your Majesty. We'll need it for the siege. And breaking the raiders' supply network—this may force them to surrender Ronda faster, knowing they cannot outlast us.\"\n\nDon Rodrigo concludes: \"Your Majesty, this is how medieval warfare works in occupied territory. It's not gentle, but it's effective. The question is how systematically we execute it, and how much mercy we show those who submit versus those who resist.\"\n\nHe waits for your specific orders on how to handle the villages.\n\nWhat are your commands?"
        },
        {
          "role": "player",
          "text": "Than this is how we do it. We offer them one chance. I am leading the army myself so I can accept their oath of fealty personally and immediately. Explain to them that we have taken their ports and that it is only a matter of time before these lands will be christian anyway.\n\n\nNow, lets move on.\n\n\nSo new lets draft a d100 table about what happens now that we have made our plans."
        },
        {
          "role": "gm",
          "text": "Thought process\n\nThe player wants to continue the march to Ronda with the village policy established. I need to create a d100 table for what happens during the march to Ronda. This will cover the 8-10 day journey through hostile territory with the established policy of offering villages terms.\n\nLet me think about the factors:\n\n**Factors in Favor:**\n- Large, well-organized force (6,000 men)\n- Heavy crossbow component (1,600 crossbowmen)\n- Professional troops, veterans of previous victories\n- Good intelligence from converts about terrain\n- Juan leading personally (morale boost)\n- Artillery train for intimidation\n- Clear defensive march protocols established\n- Policy of offering terms may get some villages to submit without fighting\n- Converts and guides who know the terrain\n- Cavalry for scouting and pursuit\n\n**Factors Against:**\n- 8-10 days through increasingly hostile terrain\n- Multiple ambush opportunities (passes, fords, narrows)\n- 1,500-2,000 raiders who know terrain intimately\n- Villages will signal approach (warning system)\n- Water sources limited and must be secured\n- Some villages may be fanatic and resist\n- Raiders emboldened by previous successes\n- Slow-moving artillery train is vulnerable\n- Long supply train to protect\n- Operating deeper into enemy territory each day\n- Raiders can choose when/where to attack\n\nThis is a complex operation with multiple elements - the march itself, village interactions, raider attacks, etc. I should create a comprehensive table that captures all these elements.\n\nThe range should probably be:\n- 1-12: Catastrophic problems (major ambush, multiple villages resist violently, heavy casualties, mission threatened)\n- 13-30: Serious difficulties (significant raider attacks, several villages resist, notable casualties, delays)\n- 31-55: Moderate challenges (some raider harassment, mixed village responses, acceptable casualties)\n- 56-78: Good progress (raiders harass but can't break formation, most villages submit, reach Ronda on time)\n\n- 79-92: Strong march (effective intimidation, villages submit quickly, minimal casualties, good position)\n- 93-100: Excellent operation (overwhelming show of force, villages capitulate, raiders can't touch them, perfect execution)\n\nI'll refine the upper ranges to reflect the force's increasing dominance. The higher rolls showcase Juan's strategic brilliance and the army's overwhelming capabilities. These top tiers represent scenarios where the army's reputation precedes them, causing widespread submission and neutralizing potential resistance before it can form.\n\nMarch to Ronda - D100 Resolution Table\n\nFactors in Favor:\n\nLarge, well-organized force (6,000 men) with clear command\n\nHeavy crossbow component (1,600) for defensive firepower\n\nProfessional veterans of Alcalá la Real and coastal campaigns\n\nJuan leading personally (major morale boost)\n\nArtillery train for psychological intimidation of villages\n\nClear defensive protocols and camp procedures\n\nGood intelligence from converts about terrain and water\n\nPolicy offering terms may secure peaceful submissions\n\nCavalry screen for scouting and quick response\n\nDisciplined formation learned from previous ambush experience\n\nFactors Against:\n\n8-10 days through increasingly hostile terrain\n\nMultiple natural chokepoints (passes, fords, narrow valleys)\n\n1,500-2,000 enemy raiders who know every hill and ravine\n\nVillage warning system will announce approach\n\nLimited water sources that must be secured\n\nSome fanatical villages likely to resist violently\n\nRaiders emboldened by summer successes\n\nSlow artillery train vulnerable at narrows\n\nLong supply train must be protected\n\nOperating deeper into enemy territory daily\n\nRaiders choose time and place of engagement\n\nCivilian population hostile in many areas\n\nSeptember heat still significant for loaded march\n\nD100 MARCH OUTCOME TABLE:\n\n1-12: Catastrophic March - Major coordinated raider attacks at multiple chokepoints. Several villages resist violently requiring costly assaults. Heavy casualties (400-600 men), lose significant supplies/animals. One or more bombards damaged or lost. Arrive at Ronda severely weakened, potentially too depleted for effective siege. Major delays (12-15 days).\n\n13-30: Serious Difficulties - Multiple significant raider ambushes inflict steady casualties (200-350 men). 2-3 villages resist and must be taken by storm. Water source denial attempts cause problems. Delays mount (11-13 days). Arrive at Ronda with reduced strength, troops demoralized by constant harassment.\n\n31-55: Moderate Challenges - Regular raider harassment throughout march. Mixed village responses—some submit, 1-2 resist requiring military action. Casualties moderate (100-180 men). Some supply losses from raids. Reach Ronda in 9-11 days, tired but functional. Standard difficult march through hostile territory.\n\n56-78: Good Progress - Raiders shadow and probe but crossbow discipline prevents major attacks. Most villages submit when they see the army; 1 resists and is destroyed as example. Casualties light (50-90 men). Secure water sources successfully. Arrive Ronda in 9-10 days, army intact and ready for siege operations.\n\n79-92: Strong March - Overwhelming show of force intimidates opposition. Villages submit rapidly after first example made. Raiders harass but can't penetrate formation—crossbowmen drive them off repeatedly. Minimal casualties (20-40 men). Arrive Ronda in 8-9 days, fresh and psychologically dominant. Raiders demoralized.\n\n93-100: Triumphant March - Perfect execution. Villages capitulate immediately seeing the king's white armor and massive host. Raiders attempt attacks but are bloodied and withdraw. Capture raider scouts, gain intelligence. Very light casualties (5-15 men). Arrive Ronda in 8 days with full strength and momentum. Army and villages convinced of Castilian inevitability.\n\nPlease roll your d100 and report the result."
        },
        {
          "role": "player",
          "text": "Rolled 74; Good Progress\n\n\nDescribe what happens until we arrive at Ronda."
        },
        {
          "role": "gm",
          "text": "Thought process\n\nThe user rolled 74, which falls in the \"Good Progress\" category (56-78). According to the table:\n\n\"Raiders shadow and probe but crossbow discipline prevents major attacks. Most villages submit when they see the army; 1 resists and is destroyed as example. Casualties light (50-90 men). Secure water sources successfully. Arrive Ronda in 9-10 days, army intact and ready for siege operations.\"\n\nI need to write a narrative covering the 9-10 day march from Málaga to Ronda, showing:\n- Raiders shadowing and probing but being driven off by crossbow discipline\n- Most villages submitting when they see the army\n- One village resisting and being destroyed as an example\n- Light casualties (I'll say around 60-70 men)\n- Successful securing of water sources\n- Arrival at Ronda with army intact and ready\n\nI should make this engaging, showing Juan's leadership, the effectiveness of the tactics, the psychological impact of the king leading personally, and the village responses. I should also show the gradual shift from coastal terrain to hill country approaching Ronda.\n\nI'll structure this chronologically across the march, showing key events without making it too long. The user wants me to stop when they arrive at Ronda and Juan needs to make decisions.\n\nThe March to Ronda\n\nDays 1-3: September 24-26, 1431 - The Coastal Hills\n\nThe first three days establish the pattern. Your army moves at a steady eight miles per day—slower than pure infantry could march, but the artillery sets the pace. Pietro Calabrese's bombards rumble along, oxen straining at the yokes, gun crews walking alongside their precious weapons.\n\nThe raiders appear on the second day. Distant horsemen on ridgelines, watching. They never come close—your scouts report movement, but every time cavalry deploys to investigate, the raiders melt back into the hills. At night, you see their campfires in the distance, like wolves circling a campfire.\n\nOn the third day, they probe. A band of perhaps eighty riders sweeps toward your supply train as it negotiates a narrow valley. But Don Rodrigo's dispositions hold perfectly—two hundred crossbowmen deploy from the column in moments, pavise shields locked together. The raiders charge to within a hundred yards, then wheel away as crossbow bolts begin to fly. Three of their horses go down. They don't try again that day.\n\nDay 4: September 27 - The First Village\n\nThe village of Alozaina sits astride the road, perhaps two hundred souls. Your scouts report they've seen the army coming—smoke signals went up yesterday from their watchtower.\n\nYou halt the army half a mile away and send emissaries: the converted knight and a translator, carrying a white flag. The terms are simple.\n\nAn hour later, the village elder walks out—an old man with a white beard, accompanied by the local imam. They kneel before you in your white armor. The elder's voice shakes: \"Your Majesty, we submit. We are simple farmers. We want no war with Castile.\"\n\nThe oath is sworn. The village hands over three hundred sheep, forty cattle, two hundred bushels of grain. The imam and a dozen families choose to leave, heading northeast toward Granada with whatever they can carry. The rest remain, uncertain but alive.\n\nYou leave twenty men to secure the village and its supplies, then continue.\n\nDays 5-6: September 28-29 - Deeper Into the Hills\n\nThe terrain grows rougher. Rocky valleys, olive groves clinging to steep hillsides, cork oak forests. The road narrows frequently. Your defensive protocols are tested repeatedly—each chokepoint negotiated with vanguard and rearguard deployed, crossbowmen ready.\n\nThe raiders attack the rearguard on Day 5 as it crosses a ford. One hundred fifty cavalry hit the tail of your column in a coordinated charge. But the sergeants have drilled this—crossbowmen form hedgehog, cavalry counter-charges from within the laager. The melee lasts ten minutes. You lose twelve men, but the raiders lose more. Bodies float downstream. They break off and don't return that day.\n\nOn Day 6, you secure a critical water source—a spring in a rocky valley. The raiders tried to foul it with dead animals the night before, but your scouts found and cleared it. The army drinks and fills water barrels. No one gets sick.\n\nDay 7: September 30 - The Resistant Village\n\nThe village of Yunquera sees you coming and bars its gates. It's larger than Alozaina—perhaps four hundred people, stone walls around the center, a fortified tower. When your emissaries approach with terms, arrows fly from the walls. One translator takes a shaft through the shoulder.\n\nDon Rodrigo looks at you. \"Your Majesty?\"\n\nYou give the order.\n\nPietro Calabrese positions two bombards. The first shots are ranging fire—stone balls smashing into the village walls, the thunder echoing through the valley. The fourth shot breaches the gate. The fifth collapses part of the tower.\n\nYour infantry storms through. The fighting lasts an hour—brutal, close-quarters work in narrow streets. The defenders fight fanatically, but they're farmers and shepherds against veteran crusaders. When it ends, eighty villagers are dead, including the local garrison of perhaps twenty actual soldiers.\n\nYou order the survivors assembled in the square. Women, children, old men—perhaps two hundred fifty people, terrified and weeping. You give them the same choice: convert and submit, or leave with nothing.\n\nFifty choose baptism on the spot—mostly the young and pragmatic, calculating survival. The rest are marched out of the village with whatever they can carry and sent northeast. Their livestock, grain stores, and valuables are loaded onto your wagons.\n\nThen you order the fortifications burned. The tower collapses in flames. The walls are pulled down where possible. When your army marches away the next morning, Yunquera is a smoking ruin that will never support raiders again.\n\nThe army's mood is grim but determined. The crossbowmen in particular are satisfied—the villagers shot first. This is war.\n\nDays 8-9: October 1-2 - The Final Approach\n\nTwo more villages submit immediately. Word has spread about Yunquera. Elders come out waving white cloths before your army even stops. They hand over everything requested without negotiation. You accept their oaths, leave small garrisons, move on.\n\nThe raiders shadow you constantly now—you're deep in their territory, approaching Ronda. They probe every chokepoint, every ford, looking for weakness. Your rearguard is attacked three times on Day 8 alone. But the defensive discipline holds. Crossbowmen form, cavalry counters, raiders withdraw. You lose men—a steady trickle of five here, eight there, twelve at one particularly sharp ambush—but the army's cohesion never breaks.\n\nOn Day 9, your scouts bring unexpected news: they captured three raider scouts in an ambush. Under interrogation, the prisoners reveal Ronda's garrison is preparing for siege. The Sultan sent no reinforcements—Granada city is too weak after Alcalá la Real. Ronda stands alone.\n\nDay 10: October 3, 1431 - Arrival at Ronda\n\nThe army crests a final ridge in the afternoon, and there it is.\n\nRonda.\n\nThe city sits on a massive limestone plateau, split by the Tajo gorge—a gash in the earth three hundred feet deep where the Guadalevín River has carved through stone over millennia. The fortress complex guards the northern approach where you stand, massive walls and towers built into the cliff edge. To the south and east, sheer drops to the gorge below. To the west, more cliffs and broken ground.\n\nIt's magnificent and terrible. One of Granada's strongest positions.\n\nBut you have six thousand men, six bombards, and the conquered coast at your back. Ronda's walls were built before gunpowder changed warfare forever.\n\nDon Rodrigo rides up beside you, studying the fortress. \"Your Majesty, we've arrived with minimal losses. Perhaps sixty-five men total—lighter than feared. The army is intact, supplied, and ready. The raiders are demoralized after failing to stop us.\"\n\nPietro Calabrese joins you, squinting at Ronda's walls with professional interest. \"Is strong fortress, Majesty. But the walls... I see where we position guns. Two weeks, maybe three, we bring those down. They cannot stop the bombards.\"\n\nYour army begins establishing camp on the high ground north of the city, out of bow range but close enough to intimidate. The defensive laager goes up with practiced efficiency—wagons circled, crossbowmen on perimeter, cavalry ready inside.\n\nFrom Ronda's walls, you can see figures watching. Banners fly—Granada's green standards, defiant in the afternoon sun. The garrison knows you're here. They know what's coming.\n\nDon Rodrigo awaits your orders. How do you wish to proceed with the siege?"
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_PLACEHOLDER_006",
      "book": 1,
      "chapter": "1.23",
      "date": "1431-10-03",
      "end_date": "1431-10-03",
      "type": "diplomacy",
      "summary": "Juan rides out in white armor to demand Ronda's surrender. Roll 36 (Conditional Negotiation): Qaida Muhammad ibn Rashid engages but wants guarantees. Juan dismounts and removes helmet, inviting face-to-face parley under truce. Muhammad accepts and emerges with escort. Juan offers terms: safe conduct for garrison, Muslims who stay pay taxes but remain unharmed, mosque converted to church, no forced conversions. Roll 25 (Rejection with Counter-Demands): Muhammad requests keeping one small mosque, written oath against forced conversion, reasonable taxation, and a formal treaty. Juan accepts these modifications, and Muhammad offers to stay two weeks to help the transition. They shake hands on the accord: Ronda will be surrendered peacefully over two days.",
      "characters": [
        "juan_ii",
        "muhammad_ibn_rashid",
        "rodrigo_de_perea",
        "fernan_alonso_de_robles"
      ],
      "factions_affected": [],
      "location": "Ronda",
      "tags": [
        "diplomacy",
        "negotiation",
        "surrender",
        "roll",
        "ronda_campaign"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "Deploy the siege lines and the guns. Then I mount up in my white horse and ride to demand the city's surrender like I always do. I go fully armed and make sure I have infantry to fall back on and take  cavalry escort with me. But I ride ahead.\n\n\nI speak to whoever holds this fort. You have one chance to surrender before I let the bombards pound your walls to dust. You know you cannot win and I give you the chance to surrender and prevent bloodshed. You know who I am. You know I always keep my word. You know that your situation is hopeless. I came here to pray you listen to reason, for your sake and for the sake of the people these walls protect.\n\n\nNow draft a d100 table so we can generate their response."
        },
        {
          "role": "gm",
          "text": "Thought process\n\nThis is a good dramatic moment - Juan riding out to demand surrender at Ronda. I need to create a d100 table for the garrison's response to his surrender demand.\n\nFactors in favor of surrender:\n- Juan's reputation for keeping his word (established at Alcalá la Real and other sieges)\n- Ronda is isolated - no reinforcements coming from Granada\n- They've watched Juan's army march through their territory systematically\n- The coastal cities have all fallen\n- Sultan's main army was destroyed at Alcalá la Real\n- Artillery bombardment is devastating (they've heard reports)\n- Juan personally leading - shows importance and commitment\n- The march succeeded despite raider harassment\n- Villages either submitted or were destroyed - clear pattern\n- Granada's overall strategic situation is hopeless\n\nFactors against surrender:\n- Ronda is one of Granada's strongest fortresses\n- Natural defenses (cliffs, gorge) make it nearly impregnable except from north\n- Garrison of ~3,000 includes many raiders who've been fighting all summer\n- Some may be fanatical - willing to die rather than submit\n- Pride and honor - surrendering without a fight is shameful\n- They may hope for eventual relief or negotiated peace\n- The fortress has strong walls and supplies\n- Converting to Christianity is a high price for Muslims\n- Some commanders may be politically connected and fear Granada's punishment for surrender\n- They've been successful raiders all summer - may be overconfident\n\nThe table should range from complete defiance to immediate surrender, with various middle options like negotiations, conditional surrender, internal division, etc.\n\nRonda Garrison Response to Surrender Demand - D100 Resolution Table\n\nFactors Favoring Surrender:\n\nJuan's established reputation for keeping his word (Alcalá la Real mass baptisms)\n\nComplete strategic isolation—no relief force coming\n\nSultan's main army destroyed at Alcalá la Real\n\nAll coastal cities fallen to Castile\n\nWitnessed systematic march through their territory\n\nArtillery capability well-known and devastating\n\nJuan personally leading shows commitment and importance\n\nRecent village destructions demonstrate consequences of resistance\n\nGranada's overall position hopeless by winter 1431\n\nPractical calculation: better baptism than death\n\nFactors Against Surrender:\n\nRonda is one of Granada's strongest natural fortresses\n\nGarrison of ~3,000 includes veteran raiders\n\nConverting to Christianity is profound religious/cultural price\n\nPride and honor—surrendering without fight is shameful\n\nSome commanders may be fanatical\n\nStrong walls and good supplies for extended siege\n\nMay hope for eventual negotiated peace or political solution\n\nFear of Granada's punishment for \"traitors\" who surrender\n\nRaiders emboldened by summer successes\n\nNatural defenses (cliffs, gorge) create false confidence\n\nD100 GARRISON RESPONSE TABLE:\n\n1-8: Fanatical Defiance - Commander spits from walls, curses Juan as infidel dog. Garrison fires on delegation—arrows, stones. Declares they'll die before converting. Internal faction willing to negotiate is suppressed violently. Siege will be brutal and costly. No quarter expected or given.\n\n9-23: Defiant Rejection - Formal refusal. Commander cites honor, faith, duty to Sultan. Believes fortress can hold until political solution emerges. Closes gates, prepares for siege. Will fight but not suicidally—may negotiate later if bombardment proves devastating.\n\n24-43: Conditional Negotiation - Willing to discuss terms but not immediate surrender. Want guarantees: safe passage for those refusing baptism? Retention of property? Promises garrison won't be massacred? Suspicious of Juan's word despite reputation. Requires proof of good faith before considering surrender.\n\n44-65: Internal Division - Garrison splits. Commander initially defiant but significant faction (30-40%) wants to surrender. Visible arguments on walls. Request time to \"consult\"—actually internal power struggle. Outcome depends on which faction wins. Could result in eventual surrender or bloody purge of moderates.\n\n66-82: Pragmatic Consideration - Commander requests parley. Doesn't refuse outright but wants to understand terms clearly. How will conversions be handled? What happens to those who convert vs. those who leave? Property rights? Will discuss seriously but needs convincing. Sees Juan's logic but struggles with religious/honor implications.\n\n83-92: Reluctant Agreement to Terms - Commander recognizes hopelessness. Agrees to surrender if terms match Alcalá la Real precedent: those converting keep property and serve Castile; those refusing baptism get safe passage to Granada city. Needs 24-48 hours to present terms to garrison and organize orderly handover. Some honor-saving delay but genuine surrender.\n\n93-100: Immediate Surrender - Commander rides out personally within hours. Kneels before Juan, offers sword. Garrison demoralized after watching systematic conquest, believes resistance is suicide. Mass conversions expected—most will take baptism over exile. Fortress gates open by nightfall. Complete capitulation.\n\nPlease roll your d100 and report the result."
        },
        {
          "role": "player",
          "text": "Rolled 36Conditional Negotiation.\n\n\nSo what happens next?"
        },
        {
          "role": "gm",
          "text": "Thought process\n\nThe user rolled 36, which falls in the \"Conditional Negotiation\" range (24-43). This means the garrison is willing to discuss terms but not immediate surrender. They want guarantees and are suspicious despite Juan's reputation. They need proof of good faith before considering surrender.\n\nI need to:\n1. Describe the initial response from the walls\n2. Show the garrison's conditional willingness to negotiate\n3. Present their concerns and demands\n4. Stop when Juan needs to respond or make decisions\n\nI should NOT write Juan's dialogue or decisions - only the garrison commander's response and the situation. I need to stop and let the player decide how to respond to their conditions.\n\nConditional Response from Ronda\n\nYou ride forward in your white armor, the afternoon sun glinting off the steel. Your cavalry escort holds position fifty yards back—close enough to intervene, far enough to show you come in peace. Infantry companies form defensive lines behind them, crossbows ready.\n\nFrom Ronda's walls, hundreds of faces watch. The northern gate towers above you, Granada's green banners snapping in the wind. For a long moment after you finish speaking, there is only silence.\n\nThen a figure appears atop the gatehouse—a man in his forties wearing the armor and turban of a Granada qaida (military commander). He's flanked by other officers, some in military dress, others in civilian robes that suggest administrators or religious figures.\n\n\"I am Qaida Muhammad ibn Rashid,\" the commander calls down in accented but clear Castilian. \"I command this fortress in the name of Sultan Yusuf III, may God grant him victory.\"\n\nHe pauses, studying you. \"King Juan of Castile. Yes, we know who you are. We know of Alcalá la Real. We know what happened at Málaga, Marbella, Vélez-Málaga.\" His voice is measured, not defiant but not submissive either. \"We have watched you march through our land for ten days.\"\n\nAnother pause. You can see discussion happening behind him on the walls—officers arguing, gesturing.\n\nMuhammad ibn Rashid continues: \"You speak of surrender. Of preventing bloodshed. You say you keep your word.\" He leans forward slightly. \"Then answer me, Christian King—what exactly are your terms? You say those who convert may remain. But what does 'convert' mean? A spoken oath? True belief? How do you judge hearts?\"\n\nBehind him, one of the civilian figures—likely an imam or qadi—speaks urgently. The commander nods, then calls down again:\n\n\"And those who refuse your baptism—what happens to them? You say 'safe passage to Granada city.' How safe? Do they walk with nothing? Do they carry possessions? Do your soldiers attack them the moment they're outside your sight?\"\n\nMore discussion on the walls. You can see the garrison is divided—some officers nodding, others shaking their heads in clear disagreement.\n\nMuhammad ibn Rashid's voice hardens slightly: \"At Alcalá la Real, we hear you baptized thousands. We also hear your armies sacked cities, burned villages, destroyed Yunquera five days ago. We hear many things, King Juan. Some say you are merciful to those who submit. Others say you are simply... thorough.\"\n\nHe spreads his hands. \"So before I open these gates and place three thousand souls in your hands—soldiers, civilians, women, children—I need more than words. I need to understand exactly what surrender means. What happens to those who convert? What happens to those who don't? What proof can you give that your promises are real and not simply... the words a conqueror speaks to make a siege easier?\"\n\nAn officer beside him shouts something in Arabic—clearly disagreeing with even this much negotiation. Muhammad waves him to silence, but the tension is visible.\n\nThe commander looks down at you. \"You offer us one chance. I ask for one thing in return—clarity. Tell me precisely what you offer, and give me reason to believe it. Because King Juan...\" His voice drops, harder now. \"We have food for six months, strong walls, and nothing to lose. If we fight and die, we die as Muslims in jihad. If we surrender and you betray us, we die as fools. So convince me. What exactly do you promise?\"\n\nBehind you, Don Rodrigo mutters quietly: \"They're testing you, Your Majesty. Trying to extract better terms, or at least understand what they're accepting. But there's genuine division up there—some want to fight, others want to negotiate. How you answer may tip the balance.\"\n\nThe garrison watches. The commander waits for your response.\n\nWhat do you say?"
        },
        {
          "role": "player",
          "text": "I dismount and take off my helmet.\n\n\nI am Juan, king of Castille. I promise you Muhammad ibn Rashid that my army will honour the banner of truce should you want to discuss these matters with me personally. I shall await you here in front of the gates with nothing but my personal escort. If I have your word to honour that you shall also honour the truce, then I will await you here so that we may speak and not shout."
        },
        {
          "role": "gm",
          "text": "Thought process\n\nThis is a powerful gesture from Juan. He's:\n1. Dismounting and removing his helmet - making himself vulnerable, showing respect\n2. Offering to parley face-to-face rather than shouting from distance\n3. Trusting Muhammad with a truce\n4. Demonstrating the personal honor he's been claiming\n\nThis is risky but characteristic of Juan's approach throughout the campaign - leading from the front, personal courage, building trust through vulnerability.\n\nMuhammad would be impressed by this. A king making himself vulnerable shows either supreme confidence or genuine good faith. Given Juan's reputation from Alcalá la Real, this gesture could be quite effective.\n\nI should:\n1. Show Muhammad's reaction to this unexpected gesture\n2. Have him consult briefly with his officers\n3. Have him accept the parley\n4. Describe the meeting setup\n5. Then have Muhammad come out with a small escort for face-to-face negotiations\n\nThis creates a dramatic moment and shows Juan's leadership style - personal, direct, willing to take risks to build trust.\n\nThe Parley\n\nYour dismount is deliberate, theatrical. The white armor catches every eye as you remove your helmet, revealing your face—young, earnest, unafraid. The gesture ripples through both armies. On the walls, you can hear surprised voices. Behind you, Captain Fernán tenses but holds position.\n\nMuhammad ibn Rashid stares down at you for a long moment. Then he turns and engages in rapid conversation with his officers. You can't hear the words, but the body language is clear—some argue against this, others urge acceptance. An older man in religious robes gestures emphatically. The military officers are split.\n\nFinally, Muhammad turns back to the wall. \"King Juan of Castile,\" he calls down, and there's something different in his voice now—respect, perhaps, or at least curiosity. \"You surprise me. A Christian king who dismounts before a Muslim fortress and offers parley as equals.\"\n\nHe pauses. \"Very well. I accept your word of truce, and I give mine in return. I will come out with ten men—no more. We will speak face to face as commanders should, not shout like merchants in a marketplace.\"\n\nHe looks to his officers. \"Prepare my escort.\"\n\nIt takes fifteen minutes. The gates remain closed, but a smaller postern door opens. Muhammad ibn Rashid emerges, and you can see him clearly now: weathered face, sharp eyes, the bearing of a professional soldier. He wears good steel armor, a curved sword at his hip, and the green turban marking him as a hajji—one who has made pilgrimage to Mecca.\n\nTen men accompany him—a mix of military officers and what appears to be a qadi (Islamic judge) in religious robes. They approach cautiously but without obvious fear.\n\nMuhammad stops ten paces from you and studies your face. He's perhaps twenty-five years your senior, veteran of decades of frontier warfare. When he speaks, his Castilian is careful but fluent:\n\n\"King Juan. I am told you are eighteen years old, yet you command armies and take fortresses.\" He gestures at your white armor. \"And you stand here, unhorsed and helmetless, trusting my word.\" A slight smile. \"Either you are very brave, very foolish, or very certain of God's favor. Perhaps all three.\"\n\nHe glances at your cavalry escort in the distance, then back to you. \"You asked me to listen to reason. I have come to hear it. Speak plainly, Christian King. What exactly do you offer Ronda? What happens to those who accept baptism? What happens to those who refuse? What proof can you give that your word means anything beyond this moment?\"\n\nHis officers watch intently. The qadi's expression is stony, clearly opposed to any negotiation. But Muhammad himself seems genuinely willing to listen—or at least, wanting to understand what he's being offered.\n\nBehind you, Don Rodrigo has moved closer with your escort, ready to intervene if the truce breaks. But for now, there's only the space between two commanders, the walls of Ronda rising behind one, and six thousand Castilian troops arrayed behind the other.\n\nWhat do you say?"
        },
        {
          "role": "player",
          "text": "Thank you for accepting the invitation.\n\n\nAnd I am a fool for sure, in case you were wondering. Undeserving of Gods grace or mercy, but I like every other man, lay my fate into his hands. It is all we can do.\n\n\nShould you accept my offer of surrender, this is exactly what will happen.\n\n\nYou and your fellow soldiers will be offered safe conduct to return to Grenada. This extends to all forces inside the city as well, as well as any civillians wanting to leave as well. You have my word and despite everything you may have heard, I am always keeping mine.\n\n\nI will garisson the city and accept fealthy from the inhabitants. Those muslims who stay will be subject to taxes but will be left unharmed. The mosque will be converted to a church. We will accept baptisms, should anyone want to choose this path.\n\n\nI will protect those under my protection, that may mean that I will hunt down and punish anyone that attacks my subjects. I take my responsibility very seriously and those wishing to serve me can count on me protecting them, no matter past allegiances.\n\n\nIf you refuse, my guns will blaze at your gates and should we breach the city, it will be plundered. I think God favors me in such a scenario, but we must all make our peace before God I suppose.\n\n\nDraft a d100 table to determine what happens next and how the commander responds."
        },
        {
          "role": "gm",
          "text": "1. Military garrison can leave safely to Granada\n2. Civilians who want to leave can also go\n3. Those who stay will be taxed but unharmed\n4. Mosque converted to church\n5. Baptisms accepted for those who want them\n6. Protection for those under his rule\n7. If they refuse, the city will be stormed and plundered\n\nThis is actually relatively generous by medieval standards - he's offering safe conduct for the military, and Muslims who stay will be taxed but not forced to convert (though obviously encouraged). This is more lenient than forced conversion at sword-point.\n\nLet me think about factors:\n\n**Factors Favoring Acceptance:**\n- Clear, specific terms that are relatively generous\n- Safe conduct for military garrison (honorable exit)\n- No forced conversions for those who stay (just taxes)\n- Juan's demonstrated track record of keeping his word\n- Alternative is certain siege, bombardment, and sack\n- Strategic situation hopeless\n- Winter approaching\n- No relief coming\n- Garrison can leave with honor intact\n- Protection promised for those who submit\n- Juan's youth and earnestness may be convincing\n- Muhammad seems pragmatic, professional soldier\n- Terms are actually quite reasonable by medieval standards\n\n**Factors Against Acceptance:**\n- Converting mosque to church is significant\n- Taxes and subordination to Christian rule\n- Some officers clearly oppose any negotiation\n- Religious pride and honor\n- The qadi (religious judge) is clearly opposed\n- Surrendering without a fight is shameful to some\n- Uncertainty about whether Juan will truly keep his word\n- Fear that once gates open, promises may be broken\n- Internal pressure from hardliners\n- Some may prefer death in jihad to submission\n\nThe roll was 36, which in my previous table was \"Conditional Negotiation\" - which is where we are now. Now I need a new table for Muhammad's response to these specific terms.\n\nLet me create a table that reflects whether Muhammad accepts, rejects, or continues negotiating:\n\nMuhammad ibn Rashid's Response to Terms - D100 Resolution Table\n\nFactors Favoring Acceptance:\n\nTerms are specific, detailed, and relatively generous by medieval standards\n\nSafe conduct for military garrison preserves honor\n\nNo forced conversions for civilians who stay (just taxes)\n\nJuan's demonstrated record at Alcalá la Real and elsewhere\n\nStrategic situation genuinely hopeless—no relief coming\n\nAlternative is bombardment, breach, and sack with no quarter\n\nJuan's youth and earnest demeanor seem genuine\n\nMuhammad is pragmatic professional soldier, not fanatic\n\nWinter approaching, siege would be brutal\n\nTerms allow honorable exit for those who refuse submission\n\nProtection promised to those under Juan's rule\n\nSpeaking face-to-face builds personal trust\n\nFactors Against Acceptance:\n\nQadi and religious faction clearly oppose any Christian rule\n\nConverting mosque to church is profound symbolic loss\n\nSubmitting to Christian taxation and authority\n\nSome officers prefer death in jihad to surrender\n\nInternal garrison pressure from hardliners\n\nUncertainty about Juan keeping word once gates open\n\nSurrendering strong fortress without fighting damages reputation\n\nFear of what happens after initial promises\n\nPride and honor demand at least token resistance\n\nCould negotiate for better terms (keep mosque? Lower taxes?)\n\nMuhammad's own authority challenged if he surrenders too easily\n\nD100 RESPONSE TABLE:\n\n1-12: Hardliners Win - Qadi and militant officers override Muhammad. He's shouted down or even physically restrained. Hardline officer takes command, curses Juan, declares jihad. Parley ends in chaos, nearly turns violent. Siege will be bitter.\n\n13-28: Rejection with Counter-Demands - Muhammad listens but cannot accept these terms. Demands: keep one mosque functioning, lower taxes, guarantee no forced conversions ever, written treaty. Won't surrender without significant concessions. Returns to fortress to \"consult\"—actually building support for continued resistance.\n\n29-48: Need Time to Convince Garrison - Muhammad personally inclined to accept but garrison deeply divided. \"I cannot simply hand you the fortress, King Juan. I must convince three thousand men to lay down arms. Give me three days to present your terms, persuade the doubters, and organize surrender. If I fail...\" He shrugs. Genuine but uncertain.\n\n49-68: Conditional Acceptance Pending Details - Muhammad accepts general framework but needs specifics: Exactly how much tax? When does garrison depart? What route to Granada? Can they take horses/arms? How are baptisms administered? Will families be separated? Professional negotiation of implementation details. Wants written agreement before opening gates.\n\n69-85: Cautious Agreement - Muhammad clearly moved by Juan's directness and reasonable terms. \"Your offer is... more generous than I expected. I will accept, but I ask one thing—\" Requests Juan's officers enter first with small force while garrison departs, to prevent chaos or betrayal by either side. Wants structured, controlled handover. Agreement in principle reached.\n\n86-95: Persuaded Surrender - Muhammad visibly convinced. Juan's youth, earnestness, and specific terms work. \"You remind me what honor means, King Juan. Even between enemies.\" Accepts terms fully. Will spend 24 hours organizing orderly departure, subduing hardliners. Gates open tomorrow. Some garrison violence expected from fanatics, but Muhammad commits to handing over fortress.\n\n96-100: Immediate Capitulation - Muhammad deeply impressed. Turns to his officers: \"We cannot win. This king offers honorable terms—better than we deserve. Those who wish to fight a lost cause are fools.\" Declares surrender immediately. Will open postern tonight to begin coordination. Full handover within 48 hours. Hardliners suppressed or accept reality.\n\nPlease roll your d100 and report the result."
        },
        {
          "role": "player",
          "text": "Rolled 25; Describe what happens next."
        },
        {
          "role": "gm",
          "text": "The roll is 25, which falls into the \"Rejection with Counter-Demands\" category (13-28). This means Muhammad listens but cannot accept these terms without significant concessions. He demands to keep one mosque functioning, lower taxes, guarantee no forced conversions ever, and wants a written treaty. He won't surrender without these concessions and returns to the fortress to \"consult\" - which is actually building support for continued resistance.\n\nThis creates an interesting situation where:\n1. Muhammad is not fanatically opposed - he's negotiating\n2. But he can't accept Juan's terms as stated\n3. He's asking for concessions that Juan may or may not be willing to give\n4. The internal politics of the garrison matter - the qadi and hardliners have influence\n5. This could go either way depending on how Juan responds\n\nI need to show:\n- Muhammad's response with his counter-demands\n- The reasoning behind them (internal garrison politics, religious concerns)\n- The qadi and other officers' reactions\n- Muhammad's demeanor - professional, not hostile, but firm\n- Set up the choice for Juan: accept the counter-demands, negotiate further, or reject and proceed with siege\n\nLet me write this scene carefully.\n\nThe Counter-Demands\n\nMuhammad ibn Rashid listens intently as you speak, his weathered face unreadable. When you finish, he nods slowly, then glances back at his officers. The qadi's expression has grown darker with each word. Several military officers look thoughtful; others skeptical.\n\nMuhammad turns back to you. \"King Juan, your terms are... clearer than I expected. More specific than the rumors we heard.\" He pauses, choosing words carefully. \"But there are problems. Not with your sincerity—I believe you mean what you say. The problems are practical.\"\n\nHe gestures toward the fortress walls. \"Behind those gates are three thousand people. Soldiers, yes, but also their families. Craftsmen. Merchants. People born in Ronda, whose fathers and grandfathers died defending these walls against your ancestors. And you ask them to accept Christian rule, Christian taxation, and watch their mosque—\" his voice tightens slightly \"—the mosque where they pray five times daily, where their children learned the Quran, become a church for your priests.\"\n\nThe qadi speaks sharply in Arabic. Muhammad raises a hand, quieting him, then continues in Castilian: \"I am a soldier, King Juan. I understand military reality. We cannot win. I know this.\" He meets your eyes. \"But I cannot simply order these people to accept what you offer—not as it stands. The garrison will tear itself apart. Half will want to fight to the death rather than surrender everything.\"\n\nHe steps closer, voice dropping but firm: \"So I propose different terms. Terms I might be able to convince them to accept:\n\nFirst—Safe conduct for the garrison and those who wish to leave. This I accept as you stated.\n\nSecond—For those who remain as your subjects and pay your taxes: Let them keep one mosque. Not the grand mosque, if you must have that for your church. But one smaller mosque where they can pray as Muslims. Your medieval laws allow this in other cities—mozárabes live among Muslims in Granada; mudéjares can live among Christians in Castile.\n\nThird—You say those who stay will pay taxes but remain unharmed. I need your oath—sworn before God and written in a treaty—that there will be no forced conversions. Ever. Those who convert do so by choice. Any who remain Muslim are protected in this.\n\nFourth—Lower the tax burden. You will take much from this city—its fortress, its strategic position, its wealth. Do not also crush those who submit with taxation that makes life impossible.\"\n\nBehind him, the qadi speaks again, clearly arguing against even these terms. One of the military officers nods in agreement with Muhammad; another shakes his head, hand on sword hilt.\n\nMuhammad's voice hardens: \"These are my conditions, King Juan. Not because I do not believe you, but because my people need to believe you. Give them one mosque, oath against forced conversion, and reasonable taxation—written in a treaty I can show them—and I will spend the next two days convincing this garrison to open the gates.\"\n\nHe gestures at the fortress. \"But if you demand they surrender everything—faith, mosque, dignity—while simply trusting that an eighteen-year-old Christian king will treat them fairly?\" He shakes his head. \"The hardliners will win. The qadi will call for jihad. We will fight until your cannons breach the walls, and when you enter, it will be over the bodies of those who chose death over surrender.\"\n\nHis eyes lock on yours. \"So I ask you, King Juan—can you give me terms I can actually use to convince three thousand people to lay down their arms? Or must we water these stones with blood?\"\n\nThe qadi watches you with undisguised hostility. Muhammad's other officers are divided—some clearly hoping you'll accept, others looking like they expect rejection and are ready for it.\n\nDon Rodrigo has moved close enough to hear. He says nothing, but you can sense his tension. This is the moment—accept Muhammad's counter-demands and possibly secure peaceful surrender, or hold firm to your original terms and prepare for siege.\n\nWhat do you do?"
        },
        {
          "role": "player",
          "text": "Like I said honoured commander, I take my responsibility to protect my subjects seriously. I have no problems granting you one mosque, and forced conversions are prohibited by papal bull already, so I am already bound to this condition anyway. But I am worried about the situation we create under your proposal. If those who have spent years fighting christians, now suddenly have to work together with christians, in many cases serve them. Some of their neighbours may convert as well. It sounds to me like a powder keg waiting to burst. How can I be sure that those living in Ronda after capture will not tear each other's throats out? Im fine with muslims remaining in Ronda, as long as they can live in peace under christian rule. In your proposal, will the hardliners leave for Grenada?"
        },
        {
          "role": "gm",
          "text": "Muhammad would likely appreciate this question - it shows Juan is thinking seriously about how this actually works, not just making empty promises. The commander would need to address:\n\n1. Whether the hardliners will actually leave\n2. How to ensure peaceful coexistence \n3. What happens to troublemakers who stay\n4. Whether he can guarantee order during the transition\n\nThis is a legitimate concern and Muhammad, as a professional, would recognize it as such. He'd need to provide assurances about how the transition would work.\n\nMuhammad ibn Rashid's expression shifts—surprise, then something like respect. He exchanges a quick glance with one of his officers, then turns back to you.\n\n\"You ask the right question, King Juan. The question of a ruler, not just a conqueror.\" He nods slowly. \"Yes, this is the danger. Those who have fought you for years, suddenly living as your subjects alongside those who convert. It is...\" He searches for the word. \"Volatile.\"\n\nHe begins pacing, thinking aloud like a commander solving a tactical problem. \"Here is the truth: The hardliners—perhaps three hundred of my garrison, maybe four hundred—will never accept Christian rule. The qadi here—\" he gestures at the religious figure \"—and men like him would rather die. These men, if they stay, will cause exactly the explosion you describe. They will sabotage, murder converts as apostates, perhaps even attempt assassination of your commanders.\"\n\nThe qadi's face confirms this assessment, though he says nothing.\n\nMuhammad continues: \"So in my proposal, yes—the hardliners must leave. I will make this clear when I present terms to the garrison: Those who cannot accept Christian rule, who cannot live peacefully under it, must take the safe conduct to Granada. This is not optional. They have three choices: convert and submit fully, accept Muslim subject status and live peacefully under your laws, or leave.\"\n\nHe stops pacing, facing you directly. \"But I will need your help to enforce this, King Juan. Here is what I propose:\n\nThe transition process—When we open the gates, we do so in stages over two days:\n\nDay One: The hardliners—those absolutely refusing Christian rule—depart first with full safe conduct. I will identify them. They take their families, their portable possessions, their horses. Your cavalry escorts them to the road to Granada and watches them leave. This removes the most dangerous elements immediately.\n\nDay Two: Your garrison enters and takes control. Those remaining—whether converting or staying as Muslim subjects—they see that order is maintained, that your promises are real, that there is no massacre or chaos.\n\nMy guarantee to you: I will personally identify and ensure that every man I judge incapable of peaceful coexistence leaves with the first group. The soldiers and civilians who remain will be those I trust to accept the new reality. Some will convert quickly—the pragmatic ones. Others will remain Muslim but will obey your laws because they prefer life under Christian taxation to exile in a dying sultanate.\"\n\nHe meets your eyes. \"And I offer you this: I will stay for two weeks after the surrender, helping your administrators establish order, identifying potential troublemakers, ensuring the transition is smooth. Then I will take my own family and depart for Granada. But those two weeks—I give you my word I will help make this work.\"\n\nOne of his officers speaks up in Arabic—questioning or objecting. Muhammad responds sharply, clearly overruling him.\n\nHe turns back to you. \"As for those who remain, King Juan—you must also make clear: Any Muslim subject who breaks your laws, who attacks converts, who makes trouble—they face justice like any other subject. Execute troublemakers publicly if needed. Those staying must understand they are subjects now, with duties and protections both.\"\n\nHe pauses. \"So yes, the hardliners will leave. I will ensure it. Because you are right—if they stay, there will be blood. But those who remain, those who can genuinely accept this arrangement...\" He gestures at the city. \"Ronda has lived through many conquerors, King Juan. People adapt when they must. Give them the mosque, the protection from forced conversion, and reasonable taxation—and most will adapt. Those who cannot or will not, I will personally ensure they depart.\"\n\nThe qadi speaks again, this time more forcefully. Muhammad turns to him and responds in Arabic—a sharp exchange that ends with the qadi falling silent, though his face shows barely contained fury.\n\nMuhammad looks back at you. \"So, King Juan. Do we have an agreement? One mosque for those who remain as Muslim subjects, written oath against forced conversion, reasonable taxation, and I guarantee the hardliners depart peacefully in the first wave. In return, you get Ronda without bloodshed, and I spend two weeks helping ensure the transition works.\"\n\nHe extends his hand—not in submission, but as one commander to another, negotiating terms.\n\n\"Do we have accord?\"\n\nWhat do you do?"
        },
        {
          "role": "player",
          "text": "I shake his hand.\n\n\nIt is done."
        },
        {
          "role": "gm",
          "text": "This should be a powerful scene showing:\n1. The handshake and its significance\n2. Reactions from both sides (mixed - some relief, some anger)\n3. Muhammad's immediate actions to begin the process\n4. The qadi's rage and what happens with hardliners\n5. Setting up the next phase - the two-day surrender process\n\nThis is a major victory achieved through diplomacy rather than siege. It saves weeks of time, many casualties, and gets Juan to the November Cortes on schedule.\n\nThe Accord\n\nYour hand clasps his—Christian king and Muslim commander, sealing terms in the shadow of Ronda's walls. Muhammad ibn Rashid's grip is firm, the handshake of a professional soldier who has just made a hard but necessary decision.\n\nFor a moment, neither speaks. Then Muhammad nods once, sharply. \"It is done. You have my word, King Juan of Castile. I will deliver this fortress to you peacefully.\"\n\nBehind him, the qadi explodes in furious Arabic. Muhammad doesn't even turn, simply raises his voice in response—sharp, commanding, final. The qadi continues arguing, but Muhammad cuts him off with a gesture and a single word that sounds like a command.\n\nThe religious figure falls silent, trembling with rage, but he's been overruled.\n\nMuhammad turns back to you. \"Two days, Your Majesty. I need two days to organize this properly. Today is October 3rd. By sunset on October 5th, Ronda will be yours.\"\n\nHe gestures toward his officers. \"Tonight, I will present these terms to the garrison commanders and the city council. There will be... disagreement. Shouting. Perhaps some violence among ourselves.\" His face is grim. \"But I command here, and these terms are the best we will ever receive. I will make them understand.\"\n\nHe looks at the fortress, then back to you. \"Tomorrow—October 4th—I will begin organizing the departure of the hardliners. The qadi and his followers, the most fanatical fighters, those who will never accept your rule. They will have until noon to gather their families and possessions. Your cavalry will escort them east toward Granada, yes? I want them gone before your soldiers enter.\"\n\nYou nod agreement.\n\nMuhammad continues: \"Then on October 5th, the postern gate opens at dawn. Your officers and a small garrison force—perhaps two hundred men—enter first while the hardliners are still departing. We maintain order together during the transition. By sunset, your banners fly from these walls, and I begin my two weeks helping you establish control.\"\n\nDon Rodrigo speaks up from behind you: \"Your Majesty, we should have written terms. Both sides sign, witnesses from each army. Standard practice for negotiated surrenders.\"\n\nMuhammad nods immediately. \"Yes. I will send my scribe with the qadi's replacement—a more... reasonable imam. We will draft the treaty tonight. You and I both sign tomorrow morning. Then I can show the garrison written proof of these terms.\"\n\nHe looks at you seriously. \"King Juan, one more thing. When the hardliners depart tomorrow, some may try to attack your escort or break the truce. I will do everything I can to prevent this, but if any of my men break faith...\" He draws his sword and offers it hilt-first. \"You have my authority to execute them immediately. The truce must hold, or everything collapses.\"\n\nThe gesture is profound—a commander giving another commander authority over his own troops.\n\nBehind you, your cavalry escort watches intently. Behind Muhammad, his officers are clearly shaken—some relieved, others uncertain, the qadi still visibly furious.\n\nMuhammad sheathes his sword when you acknowledge his words. \"Two days, Your Majesty. And Ronda is yours without a drop of blood spilled.\" He glances at your artillery train in the distance. \"Your bombards can rest. They will not be needed here.\"\n\nHe prepares to return to the fortress, then pauses. \"King Juan... you surprised me today. You fight like a king should—seeking victory, yes, but not thirsting for blood when there is another way. May your God and mine both remember that.\"\n\nHe bows—not submission, but respect between commanders—then turns and walks back toward the postern with his officers. The qadi follows last, casting one venomous look over his shoulder.\n\nThe postern door closes behind them.\n\nDon Rodrigo rides up beside you, letting out a long breath. \"Your Majesty... that was extraordinary. You just took one of Granada's strongest fortresses through negotiation. No siege, no bombardment, no weeks of casualties.\" He shakes his head in amazement. \"Two days, and Ronda is ours.\"\n\nFrom the walls, you can already hear shouting—Muhammad beginning the process of convincing his garrison. Some voices sound angry, others relieved, all loud.\n\nCaptain Fernán approaches. \"Your Majesty, what are your orders? We should prepare for the hardliners' departure tomorrow and our garrison entry on October 5th.\"\n\nThe sun is beginning to set. Your army awaits instructions. In two days, Ronda will be yours—but those two days need careful management to ensure Muhammad can deliver on his promise.\n\nWhat do you do?"
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_PLACEHOLDER_007",
      "book": 1,
      "chapter": "1.23",
      "date": "1431-10-04",
      "end_date": "1431-10-05",
      "type": "military",
      "summary": "Peaceful handover of Ronda executed over two days. October 4: Treaty signed and witnessed. Hardliners (347 soldiers, 231 family members) depart under Castilian cavalry escort toward Granada. Five men who tried to organize resistance are arrested and forced to leave. October 5: Gates open at dawn. Muhammad kneels and formally surrenders. Juan enters with garrison force, takes control of key positions without resistance. Castilian banners raised over the fortress. Muhammad begins assisting with the transition. Ronda falls without siege or bombardment.",
      "characters": [
        "juan_ii",
        "muhammad_ibn_rashid",
        "rodrigo_de_perea",
        "fernan_alonso_de_robles"
      ],
      "factions_affected": [],
      "location": "Ronda",
      "tags": [
        "military",
        "surrender",
        "occupation",
        "ronda_campaign"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "I retreat to camp and make plans with my commanders. I want the army know what has been agreed and that we will take the fort without a fight, that those who leave do so under the kings protection.\n\n\nThen we wait and make ready for the gates to let the hardliners out."
        },
        {
          "role": "gm",
          "text": "This is good strategic management. I should narrate:\n- The command meeting\n- Preparations being made\n- The army's reaction\n- The night in camp (potential for tension/events)\n- The next day's preparations\n- Then the actual departure of the hardliners\n\nI need to create some tension around whether the hardliners will actually depart peacefully, and whether Muhammad can maintain control. This should build to the moment when the gates open.\n\nI should also track time carefully:\n- October 3rd evening: Command meeting and preparations\n- October 4th: Hardliners depart\n- October 5th: Castilian garrison enters\n\nLet me write this scene building to the critical moment of the hardliners' departure.\n\nPreparations for Peaceful Surrender\n\nEvening - October 3rd, 1431\n\nYour command tent fills quickly—Don Rodrigo, Pietro Calabrese, Captain Fernán, cavalry commanders, infantry captains. They enter expecting siege plans. What you tell them instead produces stunned silence.\n\nDon Rodrigo speaks first, grinning broadly: \"Your Majesty negotiated surrender of Ronda in an hour's conversation. This will be legendary.\"\n\nPietro Calabrese looks almost disappointed his bombards won't fire, then laughs. \"Is better this way, Majesty. Save the powder for Granada city, yes?\"\n\nYou lay out the terms clearly: One mosque remains for Muslim subjects. No forced conversions—papal law already forbids this. Reasonable taxation. The hardliners depart tomorrow under royal protection with full safe conduct. Your garrison enters October 5th to take control.\n\nCaptain Fernán addresses the critical point: \"Your Majesty, escorting perhaps four hundred hostile fighters who've spent months killing our men... some of the troops won't like it. They'll want revenge.\"\n\n\"Which is why,\" you say firmly, \"every soldier must understand: These men depart under the King's sworn protection. Any man who breaks truce, who attacks the departing garrison, will face immediate execution. Make this absolutely clear.\"\n\nDon Rodrigo nods. \"I'll address the cavalry personally. They'll obey.\"\n\nThe commanders disperse to brief their units. Within an hour, word spreads through the camp: Ronda surrenders without siege. The hardliners leave tomorrow under truce. The King's justice falls on anyone who breaks his word.\n\nThe army's reaction is mixed. Relief—no costly assault, no weeks of siege. But also frustration—men who lost comrades to these raiders must now watch them walk free. Still, discipline holds. These are professionals who understand that sworn truces are sacred.\n\nNight - October 3rd\n\nFrom Ronda's walls, you hear raised voices throughout the night. Shouting. At one point, what sounds like fighting—steel on steel, brief but intense. Then silence. Muhammad is subduing opposition.\n\nYour sentries report torch-lit activity inside the fortress all night. Organization. Preparation.\n\nYou sleep lightly, one hand on your father's sword.\n\nMorning - October 4th, 1431\n\nDawn breaks clear and cold. Your army stands ready in formation—not hostile, but present. A show of strength to discourage any foolishness.\n\nAt mid-morning, the postern opens. A rider emerges carrying a white flag and a sealed document. He rides to your camp, dismounts, kneels.\n\n\"Your Majesty, from Qaida Muhammad ibn Rashid. The treaty, signed and witnessed.\"\n\nThe document is in both Arabic and Castilian, side by side. Muhammad's signature and seal. Space for yours. The terms exactly as agreed: one mosque, no forced conversions, reasonable taxation, peaceful transition.\n\nYou sign. Don Rodrigo and two other commanders witness. The rider returns to Ronda with the sealed treaty.\n\nNow the wait begins.\n\nNoon - October 4th\n\nThe main gates of Ronda swing open for the first time.\n\nThey emerge slowly—a long column of humanity. The hardliners: perhaps three hundred fifty soldiers, plus their families. Women, children, elderly. Carts loaded with possessions. Horses, mules. Some fighters look defiant, others simply exhausted. The qadi rides near the front, his face a mask of controlled fury.\n\nMuhammad ibn Rashid himself leads them out on horseback, ensuring order. Behind him, you can see Ronda's remaining garrison lining the walls—watching their comrades depart, their faces unreadable.\n\nYour cavalry forms the escort—two hundred horsemen under Don Rodrigo's direct command. They maintain distance, weapons sheathed but ready. Professional. Respectful of the truce but prepared for treachery.\n\nThe column passes your camp. Some of the departing fighters stare at you with hatred. Others won't meet your eyes. The civilians—families, children—look frightened and lost. Refugees now, leaving their home forever.\n\nOne young fighter spits toward your banner. An older man—perhaps his father—strikes him hard and forces him forward. The column continues.\n\nMuhammad rides up to where you stand. He's in full armor, sword at his side, looking exhausted. \"Your Majesty. The hardliners depart as promised. Three hundred forty-seven soldiers, two hundred thirty-one family members. They go to Granada.\"\n\nHe glances at the column. \"There were... difficulties last night. Five men refused the terms and tried to organize resistance. I had them arrested. They leave now with the others, in chains if necessary.\"\n\nHis eyes meet yours. \"Your cavalry will escort them to the Granada border—about forty miles east. Then let them go. Some may try to turn back, to raid once away from your army. Have your men watch for this.\"\n\nDon Rodrigo nods. \"We'll watch them until they're well into Granada's territory, Your Majesty.\"\n\nThe column continues past, a river of displaced humanity. It takes nearly two hours for them all to clear Ronda's gates. When the last cart rumbles through, Muhammad turns to watch them go.\n\n\"Tomorrow,\" he says quietly, \"your banners fly from these walls. And I begin teaching you how to rule a Muslim city without it burning down around you.\"\n\nHe returns to the fortress. The gates close behind him.\n\nYour cavalry rides out, escorting the departing garrison into the hills. You watch them go—fighters who might have killed hundreds of your men in a siege, now walking away peacefully under your protection.\n\nBy late afternoon, Don Rodrigo sends a rider back: \"The escort proceeds without incident. The hardliners march toward Granada. Will confirm they cross the border and report tomorrow.\"\n\nEvening - October 4th\n\nThe camp is quiet tonight. Tomorrow, you enter Ronda. Tomorrow, one of Granada's strongest fortresses becomes yours without a siege, without bombardment, without the casualties that have marked every other conquest.\n\nThe white banner snaps in the evening wind above your tent. From Ronda's walls, you can see Muhammad's silhouette, looking out over the fortress he's about to surrender.\n\nWhat do you do tonight, before entering Ronda tomorrow?"
        },
        {
          "role": "player",
          "text": "We wait outside for one more day and then we enter the city as agreed."
        },
        {
          "role": "gm",
          "text": "1. The night passing peacefully\n2. Dawn on October 5th\n3. The gates opening\n4. Juan entering with his forces\n5. The ceremony of taking possession\n6. Muhammad's assistance in the transition\n7. The reality of the city - mixed reactions from the population\n8. The raising of Castilian banners\n9. Initial steps of establishing control\n\nThis should be a significant moment - a major fortress taken peacefully, a validation of Juan's approach of offering reasonable terms. The scene should capture both the triumph and the complexity of now ruling a Muslim city.\n\nI should keep this relatively concise since it's the culmination of the negotiation, then ask what Juan wants to do next regarding administration, the continuation of the campaign, etc.\n\nThe Peaceful Conquest of Ronda\n\nNight - October 4th-5th, 1431\n\nThe night passes quietly. No violence from the city, no last-minute resistance. Your sentries report torches burning throughout Ronda as Muhammad completes final preparations. In your camp, the army rests—ready to enter tomorrow, but not for battle. For occupation.\n\nYou pray in your tent before sleeping, your father's sword laid before you. Non Nobis Domine—not unto us, O Lord, but unto Thy name give glory. Tomorrow you take one of Granada's mightiest fortresses without spilling blood.\n\nDawn - October 5th, 1431\n\nThe sun rises over Ronda's plateau, painting the limestone cliffs gold. Your army forms up in ceremonial order—two hundred infantry selected for first entry, all veterans, all disciplined. Captain Fernán and your royal guard. Don Rodrigo commanding. You in your white armor, mounted, the white banner carried before you.\n\nAt the sixth hour, the gates of Ronda swing fully open.\n\nMuhammad ibn Rashid stands just inside, flanked by his remaining officers and the city's administrators. Behind them, Ronda's remaining garrison—perhaps two thousand soldiers—stands in formation, weapons grounded. Not hostile, not threatening. Waiting.\n\nYou ride forward. Your escort follows, hooves echoing on stone as you pass through the ancient gates into the fortress city.\n\nMuhammad steps forward and kneels. His officers follow. \"Your Majesty, King Juan of Castile. In the name of those who remain in this city, I surrender Ronda to your authority.\"\n\nHe draws his sword and offers it hilt-first—the formal gesture of capitulation. You take it, then immediately return it to him. \"Qaida Muhammad, you have kept your word with honor. Rise as a free man. This fortress is now under the Crown of Castile.\"\n\nMuhammad rises, clear relief in his eyes. Behind him, the garrison relaxes slightly. No massacre. No betrayal. The terms are real.\n\nYour soldiers begin moving through the gates in organized files. No running, no looting, no chaos. They deploy to key positions—walls, gates, the fortress keep, the armory. Professional occupation.\n\nThe city spreads before you—white buildings cascading down the hillside, the great mosque with its tower dominating the skyline, narrow streets winding through residential quarters, the famous gorge cutting through the center with its dizzying drop. Civilians watch from doorways and windows—frightened, uncertain, but not fleeing.\n\nMuhammad walks beside you as you ride through the main street. \"Your Majesty, the fortress complex is yours. The armory holds three hundred swords, two hundred spears, armor stores. The granaries are full—six months of supplies. The treasury...\" He hesitates. \"The treasury was mostly evacuated to Granada weeks ago when we knew you were coming. What remains is perhaps twelve thousand dinars in coin, some trade goods.\"\n\nHe points to various buildings. \"The qasbah—the fortress keep—will serve as your headquarters. The barracks can hold eight hundred soldiers comfortably. The stables have room for three hundred horses. And there—\" He gestures to a smaller building near the mosque \"—that is the mosque that will remain for Muslim subjects. The grand mosque, I understand, will become your church.\"\n\nCivilians emerge slowly, watching the Castilian soldiers establish positions. Some faces show resignation, others fear, a few even curiosity. Children peek from behind their mothers' skirts.\n\nYou reach the central plaza. Don Rodrigo's men are already deploying, securing the area. The white banner is raised over the fortress keep—Castile's standards rising alongside the white crusader flag.\n\nMuhammad watches the banners rise. His face is carefully neutral, but you see him swallow hard. This is his home. Was his command. Now it passes to you.\n\n\"Your Majesty,\" he says quietly, \"the transition begins. For the next two weeks, I am at your service. Ask me anything about this city, its people, its administration. I will help you rule it wisely.\" He pauses. \"And I will help you identify any who might cause trouble, though most hardliners left yesterday.\"\n\nFrom the walls, your soldiers call down: \"City is secure, Your Majesty! All gates under our control! No resistance encountered!\"\n\nThe conquest is complete. Ronda—one of Granada's three greatest fortresses alongside the capital and Gibraltar—is yours. Taken in ten days' march and two days' negotiation. No siege. No bombardment. No mass casualties.\n\nThe army begins filing in—more infantry, cavalry, supplies. Pietro Calabrese's bombards rumble through the gates, unused but impressive. The city watches as six thousand Castilian soldiers establish occupation.\n\nMuhammad stands beside you. \"So, Your Majesty. You have your fortress. Now comes the harder part—keeping it. What are your first orders?\"\n\nThe city awaits. What do you do?"
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_PLACEHOLDER_008",
      "book": 1,
      "chapter": "1.23",
      "date": "1431-10-05",
      "end_date": "1431-10-10",
      "type": "legal",
      "summary": "Juan meets Ronda's city leaders: Sheikh Ibrahim al-Hamri (administrator), Imam Yusuf al-Basri (moderate religious leader), Qasim ibn Tariq (merchant), Layla bint Hassan (governor's widow), Ahmad al-Nasri (artisan guilds), Moshe ben Yitzhak (Jewish community), and Fatima al-Qurtubi (educator). Juan establishes governance terms: all agricultural lands transfer to Castilian nobility with tenants paying rent; workshops, homes stay with owners; 5% revenue tax as crown property; one mosque permitted on donations only; orphans raised Christian; Fatima may teach freely. Layla departs for Granada in protest. Ronda declared crown property under Don Rodrigo de Perea's administration. Muhammad ibn Rashid agrees to stay six months. Cavalry sweeps secure surrounding territory: villages submit, Gaucin falls after brief bombardment, raiders scatter. Supply routes reopen. Raider operational capacity broken.",
      "characters": [
        "juan_ii",
        "muhammad_ibn_rashid",
        "rodrigo_de_perea",
        "sheikh_ibrahim_al_hamri",
        "moshe_ben_yitzhak",
        "pietro_calabrese"
      ],
      "factions_affected": [],
      "location": "Ronda",
      "tags": [
        "legal",
        "governance",
        "taxation",
        "administration",
        "occupation",
        "consolidation"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "I introduce Mohammed to my command and staff. I let them coordinate the next phase of the operation. Now that we have secured the fort, we will visit the remaining villages in the area and offer the the chance to swear fealty as well.\n\n\nI take up residence and want to meet with all of the city's leaders. I want to hear their concerns and I expect them to swear fealty to me personally.\n\n\nWho shows up?"
        },
        {
          "role": "gm",
          "text": "Leaders who would show up:\n- Muhammad ibn Rashid (military commander, already cooperative)\n- A replacement imam (since the qadi left with hardliners) - probably more moderate\n- City administrators/council members\n- Merchant guild leaders\n- Craft guild masters\n- Notable family heads\n- Perhaps some Christian/Jewish minorities who lived there\n\nLet me create a diverse group that represents different interests and attitudes toward the new Castilian rule.\n\nMeeting the City's Leaders\n\nAfternoon - October 5th, 1431\nThe Qasbah, Ronda\n\nThe great hall of Ronda's fortress has been hastily prepared. Your white banner hangs behind a chair that now serves as throne. Don Rodrigo stands to your right, Captain Fernán to your left. Muhammad ibn Rashid sits to the side—present as advisor and bridge between old and new authority.\n\nThe doors open. The city's leaders file in.\n\nFirst enters Sheikh Ibrahim al-Hamri - an elderly man, perhaps seventy, walking with a cane. Muhammad leans close and whispers: \"Chief administrator under the Sultan's governor. Managed taxation, public works, civil disputes. Very old family in Ronda—his grandfather helped build the current walls.\"\n\nSheikh Ibrahim kneels stiffly, his aged knees protesting. \"Your Majesty.\" His Castilian is accented but clear. His eyes are shrewd, calculating—a survivor who's likely served multiple masters.\n\nSecond comes Imam Yusuf al-Basri - younger than you expected, perhaps forty. Muhammad whispers: \"The moderate imam. The qadi who left yesterday hated him, called him weak. He argued for negotiation when others wanted jihad. Educated, pragmatic.\"\n\nThe imam kneels, his face carefully neutral. He's clearly uncomfortable but not hostile.\n\nThird is Qasim ibn Tariq - a prosperous-looking merchant in fine robes. Muhammad: \"Head of the merchant council. Trades in wool, olive oil, leather goods. Very wealthy. More concerned with profits than politics, I think.\"\n\nQasim kneels smoothly, professionally. You can see him already calculating how to profit under new management.\n\nFourth arrives Layla bint Hassan - a middle-aged woman in elegant but modest dress, accompanied by an older male servant. Muhammad's whisper carries surprise: \"The widow of Muhammad ibn Hassan, who was wali—governor—of Ronda until he died in battle against your forces three months ago. She manages significant property, represents several noble families. That she came personally is... significant. Women rarely attend such meetings.\"\n\nLayla kneels with dignity, her eyes meeting yours briefly—assessing, proud despite circumstances.\n\nFifth is Ahmad al-Nasri - a weathered man with craftsman's hands. Muhammad: \"Master of the artisan guilds. Blacksmiths, carpenters, masons, weavers. Represents perhaps five hundred craftsmen and their families.\"\n\nAhmad kneels awkwardly, clearly unused to royal courts. A working man thrust into politics.\n\nSixth enters a surprise: Moshe ben Yitzhak - an elderly Jewish man in dark robes with a yellow badge marking his status as dhimmi (protected minority under Islamic law). Muhammad whispers: \"Leader of Ronda's small Jewish community—perhaps sixty families. They've lived here for generations under Muslim protection, paying jizya tax.\"\n\nMoshe kneels, looking uncertain whether his community has improved or worsened their position under Christian rule.\n\nFinally comes Fatima al-Qurtubi - a severe-looking woman in her fifties. Muhammad's whisper is careful: \"She runs the main madrasa—the Islamic school. Teaches children, preserves religious learning. Very respected. Very... traditional. That she came at all surprises me.\"\n\nFatima kneels last, her face showing clear disapproval of these proceedings, but she's here.\n\nThey kneel before you—seven people representing military, religious, commercial, aristocratic, artisan, minority, and educational interests of Ronda. Behind them stand various lesser officials, scribes, and attendants.\n\nSheikh Ibrahim speaks first, as senior administrator: \"Your Majesty, the leaders of Ronda present themselves. We... we are told you wish to hear our concerns and receive our oaths of fealty.\"\n\nHis tone is cautious. Around him, the others watch you carefully—some fearful, some calculating, all uncertain what kind of Christian king you'll prove to be.\n\nMuhammad ibn Rashid watches this moment intently. These are his people—some he respects, others he tolerates. Now they become yours.\n\nWhat do you say to them?"
        },
        {
          "role": "player",
          "text": "Greetings,\n\n\nWhat happened this week was going to happen sooner or later. The reconquista of Grenada and Ronda being a part of a christian Castille. This means accepting Christian rule and living as muslims or newly baptised christians in my kingdom.\n\n\nAs subjects, you fall under my protection. If you know that you cannot abide under these conditions, better you leave now than stay and live among people you consider to be your enemies. If you do choose to stay, I will make sure the rights you have are honoured.\n\n\nNow, please speak plainly. You will not be punished for speaking up."
        },
        {
          "role": "gm",
          "text": "1. Sheikh Ibrahim - old administrator, survivor, practical\n2. Imam Yusuf - moderate religious leader, concerned about faith\n3. Qasim - merchant, worried about trade and profit\n4. Layla - noble widow, concerned about property and status\n5. Ahmad - artisan guild master, worried about livelihoods\n6. Moshe - Jewish leader, uncertain about his community's status\n7. Fatima - traditional educator, concerned about preserving Islamic learning\n\nThey should speak plainly as Juan requested, but with varying degrees of comfort. Some will be more direct, others more cautious. Let me create realistic dialogue that shows their different concerns and personalities.\n\nThe Leaders Speak\n\nA long silence follows your words. The leaders exchange glances—who dares speak first to a conquering king who just invited plain speech?\n\nSheikh Ibrahim, as eldest, takes the burden. He rises from his knees with effort, leaning on his cane. \"Your Majesty grants permission to speak plainly. Very well. I am old. I have served three governors under Sultan Yusuf. Before that, I served under Sultan Muhammad VII. I know how to serve whoever holds power.\"\n\nHis voice strengthens. \"My concern is simple: stability. This city has perhaps eight thousand souls. Most are farmers, craftsmen, merchants—people who want to live, work, pray. They fear chaos more than Christian rule. They fear soldiers looting, rapine, their daughters seized, their property confiscated without cause.\" He meets your eyes. \"You say we fall under your protection. What does this mean in practice? When a Castilian soldier demands a craftsman's goods without payment, who do we complain to? When disputes arise between Christian and Muslim, whose law applies? These are practical questions, Your Majesty.\"\n\nQasim the merchant speaks next, still kneeling. \"Your Majesty, I trade with Málaga, with Granada, with the coast. Under Sultan's rule, I paid taxes—reasonable taxes that allowed profit. I employed forty men in my workshops and warehouses. My question: What taxation do we face now? And can we still trade with Granada city? Many of our markets, our suppliers, our buyers are there. If you close that trade, hundreds of families lose their livelihoods.\"\n\nAhmad the artisan guild master speaks haltingly, voice rough. \"Your Majesty... my people make things. We smith iron, build furniture, weave cloth, work leather. Good craftsmen, Christian or Muslim makes no difference to a hammer. But we need materials. Iron comes from mines to the east. Wool from shepherds in the hills. If the roads are not safe, if raiders attack caravans, if your soldiers requisition everything...\" He trails off. \"We just want to work, Your Majesty. Feed our families.\"\n\nLayla bint Hassan rises—boldly, without asking permission. Her voice is clear and proud. \"Your Majesty, I am widow of the wali who died fighting your armies at Vélez-Málaga. My husband was a good man, loyal to his sultan. Now his lands—our family's lands for four generations—belong to whom? You? Your nobles? Am I dispossessed because my husband died with honor?\"\n\nHer eyes flash. \"I have three sons. The eldest is twelve. Will they grow up as beggars because their father chose loyalty? Or do property rights survive conquest? This matters to every family of station in this city.\"\n\nImam Yusuf speaks carefully, still kneeling. \"Your Majesty, you promise one mosque remains for Muslim subjects. This is... more generous than I feared. But I must ask: What of Islamic law? For centuries, we have married, divorced, settled inheritances, resolved disputes according to sharia. Must we now submit all matters to Christian courts? Can Muslim families still marry according to our traditions? Can we still educate our children in Quran?\"\n\nHe pauses. \"And the conversions, Your Majesty. You say no forced conversions. But if a Christian offers a Muslim better employment if he converts, is that force? If Christian neighbors shun Muslim families, is that force? If children are taught that their parents' faith is evil, is that force? Where are the lines?\"\n\nMoshe ben Yitzhak speaks in heavily accented Castilian, voice quavering. \"Your Majesty, Jews in al-Andalus have lived as dhimmi for seven hundred years. We pay jizya tax, we wear the badge, we accept restrictions, but we are protected. In Christian lands, we hear...\" He hesitates. \"We hear of pogroms. Of forced baptisms. Of expulsions. Your Majesty, what becomes of sixty Jewish families in Ronda? Are we safer or less safe under Christian rule?\"\n\nFinally, Fatima al-Qurtubi speaks—her voice sharp, unafraid. \"Your Majesty, I teach children. For thirty years, I have taught them to read Quran, to know the five pillars, to understand their faith. You say I may continue as Muslim subject, but you will convert the grand mosque to church. Every day, those children will walk past their sacred space, see Christian priests where their imams stood, hear church bells where the call to prayer once sounded.\"\n\nShe stands, defiant. \"You ask us to live under your protection while you erase our faith from the city's heart. How long before the small mosque you 'allow' us also becomes a church? How long before being Muslim means being nothing?\" Her voice cracks slightly. \"I am old, Your Majesty. I will die Muslim whatever you decree. But these children—what faith can they keep when everything around them says Islam is finished, dead, defeated?\"\n\nThe seven leaders fall silent. They've spoken plainly as you asked—some pragmatic, some proud, some fearful, but all honest. Their concerns laid bare: taxation, trade, property rights, legal systems, religious practice, safety, and the slow erosion of their way of life.\n\nMuhammad ibn Rashid watches you carefully, curious how you'll respond to these very real, very practical concerns.\n\nDon Rodrigo and Captain Fernán wait, also curious. These are the challenges of ruling a conquered Muslim city—not just military occupation, but the complex reality of governance.\n\nWhat do you say?"
        },
        {
          "role": "player",
          "text": "You are right Fatima. Islam is finished and dead and defeated. And that is really the core of what is changing. Anyone who is willing to live, work, trade and worship in peace under christian rule can do so. Right now, the war blocks many trade routes with Grenada, but I leave it to the smart traders to make use of the many trade routes who are now opening up as Castillian subjects. This extends to the traders, workers and the Jews as well. All lands and positions will be distributed among Castillian Nobles. No one will be forced to convert, but I cannot look into your hearts. If you cannot live like this, it's better you leave. But if you stay, you agree to live under my rule.\n\n\nThis is what is going to change. And let me now personally adress one of you. Layla, your husband died an honourable death. You have my condoleance, losing a husband is never easy, nor is losing a father for your boys. It also means you are no longer the wife of the governor, you are now a normal muslim woman instead who must find her way in this new reality. Christians have ways to support those less fortunate and I think Islam has as well. I wish you good luck and trust that your sons will soon learn their trades and purpose in life. As  Christian, I hope they find the light and walk in Gods graces."
        },
        {
          "role": "gm",
          "text": "1. To Fatima: Directly confirmed \"Islam is finished and dead and defeated\" - very harsh but honest\n2. Said anyone willing to live/work/trade/worship in peace under Christian rule can do so\n3. Acknowledged war blocks trade with Granada but new routes opening as Castilian subjects\n4. Said all lands and positions will be distributed among Castilian nobles (major change - dispossessing Muslim aristocracy)\n5. No forced conversions but \"cannot look into hearts\" - if they can't live with this, leave\n6. To Layla specifically: Condolences but bluntly told she's no longer governor's wife, just \"a normal muslim woman\" who must find her way\n7. Suggested Christian/Islamic charity for the less fortunate\n8. Hoped her sons would convert (\"find the light\")\n\nThis is a very direct, somewhat harsh response that doesn't sugarcoat the reality. It's honest but also fairly dismissive of their concerns - especially to Layla, essentially telling a noble widow she's lost her status and should rely on charity.\n\nI need to show how the leaders react to this. Some will be:\n- Shocked at the bluntness\n- Offended (especially Layla and Fatima)\n- Resigned (the pragmatists like Sheikh Ibrahim, Qasim)\n- Uncertain what this means for them\n\nMuhammad ibn Rashid might be concerned this is too harsh and could inflame tensions. Don Rodrigo might approve of the clarity. The leaders will have varied reactions based on their personalities.\n\nThe Leaders' Reactions\n\nThe silence that follows your words is profound and uncomfortable. Fatima al-Qurtubi's face goes rigid—you've confirmed her worst fears directly. Layla bint Hassan's expression shifts from proud dignity to barely controlled fury, her hands trembling at her sides.\n\nSheikh Ibrahim closes his eyes briefly, exhaling slowly. When he opens them, his face shows the resignation of a man who has survived by adapting. \"Your Majesty speaks... clearly. We understand the terms.\"\n\nLayla can barely contain herself. Her voice shakes: \"A normal Muslim woman? My family has held estates in Ronda for four generations. My husband died defending this city with honor, and you tell me to seek charity?\" She steps forward, and Captain Fernán's hand moves to his sword. Muhammad ibn Rashid raises a hand sharply—a warning to Layla to restrain herself.\n\nShe stops, breathing hard. \"I understand perfectly, Your Majesty. Everything we built, everything we are—gone. Distributed to your nobles who know nothing of these lands.\" Her voice drops to barely above a whisper. \"I will leave. My sons will not grow up as beggars in their own city, dependent on Christian charity. We will go to Granada.\"\n\nShe turns and walks toward the door without being dismissed. Muhammad starts to call her back, then stops. One of her attendants hurries after her.\n\nFatima al-Qurtubi's voice is bitter: \"At least Your Majesty is honest. Most conquerors pretend. You simply say what is true—we are defeated, our faith is dead here, and we must accept this or leave.\" She looks at the other leaders. \"I will stay. I will teach in the small mosque you allow us. I will watch my students walk past the church that was once ours. And I will remember.\"\n\nImam Yusuf looks stricken. \"Your Majesty, the lands distributed to Castilian nobles—this includes the religious endowments? The waqf properties that support the mosque, the school, care for orphans and widows?\" He's clearly trying to understand the practical implications. \"Without those endowments...\"\n\nQasim the merchant speaks pragmatically, though his earlier confidence is shaken: \"Your Majesty, I understand. New trade routes, new opportunities. I will adapt. But the lands distributed to your nobles—if they own the workshops, the warehouses, do we become... tenants? Employees of Christian landlords?\"\n\nAhmad the guild master looks lost. \"Your Majesty, my craftsmen—they own their shops, their tools. Do they keep these? Or do nobles take everything?\"\n\nMoshe ben Yitzhak wrings his hands. \"Your Majesty, Jews in Christian lands... we hear of restrictions. Cannot own land, cannot practice certain trades, must wear badges, confined to quarters...\" His voice trails off fearfully.\n\nMuhammad ibn Rashid's face is carefully neutral, but you can see tension in his jaw. He leans toward you and speaks very quietly, meant only for your ears: \"Your Majesty, I counseled honesty, but... Layla represents a dozen noble Muslim families. If they all leave, and you distribute their lands to Castilian nobles who know nothing of local agriculture, irrigation systems, tenant relationships...\" He pauses. \"It could destabilize the entire economic structure.\"\n\nDon Rodrigo, standing behind you, also speaks quietly: \"Your Majesty made your position clear. They asked for plain speech. You gave it.\" His tone suggests approval of the directness, though perhaps not the specific message to Layla.\n\nSheikh Ibrahim steps forward carefully. \"Your Majesty, may I ask for clarification? You say all lands and positions distributed to Castilian nobles. Does this mean:\n\nAll agricultural lands? Including small family farms?\nAll commercial properties? Workshops, shops, warehouses?\nAll residential properties? Or can families keep their homes?\nAll administrative positions? Or can qualified Muslims serve in lower offices under Christian authority?\"\n\nHis voice is steady but strained. \"I do not challenge Your Majesty's right to do any of this. I simply need to understand the scope, so I can... help people prepare.\"\n\nThe remaining leaders watch you—some angry, some fearful, most simply trying to calculate what survival looks like under these terms.\n\nWhat do you say?"
        },
        {
          "role": "player",
          "text": "Of course.\n\n\nAll agricultural lands will belong to the new Castillian Nobility, all those working them will become tenants. But keep in mind that I have agreed to fair taxation and the new nobles are bound by those.\n\n\nWorkshops will stay property of their owners, as well as their posessions. They will be subject to tax of course, but you will find that Chjristian rule will provide you with stability and just and fair taxes. And with new and bigger markets as well.\n\n\nFamilies can keep their homes, but again, may be subject to just and fair tax.\n\n\nAnd I hope many Muslims will want to serve in lower offices as well.\n\n\nDo you have more questions?"
        },
        {
          "role": "gm",
          "text": "The leaders would respond to this with a mix of relief (it's not total dispossession) and continued concern (losing agricultural lands is still major, and \"fair taxation\" is vague).\n\nLet me show their responses realistically - some pragmatic acceptance, some continued concern, and the practical questions that would arise.\n\nClarifications and Concerns\n\nThe tension in the room eases slightly—not vanishing, but the sheer terror of complete dispossession recedes. Sheikh Ibrahim visibly relaxes, nodding slowly.\n\n\"Your Majesty, this is... clearer. Thank you.\" He glances at the other leaders. \"So craftsmen keep their workshops, merchants their warehouses, families their homes. Agricultural estates transfer to Castilian nobility, farmers become tenants. This is... this is conquest, but not destruction.\"\n\nHis voice steadies. \"I can work with this, Your Majesty. I can help organize the transition.\"\n\nQasim the merchant speaks with returning confidence: \"Your Majesty, if I keep my warehouse and workshops, if I can trade in new markets as Castilian subject—yes, I can work with this. The taxation—you say 'just and fair.' Can Your Majesty be more specific? What rate? We paid Sultan Yusuf one-fifth of profits on trade goods, plus jizya as dhimmi protection tax. What will Castile require?\"\n\nAhmad the guild master looks relieved. \"Your Majesty, my blacksmiths keep their forges? Carpenters their workshops? Then we can survive. We will pay your taxes, work for whoever owns the land, adapt.\" He pauses. \"But the agricultural lands—many craftsmen have small gardens, orchards that feed their families. These also transfer to nobles?\"\n\nImam Yusuf asks carefully: \"Your Majesty, the religious endowments—the waqf lands that support the mosque, the school, care for orphans—these are agricultural properties technically. Do they also transfer to Castilian nobles? Or can they remain as endowments serving the Muslim community?\"\n\nMoshe ben Yitzhak speaks hesitantly: \"Your Majesty, Jews in Ronda own no agricultural land—we are forbidden this under Islamic law. But we have homes, shops, small businesses. These we may keep? And the taxation—will it be heavier for Jews than Muslims? In some Christian lands...\" He doesn't finish.\n\nFatima al-Qurtubi's voice is still bitter but less confrontational: \"Your Majesty, I teach in a building adjacent to the small mosque. This building—does it count as religious endowment or residential property? Can I continue teaching there?\"\n\nSheikh Ibrahim adds a crucial question: \"Your Majesty, the Castilian nobles who receive the agricultural lands—when do they arrive? How is the transition managed? If farmers do not know who their new lord is, who collects rents, who resolves disputes about water rights or grazing...\" He spreads his hands. \"The autumn planting season approaches. Farmers need to know who they serve.\"\n\nMuhammad ibn Rashid interjects quietly: \"Your Majesty, may I suggest something? Many of these details—tax rates, property boundaries, timing of noble appointments—these need not be decided this moment. Perhaps Sheikh Ibrahim and I could work with Don Rodrigo to draft specific policies over the next week? Present them for Your Majesty's approval?\"\n\nHe continues: \"What matters now is that these leaders understand the basic framework and can communicate it to the people. Workshops stay with owners, homes remain with families, agricultural estates transfer to Castilian nobility. That is enough for today. The details can follow.\"\n\nDon Rodrigo nods approval of this approach. \"Your Majesty, the Qaida makes sense. We need time to survey lands, identify which Castilian nobles will receive which estates, establish tax collection systems. This cannot be improvised in one afternoon.\"\n\nSheikh Ibrahim looks hopeful at this suggestion. \"Your Majesty, if I may serve in this capacity—I know every estate, every farm, every water right in Ronda's territory. I can help ensure the transition is orderly, that farmers know who their lords are, that rents are collected properly.\"\n\nHis offer is pragmatic: he's offering to help implement his own people's subordination, in exchange for ensuring it happens in a controlled, non-chaotic way that preserves some stability.\n\nThe other leaders watch to see how you respond to these questions and Muhammad's suggestion about working out details over the coming week.\n\nWhat do you do?"
        },
        {
          "role": "player",
          "text": "The exact taxes will be up to your new duke. But normally, it's just 5% of revenue for traders and craftsmen. That will be the tax until I appoint someone else. For now, this city is crown property. As crown lands, I will exempt the small gardens craftsmen have from tax.\n\n\nImam Yusuf, the mosque remains, but only the mosque. It can function on donations from muslims but will no longer own any lands. Dont worry about the orphans, I will take care of them through our christian tradition.\n\n\nMoshe, keep your shops. You will pay the normal 5% revenue tax as long as you are crown dependants.\n\n\nFatima, this building is no longer property of the mosque. It is owned by the crown. You may continue to teach there.\n\n\nI think that Ronda will remain crown property at least for the coming years. I will leave don Rodrigo here to manage affairs. I hope Mohammed will stay as well beyond the two weeks he has agreed to serve as an official serving the crown. You can work out the details of these policies amongst yourselves and with Don Rodrigo.\n\n\nDo you have any more concerns?"
        },
        {
          "role": "gm",
          "text": "1. 5% revenue tax for traders and craftsmen (as crown property)\n2. Small gardens owned by craftsmen exempt from tax\n3. Mosque keeps the building but no lands, must operate on donations\n4. Crown takes responsibility for orphans through Christian charity\n5. Jews keep their shops, pay 5% revenue tax\n6. Teaching building is crown property but Fatima can continue teaching there\n7. Ronda remains crown property for the foreseeable future\n8. Don Rodrigo will manage affairs\n9. Juan hopes Muhammad will stay beyond the two weeks\n\nThis is actually somewhat more moderate than the initial harsh statements. The leaders should respond to this. Some concerns:\n\n- Imam Yusuf will be worried about how the mosque functions without endowment lands\n- Sheikh Ibrahim should be mostly satisfied, seeing a path forward\n- Qasim should be pleased with the 5% rate (better than one-fifth under Sultan)\n- Muhammad may respond to the request to stay longer\n- Someone should ask about the agricultural tenants and what happens to them\n\nLet me write their responses.\n\nFinal Questions and Commitments\n\nSheikh Ibrahim bows his head respectfully. \"Your Majesty, 5% revenue tax is... very reasonable. More reasonable than I expected, honestly. Crown property managed by Don Rodrigo with Your Majesty's direct oversight—this gives stability.\" He glances at Muhammad. \"If the Qaida stays to help with transition, and Don Rodrigo learns from him, we can make this work.\"\n\nQasim the merchant looks genuinely pleased. \"Five percent, Your Majesty? Under Sultan Yusuf we paid one-fifth—twenty percent—plus jizya. This is significantly less. I can prosper under such taxation.\" His merchant's mind is already calculating. \"With access to Castilian markets, new trade routes... yes, Your Majesty, this can work well.\"\n\nAhmad the guild master nods vigorously. \"Small gardens exempt? Your Majesty is generous. My craftsmen will accept this. We can work, pay fair tax, live under your protection.\"\n\nImam Yusuf's face shows strain, but he's clearly trying to be practical. \"Your Majesty, the mosque without endowments... we will manage on donations, though it will be difficult. But I must ask—the orphans you say you will care for through Christian tradition. Does this mean they will be raised Christian? Converted? Or simply fed and housed while remaining Muslim?\"\n\nHis concern is clear: if every orphan becomes a Christian ward, the Muslim community loses its children to conversion through charity.\n\nMoshe ben Yitzhak actually smiles—the first smile in the room. \"Your Majesty, five percent and we keep our shops? This is... this is better than we had under Sultan.\" He bows low. \"The Jewish community will be loyal subjects. We know how to live as minorities. We will cause no trouble.\"\n\nFatima al-Qurtubi's voice is still hard but resigned. \"Crown property. I may continue teaching. Very well, Your Majesty. I understand the reality.\" She pauses. \"But I ask one thing—may I teach Muslim children Islamic faith and Quran in this building? Or must my teaching be only... practical matters? Reading, arithmetic, but not religion?\"\n\nSheikh Ibrahim adds a final practical question: \"Your Majesty, the agricultural tenants—the farmers who work the lands being transferred to Castilian nobles. What protections do they have? Can a new noble evict them without cause? Raise rents arbitrarily? Or do they have rights as tenants? This affects perhaps two thousand farming families in Ronda's territory.\"\n\nThen Muhammad ibn Rashid speaks, and his words carry weight: \"Your Majesty, you honor me by asking me to stay beyond my promised two weeks.\" He's quiet for a moment, thinking. \"I will stay. Not two weeks—I will stay six months, through the winter and into spring. Long enough to ensure this transition succeeds, to teach Don Rodrigo how this city works, to help prevent the chaos that destroys conquered cities.\"\n\nHe meets your eyes. \"I do this for my people, Your Majesty. For the families who remain. They need someone who knows both worlds—Muslim and Christian, the old system and the new. I can be that bridge.\" He pauses. \"After six months, I will take my family to Granada. But until then, I serve Castile as I served Granada—with competence and honor.\"\n\nDon Rodrigo looks relieved at this commitment. \"Your Majesty, with the Qaida's help for six months, I can learn to govern this city properly. It's a generous offer.\"\n\nSheikh Ibrahim bows again. \"Your Majesty, if Qaida Muhammad stays, if Don Rodrigo governs with his counsel, if the tax rates remain as stated... I believe Ronda can thrive under Castilian rule. Most people simply want stability, justice, and the ability to live their lives. You offer this. Many will accept, even prefer it to the chaos and weakness Granada has become.\"\n\nThe leaders wait for your response to the remaining questions: What happens to orphans? Can Fatima teach Islamic faith? What protections do tenant farmers have?\n\nWhat do you say?"
        },
        {
          "role": "player",
          "text": "I thank those of you who see the opportunity in the new situation. And I understand Fatima and the iman. Like I said, Islam is finished and dead and the sooner you can understand this, the better it is. I will not force convert anyone, but Christianity is the future.\n\n\nFatima, you may teach what you want to willing students. But why would you teach islamic law when there is lo longer a need for it? It's up to you and the parents of your students.\n\n\nThe orphans will of course be given the best chance in life and that is clearly to raise them in the christian tradition.\n\n\nNow, if there is nothing else, I have other business to attend to. I wish you well and hope you can live in peace and prosperity under my rule.\n\n\nI go and wait for a few days and see how things develop as my troops extend their control to new villages. Are the raiders being driven out?"
        },
        {
          "role": "gm",
          "text": "The tone from Juan has been quite direct and uncompromising about the end of Islam and Christian supremacy. The leaders will have mixed reactions - some pragmatic acceptance, some barely concealed anger, some resignation.\n\nThen I need to show the military operations extending into the countryside and what happens with the raiders.\n\nThe Consolidation of Ronda's Territory\n\nThe leaders bow—some deeply, others stiffly—and file out. Sheikh Ibrahim looks pragmatic and ready to adapt. Qasim already calculating profit margins. Ahmad relieved his craftsmen can keep working. Moshe grateful for better terms than expected.\n\nImam Yusuf's face shows profound sadness but acceptance. Fatima al-Qurtubi leaves with her back rigid, anger and grief in every line. She'll teach, but she'll teach defiance alongside arithmetic.\n\nMuhammad ibn Rashid remains after they depart. \"Your Majesty speaks very directly about Islam's end. They needed to hear it, I think. Better harsh truth than false hope.\" He pauses. \"But the orphans raised Christian—every Muslim family will see this. They will know that poverty means losing children to your faith. It will... accelerate conversions, perhaps. Or deepen resentment.\"\n\nHe doesn't criticize, simply states reality. \"I will help Don Rodrigo implement what you've decreed. The city will adapt. Most people are pragmatic when faced with overwhelming power.\"\n\nDays 6-10: October 6-10, 1431 - Extending Control\n\nOver the following days, your forces radiate outward from Ronda in coordinated sweeps.\n\nOctober 6th:\n\nDon Rodrigo dispatches cavalry columns—five hundred horsemen split into four groups, each targeting villages within a day's ride of Ronda. Infantry companies follow to establish garrisons in key locations.\n\nThe first village—a hamlet of perhaps one hundred fifty souls eight miles northeast—surrenders immediately when two hundred cavalry arrive. The elder sees the Castilian banners, hears that Ronda has fallen without siege, and kneels within an hour. The oath is sworn. A twenty-man garrison is left. The cavalry moves on.\n\nOctober 7th:\n\nThree more villages submit. Word has spread impossibly fast—Ronda fallen, the king himself in residence, generous terms offered. The villages are calculating: resistance is suicide, submission offers survival and reasonable taxation.\n\nBut the fourth village—Gaucín, a fortified position on a hilltop twelve miles west—bars its gates. This is one of the secondary raider bases Muhammad mentioned. Perhaps two hundred fighters, families, supplies.\n\nYour cavalry surrounds it but doesn't assault. The commander sends word: \"Village fortified, garrison refuses terms. Request artillery support or permission to starve them out.\"\n\nOctober 8th:\n\nYou dispatch Pietro Calabrese with two bombards. The guns arrive at Gaucín by afternoon, unlimber, and fire ranging shots. The second ball smashes through the village gate. The third collapses a watchtower.\n\nBefore the fourth shot, white flags appear. The garrison commander—seeing what happened at Yunquera and Ronda—chooses submission over destruction. Terms are identical: hardliners leave, moderates submit, one small mosque if the population warrants it.\n\nSeventy fighters and their families depart for Granada under escort. One hundred thirty people remain and swear fealty. A fifty-man Castilian garrison moves in.\n\nOctober 9th:\n\nReports from all cavalry columns: The countryside is submitting. Villages see the inevitability. Eight more settlements have sworn fealty. The garrisons you're leaving—twenty to fifty men each depending on village size—total perhaps four hundred soldiers now spread across the territory.\n\nMore importantly: The raiders are disappearing.\n\nDon Rodrigo's scouts report that the raider bands operating from Ronda and Gaucín—perhaps six hundred cavalry total—have scattered. Some rode east toward Granada city when Ronda fell. Others are simply... gone. Melted into the hills without bases to operate from.\n\n\"Your Majesty,\" Don Rodrigo reports, \"we've cut the head off the snake. Without Ronda's supplies, without Gaucín as a secondary base, the raiders cannot sustain operations. Some may still harass isolated targets, but coordinated ambushes of major convoys? That's finished. We've broken their operational capacity.\"\n\nOctober 10th:\n\nA significant moment: A convoy from Málaga arrives at Ronda—the first major supply train since you took the fortress. It traveled the route that was ambushed repeatedly throughout summer and early autumn.\n\nNo attacks. No raiders. The convoy commander reports seeing distant horsemen—scouts, perhaps—but no one approached within bowshot. The roads are effectively open.\n\nMuhammad ibn Rashid, working alongside Don Rodrigo, confirms: \"Your Majesty, taking Ronda achieved what months of counter-raiding could not. The raiders operated from here, resupplied here, rested here. Without this fortress, they're just scattered bandits—dangerous to individuals but unable to threaten armies or major convoys.\"\n\nHe looks at the map. \"The villages submitting cuts their intelligence network. They don't know where your forces are anymore, which routes are vulnerable. And the garrisons you've placed—even twenty men in a village means raiders can't rest there, can't requisition supplies.\"\n\nSheikh Ibrahim, who's been helping organize the transition, adds his assessment: \"Your Majesty, the countryside is... relieved. These raiders were Muslims, yes, but they were also a plague—taking food, horses, sons for fighting. The villagers submitted to Your Majesty partly from fear, but partly because Castilian garrisons mean the raiders can no longer simply take what they want.\"\n\nStatus - October 10th, 1431\n\nTerritory Secured:\n\nRonda fortress and city (8,000 population)\n\nGaucín fortified village (130 remaining after departures)\n\nTwelve smaller villages (total ~2,500 people)\n\nTotal: ~10,500 people now under Castilian authority in Ronda's territory\n\nGarrisons: 1,000 men at Ronda, 400 spread across villages/Gaucín\n\nMilitary Situation:\n\nRaider operational capacity broken\n\nSupply routes from Málaga to Ronda now secure\n\nGranada's organized resistance in this region effectively ended\n\nScattered small bands remain but cannot threaten organized forces\n\nPolitical Situation:\n\nMost villages submitted peacefully after Ronda's example\n\nModerate Muslims adapting to new reality\n\nHardliners (perhaps 500 total) departed to Granada\n\nJewish community relieved by favorable treatment\n\nChristian merchants already arriving from Málaga, seeing opportunity\n\nYour Available Forces:\n\n5,000 men still with you at Ronda (1,000 garrisoning, 4,000 mobile)\n\nMaster of Santiago has 9,000 in western coastal areas\n\nEastern army (Don Álvaro) has ~18,000 near Loja\n\nDon Rodrigo approaches as you review these reports. \"Your Majesty, we've accomplished the mission. Ronda is ours, the raiders are broken, the territory is secured. It's October 10th. The Cortes convenes in Jaén on November 1st—three weeks away.\"\n\nHe pauses. \"We could continue operations—push further into Granada's interior, take more villages. Or we could consolidate what we have, leave strong garrisons, and you could return to Jaén to prepare for the Cortes. Your presence there for the assembly would be... significant.\"\n\nMuhammad ibn Rashid adds: \"Your Majesty, winter approaches. Two more weeks of good campaign weather, perhaps three at most. Then the rains come and roads become difficult. Whatever you do next, the season is ending.\"\n\nWhat are your orders?"
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_PLACEHOLDER_009",
      "book": 1,
      "chapter": "1.23",
      "date": "1431-10-10",
      "end_date": "1431-10-11",
      "type": "military",
      "summary": "Juan issues departure orders. Don Rodrigo remains to govern Ronda and continue operations. Military Orders (~5,000 professional soldiers) will garrison through winter; levies can disband. Cortes date set for November 15 in Jaen. Artillery returns to Malaga for winter maintenance. All commanders instructed to coordinate and halt campaign in time for Cortes. Muhammad ibn Rashid and Sheikh Ibrahim will help with transition. Juan takes 100 cavalry escort and departs Ronda at first light October 11 for Toledo.",
      "characters": [
        "juan_ii",
        "rodrigo_de_perea",
        "muhammad_ibn_rashid",
        "pietro_calabrese",
        "fernan_alonso_de_robles"
      ],
      "factions_affected": [],
      "location": "Ronda",
      "tags": [
        "military",
        "orders",
        "departure",
        "winter_quarters",
        "cortes"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "I will leave for Toledo and Jaen tomorrow. I leave the army under don Rodrigo to push on for as long as he deems practical. I dont expect miracles with only a few weeks left in the season.\n\n\nI write letters to the garisson commanders. We leave in a few weeks for Jaen and the Cortes. Levies can disband and we leave only winter garissons. Garissons that stay can be paid from the crown tax coming year should they stay.\n\n\nAny questions?"
        },
        {
          "role": "gm",
          "text": "Don Rodrigo nods, understanding the orders, but raises practical points: \"Your Majesty, a few clarifications before you depart:\n\nFirst—your escort for the journey. Ronda to Toledo is perhaps one hundred fifty miles, then Toledo to Jaén another hundred. That's six to eight days hard riding through territory that's mostly secure but not entirely pacified. How large an escort? Captain Fernán and the royal guard—fifty men—sufficient? Or do you want a larger force?\"\n\nCaptain Fernán speaks up: \"Your Majesty, after the ambush on the way here, I recommend at least one hundred cavalry. The roads near Ronda are secure now, but once we're north of the coastal mountains...\"\n\nDon Rodrigo continues: \"Second—command structure while you're absent. I'll command the Ronda forces and continue operations as you've ordered. But Master of Santiago leads the western coastal army. Do you want me coordinating with him, or do we operate independently? And what about communication with Don Álvaro's eastern army?\"\n\nHe glances at the map. \"Third—the winter garrisons you mention. Currently we have perhaps 1,400 men in garrisons across all the territory we've taken—Ronda, Gaucín, coastal fortresses, villages. You're ordering levies to disband, keeping only professional soldiers through winter. That's wise—saves money, sends farmers home for planting season. But how many professional soldiers do we have versus levy troops?\"\n\nMuhammad ibn Rashid adds quietly: \"Your Majesty, the garrison at Ronda specifically—Don Rodrigo needs at least eight hundred men here through winter to maintain control of the city and surrounding area. This is Granada's interior, more hostile than the coast. A smaller garrison risks uprising.\"\n\nDon Rodrigo nods. \"Agreed. So between Ronda, the coastal fortresses, and key villages, we need perhaps two thousand professional troops for winter garrisons. The rest—levies and temporary crusader volunteers—can go home until spring.\"\n\nHe continues: \"Fourth—timeline for everyone else reaching Jaén for the Cortes. You said November 1st. That's three weeks away. If I'm to continue operations here for two more weeks, then organize withdrawal and march to Jaén...\" He calculates. \"The western army won't reach Jaén until late October at earliest. Is the Cortes flexible on timing, or must everyone be there by November 1st precisely?\"\n\nFifth—Don Álvaro and the eastern forces. Your letters to garrison commanders—should I send a comprehensive report to Don Álvaro as well? He doesn't know about Ronda's fall yet, or that the raider threat is broken. That intelligence would help him plan his own operations and withdrawal.\"\n\nSheikh Ibrahim, who's been listening, speaks up: \"Your Majesty, one administrative question. You leave tomorrow, Don Rodrigo remains to govern Ronda. But the details of taxation, property transfers, noble appointments we discussed—who makes these decisions in your absence? Don Rodrigo? Or must he wait for your return to implement anything?\"\n\nPietro Calabrese adds: \"Your Majesty, the artillery—the six bombards here at Ronda. Do they stay with Don Rodrigo for potential sieges, or do some return to the coast? And what of me—stay here or return to Málaga?\"\n\nFinally, Don Rodrigo asks the most personal question: \"Your Majesty, you go to Toledo before Jaén. To see Queen Isabel before the Cortes?\" His tone is respectful but knowing—your pregnant wife hasn't seen you since August. \"How long do you plan in Toledo? The Cortes begins November 1st, and Toledo to Jaén is three to four days' travel.\"\n\nHe's not questioning your decision, just ensuring everyone understands the timeline and can plan accordingly.\n\nWhat are your answers?"
        },
        {
          "role": "player",
          "text": "I take one hundred men with me.\n\n\nYou all have your armies and orders. Communicate with each other.\n\n\nWe use the military order, the crusaders. That should give us more than 5.000 soldiers who can garisson during winter. The rest can go home.\n\n\nWe hold Cortes at November 15th. I expect everyone to be there. Stop campain earlier if needed.\n\n\nCommunicate with the rest of the army yes.\n\n\nRoll the cannons back to Malaga and stay there for the winter.\n\n\nI will be at the Cortes on time.\n\n\nNow, you all have your orders.\n\n\nI leave for Toledo at first light in the morning."
        },
        {
          "role": "gm",
          "text": "1. Escort: 100 cavalry for the journey\n2. Command structure: Commanders coordinate amongst themselves\n3. Winter garrisons: Use the crusaders and professional soldiers (~5,000 total) to garrison through winter\n4. Cortes date: CHANGED to November 15th (giving more time)\n5. Communication: Yes, coordinate between armies\n6. Artillery: Return to Málaga for winter\n7. Timeline: Juan leaves tomorrow for Toledo, will be at Cortes on time\n\nThis is Juan being decisive and leaving competent commanders to execute. The change to November 15th for the Cortes is smart - gives everyone more time.\n\nNow I should:\n1. Show the commanders accepting orders\n2. Brief scene of preparation\n3. Dawn departure\n4. Then I'll need to create a d100 table for the journey to Toledo (through partially secured territory)\n\nThe journey is: Ronda → Toledo (150 miles, probably through Córdoba or similar route) → then Toledo to Jaén when needed.\n\nFinal Orders and Departure\n\nDon Rodrigo snaps to attention. \"Understood, Your Majesty. November 15th gives us proper time to conclude operations and march. I'll coordinate with Master of Santiago and send comprehensive reports to Don Álvaro.\" He salutes. \"Ronda will be secured and ready to contribute troops to the Cortes.\"\n\nPietro Calabrese bows. \"The bombards return to Málaga. We rest them through winter, do maintenance. Ready for spring campaign, yes?\"\n\nCaptain Fernán nods. \"One hundred cavalry, departure at first light. I'll select the best riders and horses, Your Majesty.\"\n\nMuhammad ibn Rashid speaks quietly: \"Safe journey, King Juan. When you return to Jaén, you'll find the western territories secured. Don Rodrigo and I will ensure it.\"\n\nSheikh Ibrahim bows deeply. \"Your Majesty, may God—yours and mine—grant you safe travels.\"\n\nThe commanders disperse to their tasks. The fortress comes alive with activity—orders being relayed, troops organizing, messengers preparing to ride to distant garrisons with news of the timeline change.\n\nDawn - October 11th, 1431\n\nFirst light breaks cold and clear over Ronda. Your escort assembles in the courtyard—one hundred cavalry, all veterans, fresh horses from Ronda's stables. Captain Fernán personally inspects each mount, each man's equipment. Supply packs for a week's travel. Fast, mobile, professional.\n\nYou emerge in your white armor, though the helmet stays with your baggage for now. Your father's sword at your hip. The white banner furled on a cavalry lance—no need to announce your presence to every bandit between here and Toledo.\n\nDon Rodrigo waits at the gate. \"Your Majesty, the roads north are mostly secure—we control the territory to Córdoba, and from there it's solid Castilian lands all the way to Toledo. Still, stay alert. Small raider bands may still operate in the hill country.\"\n\nHe clasps your arm. \"We'll see you at the Cortes, Your Majesty. With good news of consolidated conquests.\"\n\nMuhammad ibn Rashid has also come to see you off. He bows—lower than before, you notice. Respect earned, not just given to power. \"Your Majesty changed history this week. Future generations will remember that Ronda fell without siege, that its people were given terms they could accept. Some will curse you, others will thank you. Both will remember.\"\n\nYou mount. Captain Fernán gives the signal. The column moves out through Ronda's gates—hooves clattering on ancient stone, breath misting in morning air, the city waking behind you to its first full week under Christian rule.\n\nThe road north winds through the hills, climbing out of Ronda's plateau toward the plains beyond. Behind you, Castilian banners fly from walls that flew Granada's green just days ago.\n\nAhead lies Toledo—and Isabel, six months pregnant, waiting.\n\nJourney ahead: Ronda to Toledo, ~150 miles through hill country then Castilian heartland, 6-8 days' travel\n\nShould we roll for how this journey goes? Or would you like to handle it narratively?"
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_PLACEHOLDER_010",
      "book": 1,
      "chapter": "1.23",
      "date": "1431-10-11",
      "end_date": "1431-10-17",
      "type": "travel",
      "summary": "Juan rides at best speed from Ronda to Toledo with 100 cavalry escort under Captain Fernan. Roll 29 (Minor Delays): The first three days through hill country are uneventful, passing through recently submitted villages. On day 4, unexpected upstream rains have swollen the Guadalquivir at the ford crossing, forcing an 8-mile detour to Cordoba's Roman bridge. One day lost. The remaining push is grueling: 35 miles per day through La Mancha. Three horses go lame. The escort arrives at Toledo on October 17 after 7 days instead of the planned 6, battered but intact.",
      "characters": [
        "juan_ii",
        "fernan_alonso_de_robles"
      ],
      "factions_affected": [],
      "location": "Road to Toledo",
      "tags": [
        "travel",
        "roll",
        "journey"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "I travel at best speed to Toledo. Draft a d100 table to see how the journey goes."
        },
        {
          "role": "gm",
          "text": "**Factors in Favor:**\n- 100 experienced cavalry escort - all veterans\n- Mostly through secured territory (Ronda to Córdoba is controlled, Córdoba to Toledo is solid Castile)\n- Good horses from Ronda's stables\n- Fast, mobile force with no baggage train\n- Professional soldiers after successful campaign\n- Main raider threat broken after Ronda's fall\n- October weather still good for travel\n- Well-supplied for the journey\n- Captain Fernán commanding - experienced and cautious after previous ambush\n\n**Factors Against:**\n- \"Best speed\" means pushing hard - more vulnerable to mistakes\n- Small raider bands may still operate in hill country near Ronda\n- ~150 miles through some rough terrain initially\n- Fast travel means less careful scouting\n- Horses being pushed hard could break down\n- October weather could turn bad\n- Still in recently contested territory for first 2-3 days\n- Reduced supply packs mean less flexibility if delayed\n\nThis should be relatively safe - the territory is mostly secured and it's a strong escort. But \"best speed\" introduces some risk. Let me create a table:\n\n1-8: Serious incident\n9-23: Complications/delays\n24-55: Minor issues but arrive safely\n56-85: Good journey\n86-95: Fast, uneventful journey\n96-100: Excellent journey with good encounters\n\nLet me draft this properly.\n\nJourney to Toledo at Best Speed - D100 Resolution Table\n\nFactors in Favor:\n\nStrong escort of 100 veteran cavalry\n\nCaptain Fernán commanding (experienced, cautious after ambush)\n\nGood horses from Ronda's stables\n\nTerritory mostly secured - Ronda to Córdoba controlled, beyond that solid Castile\n\nMain raider threat broken with Ronda's fall\n\nProfessional soldiers, high morale after successful campaign\n\nFast, mobile force with no vulnerable baggage train\n\nGood October weather for travel\n\nWell-supplied for the journey\n\nFactors Against:\n\nPushing for best speed means harder riding, less careful scouting\n\nFirst 2-3 days still through recently contested hill country\n\nSmall scattered raider bands may still operate near former raider territory\n\nHard riding risks horse breakdowns or injuries\n\nReduced caution for speed increases vulnerability\n\nFast pace exhausts men and mounts\n\nLess flexibility if problems arise\n\nOctober weather could turn unexpectedly\n\nD100 JOURNEY OUTCOME TABLE:\n\n1-5: Serious Incident - Encounter with desperate raider band or major horse breakdown. Fighting or significant delay (2-3 days). Minor casualties (3-8 men) or Juan takes minor injury. Arrive Toledo late and depleted.\n\n6-15: Major Complications - Bad weather, multiple horse breakdowns, or minor raider harassment forces slower pace. Significant delays (1-2 extra days). Arrive exhausted, some horses ruined. 8-9 days total journey.\n\n16-35: Minor Delays - One incident (weather, minor encounter, horse problems) slows progress. Brief detour or rest needed. Arrive 1 day late (7-8 days journey) but safely. Troops tired but intact.\n\n36-60: Solid Journey - Hard riding with minor inconveniences (tough terrain, brief weather, distant sightings). Arrive in 6-7 days as planned. Troops and horses tired but functional. Standard fast journey.\n\n61-82: Good Progress - Fast travel with few problems. Good roads once past hill country, cooperative weather, no real threats. Arrive in 6 days, troops tired but satisfied. Efficient journey.\n\n83-94: Excellent Journey - Near-perfect conditions. Clear weather, good roads, strong horses, no threats. Arrive in 5-6 days, minimal exhaustion. Very successful fast march.\n\n95-100: Swift and Fortunate - Exceptional journey with favorable encounters (friendly patrols provide fresh horses, perfect weather, excellent roads). Arrive in 5 days, fresher than expected. Encounter good news or helpful allies en route.\n\nPlease roll your d100 and report the result."
        },
        {
          "role": "player",
          "text": "Rolled 29, minor delays.\n\n\nDraft what happens on the journey with this result."
        },
        {
          "role": "gm",
          "text": "The Road to Toledo\n\nDays 1-3: October 11-13, 1431 - Through the Hills\n\nThe first days are hard riding. Captain Fernán pushes the pace—thirty miles daily, which is punishing for cavalry with full kit. You climb out of Ronda's highlands into the rolling country beyond, following ancient Roman roads when you find them, cutting cross-country when the routes are clear.\n\nThe first night camps at a small village that submitted just days ago. The Castilian garrison there—twenty men—reports no raider activity. The roads are clear. Your escort rests briefly, then continues at dawn.\n\nDay two brings you to Antequera, a mid-sized town firmly in Castilian hands. Fresh horses are available, but Captain Fernán judges your mounts can continue—no need to waste time. You press on after a brief meal, covering another thirty miles by sunset.\n\nDay three, the terrain flattens as you approach the Guadalquivir valley. This is unquestionably Castilian territory now—farms, villages flying Christian banners, churches visible in every settlement. The war feels distant. Your escort relaxes slightly, though discipline remains tight.\n\nDay 4: October 14 - The Complication\n\nMorning of the fourth day, you're making excellent time. The road to Córdoba stretches ahead, clear and well-maintained. Captain Fernán estimates you'll reach the city by afternoon, possibly press through to cut another day off the journey.\n\nThen, around midday, you reach the Guadalquivir River crossing at a ford that should be simple.\n\nIt's not.\n\nThree days of unexpected rain in the mountains upstream—news you hadn't heard—has turned the normally placid crossing into a swift, muddy torrent. The water runs waist-deep and fast, full of debris. One of your scouts tests the ford and his horse nearly loses footing on the treacherous bottom.\n\nCaptain Fernán rides up beside you, frowning at the river. \"Your Majesty, this is... problematic. We could try the ford anyway—lose maybe two or three horses, risk men being swept downstream. Or...\" He points upriver. \"There's a bridge at Córdoba proper, about eight miles that way. But that adds most of a day to reach it and cross.\"\n\nOne of your sergeants adds: \"Could wait for the water to drop, Your Majesty. Maybe by tomorrow afternoon it'll be passable. But that's a full day lost.\"\n\nThe hundred cavalry wait behind you, horses stamping, men looking at the swollen river with professional wariness. It's not life-threatening—you could order the crossing and probably lose only horses, not men. But it's dangerous and uncertain.\n\nYou choose the prudent option: detour to Córdoba's bridge.\n\nThe eight-mile ride upriver eats the afternoon. You reach Córdoba's great Roman bridge as the sun sets—a magnificent piece of ancient engineering spanning the Guadalquivir with sixteen arches. Your escort crosses without incident, the horses' hooves echoing on two-thousand-year-old stone.\n\nCórdoba offers to host you for the night—the city's governor has quarters prepared—but you decline. You've already lost hours; stopping now means losing the entire day's progress. Instead, you push through the city and continue north in gathering darkness for another two hours before making camp.\n\nDay four ends having covered only about twenty miles instead of the planned thirty. One day lost to a river you couldn't have predicted.\n\nDays 5-7: October 15-17 - The Final Push\n\nThe remaining days are hard, grinding travel. Captain Fernán pushes to make up lost time—long days in the saddle, brief rest stops, pressing through until darkness forces halt. The horses are showing strain; three go lame and must be left at villages with promises to retrieve them later. The men are exhausted but determined.\n\nDay five: Thirty-five miles, passing through La Mancha's open plains.\n\nDay six: Another thirty-five miles, the escort now visibly worn. You enter Castile's heartland—familiar territory, completely secure, churches and castles everywhere.\n\nDay seven: The final push to Toledo. You spot the city's unmistakable silhouette in the late afternoon—the Alcázar rising above the Tagus River, the cathedral's tower, medieval walls cascading down the hillside. One of Castile's greatest cities, and more importantly: Isabel is here.\n\nYour escort is battered—horses blown, men swaying in saddles from exhaustion, armor dusty and travel-stained. But you've made it. Seven days from Ronda to Toledo instead of the planned six. Not disastrous, but the delay reminds you that even with secure roads, distance and nature still impose their will.\n\nEvening - October 17th, 1431 - Toledo\n\nThe city gates open as your white armor is recognized. Word spreads instantly: the king has returned. You ride through streets filling with citizens—merchants, artisans, nobles, all cheering the conquering hero. News of Ronda's fall has preceded you.\n\nThe Alcázar looms ahead. As you enter the courtyard, you see figures rushing to the entrance. Servants, guards, courtiers—and there, emerging into the fading sunlight, moving as quickly as a woman six months pregnant can move:\n\nIsabel.\n\nShe stops at the top of the steps, one hand on her swollen belly, the other clutching the carved Virgin Mary figure you gave her in August. Her face—plain by courtly standards but radiant to you—shows relief, joy, and the accumulated fear of two months' separation finally released.\n\nShe doesn't wait for you to dismount. She starts down the steps, and Dona Beatriz has to hurry to support her arm. By the time you've swung down from your horse, Isabel has reached you, propriety abandoned, throwing her arms around you despite the dusty armor and watching court.\n\n\"Thank God,\" she whispers against your chest. \"Thank God you're home.\"\n\nBehind her, the royal household has assembled. Álvaro de Luna—your Constable—watches with satisfaction. Other nobles, courtiers, servants. But for this moment, there's only Isabel, pregnant and relieved, holding you like she'll never let go.\n\nWhat do you do?"
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_PLACEHOLDER_011",
      "book": 1,
      "chapter": "1.23",
      "date": "1431-10-17",
      "end_date": null,
      "type": "personal",
      "summary": "Juan arrives at Toledo to cheering crowds. Isabel, six months pregnant, rushes to meet him at the Alcazar steps. Emotional reunion: Isabel has been praying daily since his departure. Juan removes armor, washes, drinks beer, and tells Isabel everything about Ronda. He explains his philosophy of trusting God's plan to save lives through negotiation rather than siege. Isabel is torn between pride and fear for his safety, and asks him to promise to be careful. Juan promises God will not let him die because he has too much work to do. Isabel, troubled but hopeful, asks about the birth timeline. Juan confirms he will attend the Cortes (November 15) for about a week, then return to stay with her through January/February for the birth. They discuss Juan's vision for tax reform at the Cortes, using crusade leverage to end noble privilege. Isabel expresses concern about noble resistance but supports his vision.",
      "characters": [
        "juan_ii",
        "isabel_of_portugal",
        "alvaro_de_luna",
        "dona_beatriz",
        "fernan_alonso_de_robles"
      ],
      "factions_affected": [],
      "location": "Toledo",
      "tags": [
        "personal",
        "reunion",
        "pregnancy",
        "cortes",
        "reform",
        "family"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "I rode as fast as I could Isabel.\n\n\nI hold her for a moment longer, then hold her at arms length so I can look at her properly.\n\n\nHow are you love? How is the baby?"
        },
        {
          "role": "gm",
          "text": "Isabel's hands come up to grip your arms as you hold her at arm's length. Her eyes—grey-blue and always slightly uncertain—search your face as if memorizing every detail. She's changed in two months. The pregnancy shows clearly now—her belly round and prominent beneath her deep blue gown, her face slightly fuller, a new weariness around her eyes that speaks to sleepless nights of worry.\n\n\"I'm well,\" she says, voice catching slightly. \"We're both well. The physicians say everything is as it should be.\" She places your hand on her belly, pressing it there. \"The baby moves constantly now. Strong kicks—Don Álvaro jokes it must be a warrior already.\"\n\nA flicker of movement under your palm—the child within, very much alive. Isabel's smile wavers, tears threatening. \"But Juan, I've been so frightened. Every messenger that arrived, every time someone came with news from the campaign, I thought...\" She can't finish, just shakes her head.\n\nDona Beatriz steps closer, voice gentle: \"Her Majesty has been very brave, Your Majesty. She's attended Mass daily for your safety, prayed the rosary countless times. But the worry has been hard.\"\n\nIsabel nods, not releasing her grip on you. \"I heard about Ronda. The whole city is talking about it—that you took one of Granada's strongest fortresses without a siege, through negotiation. That you rode into danger yourself to parley.\" Her voice tightens. \"You could have been killed, Juan. If they'd broken the truce, if they'd—\"\n\nShe stops herself, drawing a shaking breath. \"I'm sorry. You're home now. That's what matters.\" She glances at the assembled courtiers watching this reunion, then back to you. \"Can we... can we go inside? I want to hear everything. About Ronda, about the campaign. And I have things to tell you too—about the Cortes preparations, about...\" She hesitates. \"About other matters.\"\n\nBehind her, Don Álvaro de Luna bows. \"Your Majesty, welcome home. The court has much to discuss, but it can wait until morning. Tonight should be for your reunion with the Queen.\"\n\nThe household staff is already moving—servants rushing to prepare chambers, calling for hot water and food, the machinery of royal hospitality springing into action.\n\nIsabel still holds your arm, looking up at you with exhausted relief. \"Please, Juan. I've missed you terribly. Can we just... talk? Just us?\"\n\nWhat do you do?"
        },
        {
          "role": "player",
          "text": "Yes, Isabel. Lets go inside together and let me doff my armour and have a quick wash.\n\n\nCan I have something to drink please? Some cold beer?"
        },
        {
          "role": "gm",
          "text": "Juan wants to go inside with Isabel, remove his armor, wash up, and have a beer. This is a natural domestic moment after a long journey. Isabel would be happy to have him to herself. The servants would help with the armor and provide refreshments.\n\nI should narrate:\n1. Going to their chambers\n2. Servants helping remove armor\n3. Juan washing/cleaning up from the journey\n4. Beer being brought\n5. A quiet moment with Isabel where they can talk\n6. Isabel would likely want to hear about the campaign but also share what's been happening in Toledo\n\nI should keep this relatively brief and natural, letting the player direct where the conversation goes. Isabel is 6 months pregnant (due late January/early February), so it's now mid-October. She's been alone and worried for about 2 months since August when they last saw each other.\n\nReunion in Toledo\n\nIsabel nods eagerly, relief flooding her face. She keeps her hand on your arm as you walk together into the Alcázar, the household parting before you. Dona Beatriz follows at a discreet distance, while Captain Fernán disperses your exhausted escort to quarters and stables.\n\nYour chambers—the royal apartments overlooking the Tagus—have been kept ready. As you enter, servants are already lighting lamps against the gathering dusk. The familiar Portuguese chapel corner Isabel established catches your eye: the carved Virgin Mary in place of honor, fresh flowers, well-used prayer cushions.\n\n\"Your Majesty, let me help with that armor,\" a squire says, already moving to unbuckle your breastplate. The process is familiar—straps loosened, plates removed piece by piece, the weight lifting from shoulders and back after seven days of hard riding. Your gambeson beneath is sweat-stained and road-dusty.\n\nIsabel watches from a chair, one hand resting on her belly, the other fidgeting with her skirts. She's trying not to hover, but her eyes follow your every movement.\n\nA basin of warm water appears. You wash face, hands, neck—the grime of travel sluicing away. A clean shirt is produced. The relief of being out of armor after days of travel is profound.\n\n\"Your beer, Your Majesty.\" A servant presents a pewter tankard, condensation beading on the metal. The beer is cold from the cellar, bitter and refreshing. You drink deeply.\n\nIsabel dismisses the servants with a gesture. \"Leave us, please. I'll call if we need anything.\" Even Dona Beatriz withdraws, though she leaves the door slightly ajar for propriety's sake.\n\nAlone now—or as alone as royalty ever gets—Isabel rises and comes to you. She's moving more slowly, carefully, one hand always steadying her belly. She reaches up to touch your face, as if confirming you're real.\n\n\"You look tired,\" she says softly. \"Thinner, I think. Have you been eating properly?\" The wifely concern breaks through her formal composure. Then: \"Tell me everything. What happened at Ronda? The messenger said you negotiated surrender, that you rode out alone to meet their commander. Juan...\" Her voice wavers. \"You promised to come back to us.\"\n\nShe guides you to sit, then carefully lowers herself into the chair beside you, angling it so she can see your face. \"Start from the beginning. Tell me what happened after you left Jaén in September.\"\n\nWhat do you tell her?"
        },
        {
          "role": "player",
          "text": "I tell her everything and explain that sometimes I have to place my fate in God's hands. That trusting in God's plan ultimately saves lives. That if I had not done so, there would have been a siege with many casualties and plunder. That I as a king have to show myself and in doing so, I achieve the grace and mercy Isabel has been praying for so fiercely."
        },
        {
          "role": "gm",
          "text": "Juan is explaining to Isabel his reasoning for the risks he took - riding out personally to negotiate, trusting God's plan, and how this ultimately saved lives and led to a peaceful surrender. This is a moment of intimacy where he's sharing his thinking with her, connecting his actions to her prayers for mercy.\n\nIsabel has been characterized throughout as:\n- Deeply pious and religious\n- Concerned about mercy and the innocent\n- Worried about Juan's safety\n- Pregnant and frightened during his absence\n- Growing in their relationship through shared faith\n- Struggling with the violence of war vs. her Christian values\n\nHer response should reflect:\n1. Relief that he's safe\n2. Understanding the religious/faith dimension of his actions\n3. Still worried about the risk to him personally\n4. Appreciation that he connected his actions to her prayers\n5. The ongoing tension between understanding his duty and wanting him safe\n6. Her pregnancy making her more vulnerable emotionally\n\nThis is also a moment where their relationship dynamics are shown - he's explaining his kingship to her, she's trying to understand and support while also being honest about her fears.\n\nIsabel listens intently as you recount the march to Ronda, the villages that submitted or resisted, the moment you rode forward in your white armor to demand surrender. When you describe dismounting before the gates, removing your helmet, and offering parley, her hand tightens on yours.\n\n\"Juan...\" she breathes, but lets you continue.\n\nYou tell her about Muhammad ibn Rashid, the negotiation, the handshake that sealed the accord. The hardliners departing peacefully. The gates opening without bombardment. One of Granada's mightiest fortresses taken without a drop of blood in the conquest itself.\n\nWhen you finish explaining how trust in God's plan saved hundreds of lives—both Castilian and Moorish—Isabel is quiet for a long moment. Her eyes glisten with tears.\n\n\"I understand,\" she says finally, voice thick with emotion. \"I do, Juan. When you put it that way—that your faith, your willingness to trust God completely, saved all those lives...\" She touches the Virgin Mary figure hanging at her neck. \"That's what I've been praying for. Mercy. A way to end this war without endless slaughter.\"\n\nShe wipes at her eyes. \"And God answered. Through you. Through your courage to stand there, alone and vulnerable, trusting that He would protect you.\" A slight smile. \"You showed them Christ's love, in a way. Even in conquest, you offered them dignity, terms they could accept.\"\n\nBut then her voice breaks slightly. \"But Juan, I was so frightened. Two months without you. Every night I prayed, but I didn't know... I couldn't know...\" Her hand moves to her belly. \"The baby moves and I think—what if their father never comes home? What if I have to tell this child about their brave father who died before they were born?\"\n\nShe looks at you, torn between pride and fear. \"I know you're a king. I know you must lead, must show yourself, must trust in God's plan. And I'm so proud of what you accomplished—truly, Juan. Ronda without a siege is... it's miraculous.\"\n\nHer grip tightens on your hand. \"But you're also a husband. And soon you'll be a father. And I need you to come home. Not just for the kingdom—for us.\" Tears spill over now. \"I know that's selfish. I know God calls you to do great things. But Juan, I can't lose you. I can't.\"\n\nShe's crying openly now, the accumulated stress and fear of two months pouring out. \"Promise me—promise me you'll be careful. That you won't take unnecessary risks. That you'll remember you have a wife and child who need you.\" She looks up at you, vulnerable and pleading. \"Please.\"\n\nWhat do you say?"
        },
        {
          "role": "player",
          "text": "I pull her close and hold her tight for a long moment. You will never lose me Isabel.\n\n\nGod will not allow me to die. I have too much work to do for him."
        },
        {
          "role": "gm",
          "text": "Isabel is expressing her deep fear and vulnerability. Juan's response is confident, almost presumptuous - he's claiming God won't allow him to die because he has work to do. This is actually a pretty bold theological claim, and it might be concerning or at least... not fully comforting to someone as pious as Isabel.\n\nIsabel is devout and theologically aware. She would understand that many faithful people die young, that God's plans aren't always what humans expect, that presuming to know God's will so certainly could be seen as pride. But she also desperately wants to believe him, wants this reassurance.\n\nI should show her reaction as torn - wanting to believe him but also perhaps a bit troubled by the certainty, or maybe just desperate enough to cling to it despite theological concerns. She's pregnant, scared, and has been alone for two months worrying. She might accept this reassurance even if part of her knows it's not quite how faith works.\n\nLet me write her response showing this complexity.\n\nIsabel clings to you, her swollen belly pressing between you, her face buried against your shoulder. For a long moment she just holds on, her breathing shaky.\n\nWhen she pulls back to look at you, her expression is complicated—wanting desperately to believe your words, but something else flickering in her grey eyes. \"Juan...\" she starts, then stops, choosing words carefully. \"Many faithful men have died doing God's work. Martyrs. Saints. Good kings who served Him and still fell in battle.\"\n\nShe touches your face gently. \"I want to believe you're right. That God will preserve you because the work isn't finished. But...\" Her voice drops to a whisper. \"What if the work is finished? What if taking Ronda was the last thing God needed you to do? What if—\"\n\nShe can't finish that thought. Instead, she presses closer again. \"I'm sorry. I know you have more faith than I do. You've always been so certain of God's plan, and He's rewarded that faith with victory after victory. The papal bull, Alcalá la Real, now Ronda...\"\n\nA shuddering breath. \"Maybe you're right. Maybe God does still have great plans for you. I pray you're right, Juan. I pray every day that you're right.\"\n\nShe's trying to convince herself as much as accept your assurance. Her hand moves to your chest, over your heart. \"Just... even if God has work for you to do, please remember that being a father and husband is also His work. That coming home to us is also serving Him.\"\n\nShe looks up at you, exhausted and vulnerable. \"The baby will be here in two or three months. January, the physicians think, or early February. Will you... will you be here? For the birth?\"\n\nWhat do you say?"
        },
        {
          "role": "player",
          "text": "I have to go to Jaen for the Cortes. After that, I ride straight back to you and will stay by your side until the baby is born. That gives a lot of time together.\n\n\nI touch her face.\n\n\nI am already looking forward to that. Are you?"
        },
        {
          "role": "gm",
          "text": "- She's conventionally pious, dutiful, and loves Juan deeply\n- She's been terrified during his absence\n- She's six months pregnant (end of October, due January/early February)\n- She's been praying constantly for his safety\n- She wants reassurance but is also realistic about the fears\n\nJuan promises to return after the Cortes (November 15) and stay until the birth (January/February). That's about 2-3 months together, which should be comforting to her.\n\nHer response should show:\n- Relief and joy at this promise\n- Her love for him\n- Her fears about childbirth (common in medieval times - very dangerous)\n- Her desire for this time together\n- Maybe some vulnerability about being a mother\n\nLet me write her response authentically to her character.\n\nIsabel's face transforms—the worry and fear melting into something softer, warmer. A genuine smile breaks through her tears. \"Yes,\" she breathes. \"Yes, I am. So much, Juan.\"\n\nShe leans into your touch, her eyes closing briefly. \"Two or three months together. No campaigns, no battles, no... no watching you ride away not knowing if you'll come back.\" When she opens her eyes again, they're bright with emotion. \"Just us. And preparing for the baby.\"\n\nHer hand covers yours against her face. \"I've been so frightened about the birth too,\" she admits quietly. \"Dona Beatriz tries to reassure me—she's attended many births, says I'm young and healthy, that everything will be fine. But...\" Her voice drops. \"Women die in childbirth, Juan. Even queens. Even young, healthy ones.\"\n\nShe places your hand on her belly again. \"I want to meet this child. I want to hold them, watch them grow, teach them to pray. I want...\" She looks up at you. \"I want us to be a family. You, me, this baby. Maybe more children someday, if God wills it.\"\n\nA small, almost shy smile. \"And yes—I'm looking forward to having you here. To evening prayers together like we used to do. To falling asleep beside you. To...\" She blushes slightly. \"To not being alone and worried all the time. Just being your wife, carrying our child, with you safe at home.\"\n\nShe takes a shaky breath. \"The Cortes in Jaén—when does it start? How long will you be gone?\""
        },
        {
          "role": "player",
          "text": "Its a few days ride to Jaen. I will stay there for a few days I think and then a few days travel back. Maybe a week in total?"
        },
        {
          "role": "gm",
          "text": "Isabel would be relieved by this timeline - almost a month together now, then only a brief absence, then 2+ months until the birth.\n\nIsabel's relief is visible. \"Only a week? I thought... I thought you'd be gone for weeks, maybe a month.\" She calculates quickly. \"So you're here now—it's October 17th. The Cortes is November 15th. That's almost a month together before you even leave.\"\n\nHer smile grows. \"And then you'll be back by late November at the latest. That still gives us...\" She counts on her fingers. \"December, January—two full months before the baby comes. Maybe more if they arrive late.\"\n\nShe takes both your hands now, her face brighter than you've seen it all evening. \"Juan, that's wonderful. I thought you'd be gone much longer. A week for the Cortes I can manage. Especially knowing you'll come straight back afterward.\"\n\nThe tension in her shoulders eases visibly. \"Almost a month together now. We can... we can prepare for the baby. Set up the nursery properly. I've been gathering things—linens, a cradle that belonged to your mother, baby clothes. Dona Beatriz has been helping, but I wanted...\" She looks almost embarrassed. \"I wanted you to be part of it too. To help decide things.\"\n\nShe shifts in her chair, one hand supporting her back—clearly pregnancy is becoming uncomfortable. \"And evening prayers. I've missed that so much. Just the two of us, sharing our hearts with God together. Can we... can we pray together tonight? Before bed? Like we used to?\"\n\nA thought occurs to her. \"The Cortes—what will you discuss there? Don Álvaro mentioned something about taxation reforms and distributing the conquered territories. Will it be... contentious?\"\n\nWhat do you tell her?"
        },
        {
          "role": "player",
          "text": "When I was a child, the rich nobles misused their power to seek all sorts of special exemptions for themselves. I seek to remedy that. And the crusade and the conquest of Grenada gives me a lot of leverage to do so. It will all become Gods kingdom Isabel, it's so beautiful. I can see it when I close my eyes."
        },
        {
          "role": "gm",
          "text": "1. Her conventional piety and general lack of political sophistication\n2. Her deep love for Juan and desire to support him\n3. Her pregnancy making her vulnerable and emotional\n4. Her concern for his safety but also admiration for his vision\n5. Her growing understanding of him as both king and husband\n\nShe would be moved by his vision but might also worry about the practical dangers of challenging powerful nobles. She's not politically minded but she's not naive either - she knows nobles can be dangerous when their interests are threatened.\n\nIsabel's eyes widen as she watches you speak, seeing the passion and conviction in your face. \"Gods kingdom,\" she repeats softly. \"All of Iberia united under the Cross, with justice and fairness even in taxation...\"\n\nShe's quiet for a moment, processing this vision. When she speaks again, her voice is gentle but carries a note of concern. \"Juan, that's beautiful. Truly. A kingdom where even the powerful serve God's justice, where they can't simply take what they want because of their birth...\" She squeezes your hand. \"But the nobles—the great houses—they won't surrender their privileges easily, will they?\"\n\nHer brow furrows slightly. \"Don Álvaro has told me a little about the regency years. How the nobles grew so powerful during your minority. How they...\" She hesitates. \"How they fought each other, how some were cruel to their own people. And you want to make them pay their fair share, serve the kingdom instead of just themselves.\"\n\nShe looks at you with both admiration and fear. \"It's right, Juan. It's what a Christian king should do. But...\" Her hand tightens on yours. \"They'll resist. Some of them are dangerous men. The Infantes de Aragón rebelled just this year. What if... what if reforming their taxation makes them rebel again?\"\n\nShe touches your face. \"I want you to build God's kingdom. I want justice and fairness. But I also want you alive to see it. To see our child grow up in it.\" Her voice drops to a whisper. \"Promise me you'll be careful at this Cortes. That you won't push so hard they...\" She can't finish.\n\n\"I see your vision too, Juan. When you speak of it, I can see it—a kingdom under God, just and righteous. But please, be wise. Be careful.\"\n\nWhat do you say?"
        },
        {
          "role": "player",
          "text": "Lets wrap up the chapter here. Create a new document and put a summary of all events of this chat into it. Name it \"Chapter 23\""
        },
        {
          "role": "gm",
          "text": "Create File: Creating Chapter 23 complete summary document covering all events from Juan's departure from Jaén through the Ronda campaign and return to Toledo\n\n1. Juan's farewell to Isabel\n2. The ambush on the road to Málaga\n3. Arrival at Málaga and the war council\n4. The strategic decision to march on Ronda\n5. The march to Ronda with village encounters\n6. The parley and negotiated surrender\n7. Meeting the city leaders\n8. Consolidation of territory\n9. Juan's orders and departure for Toledo\n10. The journey to Toledo\n11. Reunion with Isabel\n\nThe summary is detailed, well-organized with clear sections and subsections, includes all the die roll results and their outcomes, character developments, strategic decisions, and sets up the next chapter. It's formatted in markdown and saved to the outputs directory as requested.\n\nPerfect! I've created a comprehensive summary of Chapter 23 covering all the major events:\n\nView Chapter 23 Summary\n\nThe summary includes:\n\nJuan's emotional farewell to pregnant Isabel\n\nThe ambush on the road to Málaga (rolled 18)\n\nThe war council and strategic insight about raiders' supply lines\n\nThe march to Ronda (rolled 74 - Good Progress)\n\nThe negotiated surrender after face-to-face parley (rolled 36)\n\nMeeting with Ronda's city leaders and establishing governance\n\nConsolidation of territory and breaking the raider network\n\nJourney back to Toledo (rolled 29 - Minor Delays)\n\nReunion with Isabel and their conversation about the future\n\nThe document is well-organized with sections, character lists, themes, and sets up the transition to Chapter 24 with the upcoming Cortes and Isabel's impending childbirth.\n\nThis was an excellent chapter—Juan's strategic thinking in targeting the raiders' supply infrastructure, his courage in negotiating face-to-face with Muhammad ibn Rashid, and the complex reality of governing conquered Muslim territories all came through beautifully. The emotional reunion with Isabel also highlighted the growing strain between his royal duties and family responsibilities."
        }
      ],
      "roll": null
    }
  ]
}