{
  "chapter": "1.30",
  "book": 1,
  "event_count": 9,
  "date_range": "1432-02-04 / 1432-02-04",
  "events": [
    {
      "event_id": "evt_1432_00203",
      "book": 1,
      "chapter": "1.30",
      "date": "1432-02-04",
      "end_date": null,
      "type": "personal",
      "summary": "Juan II visits Isabel and their week-old daughter Catalina in the royal chambers at Toledo. Isabel, still gravely ill with post-birth fever, manages to eat a few spoonfuls of broth with trembling hands before exhaustion overtakes her. Dona Beatriz tends to the queen while the wet nurse Maria cares for the thriving infant.",
      "characters": [
        "juan_ii",
        "isabel_of_portugal",
        "catalina_de_castilla",
        "dona_beatriz"
      ],
      "factions_affected": [],
      "location": "Toledo",
      "tags": [
        "family",
        "illness",
        "recovery",
        "childbirth"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "Hi,\n\n\nI am with Catalina and Isabel, sho is just starting to eat some broth"
        },
        {
          "role": "gm",
          "text": "The chapter ended with Isabel agreeing to try eating, and moving to sit up caused gasping pain. Now the user says \"I am with Catalina and Isabel, who is just starting to eat some broth.\"\n\nSo I need to narrate this scene - Isabel attempting to eat while Juan is present with both his wife and daughter. This should be SHORT (2-4 paragraphs) during this active scene, focusing on the tender moment, Isabel's struggle to eat, her weakness, and the family dynamic.\n\nLet me check the character tracker for any additional context.\n\nThe character tracker is outdated (last updated end of Chapter 18). I need to rely on the Chapter 29 summary for accurate information about current status. Let me now begin Chapter 30.\n\nCurrent situation from Chapter 29:\n- Date: February 4, 1432 (one week after birth)\n- Location: Toledo, Royal Alcázar\n- Isabel is very weak, has fever from infection after traumatic birth\n- Catalina (daughter) is one week old, healthy and thriving\n- Juan has been at Isabel's bedside constantly\n- Doña Beatriz is the Portuguese lady-in-waiting helping\n- Doctor Fernández is the physician\n- Isabel just agreed to try eating broth and soft bread soaked in wine\n- Moving to sit up caused gasping pain\n\nThe user says \"I am with Catalina and Isabel, who is just starting to eat some broth.\"\n\nI need to narrate this intimate family moment. Since this is during an active scene with dialogue/interaction, I should keep it SHORT (2-4 paragraphs). I'll describe:\n- Isabel's attempt to eat\n- Her physical struggle\n- The presence of Catalina (maybe she's in a cradle nearby or with the wet nurse)\n- The tender atmosphere\n- Isabel's weakness but determination\n- Stop when there's a natural interaction point for Juan to respond\n\nLet me write a short, intimate scene showing Isabel's struggle to eat while recovering.\n\nChapter 30: The Fever's Hold\n\nFebruary 4, 1432 - Toledo, Royal Alcázar\n\nDoña Beatriz brought the bowl of chicken broth herself, the steam rising in the late afternoon light filtering through the chamber windows. She'd already soaked pieces of soft bread in watered wine, arranging them on a small plate. Isabel sat propped against cushions, face pale and drawn, her nightgown damp with fever sweat. A week ago she'd given birth. Now she looked like she'd aged years.\n\nCatalina lay in her cradle beside the bed, wrapped in soft linens. One week old and already nine pounds—thriving while her mother burned. The wet nurse had just finished feeding her and stepped back respectfully, letting the family have this moment. The baby made small contented sounds, utterly unaware of her mother's struggle.\n\nIsabel lifted the wooden spoon with trembling hands. The simple motion—raising it to her lips—required visible effort. She managed one sip, then another. Her throat worked as she swallowed. A wince crossed her face, but she persisted. The third spoonful went down easier.\n\n\"It's warm,\" she whispered, her voice rough from days of fever. \"It... it helps.\" But even those few words exhausted her. She set the spoon down, breathing hard. \"I'm sorry. Everything is so difficult.\""
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_1432_00204",
      "book": 1,
      "chapter": "1.30",
      "date": "1432-02-04",
      "end_date": null,
      "type": "ceremony",
      "summary": "Juan takes Princess Catalina from her cradle and carries her to the throne room to present her to the court. Before roughly sixty assembled nobles, he declares her Princess of Castile. Don Inigo Lopez de Mendoza leads the court in kneeling, and the hall echoes 'God save the Princess.' Juan honestly discloses that Isabel is very weak and asks for prayers, prompting visible political calculation among some nobles about succession. Don Fadrique Enriquez pledges the court's prayers for the queen's recovery.",
      "characters": [
        "juan_ii",
        "catalina_de_castilla",
        "isabel_of_portugal",
        "inigo_lopez_de_mendoza",
        "fadrique_enriquez",
        "alvaro_de_luna",
        "cardinal_capranica",
        "rodrigo_de_perea"
      ],
      "factions_affected": [
        "royal_court"
      ],
      "location": "Toledo",
      "tags": [
        "presentation",
        "succession",
        "princess",
        "court",
        "ceremony"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "I tale Catalina from the wet nurse. \nIt's time to show Catalina to the world and show the world to Catalina. , I say to Isabel.\n\n\nI take Catalina to the throneroom to show her to the court. I let the wetnurse come with me."
        },
        {
          "role": "gm",
          "text": "You lifted Catalina carefully from her cradle. The baby was warm and solid in your arms, wrapped in soft white linen embroidered with the Castilian castle and Portuguese escutcheon. She stirred slightly, one tiny fist emerging from the swaddling, but didn't cry. The wet nurse—a sturdy woman from Toledo named María who'd nursed three healthy children of her own—gathered the princess's outer wrappings and followed you to the door.\n\nIsabel watched from her pillows, too weak to object or join. \"Be careful with her,\" she managed. \"Juan... tell them...\" But her strength failed. She closed her eyes, exhausted from the brief effort of eating.\n\nDoña Beatriz moved to cool her forehead with a damp cloth. \"I'll watch over her, Your Majesty. Go. The kingdom needs to see their princess.\"\n\nThe corridor between the royal chambers and the throne room felt longer than usual. Guards snapped to attention as you passed, their eyes flicking to the bundle in your arms. Word spread ahead of you like ripples in water—the king is bringing the princess. By the time you reached the great doors, you could hear the murmur of voices inside growing louder.\n\nThe doors opened. The throne room held perhaps sixty nobles and courtiers—those who'd remained in Toledo through the winter rather than retiring to their estates. They'd gathered quickly when summons went out that the king would make an announcement. All conversation died the instant you entered.\n\nCatalina chose that moment to wake fully. Her eyes opened—dark and unfocused still, but alert. She didn't cry, just looked about with that serious newborn expression that made her seem ancient and brand new at once.\n\nYou walked the length of the hall, the wet nurse following three paces behind. Your throne stood empty, but you didn't sit. Instead you stood before it, holding your daughter where all could see.\n\nThe court stared. Some with joy. Some with concern. Some with calculation. All wondering the same thing: where was the queen? Why wasn't Isabel of Portugal here for this moment?\n\nDon Íñigo López de Mendoza stood near the front, his weathered face showing genuine warmth. Beside him, Don Fadrique Enríquez watched with his admiral's careful assessment. Álvaro de Luna stood to the side, dressed in his constable's colors, expression unreadable. The Cardinal Capranica had positioned himself where he could observe both you and the gathered nobles.\n\nThe silence stretched. Every eye fixed on you and the week-old princess in your arms.\n\nDon Íñigo finally broke it, his voice carrying clearly. \"Your Majesty honors us.\" He didn't kneel—not yet—but his tone held respect. \"The Princess Catalina appears... remarkably strong. God has blessed her.\"\n\nSeveral nobles murmured agreement. But none had spoken the question that hung in the air like smoke: And what of the Queen? Where is Isabel?\n\nDon Rodrigo de Perea—one of the nobles who'd supported the crusade taxation at Valladolid—stepped forward. His face showed concern rather than calculation. \"Your Majesty, we have heard... varying reports about Her Majesty the Queen's condition. The court prays for her recovery daily. Is there... news we might share with those who wait anxiously?\""
        },
        {
          "role": "player",
          "text": "I have come here to show you my beautiful daughter and princess of Castille, Catalina.\n\n\nI turn her so to show her face to the gathered crowd.\n\n\nThe queen is very weak and sick, recovering from a difficult delivery. We must hope and pray for her recovery. Time will tell."
        },
        {
          "role": "gm",
          "text": "Juan is being honest and direct with the court. He's showing them Catalina - his daughter and a princess of Castile (though notably not yet declaring her an heir). He's also being transparent about Isabel's condition without sugarcoating it.\n\nThe court will react to several things:\n1. The baby herself - healthy, thriving\n2. Isabel's serious condition\n3. The succession implications (daughter, not son; mother possibly unable to have more children)\n4. Juan's demeanor and how he handles this\n\nI should show varied reactions from the nobles present. Some will be moved by the baby, some will be calculating about succession, some will be concerned about the queen. This is a delicate political moment wrapped in a personal one.\n\nI need to stop after the court reacts and see what Juan does next. Don't overwrite or have nobles make demands/suggestions without giving Juan room to respond.\n\nKeep it focused and relatively short - this is an active scene, not a long descriptive passage.\n\nYou turned Catalina outward, supporting her carefully so the court could see her face. The afternoon light caught her features—the small nose, the serious dark eyes still unfocused but aware, the downy black hair just visible beneath her cap. She was beautiful in the way all newborns are beautiful to those who love them, but more than that—she was real. Solid. Alive. A week ago she'd nearly died before drawing breath.\n\nThe silence held for a heartbeat longer, then Don Íñigo dropped to one knee. \"God save Princess Catalina of Castile.\"\n\nThe movement rippled through the hall like wind through wheat. Nobles sank to their knees—some quickly, some more slowly. Don Fadrique knelt with naval precision. The Mendozas followed their patriarch's lead. Álvaro went down smoothly, his face still unreadable but his gesture perfect. Even Cardinal Capranica inclined his head deeply, though he didn't kneel.\n\n\"God save the Princess,\" the hall echoed. \"God preserve Her Highness.\"\n\nBut you could see it in their faces as they rose—the mental calculations. Daughter, not son. Queen gravely ill. Time will tell. Don Rodrigo de Perea's expression showed genuine concern for Isabel, but beside him, the Count of Benavente's eyes held something else. Opportunity, perhaps. Or simply awareness that the succession was now uncertain.\n\nDon Fadrique spoke carefully. \"Your Majesty's honesty does you credit. The Princess is clearly thriving—a blessing in these difficult days. The kingdom will pray for Her Majesty the Queen's swift recovery.\" He paused, choosing his next words with care. \"And we will, of course, await any further instructions Your Majesty requires of us in this... time of uncertainty.\"\n\nCatalina stirred in your arms, making a small sound—not quite a cry, just an infant's complaint. The wet nurse stepped forward slightly, ready to take her if needed, but waiting for your signal.\n\nWhat do you do?"
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_1432_00205",
      "book": 1,
      "chapter": "1.30",
      "date": "1432-02-04",
      "end_date": null,
      "type": "council",
      "summary": "Juan signals his return to governance after a week at Isabel's bedside, noting that her mother the Queen of Portugal is on her way to provide support. Alvaro de Luna, Don Fadrique, Cardinal Capranica, and Don Inigo immediately raise pressing matters: Sotomayor's impending arrival for trial, the Baron de Medina's barricade, the Count of Niebla's mercenary buildup, Granada garrison requests for spring guidance, the western fleet awaiting orders, and accumulated crusade accounts requiring review.",
      "characters": [
        "juan_ii",
        "alvaro_de_luna",
        "fadrique_enriquez",
        "inigo_lopez_de_mendoza",
        "cardinal_capranica",
        "rodrigo_de_perea"
      ],
      "factions_affected": [
        "royal_court"
      ],
      "location": "Toledo",
      "tags": [
        "governance",
        "military_planning",
        "rebels",
        "crusade"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "I hold Catalina close to me again.\n\n\nNow that I have fathered my first child, my attention turns again to the realm and the crusade."
        },
        {
          "role": "gm",
          "text": "Juan is transitioning from the personal moment to governance. He's holding Catalina but signaling that he's ready to return to business. The court will be watching this carefully - how does he balance father and king? He's also implicitly saying he's not going to be absent from governance anymore, which is important after a week at Isabel's bedside.\n\nI should have the nobles respond to this. Some will be relieved he's focusing on the kingdom again. Others might be calculating about what this means. Álvaro in particular would want to speak with him privately about the various matters awaiting decisions.\n\nKey pending issues from Chapter 29:\n1. Sotomayor is coming to Toledo peacefully for trial\n2. Medina is barricaded and needs force to extract\n3. Niebla is in full defiance, preparing for siege\n4. Granada campaign waiting\n5. Portuguese Queen and physicians are coming (should arrive within 2 weeks from Feb 4)\n\nI should keep this response relatively short (4-6 paragraphs) since we're in an active scene. Juan has made a statement. The nobles will react. Then probably Álvaro or someone will want to discuss specifics, which will create a natural stopping point for Juan to respond.\n\nYou drew Catalina close against your chest, one hand cradling her head. She settled against the white surcoat you wore, the Castilian lions and castles embroidered in gold thread. For a moment—father and daughter, king and princess—the image was complete. Then you lifted your gaze to the assembled court.\n\nThe shift in your bearing was subtle but unmistakable. The tender father remained, but the king emerged fully. The nobles saw it immediately—you were no longer going to spend every hour at Isabel's bedside while the kingdom waited.\n\nDon Íñigo's weathered face showed satisfaction. \"The realm has waited patiently for Your Majesty's attention, knowing the circumstances. There is much to discuss.\"\n\nÁlvaro moved forward from his position near the wall. \"Your Majesty, if I might—there are several matters requiring your immediate decision. Don García de Sotomayor arrives within three days under Crown Marshal escort. The Baron de Medina remains barricaded. And reports from the frontier...\" He glanced at the assembled nobles, weighing how much to say publicly. \"The Granada garrison commanders request guidance on spring preparations.\"\n\nDon Fadrique added, \"The western fleet awaits orders at Seville, Your Majesty. Admiral Manrique sends word that the galleys are maintained and ready, but winter patrol schedules need renewal or modification.\" He paused. \"And there is the matter of the Count of Niebla's fortifications. My brother reports the count is building his defenses in earnest.\"\n\nCardinal Capranica stepped forward, his voice dry as parchment. \"The crusade accounts also require Your Majesty's review. Three months of winter garrison costs have accumulated. And I have received... inquiries... from Rome regarding the campaign timeline.\"\n\nThe weight of governance settled back onto your shoulders. Catalina made another small sound against your chest—hungry, perhaps, or simply restless. The wet nurse stood ready, but she wouldn't take the princess without your word.\n\nWhat do you say?"
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_1432_00206",
      "book": 1,
      "chapter": "1.30",
      "date": "1432-02-04",
      "end_date": null,
      "type": "council",
      "summary": "Juan orders Alvaro to schedule a budget meeting with Cardinal Capranica for the 1432 campaign. He sets clear strategic priorities: budget first, then crush the rebels decisively. Discussion turns to the Count of Niebla's hired mercenaries and the Baron de Medina's barricade. Juan declares he will leave Isabel's side soon and march to war, with Isabel's mother coming to provide support. He orders the bombards moved from Jaen and plans to handle Medina without artillery while concentrating all five bombards against Niebla. The council discusses Castile's total levy capacity of approximately 35,000 troops, with 30,000 available excluding garrisons.",
      "characters": [
        "juan_ii",
        "alvaro_de_luna",
        "fadrique_enriquez",
        "inigo_lopez_de_mendoza",
        "cardinal_capranica",
        "rodrigo_de_perea",
        "count_of_niebla"
      ],
      "factions_affected": [
        "royal_court"
      ],
      "location": "Toledo",
      "tags": [
        "military_planning",
        "rebels",
        "mobilization",
        "artillery",
        "bombards",
        "niebla",
        "medina"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "Yes, let's adress these matters.\n\n\nAlvaro, schedule a meetiung with the cardinal to draft a new budget for this year's campain and to review last years expenses."
        },
        {
          "role": "gm",
          "text": "Juan is still holding Catalina, so at some point he'll need to hand her to the wet nurse. The nobles mentioned several issues:\n1. Don García de Sotomayor arriving in 3 days (needs trial/judgment)\n2. Baron de Medina barricaded (needs military force)\n3. Count of Niebla fortifying (needs military response)\n4. Granada garrison commanders requesting spring guidance\n5. Western fleet needing orders\n6. Crusade accounts needing review\n\nJuan addressed the last one first (meeting with Cardinal). I should have Álvaro confirm, then perhaps prompt about the other matters, or have the nobles wait to see what Juan will address next.\n\nI should keep this relatively short since we're in active conversation/throne room scene. Stop after Álvaro responds and maybe one other noble speaks, then let Juan direct the conversation further.\n\nÁlvaro inclined his head. \"Of course, Your Majesty. I will coordinate with His Eminence this evening. We can have preliminary figures prepared for your review by tomorrow afternoon.\" He glanced at Cardinal Capranica, who nodded stiffly in agreement.\n\nThe Cardinal added, \"The winter garrison costs were within projected parameters, but the spring campaign will require significant additional funds—particularly if we're mounting operations against both the rebel nobles and Granada simultaneously.\" His tone was matter-of-fact, accountant's precision rather than judgment. \"The crusade taxation revenues have been... adequate. But Your Majesty will need to decide on priorities.\"\n\nDon Fadrique cleared his throat. \"Your Majesty, if I might—the matter of the Count of Niebla grows more pressing. My brother writes that Niebla has hired mercenaries. Perhaps a hundred men, maybe more. He's not simply fortifying. He's preparing for a genuine siege.\" The Admiral's face was grim. \"This cannot be allowed to fester. It encourages others who might consider defiance.\"\n\nDon Íñigo spoke up, his voice carrying the weight of his years. \"The Mendozas can have forces ready to march on the Baron de Medina within a fortnight, Your Majesty. He's a minor irritant—a few hundred men at most should extract him without difficulty. But Niebla...\" He shook his head. \"That will require bombards. A proper siege train. It cannot be done by half-measures.\"\n\nCatalina began to fuss properly now, small cries building toward real hunger. The wet nurse took a half-step forward, awaiting your permission.\n\nWhat do you do?"
        },
        {
          "role": "player",
          "text": "First things first, I, you and the cardinal will decide on the new budget and finalize last year's expenses. Then we move in like a hammer to crush the rebels. A few hundred mercenaries do not scare me."
        },
        {
          "role": "gm",
          "text": "Juan is setting clear priorities:\n1. Budget review with Álvaro and Capranica\n2. Then crush the rebels militarily\n\nHe's dismissive of the mercenary threat from Niebla. This is confident but he needs to understand the full situation. The nobles will want to provide input here.\n\nCatalina is crying now - he needs to hand her to the wet nurse. I should narrate that naturally.\n\nThen the nobles will react to his statement. Some will be pleased by his decisiveness, others might want to discuss strategy more carefully. Don Íñigo and Don Fadrique are experienced military men - they'll have opinions about how to handle two rebel nobles plus potentially resuming the Granada campaign.\n\nI should stop after the nobles react, before making any decisions for Juan.\n\nYou handed Catalina to the wet nurse, who took her with practiced ease. The princess's cries softened as María cradled her, already moving toward the side chamber where she could nurse in privacy. Your daughter's needs were simple - milk, warmth, sleep. The kingdom's needs were more complex.\n\n\"First things first,\" you repeated, watching the nobles' reactions. \"Budget, then the hammer falls.\"\n\nDon Íñigo's face showed approval - decisive action, clear priorities. Álvaro's expression revealed nothing, but you knew him well enough to read the slight relaxation in his shoulders. The plan was straightforward, executable.\n\nBut Don Fadrique looked less certain. \"Your Majesty's confidence is well-founded regarding Medina. A minor noble in a weak position.\" He chose his next words carefully. \"But Niebla is different. His main castle is substantial - proper curtain walls, provisioned for months. A hundred mercenaries plus his household troops gives him perhaps three hundred men. That's not a field army, but behind walls?\" He glanced at Don Íñigo. \"It will take time. Weeks, possibly months if he's truly prepared.\"\n\nDon Rodrigo de Perea spoke up. \"And Your Majesty must consider - while we besiege Niebla, what happens with Granada? The Sultan knows our winter dispositions. He knows we're maintaining garrisons but not pressing. If we divert forces to crush rebels, does that give him breathing room to recover?\"\n\nDon Íñigo stroked his beard thoughtfully. \"Two rebel nobles requiring military action. One easy, one hard. And a crusade that has waited all winter.\" He looked at you directly. \"Your Majesty, what is your timeline? Crush the rebels first, then resume Granada in... summer? Or split forces and do both?\"\n\nThe question hung in the air. Behind it lay other questions: How long before you could leave Isabel's side? How long before the Queen recovered enough to manage in your absence? How soon could you actually take the field?\n\nWhat do you say?"
        },
        {
          "role": "player",
          "text": "I will move out soon Alvaro. The crusade and the war cannot wait, the queen understands this. And her mother is on her way as well. She can offer familial support in my absence.\n\n\nWe bring the cannons to the rebels near Seville. Rebels first, then we march on Grenada and strike them down once and for all."
        },
        {
          "role": "gm",
          "text": "Juan is making a clear declaration: he's going back to war soon. He's prioritizing the crusade and kingdom over staying at Isabel's bedside. This is a significant decision that will have consequences.\n\nKey points:\n1. He's saying he'll leave soon\n2. Isabel's mother (Queen of Portugal) is coming to provide support\n3. Plan: Crush rebels with artillery, then march on Granada for final campaign\n4. He wants to deal with Niebla (near Seville) first with cannons\n\nThe nobles will react to this. Some will approve of the decisiveness, others may have concerns about timing or logistics. Álvaro will need to provide practical assessment.\n\nI should:\n- Show noble reactions (approval from military-minded, possible concern from others)\n- Have Álvaro or military commanders provide practical logistics feedback\n- Mention the timeline implications\n- Keep it relatively short since we're in active conversation\n- NOT write what Juan says/does next\n\nÁlvaro's face showed something you rarely saw there—relief mixed with concern. \"Your Majesty, I...\" He paused, choosing words carefully. \"The realm needs its king in the field. But the timing will require careful coordination.\"\n\nDon Fadrique nodded decisively. \"The artillery is already at Jaén from last year's campaign. Moving five bombards with full powder train to Seville will take... three weeks, perhaps four, depending on roads and weather. But it can be done.\" His admiral's mind was already calculating logistics. \"The western fleet can support a siege of Niebla from the coast if needed. Cut off any escape by sea.\"\n\nDon Íñigo spoke with veteran's practicality. \"Medina first—he's on the way. A week to organize forces, three days to march, perhaps a week to extract him from his barricade. Two weeks total. Then move the full force with artillery to Niebla. Another month for a proper siege.\" He met your eyes. \"Early April, Your Majesty. That's when you could realistically turn your full attention to Granada. If all goes smoothly.\"\n\nCardinal Capranica cleared his throat. \"Which means the spring campaign against Granada begins in mid to late April, not March as some had hoped. The Moroccan reinforcements will have had six months to integrate with the Sultan's forces.\" It wasn't criticism, merely observation of consequences.\n\nDon Rodrigo de Perea asked quietly, \"And Her Majesty the Queen, Your Majesty? When do you intend to depart?\"\n\nThe question was delicate. Isabel was still fevered, still fighting infection. The Portuguese Queen and physicians were two weeks away at best. You'd just held your week-old daughter before the court.\n\nWhat do you say?"
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_1432_00207",
      "book": 1,
      "chapter": "1.30",
      "date": "1432-02-04",
      "end_date": null,
      "type": "council",
      "summary": "Juan inquires about a second French bombard crew, but Alvaro clarifies that no such crew exists -- Castile has only Master Calabrese's five bombards at Jaen plus foreign artillery experts coming for the planned Royal Artillery Foundry in Seville. Juan orders the bombards moved immediately to Seville for the rebel campaign, sets a two-week mobilization timeline, and asks about total available forces. The council confirms 35,000 maximum feudal capacity with 30,000 available for campaign, but warns that two weeks is tight for full mobilization after nobles just returned home three months ago.",
      "characters": [
        "juan_ii",
        "alvaro_de_luna",
        "fadrique_enriquez",
        "inigo_lopez_de_mendoza",
        "rodrigo_de_perea",
        "pietro_calabrese"
      ],
      "factions_affected": [
        "royal_court"
      ],
      "location": "Toledo",
      "tags": [
        "artillery",
        "mobilization",
        "logistics",
        "bombards",
        "military_capacity"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "We have two bombard crews. One we already have at Jaen, and one promised by France as part of their support to our crusade. Where are they now? If they arrive by ship, we can redirect them to Seville immediately."
        },
        {
          "role": "gm",
          "text": "- 40,000 florins\n- 300 veteran soldiers - men who fought with Joan of Arc\n- Captain Jean de Metz commanding French contingent\n- Master siege engineer Guillaume Balard\n\nBut I don't see specific mention of a French bombard crew being promised. The user seems to be creating new information that wasn't established. However, there WAS mention of additional bombards from foreign powers. Let me search for more details about artillery received from abroad.\n\nActually, looking at Chapter 24 more carefully, I see:\n- Burgundy offered: Master cannon founder (cutting-edge technology), two master gunners with expertise\n- This isn't the same as a complete bombard crew arriving by ship\n\nLet me search more specifically for what artillery support was promised or arrived.\n\nThe Burgundian cannon founder Jean Hennecart was meant to establish a Royal Artillery Foundry in Seville, not to bring a ready bombard crew.\n\nLooking at the current military situation from the summaries, it seems that Castile has:\n- Five bombards at Jaén from the previous campaign (Master Calabrese's artillery)\n- Foreign military experts arriving including artillery masters and siege engineers\n- Plans for an artillery foundry in Seville\n\nThe user is asking about a French bombard crew promised as part of their crusade support that could arrive by ship and be redirected to Seville. This doesn't match what was established in the documents. However, the user is asking as Juan II, and it's reasonable that he might be confused about what was promised or might be hoping for something that wasn't actually offered.\n\nI should respond realistically - Álvaro would know what was actually promised and would need to clarify the situation. There's no second complete bombard crew arriving by ship. What they have is the artillery experts and the plan to build more guns, but that takes time.\n\nÁlvaro exchanged a quick glance with Don Fadrique before responding carefully. \"Your Majesty, I must clarify the artillery situation. We do not have a second complete French bombard crew arriving by ship.\"\n\nHe held up a hand before you could object. \"What we do have from foreign support is this: Master Calabrese's five bombards are at Jaén—they've been there since the Málaga campaign. The foreign military aid included artillery experts—Jean Hennecart, the Burgundian cannon founder, and several master gunners—but they're coming to establish the Royal Artillery Foundry in Seville and train our own crews. That's a long-term investment, not an immediate tactical asset.\"\n\nDon Fadrique added, \"The western fleet at Seville has naval guns, Your Majesty, but those are ship-mounted pieces—not siege bombards. They can support a coastal siege with bombardment from the sea, but we cannot move them inland to reduce a fortress like Niebla.\"\n\nCardinal Capranica's dry voice cut in. \"If Your Majesty wishes to besiege Niebla with proper artillery, the five bombards must come from Jaén. There is no alternative currently available.\"\n\nÁlvaro continued, his tone practical. \"Which means Your Majesty faces a choice: Either we bring the artillery from Jaén to deal with both Medina and Niebla—which takes three to four weeks of transport time—or we handle Medina quickly without artillery, then bring the guns west for Niebla specifically.\"\n\nDon Íñigo stroked his beard thoughtfully. \"The Mendozas can extract Medina from his barricade without bombards, Your Majesty. Ladder assault, fire, battering rams—crude but effective against a minor fortification. Saves time if Your Majesty wishes to move quickly.\"\n\nWhat do you say?"
        },
        {
          "role": "player",
          "text": "we handle Medina without artillery and bring the bombards to Niebla immediately. Send an order for the bombards to move immediately.\n\n\nWe start the campain in two weeks time. We assemble the men.\n\n\nRemind me again, if I call upon every levy, every men at arms in Castille, how many can we raise in total? Exclude garissons from this total."
        },
        {
          "role": "gm",
          "text": "Currently there are about 5,000 in garrisons through winter. So if we call EVERYONE and exclude garrisons, we'd have the full feudal capacity.\n\nLet me think about this more carefully. The 35,000 was the crusade force. But what's the MAXIMUM feudal levy capacity of Castile?\n\nLooking at the documents, it seems like the 35,000 was already a comprehensive mobilization. The feudal system in Castile can raise about:\n- Crown forces: 3,500-4,000\n- Noble feudal levies: 26,800\n- Military Orders: 4,500\n- Total: ~35,000\n\nIf we exclude current garrisons (5,000), that leaves about 30,000 available for campaign.\n\nBut the user is asking if we call upon EVERY levy, EVERY man at arms - so this is asking about absolute maximum capacity, not just what was raised for Granada.\n\nActually, I should be careful. The crusade mobilization was extensive but may not have been 100% of capacity. Let me think about what makes sense.\n\nThe documents suggest the 35,000 was a comprehensive mobilization for the crusade. If Juan calls upon absolutely everyone, excluding garrisons, he'd have approximately 30,000-32,000 available.\n\nÁlvaro straightened, clearly pleased by the decisiveness. \"I'll send riders to Jaén immediately, Your Majesty. Master Calabrese can have the bombards moving within two days. They should reach Seville in three to four weeks—by early March at latest.\"\n\nDon Íñigo nodded approvingly. \"The Mendozas will be ready to march on Medina within the fortnight. We'll extract him quickly and cleanly.\"\n\nYour question about total levy capacity brought a moment of calculation. Álvaro exchanged glances with Don Íñigo and Don Fadrique before responding.\n\n\"Your Majesty, if you summon every feudal levy in Castile—every man-at-arms from every noble house, every Military Order knight, every sworn vassal—and exclude garrison forces...\" Álvaro paused, doing the mathematics. \"The maximum field army Castile can raise is approximately thirty-five thousand troops.\"\n\nDon Íñigo elaborated. \"That breaks down roughly as:\n\nCrown forces: Three thousand five hundred to four thousand—your household troops, professional soldiers, crusaders\n\nNoble feudal levies: Twenty-six to twenty-seven thousand—every baron, count, and duke bringing their full complement\n\nMilitary Orders: Four thousand five hundred—Santiago, Calatrava, Alcántara at full strength\n\n\"The Granada crusade this past year was essentially a full mobilization, Your Majesty. We had thirty-five thousand in the field. That's why the extended service—eight months instead of forty days—strained the nobles so badly. They've already given everything they have.\"\n\nDon Fadrique added carefully, \"If Your Majesty excludes current garrisons—the five thousand professional troops holding our conquests through winter—that leaves approximately thirty thousand available for a spring campaign. But...\" He hesitated. \"Your Majesty, many of those levies just returned home in November. Calling them back after only three months...\"\n\nDon Rodrigo de Perea spoke up. \"They'll come, Your Majesty. The nobles know Granada must be finished. But two weeks is very tight for a full mobilization. Most lords need three to four weeks to gather their men, equip them properly, and march to assembly points.\"\n\nWhat do you say?"
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_1432_00208",
      "book": 1,
      "chapter": "1.30",
      "date": "1432-02-04",
      "end_date": null,
      "type": "military_action",
      "summary": "Juan and his commanders conduct a detailed strategic analysis of how to defeat Granada. They assess that a direct siege of the city with its 50,000 civilians and 12,000 troops could last six to ten months due to the Alhambra's independent water supply and stored provisions. The terrain discussion reveals the Vega plain favors Castilian heavy cavalry, but mountain approaches favor Granadan light raiders. Key enemy fortresses at Alhama and Montefrio form a defensive ring. Juan proposes a brilliant alternative: rather than directly besieging Granada, take the surrounding forts, build forward bases, systematically raid and burn crops, and starve the city into submission without committing to a costly static siege. The commanders enthusiastically endorse this strangulation strategy, estimating it could force Granada's surrender by late 1432 or early 1433.",
      "characters": [
        "juan_ii",
        "alvaro_de_luna",
        "fadrique_enriquez",
        "inigo_lopez_de_mendoza",
        "rodrigo_de_perea",
        "cardinal_capranica"
      ],
      "factions_affected": [
        "royal_court"
      ],
      "location": "Toledo",
      "tags": [
        "granada",
        "strategy",
        "siege",
        "starvation",
        "alhama",
        "montefrio",
        "vega",
        "terrain",
        "fortresses"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "If we march an army of twenty thousand against Grenada and siege the city, how long can they realistically hold out? Surely the city cannot sustain itself for very long?"
        },
        {
          "role": "gm",
          "text": "Álvaro exchanged glances with Don Íñigo and Don Fadrique before responding. The question clearly required careful consideration.\n\nDon Íñigo spoke first, his veteran's voice measured. \"Your Majesty, Granada city is not like the fortresses we've taken. It's a different proposition entirely.\"\n\nDon Fadrique elaborated. \"The city has approximately fifty thousand civilians, plus whatever garrison the Sultan has concentrated there. Our intelligence suggests he has perhaps ten to twelve thousand troops in the capital now—he's pulled forces from outlying positions through the winter.\"\n\nÁlvaro continued the assessment. \"The fortifications are formidable. The Alhambra itself is virtually impregnable—built on a high plateau, with independent water supplies from mountain springs, thick walls, multiple defensive layers. The city walls are strong and well-maintained. Unlike the coastal fortresses, Granada was built specifically to withstand extended sieges.\"\n\nDon Rodrigo added, \"And they have food stores. A city that size, expecting siege, will have accumulated grain for months. The Vega devastation last May hurt them, but they've had nine months to import supplies from across the straits—Moroccan grain, North African provisions.\"\n\n\"How long, specifically?\" you pressed.\n\nÁlvaro calculated aloud. \"A city of fifty thousand civilians plus twelve thousand troops—call it sixty-two thousand mouths. Assuming they've provisioned properly... six months minimum, possibly eight to ten months if they're willing to endure hardship and ration strictly. The Alhambra's independent water means we cannot cut that off. They can hold through summer into next winter if they must.\"\n\nDon Íñigo added grimly, \"And Your Majesty, a siege of that duration presents problems beyond simple time. Twenty thousand troops besieging for six months means:\n\nMassive supply requirements—we'd need constant wagon trains from conquered territories\n\nDisease becomes a factor in siege camps by summer\n\nDesertion increases as months drag on\n\nThe Sultan might attempt relief with whatever forces he's assembled\n\nCost becomes astronomical—feeding twenty thousand men for half a year...\"\n\nDon Fadrique spoke carefully. \"Your Majesty, I'm not saying it's impossible. With proper preparation, sufficient supplies, and determination, we could take Granada. But it would be the longest, costliest siege of the entire crusade. And if we commit twenty thousand troops to a siege that lasts into autumn...\" He let the implication hang.\n\nCardinal Capranica's dry voice cut in. \"The crusade taxation expires December 31, 1433, Your Majesty. You have less than two years. A six-month siege of Granada leaves little margin for... complications.\"\n\nWhat do you say?"
        },
        {
          "role": "player",
          "text": "How is the terrain around Grenada. Is it terrain that favors our heavy cavalry, or is their light cavalry more at the advantage?"
        },
        {
          "role": "gm",
          "text": "Don Fadrique answered immediately, his admiral's experience with coastal and inland geography evident. \"Your Majesty, the terrain around Granada is... complex. It depends on where you approach from.\"\n\nDon Íñigo elaborated, gesturing as if visualizing the landscape. \"The Vega de Granada—the fertile plain immediately surrounding the city—is flat, open agricultural land. When we devastated it last May, we moved through wheat fields, barley fields, irrigation channels. It's excellent terrain for heavy cavalry. Wide open spaces, firm ground most of the year, few obstacles. If we could bring the Sultan's forces to battle in the Vega, our heavy cavalry would dominate.\"\n\n\"However,\" Don Rodrigo added carefully, \"that's precisely why the Sultan won't come out to fight us there. He learned that lesson at Alcalá when his army was destroyed. Their light cavalry—fast, mobile, armed with bows—can harass our supply lines, raid our camps, strike at foraging parties. But they won't stand and fight against our heavy horse in open terrain.\"\n\nDon Fadrique continued the assessment. \"The approaches to Granada from our conquered territories are a different matter. From Loja to Granada—that's thirty miles through hill country and mountain passes. Narrow defiles, rocky ground, steep slopes. That terrain favors their light cavalry significantly. They can attack from high ground, retreat into terrain our heavy horse cannot follow, use their mobility to strike and vanish.\"\n\n\"You experienced this last May, Your Majesty,\" Álvaro reminded you. \"The march from Alcalá to Granada for the demonstration—the guerrilla cavalry shadowed you constantly. They couldn't stop ten thousand troops, but they made the march costly. That's what they do best—harassment in broken terrain.\"\n\nDon Íñigo stroked his beard thoughtfully. \"For a siege of Granada itself, the terrain question becomes: can we keep our siege lines supplied? The Vega is good for heavy cavalry operations, yes. But our supply wagons must come from Loja or from the coast—through mountain passes where their raiders operate. A six-month siege means constant supply convoys through terrain that favors their light cavalry.\"\n\nDon Rodrigo concluded grimly. \"They cannot defeat us in open battle. But they can make feeding twenty thousand men for six months... very expensive in blood and treasure.\"\n\nWhat do you say?"
        },
        {
          "role": "player",
          "text": "Are there any forts surrounding Grenada and the Vega? Apart from Loja?"
        },
        {
          "role": "gm",
          "text": "The search results mention \"Option Three: Clear Eastern Fortresses - Between eastern conquests and Granada city lie several medium fortresses - Alhama, Montefrio, others - Complete encirclement of Granada\"\n\nI should have the NPCs provide details about these remaining fortresses around Granada.\n\nDon Álvaro nodded and gestured for Don Rodrigo de Perea to step forward with a map. \"Your Majesty asks the right question. Yes, there are several fortresses that form a defensive ring around Granada and the Vega.\"\n\nDon Rodrigo unrolled a parchment map and pointed to positions. \"We've already taken the eastern approaches—Alcalá la Real, Illora, and Loja. But between our conquests and Granada city itself, the Sultan still holds several significant positions.\"\n\nDon Íñigo leaned over the map. \"The two most important are Alhama and Montefrío. Both are substantial fortresses, well-garrisoned, controlling key approaches to the Vega.\"\n\nDon Rodrigo elaborated. \"Alhama de Granada—about fifteen miles southwest of Granada city, commanding the road from the coast. Strong fortress, natural hot springs in the area. Garrison of perhaps five to six hundred troops. It's positioned to threaten our supply lines if we besiege Granada from Loja.\"\n\n\"And Montefrío,\" Don Íñigo continued, \"northwest of Granada, perhaps twenty miles. Another strong position on high ground. Similar garrison strength—maybe six hundred men. Controls the northern approaches through the hill country.\"\n\nDon Fadrique added, \"There are also several smaller fortified positions—watchtowers, minor castles—scattered around the Vega's perimeter. Perhaps another thousand troops total distributed among them. Each one could serve as a base for raiding our siege lines or supply convoys.\"\n\nÁlvaro summarized grimly. \"If we march twenty thousand troops to besiege Granada without first reducing these positions, Your Majesty, we'd be placing ourselves in the middle of a ring of enemy fortresses. Alhama could strike our supply lines from the south. Montefrío from the north. The smaller positions would provide eyes and staging points for constant harassment.\"\n\nThe Master of Calatrava stroked his beard. \"It's a classic defensive network. The Sultan cannot meet us in open battle, but these fortresses allow him to make any siege of Granada... uncomfortable. Very uncomfortable.\"\n\nDon Rodrigo concluded, \"That's why last summer's strategic discussion mentioned 'Option Three'—systematically reducing these eastern fortresses before attempting Granada itself. Take Alhama, take Montefrío, eliminate the smaller positions. Then besiege the capital with our flanks and supply lines secure.\"\n\nWhat do you say?"
        },
        {
          "role": "player",
          "text": "Indeed. We take the surrounding forts and block food supplies from there. They have virtually no ports left. We raid their farms again and burn their crops. We dont need to besiege the city itself to starve them out. Maybe all we need to do is take the surrounding forts, maybe build a few temporary ones of our own and raid their lands."
        },
        {
          "role": "gm",
          "text": "1. This avoids the 6-month direct siege problem\n2. It's less costly in lives\n3. It plays to Castilian strengths (superior field forces, artillery for fortress reduction)\n4. It addresses the terrain issue - they don't need to defend static siege lines in the Vega, they can operate from secure bases\n5. Granada has limited ports (they've taken most of the coast), so maritime supply is already restricted\n6. The Vega devastation from last May already hurt their agricultural capacity\n\nThe commanders should recognize this as a sound strategy, though with some considerations:\n- Timeline: Still takes months, but more flexible\n- Garrison costs: Need troops in all the surrounding fortresses\n- Granada might still hold out for a long time with existing stores\n- But it's much less risky than a direct siege\n- And it might force Granada to come out and fight (which favors Castile)\n\nI should have the experienced commanders appreciate this strategic thinking, work through the logistics, and maybe suggest refinements. This shows Juan's growing military sophistication.\n\nÁlvaro's eyes lit up with sudden understanding. \"Your Majesty... that's actually brilliant.\"\n\nDon Íñigo straightened, stroking his beard as he processed the strategy. \"A blockade without a siege. We don't throw twenty thousand men against the Alhambra's walls. We simply... cut them off from the world.\"\n\nDon Fadrique leaned over the map, tracing lines with his finger. \"We already control most of the coast—Málaga, Vélez-Málaga, the western positions. They have almost no maritime supply remaining. If we take Alhama and Montefrío, plus the smaller positions around the Vega...\" He looked up. \"Granada becomes an island in a Christian sea.\"\n\nThe Master of Calatrava nodded slowly, warming to the concept. \"And we can raid the Vega again—destroy whatever crops they've managed to replant since last May. Burn the mills we missed. Make it impossible for them to feed themselves from local agriculture.\"\n\nDon Rodrigo added excitedly, \"The beauty is we're not static. We're not sitting in siege lines for six months where their light cavalry can harass us. We operate from secure fortresses—Loja, Alhama once we take it, Montefrío. We raid when we choose, from where we choose, with forces sized for each operation. They can't predict where we'll strike.\"\n\nÁlvaro worked through the logistics aloud. \"Alhama and Montefrío—each perhaps three to four weeks with artillery. The smaller positions, maybe two weeks each. Call it... three months of campaigning to secure the entire ring. We'd need substantial garrisons in each position—say eight thousand troops distributed among them. But the remaining twelve thousand stay mobile, raiding, burning, preventing any relief.\"\n\nDon Íñigo added a critical point. \"And Your Majesty, this strategy has another advantage: it forces the Sultan to make a choice. Either watch us strangle his capital slowly while he does nothing—which destroys his prestige and might cause internal revolt—or come out and fight us in the field, where our heavy cavalry will destroy whatever forces he's assembled.\"\n\nDon Fadrique grinned. \"We demonstrated this exact strategy works. Look at Ronda last autumn—we took the fortress, garrisoned it, and the raiding network collapsed. The raiders had nowhere to base from, nowhere to resupply. Apply that same principle to Granada on a larger scale.\"\n\nCardinal Capranica spoke from the side, his dry voice cutting through the martial enthusiasm. \"How long before starvation forces surrender, by this method?\"\n\nÁlvaro calculated. \"If we take the surrounding fortresses by... late April or May, and begin systematic raiding? Granada city has stores, but they're feeding sixty thousand people. Without maritime supply, without the Vega producing crops, importing everything overland through mountains we patrol...\" He paused. \"By autumn—September or October—they'd be in severe distress. By winter, perhaps desperate. By next spring, almost certainly ready to negotiate.\"\n\nDon Íñigo added, \"And Your Majesty, this timeline works perfectly with the crusade tax expiration. We have until December 1433. This strategy completes well within that window—with time to spare if complications arise.\"\n\nWhat do you say?"
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_1432_00209",
      "book": 1,
      "chapter": "1.30",
      "date": "1432-02-04",
      "end_date": null,
      "type": "economic",
      "summary": "Alvaro presents the 1431 campaign financial review. Actual spending of approximately 142,000 florins came within 1,000 of the 143,171 florin budget -- remarkable financial discipline across seven months of operations with two separate armies. The crusade treasury now holds approximately 530,841 florins thanks to the October foreign aid windfall of 440,000 florins. Cardinal Capranica formally declares himself satisfied with the accounting and confirms he can report to the Pope with complete confidence. The kingdom has never been wealthier, with both crusade and crown treasuries flush.",
      "characters": [
        "juan_ii",
        "alvaro_de_luna",
        "cardinal_capranica",
        "tommaso_parentucelli"
      ],
      "factions_affected": [
        "royal_court"
      ],
      "location": "Toledo",
      "tags": [
        "budget",
        "treasury",
        "accounting",
        "crusade_finances",
        "audit"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "Yes, these strategies are sound. But the sultan will not be idle for sure. But we have a sound plan, let him come to us. We will beat him again in the field.\n\n\nLets review the budget of 1431 and compare how much we have actually spent compared to the budget.\n\n\nAlvaro, what does the ledger say?"
        },
        {
          "role": "gm",
          "text": "Perfect! I found the information about the actual spending. Let me compile this for the user:\n\nBudget planned: 143,171 florins for 8 months\nActual spending: ~142,000 florins for 7 months (April-October)\n\nThis is actually remarkably close to budget. The breakdown was:\n- Western Army: ~66,000 florins (budgeted 75,178 florins)\n- Eastern Army: ~31,000 florins (budgeted 35,748 florins)\n- Shared costs: ~25,000 florins (budgeted 32,245 florins including contingency)\n- Contingency spending: ~20,000 florins\n\nLet me have Álvaro present this information to Juan.\n\nÁlvaro pulled out a leather-bound ledger and opened it carefully. Cardinal Capranica leaned forward with interest—financial accountability was his passion.\n\n\"Your Majesty, the numbers are remarkably good,\" Álvaro began. \"In January, Father Tommaso and I prepared a comprehensive campaign budget projecting costs of 143,171 florins for eight months of operations—April through November.\"\n\nHe ran his finger down columns of neat figures. \"We've now completed seven months of active campaigning—April through October. The actual expenditures are as follows:\n\nWestern Army operations: Approximately 66,000 florins\n\nThis covered the coastal campaign from Estepona to Ronda\n\nNaval operations with the Genoese fleet\n\nProvisions for twelve thousand troops\n\nSiege equipment and artillery support\n\nBudgeted: 75,178 florins\n\nUnder budget by about 9,000 florins\n\nEastern Army operations: Approximately 31,000 florins\n\nThe campaign from Alcalá to Málaga\n\nRaiding operations and the Vega devastation\n\nProvisions for twenty-three thousand troops\n\nIntelligence gathering and scouts\n\nBudgeted: 35,748 florins\n\nUnder budget by about 4,700 florins\n\nShared costs and command: Approximately 25,000 florins\n\nRoyal command staff and administration\n\nCommunication between armies\n\nCrusader Marshal program\n\nVarious administrative expenses\n\nBudgeted: 245 florins base costs plus contingency reserve\n\nWell within projections\n\nContingency spending: Approximately 20,000 florins used\n\nUnexpected opportunities and emergencies\n\nWeather-related delays and complications\n\nEquipment repairs and replacements\n\nReserved: 32,000 florins\n\n12,000 florins remaining in reserve\"\n\nÁlvaro looked up from the ledger. \"Total actual spending for seven months: approximately 142,000 florins. We projected 143,171 for eight months, so we're essentially exactly on budget with one month of operations still to account for—November's winter transition costs.\"\n\nCardinal Capranica nodded approvingly. \"Excellent financial discipline, Constable. The variance is well within acceptable parameters.\"\n\n\"The real surprise, Your Majesty,\" Álvaro continued, \"is how the revenue picture transformed. Our crusade treasury started with 210,200 florins in donations. We collected approximately 22,641 florins from the crusade taxation—less than hoped due to noble resistance, but respectable. And then...\" He smiled. \"The foreign aid windfall arrived in October: 440,000 florins.\"\n\nHe did the mathematics aloud. \"Beginning balance plus taxation plus foreign aid: 672,841 florins income. Minus 142,000 florins in expenses. Current crusade treasury balance: approximately 530,841 florins.\"\n\nDon Fadrique whistled low. \"More than three times what we spent on the entire campaign.\"\n\n\"Exactly,\" Álvaro confirmed. \"And Your Majesty, this doesn't include the crown treasury, which benefited enormously from the Portuguese dowry and conquest booty. Between both treasuries, the kingdom has never been wealthier.\"\n\nWhat do you say?"
        },
        {
          "role": "player",
          "text": "Is the cardinal satisfied with the accounting of this crusade year? If so, we can proceed with the drafting of next years budget."
        },
        {
          "role": "gm",
          "text": "Given that:\n1. The budget was almost perfectly on target (142,000 spent vs 143,171 projected)\n2. The accounting has been transparent\n3. The oversight mechanisms worked\n4. The funds were used for their stated purposes\n\nCapranica should be satisfied, though he might have some procedural questions or want to see final documentation. He might also want to discuss lessons learned.\n\nThen we can transition to discussing the 1432 budget planning. This makes sense timing-wise - it's early February 1432, so planning for the spring campaign would be starting soon.\n\nI should have Capranica express satisfaction but in character - methodical, appreciating the procedure, perhaps asking a clarifying question or two. Then we can move toward discussing 1432 planning.\n\nCardinal Capranica set down the papers he'd been reviewing and looked up, his thin face showing something close to satisfaction—a rare expression for the perpetually meticulous legate.\n\n\"Constable, Your Majesty,\" he began, his dry voice precise as always, \"I must say this accounting reflects admirably on both the planning and execution of this campaign. When Father Tommaso and I reviewed that initial budget in January, I had... reservations about whether battlefield realities would respect such careful projections.\"\n\nHe gestured at the ledger. \"To come within one thousand florins of an eight-month projection, across two separate armies operating independently, managing naval contracts, provisions for thirty-five thousand troops, and countless variable expenses...\" He paused. \"That represents exceptional financial discipline.\"\n\nDon Íñigo couldn't resist. \"His Eminence is impressed. Mark this day, Your Majesty.\"\n\nCapranica allowed himself the ghost of a smile. \"The Constable and Father Tommaso established sound procedures, and the field commanders—yourself included, Don Íñigo—adhered to them. The monthly reports were submitted on time. Expenditures over five thousand florins received proper approval. Emergency authorizations were justified appropriately.\"\n\nHe looked directly at you. \"Your Majesty, from an ecclesiastical oversight perspective, this crusade's financial management has been exemplary. The funds donated by the faithful across Christendom—and the substantial foreign aid—have been used precisely as intended: for holy war against the Emirate of Granada. I can report to His Holiness with complete confidence that this crusade's finances are in order.\"\n\nÁlvaro cleared his throat. \"Then Your Eminence would be amenable to beginning work on the 1432 campaign budget?\"\n\nCapranica nodded. \"Indeed. Though I would like to see the final November-December accounting first—the winter garrison costs and the transition period. Assuming those align with projections, which I expect they will, then yes.\" He pulled out a fresh sheet of parchment. \"We should begin planning immediately. The 1432 campaign will be... different from 1431.\"\n\nHe looked at you meaningfully. \"Your Majesty, if I understand the strategic situation correctly, you are preparing to besiege Granada itself—the capital city. That is an undertaking of entirely different scale and cost than this year's mobile campaigns. We will need to plan accordingly.\"\n\nWhat do you say?"
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_1432_00210",
      "book": 1,
      "chapter": "1.30",
      "date": "1432-02-04",
      "end_date": null,
      "type": "economic",
      "summary": "Juan outlines the 1432 campaign budget parameters for Alvaro and Cardinal Capranica to draft. The plan includes: no major naval expenditure but a Portuguese ship contingency; a rebel suppression campaign near Seville with 6,000-7,000 troops in March-April against Medina and Niebla simultaneously; a main Granada force of 20,000-25,000 assembling at Jaen in May for the strangulation strategy through November. Juan proposes distributing conquered western Granada lands to nobles to reduce garrison costs. He also directs funding for a new Military Academy in Toledo (25,000 florins from crown treasury for construction, 7,500 from crusade budget for operations) to preserve foreign military expertise. The total 1432 budget is estimated at 170,000-200,000 florins, well within the 530,000 florin treasury. Juan argues the crusade tax can be renewed beyond 1433 if needed, giving nobles incentive to ensure the war continues.",
      "characters": [
        "juan_ii",
        "alvaro_de_luna",
        "cardinal_capranica",
        "fadrique_enriquez",
        "inigo_lopez_de_mendoza",
        "rodrigo_de_perea",
        "tommaso_parentucelli"
      ],
      "factions_affected": [
        "royal_court"
      ],
      "location": "Toledo",
      "tags": [
        "budget",
        "1432_campaign",
        "military_academy",
        "land_grants",
        "noble_compensation",
        "rebel_campaign",
        "granada_strategy",
        "taxation"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "One major difference is that we do not need naval support this year. We can take the few minor remaining ports from our land positions and rely mostly on land supplies.\n\n\nI would like to include a contingency in our planning to hire portugese ships at discount as per their offer to support the crusade. If the land war experiences a setback, we may need to rely on supplies by sea and we need an escort for those. Castille practically has no fleet of it's own.\n\n\nFor the rest, I think of raising an army near Seville to deal with a few rebels decisively. Two nobles have not only refused the crown but also the church and this rebellion cannot stand. I have already ordered the bombards to be brought against them and I want to raise the levvies from nearby nobles to start the siege as soon as the bombards arrive. This should give them a few weeks to get organized. Maybe six or seven thousand troops? I want to siege both holds simultaneously.\n\n\nLater I want to raise a main force to march against Grenada. But I want to give my nobles a bit of rest after the long campain season. I think we form up near Jaen in May. 20.000 troops to march on Grenada and take every fort surrounding them and starve them out.\n\n\nSuggetions?"
        },
        {
          "role": "gm",
          "text": "1. No major naval support needed (unlike 1431's coastal campaign)\n2. Contingency planning for Portuguese ships at discount if needed\n3. Rebel suppression campaign near Seville:\n   - Two defiant nobles (Medina and Niebla from earlier discussion)\n   - 6-7,000 troops\n   - Simultaneous sieges once bombards arrive\n   - Give nobles a few weeks to organize\n\n4. Main Granada campaign:\n   - Assemble near Jaén in May\n   - 20,000 troops\n   - Take surrounding forts and starve out Granada city\n   - Give nobles rest after long 1431 campaign\n\nThis is smart strategic thinking. Let me have the advisors respond with their thoughts - they should be supportive but raise practical considerations about:\n- Timeline and troop availability\n- The rebel campaign logistics\n- Whether 20,000 is enough for the Granada strategy\n- Cost implications\n- The rest period for nobles\n\nÁlvaro, Don Íñigo, Don Fadrique, and Capranica would all have relevant input.\n\nÁlvaro nodded approvingly as he took notes. \"Your Majesty's strategic thinking is sound. Let me address each element.\"\n\nDon Fadrique spoke first about the naval situation. \"You're correct that we won't need the Genoese fleet contract—that was 38,400 florins alone last year. The remaining coastal positions are minor. However, the Portuguese contingency is wise.\" He glanced at his notes. \"King João's letter offered favorable rates for their Atlantic galleys. Perhaps we budget for... six ships on standby? Available if needed but not contracted unless circumstances require. Maybe 3,000-4,000 florins reserved for that contingency.\"\n\nDon Íñigo addressed the rebel campaign. \"Six to seven thousand troops for two simultaneous sieges is adequate, Your Majesty. The Baron de Medina is in a weak position—three to four thousand troops with artillery should extract him quickly. The Count of Niebla is more substantial, requiring the remainder. The beauty of bombards is we can breach both fortifications in parallel.\"\n\nHe calculated aloud. \"Three weeks for the bombards to reach Seville from Jaén. Give nobles two weeks to muster near Seville—so early March assembly. Both sieges completed by... early April, assuming neither drags longer than expected. Your Majesty returns to Toledo by mid-April for the birth.\"\n\nÁlvaro added, \"The rebel campaign costs will be modest—perhaps 8,000 to 10,000 florins. Short duration, smaller force, local provisioning. The Mendozas and other southern houses can provide most of the troops as their feudal obligation.\"\n\nDon Rodrigo de Perea spoke up about the main campaign. \"Twenty thousand troops for the Granada strategy is... sufficient, Your Majesty, but tight. If we're taking Alhama, Montefrío, and the smaller ring fortresses simultaneously, we'll need to split forces. Each fortress requires investment, and we'll need mobile reserves to respond to threats.\"\n\nDon Íñigo stroked his beard. \"I'd recommend planning for twenty-five thousand if possible. That gives us eight thousand for garrisons across the ring of fortresses, twelve thousand as mobile raiding forces, and five thousand in reserve. Better to have extra capacity than find ourselves stretched.\"\n\nÁlvaro made more notes. \"May assembly in Jaén gives nobles nearly six months rest—November through April. That's generous and will be appreciated. They've been in the field for eight months this year. Their treasuries need recovery time as much as their men.\"\n\nCardinal Capranica interjected carefully. \"Your Majesty, I must raise a fiscal consideration. The crusade taxation expires December 31st, 1433. We now have February 1432 through the end of 1433—twenty-three months of taxation authority remaining. If the 1432 campaign extends into autumn, and then you campaign again in 1433...\" He paused. \"We should plan the 1432 budget to be final. Make it sufficient to complete the conquest decisively, rather than planning for a multi-year approach.\"\n\nDon Fadrique added, \"His Eminence is right. If we budget to take the surrounding fortresses in 1432 and then plan another campaign for 1433 to actually take Granada city... we're cutting it very close to the tax expiration. Better to budget for the whole conquest in one campaign year.\"\n\nÁlvaro looked at you directly. \"Your Majesty, the question is: do we budget 1432 as a strangulation campaign—take the fortresses, raid, starve them for six months, then negotiate surrender in late 1432 or early 1433? Or do we budget to actually assault Granada city in 1432 if necessary?\"\n\nDon Íñigo added, \"The starvation strategy is cheaper and lower casualties. But if they hold out stubbornly, we might not finish before winter. Then we'd need another campaign season in 1433, eating into our remaining tax authority.\"\n\nWhat do you say?"
        },
        {
          "role": "player",
          "text": "We continue to strangle Grenada. But I would not worry too much about ending the crusade after 1433. If we need more time, I can just declare another tax. It may in fact give me MORE influence since right now, nobles are compensated as ppart of this tax. This compensation expires so they feel the pressure to make sure this is continued.\n\n\nLets just focus on fighting the good fight. This strategy is correct, lets follow it for now.\n\n\nDo you have more questions before you can draft the budget again?"
        },
        {
          "role": "gm",
          "text": "Álvaro and the others would want to clarify some details before drafting:\n- Exact force compositions for each phase\n- Timeline expectations\n- Garrison requirements (since they'll be holding more territory)\n- What happens with the conquered territories during 1432\n- Artillery distribution\n- Any other major expenditures\n\nLet me have them ask practical questions about the campaign structure.\n\nÁlvaro's eyebrows rose slightly at your political calculation, then he nodded with understanding. \"Your Majesty sees the leverage. If nobles want their compensation to continue, they'll support extending the crusade taxation. Clever.\"\n\nCardinal Capranica looked less certain but didn't object. \"As Your Majesty wishes. Though I should note that extending crusade taxation beyond the bull's terms would require... papal approval or a new bull. But that is a matter for another time.\"\n\nÁlvaro turned to practical matters. \"Several questions before Father Tommaso and I can draft a proper budget, Your Majesty:\n\nFirst, garrison requirements. We currently hold substantial territory—Alcalá, Loja, Málaga, Ronda, and various smaller positions. Through winter, we have five thousand professional troops garrisoning. But during active campaign in 1432, when we add Alhama, Montefrío, and other positions...\" He calculated mentally. \"We might need ten to twelve thousand troops just for garrisons. That's a significant portion of our force—and a major budget line.\"\n\nDon Íñigo added, \"And Your Majesty, those garrison troops need supplies for potentially twelve months. Last year, we budgeted for eight-month campaigns with troops rotating home. Permanent garrisons cost more—they're there year-round.\"\n\nÁlvaro continued. \"Second, artillery distribution. We have five bombards currently. For simultaneous operations—two rebel sieges in March, then multiple fortress sieges around Granada starting May—we'll need to split them. Perhaps three to the rebel campaign, then all five move to Granada theater? Or do we need more guns?\"\n\nDon Rodrigo spoke up. \"Third, the raiding operations around Granada. Your Majesty plans systematic devastation—burning crops, destroying mills, making the Vega unusable. That requires mobile forces operating continuously for months. More expensive than static sieges—constant movement means more horses, more supplies consumed, more wear on equipment.\"\n\nDon Fadrique added, \"Fourth, what about the Moroccan reinforcements? Intelligence suggests Granada received about twenty-five hundred Moroccan troops in November. They're professionals. Does Your Majesty expect field battles, or will they stay behind walls?\"\n\nÁlvaro made notes. \"Fifth, timeline. You mentioned:\n\nFebruary-March: Organize rebel campaign\n\nMarch-April: Siege rebels\n\nMay: Assemble main force at Jaén\n\nMay onwards: Granada campaign\n\n\"But how long do we budget the Granada campaign? Through October like last year? Or do we plan for operations into winter if the strangulation takes longer?\"\n\nCardinal Capranica interjected, \"And sixth, Your Majesty—the foreign aid windfall. We have over 530,000 florins in crusade treasury. Do you wish to spend aggressively, knowing we have reserves? Or maintain fiscal discipline?\"\n\nÁlvaro looked up from his notes. \"Those are the key questions I need answered to create an accurate budget. What are Your Majesty's directions?\"\n\nWhat do you say?"
        },
        {
          "role": "player",
          "text": "Cardinal, The bull allows me to tax as long as the crusade lasts. So i am well within the rights of the current bull to levy tax after the current Cortes approved tax expires.\n\n\nRight now, the garisson is made up of the military orders. They will be relieved by raised levvies. We have taken western Grenada already. Can we start giving these lands to nobles? This way, we do not have to garisson them so heavily I hope.\n\n\nI want to keep the bombards together for now. We deploy them against the rebels first and then move them towards Grenada and the forts there. Dont split them up.\n\n\nWe indeed need mobile troops to strangle Grenada, but first we need forts to operate from.\n\n\nI dont know what the sultan will do. But if he moves out, we will meet him on the field again.\n\n\nWe go on untill November again. We may call off some troops if the front is stable, but we budget to November.\n\n\nWe do not spend frivolously. But we will add the academy to the budget. We recieve support from all of christendom and I want to set up an academy to channel this knowledge, combine experience and extertise. I want to develop new Christian cavalry, infantry and artillery and naval expertise. To develop new techniques and formations, fighting styles and weapons. \nAlso, make sure we include the compensation for the nobles according to the tax."
        },
        {
          "role": "gm",
          "text": "1. Clarifies the bull allows taxation as long as crusade lasts - so extending beyond 1433 is legally valid\n2. Wants to start distributing western Granada lands to nobles to reduce garrison requirements\n3. Keep bombards together - use against rebels first, then move to Granada theater\n4. Mobile raiding troops need fortresses as bases first\n5. If Sultan comes out, meet him in field battle\n6. Budget through November 1432\n7. Don't spend frivolously but DO include the Military Academy\n8. Include noble compensation according to the tax law\n\nÁlvaro and others should respond to these directions, asking any clarifying questions, and confirming they can draft the budget with these parameters.\n\nThe land distribution question is interesting - this starts the process of rewarding nobles with conquered territory, which was supposed to happen at the Cortes. So this might need some discussion about timing and process.\n\nCardinal Capranica inclined his head. \"Your Majesty is correct. The bull's language—'for the duration of the holy war against Granada'—does support continued taxation until the emirate falls completely. I stand corrected.\"\n\nÁlvaro seized on your point about land distribution. \"Your Majesty, this is excellent timing. The Cortes at Valladolid distributed some territory, but we held back most of western Granada for future allocation. If we begin granting estates now—Ronda, the coastal fortresses, villages—to nobles who served well...\" He smiled. \"They garrison their own new lands. We shift costs from crown to the recipients.\"\n\nDon Íñigo nodded enthusiastically. \"Give Don Rodrigo de Perea formal lordship over Ronda and its territory—he conquered it, he's proven he can govern it. Grant coastal estates to Mendoza branches, the Master of Santiago's order gets holdings near Marbella. Each grant comes with obligation to maintain garrison at their own expense.\"\n\n\"Precisely,\" Álvaro continued. \"We'd still need crown garrisons at key strategic positions—Loja, Málaga, Alcalá—perhaps six thousand troops. But western Granada becomes self-garrisoning through feudal obligations. Saves... perhaps 30,000 to 40,000 florins annually.\"\n\nDon Fadrique added, \"And Your Majesty, it rewards loyalty. Nobles who served well get rich estates. Those who resisted or sat out get nothing. Clear message.\"\n\nÁlvaro made detailed notes. \"Understood on the bombards—keep all five together, rebels first, then Granada theater. That simplifies logistics considerably.\"\n\nDon Rodrigo spoke about the mobile operations. \"So the sequence is: take ring fortresses first—Alhama, Montefrío, the smaller positions. Establish forward bases. Then launch systematic raiding from secure positions. That's sound. We're not operating unsupported in hostile territory.\"\n\nÁlvaro continued noting. \"November end-date, same as 1431. And we include full noble compensation per the Cortes law.\" He flipped through papers. \"That was... substantial. Let me see... the compensation structure pays nobles for troops beyond their forty-day feudal obligation, plus payments for artillery transport, plus rewards for successful sieges...\"\n\nHe calculated aloud. \"For twenty-five thousand troops over eight months, with the compensation structure, we're looking at perhaps... 45,000 to 50,000 florins just for noble payments. That's separate from provisions and other costs.\"\n\nDon Íñigo raised an eyebrow. \"Expensive. But it keeps the nobles happy and motivated.\"\n\n\"And politically necessary,\" you reminded them. \"The Cortes approved the taxation with that compensation. We honor our commitments.\"\n\nÁlvaro nodded. \"Of course, Your Majesty. Now, the Military Academy—this is exciting. Father Tommaso and I discussed this in October.\" He pulled out notes. \"To establish properly in Toledo:\n\nFacility costs: Converting existing buildings or constructing new—perhaps 15,000 to 20,000 florins initial investment\n\nFaculty salaries: The foreign experts arriving—French veterans, Italian engineers, German knights, Hungarian cavalry officers—need to be compensated. Perhaps 30 masters at 100 florins annually each—3,000 florins yearly\n\nStudent support: Housing and provisions for noble sons and promising officers attending—maybe 50 students initially—2,000 florins yearly\n\nMaterials and equipment: Training weapons, siege models, artillery pieces for instruction, maps, books—5,000 florins initial, 1,000 florins yearly maintenance\n\nAdministration: Commandant, clerks, support staff—1,500 florins yearly\"\n\nHe tallied. \"Initial establishment: roughly 25,000 florins. Annual operating costs: about 7,500 florins. And that's for a modest start—we can expand as it proves valuable.\"\n\nDon Íñigo added thoughtfully, \"Your Majesty, the academy serves double purpose. It preserves the knowledge these foreign experts bring, but it also keeps them here—employed, integrated into Castile's military structure. They won't just finish the crusade and leave. We build institutional knowledge.\"\n\nCardinal Capranica spoke carefully. \"The academy is a military institution supporting the crusade's long-term success. I can justify including it in crusade finances—though initial facility construction should perhaps come from crown treasury as it's a permanent kingdom asset, not a temporary war expense.\"\n\nÁlvaro nodded. \"Fair point. So: 25,000 florins from crown treasury for construction, 7,500 florins from crusade budget for first year operations. Is that acceptable, Your Majesty?\"\n\nHe reviewed his notes. \"So, to summarize what I need to budget:\n\nRebel Campaign (February-April):\n\n6,000-7,000 troops\n\nFive bombards\n\nThree months operations\n\nProvisions, siege equipment, transportation\n\nEstimated: 8,000-10,000 florins\n\nMain Granada Campaign (May-November):\n\n25,000 troops\n\nTake Alhama, Montefrío, ring fortresses\n\nSystematic raiding operations\n\nSeven months operations\n\nNoble compensation per Cortes law\n\nProvisions, cavalry operations, siege equipment\n\nEstimated: 100,000-120,000 florins\n\nYear-Round Expenses:\n\n6,000 crown garrison troops at strategic positions (Loja, Málaga, Alcalá)\n\nWestern Granada estates granted to nobles (self-garrisoning)\n\nMilitary Academy operations: 7,500 florins\n\nCrusader Marshal program continuing\n\nAdministrative overhead\n\nEstimated: 35,000-40,000 florins\n\nContingency:\n\nPortuguese naval reserve (six ships standby): 4,000 florins budgeted\n\nEmergency reserve: 20,000 florins\n\nEquipment replacement and repairs: 5,000 florins\n\nRough total: 170,000-200,000 florins for 1432 campaign year\"\n\nHe looked up. \"That's higher than 1431's 143,000 florins, but we're operating longer, maintaining more garrisons, paying substantial noble compensation, and funding the academy. With 530,000 florins in crusade treasury, this is entirely affordable. And the crusade taxation will generate another 20,000-25,000 florins during the year.\"\n\nDon Fadrique added, \"And Your Majesty, this assumes no major setbacks. If Granada falls faster than expected—if they negotiate surrender by autumn—costs drop significantly.\"\n\nÁlvaro set down his quill. \"Your Majesty, do I have your authorization to begin drafting the detailed 1432 budget with Father Tommaso based on these parameters?\"\n\nWhat do you say?"
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_1432_00211",
      "book": 1,
      "chapter": "1.30",
      "date": "1432-02-04",
      "end_date": null,
      "type": "council",
      "summary": "The chapter concludes with a comprehensive summary of all session events: Isabel's recovery and broth, Catalina's presentation to court, Juan's return to governance, military strategy discussions, the rebel suppression plan, the Granada strangulation strategy, the 1431 budget review, and the 1432 campaign budget planning including the Military Academy.",
      "characters": [
        "juan_ii"
      ],
      "factions_affected": [],
      "location": "Toledo",
      "tags": [
        "chapter_end",
        "summary"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "Lets wrap up the chapter here.\n\n\nCreate a new document and put a summary of all events in this chat in it. Name it \"Chapter 30\""
        },
        {
          "role": "gm",
          "text": "1. Juan with Isabel and Catalina - Isabel recovering from birth, trying to eat broth\n2. Juan takes Catalina to throne room to present her to court\n3. Announces Isabel's serious illness, asks for prayers\n4. Discussion of realm business - rebels, crusade, budget\n5. Decision to move bombards to deal with rebels\n6. Discussion of total Castilian military capacity (35,000 troops)\n7. Questions about besieging Granada - how long could they hold (6-8 months)\n8. Discussion of terrain around Granada (Vega is good for heavy cavalry, approaches favor light cavalry)\n9. Discussion of fortresses surrounding Granada (Alhama, Montefrío)\n10. Juan's strategic insight - don't besiege city directly, take surrounding forts and starve them out\n11. Review of 1431 budget vs actual spending (142,000 florins spent vs 143,171 budgeted)\n12. Cardinal satisfied with accounting\n13. Planning for 1432 campaign budget\n14. Juan's strategy: rebel campaign first (March-April), then Granada campaign (May-November)\n15. Discussion of land grants to nobles for western Granada\n16. Military Academy funding\n17. Budget planning for 1432 (~170,000-200,000 florins)\n\nI need to create a comprehensive summary document covering all these events.\n\nCreate File: Creating Chapter 30 complete summary document covering all events from this session"
        }
      ],
      "roll": null
    }
  ]
}