{
  "chapter": "1.25",
  "book": 1,
  "event_count": 6,
  "date_range": "1431-10-15 / 1431-10-15",
  "events": [
    {
      "event_id": "evt_1431_00149",
      "book": 1,
      "chapter": "1.25",
      "date": "1431-10-15",
      "end_date": null,
      "type": "council",
      "summary": "Juan II and Alvaro de Luna review the treasury and budget, acknowledging a deficit but deferring major changes to 1432. The discussion pivots to the Aragonese succession: with the Infantes disinherited and their descendants excluded, Alvaro maps out the claimants. Juan himself emerges as the strongest candidate -- a first cousin of Alfonso V through the Trastamara line. They assess factions in Aragon (Castilian, Catalonian, Aragonese, Portuguese, Italian) and note the extinction of the Urgell rival line.",
      "characters": [
        "juan_ii",
        "alvaro_de_luna",
        "alfonso_v"
      ],
      "factions_affected": [
        "royal_court"
      ],
      "location": "Toledo",
      "tags": [
        "budget",
        "treasury",
        "succession",
        "aragon",
        "trastamara",
        "strategy"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "Hi\n\n\nI am discussing the budget and treasury with Alvaro de Luna.\n\n\nWe have enouth money for now, but we are operating on a deficit. We just let it be for now, but I plan to make big changes to the budget for 1432. Both for the crusade and for the crown.\n\n\nI do ask alvaro; who is the heir to the Aragonese crown now that the infantes have been desinherited?"
        },
        {
          "role": "gm",
          "text": "Álvaro sets down the ledger he's been reviewing and looks up, his expression thoughtful. \"That, Your Majesty, is the question creating sleepless nights in Barcelona and Naples,\" he says. \"And it's precisely why Alfonso withdrew his support for our crusade—he needs to focus entirely on securing his own succession.\"\n\nHe stands and moves to the window, hands clasped behind his back. \"With the Infantes' renunciation extending to all their descendants, young Carlos is eliminated. Alfonso has no legitimate children despite years of marriage to Doña María. The succession falls to... more distant relations.\" He turns back to face you. \"There are cousins—descendants of Ferdinand I through various cadet branches of the Trastámara line. But none with particularly strong claims, and several are children themselves or have their own complications.\"\n\n\"The most likely candidates would be relatives through the Urgell branch or other Trastámara cousins, but Your Majesty...\" Álvaro's eyes gleam with the careful calculation you've come to recognize. \"This is why Alfonso watches everything involving the Infantes so carefully. If he fails to produce an heir or designate a successor, Aragon faces a succession crisis that could tear the crown apart. Multiple weak claimants means potential civil war.\"\n\nHe returns to the table, tapping the ledger. \"Which brings us back to why maintaining good relations with Alfonso—and with your sister María—remains crucial. The situation is... fluid. And unlikely to resolve quickly.\"\n\nWhat do you say?"
        },
        {
          "role": "player",
          "text": "Can we be more specific Alvaro? Who exactly are these claimants? And I think I have my own legitimate claim to the throne as well. Let's properly assess the situation. What factions are there?"
        },
        {
          "role": "gm",
          "text": "Potential claimants:\n1. **Juan II of Castile himself** - he's a Trastámara, nephew of Ferdinand I of Aragon, and married to Alfonso's sister María\n2. **Descendants of the Urgell line** - they were the rival claimants in 1412, though their county was dissolved\n3. **Other distant Trastámara relatives**\n4. **Descendants of earlier Aragonese kings through female lines**\n\nNow I need to search for more specific information about the Urgell claimants and Juan II's actual genealogical claim.\n\nJuan de Castilla y León, II (1405 - 1454) - Genealogy geni.com\n\nJohn II of Castile - Wikipedia wikipedia.org\n\nSpanish Royal Burials: House of Trastámara – Family of Ferdinand II of Aragon and Isabella I of Castile | Unofficial Royalty unofficialroyalty.com\n\nFerdinand II of Aragon - Wikipedia wikipedia.org\n\nJuan (Castilla) Trastámara (1405-1454) | WikiTree FREE Family Tree wikitree.com\n\nJoanna of Castile - Wikipedia wikipedia.org\n\nFerdinand I of Aragon - Wikipedia wikipedia.org\n\nJuan II Trastamara : Family tree by Joan DOUGHTY (cousinjeanne) - Geneanet geneanet.org\n\nJohn II of Aragon - Wikipedia wikipedia.org\n\nJohn II of Castile - tordesillas.net tordesillas.net\n\nOkay, now I have a clearer picture. Let me piece together the genealogy:\n\n**Juan II of Castile's relationship to Ferdinand I of Aragon:**\n- Juan II's father: Henry III of Castile (died 1406)\n- Henry III's father: John I of Castile (House of Trastámara)\n- John I's father: Henry II of Trastámara (founder of the Trastámara dynasty in Castile)\n\n- Ferdinand I of Aragon's father: John I of Castile\n- So Ferdinand I and Henry III were brothers!\n\nThis makes Ferdinand I of Aragon Juan II's UNCLE (his father's brother).\n\nAlfonso V of Aragon is therefore Juan II's first cousin.\n\nThe Infantes Juan and Enrique are also Juan II's first cousins.\n\nMaría of Aragon (Alfonso's sister, Juan II's first wife who died in 1445) was Juan II's first cousin whom he married.\n\nSo Juan II of Castile is a member of the Trastámara dynasty with a legitimate claim to Aragon as well - he's Alfonso V's first cousin!\n\nNow, let me think about the succession:\n\n1. Alfonso V (no legitimate heirs)\n2. Infante Juan (renounced for himself and descendants)\n3. Infante Enrique (renounced for himself and descendants)\n4. Carlos, Prince of Viana (eliminated due to father's renunciation of descendants)\n5. Other children of Ferdinand I: Eleanor (married King of Portugal), Pedro (died 1438), María (died 1445, was Juan II's first wife), Henry (died 1445)\n\nSo the next in line after the Infantes would be... other descendants of the Trastámara line.\n\nThe key question is: who has claims?\n\n1. **Juan II of Castile** - first cousin of Alfonso V, also a Trastámara\n2. **Descendants of the Urgell branch** - they were the rival claimants in 1412 when Ferdinand was chosen\n\n3. **Other more distant Trastámara relatives** might also have potential claims through complex familial connections within the royal lineage, potentially extending the pool of possible successors beyond the immediate line.\n\nCompromise of Caspe - Wikipedia wikipedia.org\n\nJames II, Count of Urgell - Wikipedia wikipedia.org\n\nHistory - La Real Casa d'Aragona real-aragon.org\n\nCompromise of Caspe en-academic.com\n\nCount of Urgell's revolt - Wikipedia wikipedia.org\n\nLearn James II, Count of Urgell facts for kids kiddle.co\n\nJaume II 'el Dissortat' d'Aragó i Montferrat, comte d'Urgell (1380 - 1433) - Genealogy geni.com\n\nLearn Compromise of Caspe facts for kids kiddle.co\n\nTHE COMPROMISE OF CASPE - ARAGON - THE DEVELOPMENT OF EUROPEAN STATES - c. 1415-c. 1500 - The new cambridge medieval history erenow.org\n\nMonument to Count James II of Urgell - ART CLIPPINGS - PUBLICATIONS - Museu de la noguera museucn.com\n\n**James II, Count of Urgell:**\n- Born 1380, died 1433 in captivity\n- Was the closest male-line descendant of the House of Barcelona\n- Great-grandson of Alfonso IV of Aragon\n- Lost the Compromise of Caspe in 1412 to Ferdinand of Antequera\n- Rebelled in 1413, was defeated, imprisoned for life\n- Died WITHOUT HEIR in 1433\n\n**Alfonso, Duke of Gandia:**\n- Also a claimant in 1412\n- Died in 1454 without heir\n\nSo BOTH rival claimants from 1412 are now dead (by 1430 in our game) or will die without heirs. \n\nThis means the succession situation in Aragon is:\n\n**Current Line (House of Trastámara through Ferdinand I):**\n1. Alfonso V (no legitimate children)\n2. Infante Juan (renounced for himself and descendants) → Carlos excluded\n3. Infante Enrique (renounced for himself and descendants)\n4. María (died 1445, had no surviving children with Juan II)\n5. Eleanor (married King Edward of Portugal, died 1445)\n6. Pedro (died 1438)\n\n**Alternative Claimants:**\n1. **Juan II of Castile** - First cousin of Alfonso V, also a Trastámara (son of Henry III of Castile, whose father John I of Castile was Ferdinand I's father too - they were brothers!)\n2. **Urgell line** - EXTINCT (James II died 1433 without heir)\n3. **Gandia line** - will die out in 1454 without heir\n4. **Other Trastámara branches** - various more distant relatives\n\nSo Juan II has a VERY legitimate claim as Alfonso's first cousin! In fact, he might be one of the strongest claimants after the Infantes renounced.\n\nI'll craft a diplomatic explanation that subtly highlights Juan II's strongest claim while maintaining political nuance. I'll emphasize the family connections and legal legitimacy without appearing too aggressive.\n\nÁlvaro's expression shifts from thoughtful to deeply engaged. He returns to the table and spreads his hands flat on its surface, as if laying out chess pieces.\n\n\"Your Majesty has identified the key question precisely.\" He pauses, organizing his thoughts. \"Let me map this properly, because the situation is more complex—and more favorable to Your Majesty—than it first appears.\"\n\n\"The candidates, in rough order of claim strength:\n\nFirst: Your Majesty yourself. You are Alfonso's first cousin—your father Henry III and Alfonso's father Ferdinand were brothers, both sons of John I of Castile. You share Trastámara blood equally with Alfonso. In fact,\" he meets your eyes significantly, \"you might argue your claim is stronger than Ferdinand's was in 1412, since you descend through the legitimate male line just as Alfonso does.\n\nSecond: Any surviving children of Alfonso's siblings. Eleanor married the King of Portugal and had children before her death—those Portuguese grandchildren have claims. Pedro died in 1438 without surviving issue. María, your first wife, had only young Enrique who survived infancy with you. Henry, Duke of Villena, also has descendants.\n\nThird: The Urgell line—but here's the crucial point: Count James II of Urgell died in prison in 1433 without heirs. His line is extinct. The other 1412 claimant, Alfonso Duke of Gandia, is ancient and childless. When he dies, that claim vanishes too.\n\nFourth: Various distant Trastámara cousins through cadet branches. Weaker claims, children, complications.\"\n\nÁlvaro straightens. \"But there's another critical factor, Your Majesty. The Compromise of Caspe in 1412 wasn't about bloodlines alone—it was political. They chose Ferdinand over the 'rightful' Urgell heir because Ferdinand had an army, papal support, and could actually rule. The lesson? Aragon's succession crises get resolved by capability as much as genealogy.\"\n\n\"Which brings us to the factions that matter:\n\nThe Castilian Faction: Nobles who supported Ferdinand in 1412 and now benefit from Trastámara rule. They might support Your Majesty as continuity—another Trastámara who keeps their positions secure. But they'd need assurance their privileges continue.\n\nThe Catalonian Faction: Deeply resented the Caspe decision. They wanted Urgell because he was Catalan, House of Barcelona. With Urgell extinct, they're adrift. They might resist another Castilian... or embrace you if you court them properly.\n\nThe Aragonese Faction: Pragmatists. They care about strong rule, Mediterranean trade, Italian ambitions. They'll back whoever can deliver stability and prosperity.\n\nThe Portuguese Faction: Through Eleanor's marriage, Portugal has claims through her children. They'll make noise but probably lack the force to push it seriously.\n\nThe Italian Faction: Alfonso's bastard son Ferdinand has support in Naples. If Alfonso legitimizes him and designates him heir, that's a powerful claim—especially with Alfonso's Neapolitan focus.\"\n\nÁlvaro leans forward. \"Your Majesty's strategic position: You're the closest legitimate male Trastámara after the Infantes renounced. You're married to Alfonso's sister's memory and now to a Portuguese princess—dynastically impressive. You're conducting a papal crusade—religious legitimacy. And if Granada falls...\" he smiles slightly, \"you'll be a conquering hero with military credibility the Aragonese nobility respects.\n\nBut,\" his tone becomes cautionary, \"Alfonso is only thirty-four. He could live another twenty-five years. He could legitimize his bastard. He could father legitimate children still. The situation is fluid, and much depends on time, politics, and relationships.\"\n\nHe sits back. \"The question isn't just who has claims, Your Majesty. It's who will be in position to press those claims when the time comes, and who the Aragonese nobility will actually accept.\""
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_1431_00150",
      "book": 1,
      "chapter": "1.25",
      "date": "1431-10-15",
      "end_date": null,
      "type": "diplomacy",
      "summary": "Juan asks Alvaro about the Hussite heresy in Bohemia. Alvaro reports the fifth crusade against the Hussites was routed at Domazlice in August 1431, with Cardinal Cesarini barely escaping. He then explains the Council of Basel, which opened July 23 and is now in open conflict with Pope Eugenius IV who tried to dissolve it in December. The council is debating Hussite negotiations, church reform, reunion with the Greek Church, and papal vs. conciliar supremacy. Alvaro warns that the papal authority underpinning Juan's crusade could be weakened by this power struggle.",
      "characters": [
        "juan_ii",
        "alvaro_de_luna"
      ],
      "factions_affected": [],
      "location": "Toledo",
      "tags": [
        "bohemia",
        "hussites",
        "council_of_basel",
        "papacy",
        "church_reform",
        "crusade"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "Interesting. So I will visit my sister again sometime.\n\n\nHow is the situation in Bohemia now? Are they still heretical?"
        },
        {
          "role": "gm",
          "text": "Jan Hus (1369-1415) and the Hussite wars (1419-1436) - Musée protestant museeprotestant.org\n\nÁlvaro's expression darkens. \"Very much so, Your Majesty. In fact, the situation grows more alarming by the month.\"\n\nHe crosses to a map on the wall. \"Bohemia remains firmly in Hussite hands—heretics who reject papal authority, administer communion in both kinds, and have defeated five crusades sent against them. Five, Your Majesty.\" He holds up his hand for emphasis. \"The most recent was just this past August at Domažlice. The crusaders—led by Frederick of Brandenburg and Cardinal Cesarini himself as papal legate—were utterly routed. The reports say they fled in panic merely upon hearing the Hussites singing their battle hymns.\"\n\nHe returns to face you. \"These heretics are no mere peasant rabble. Under commanders like Jan Žižka—now deceased—and currently Prokop the Great, they've developed devastating military tactics using war wagons and early firearms. They've not only defended Bohemia but conducted aggressive raids deep into Germany, Silesia, and Hungary. The German princes are terrified the heresy will spread to their lands.\"\n\n\"The situation is complicated because the Hussites are divided among themselves. The moderate faction—called Utraquists—simply want communion in both kinds and some church reforms. The radical faction—the Taborites—want wholesale revolution, attacking church wealth and hierarchy itself. But when crusaders threaten, they unite and crush them.\"\n\nHe pauses. \"There is... one development. The Council of Basel, which convened this past March, has extended an invitation to the Hussites to negotiate. On October 15th—just weeks ago—they formally invited Hussite representatives to attend the council and discuss terms. The Church is finally admitting that military solutions have failed.\"\n\nÁlvaro's tone becomes more pointed. \"This is significant for Your Majesty's crusade. Every crusade against the Hussites has failed spectacularly, draining resources and manpower that might otherwise go to Granada. And it demonstrates that even the most stubborn heresy, when backed by military success, forces the Church to negotiate rather than simply condemn.\"\n\nHe meets your eyes. \"The Hussites remain defiantly heretical, Your Majesty. Bohemia is lost to Rome for now, though negotiations may bring some reconciliation. But they've proven that a determined, militarily competent force can resist even papal crusades for over a decade.\""
        },
        {
          "role": "player",
          "text": "Tell me more about this meeting in Basel. I know nothing about this. What happened there? What are the issues discussed and will it affect us?"
        },
        {
          "role": "gm",
          "text": "Council of Basel 1431-45 A.D. Council Fathers - Papal Encyclicals papalencyclicals.net\n\nCATHOLIC ENCYCLOPEDIA: Council of Basle newadvent.org\n\nCouncil of Florence - Wikipedia wikipedia.org\n\nCouncil of Basel | Description, History, & Facts | Britannica britannica.com\n\nMedievalChurch.org.uk: Council of Basel (1431 - 1449) medievalchurch.org.uk\n\nCouncil of Basel (1431-1449) | WikiFreedom freedomgpt.com\n\nCouncil of Basel 1431-45 A laikos.org\n\nCouncil of Basle | Catholic Answers Encyclopedia catholic.com\n\nCouncil Of Basel | Encyclopedia.com encyclopedia.com\n\nBasel, Council of ccel.org\n\n1. The Council was called by Pope Martin V shortly before his death in February 1431\n2. It officially opened on July 23, 1431\n3. Cardinal Giuliano Cesarini was the papal legate presiding - the same cardinal who led the failed crusade against the Hussites\n4. In December 1431, Pope Eugene IV (the new pope) tried to dissolve the council, but the council refused\n5. This created a major conflict about whether the Pope or Church Councils have supreme authority\n6. The council invoked the decrees of Constance declaring councils superior to popes in certain matters\n7. Major issues being discussed:\n   - The Hussite heresy (invitation sent October 15, 1431)\n   - Church reform (especially limiting papal power and revenues)\n   - Reunion with the Greek/Eastern Church\n   - Papal supremacy vs conciliar supremacy\n\nEffects on Castile's crusade:\n- This is a major power struggle that could affect all church matters\n- If the council wins, it could mean more decentralized church authority\n- The Hussite negotiations show the church is willing to compromise with heretics when military force fails\n- The conflict between pope and council could distract from other crusades\n- Cardinal Cesarini, who just failed against the Hussites, is now leading the council negotiations\n\nThis is December 1431 in the game, so the council is just getting started and the pope has just tried to dissolve it.\n\nÁlvaro's expression becomes grave. He pulls over a chair and sits, clearly preparing for a lengthy explanation.\n\n\"Your Majesty, the Council of Basel may be the most significant ecclesiastical event of our generation—and it's unfolding right now.\" He leans forward. \"The implications for your crusade, for papal authority, for the entire structure of the Church... they're profound.\"\n\n\"The basics first: Pope Martin V—God rest his soul—called this council shortly before his death this past February. It officially opened on July 23rd in Basel, in Switzerland. The papal legate presiding is Cardinal Giuliano Cesarini.\" He pauses meaningfully. \"Yes, the same Cardinal Cesarini who just led the disastrous fifth crusade against the Hussites at Domažlice in August. When the crusaders fled in panic, he barely escaped with his life.\"\n\n\"When Cesarini arrived at Basel in September, attendance was sparse. The new Pope, Eugenius IV—a Venetian who succeeded Martin—looked at the meager turnout and in December issued a bull dissolving the council. He ordered everyone to reconvene at Bologna in eighteen months instead.\"\n\nÁlvaro's eyes gleam. \"But here's where it becomes explosive: the council refused to disperse. They invoked the decrees of the Council of Constance—the council that ended the Great Schism twenty years ago—which declared that in matters of faith, schism, and reform, a general council draws its authority directly from God and even the Pope must obey.\"\n\nHe stands and begins pacing. \"This is the fundamental question now tearing the Church apart: Who governs? The Pope? Or the councils? The council fathers at Basel believe the Pope has become too powerful, too corrupt, too focused on revenues and Italian politics. They demand reform of the Church 'in head and members'—meaning the papacy itself must be reformed.\"\n\n\"The main issues being debated:\n\nFirst, the Hussites: On October 15th—just last month—the council formally invited Hussite representatives to Basel to negotiate. This is extraordinary, Your Majesty. For sixteen years, the Church has been sending crusade after crusade against these heretics, all of which failed. Now, after Cesarini's humiliation at Domažlice, the council is negotiating with them as equals. They're discussing the 'Four Articles of Prague'—the Hussite demands for communion in both kinds, freedom of preaching, limitation of church property, and punishment of mortal sins regardless of rank.\n\nSecond, church reform: The council wants to strip away papal revenues—annates, provisions, all the fees that fund Rome. They want to limit papal authority over appointments, elections, and church governance. They're essentially trying to turn the papacy from an absolute monarchy into something more... consultative.\n\nThird, reunion with the Greeks: Both the Pope and the council want the glory of reuniting with the Eastern Church. The Byzantine Empire is desperate for help against the Turks and is willing to discuss church union. But who gets to negotiate? The Pope wants it in Italy, under his control. The council wants it at Basel, under theirs.\n\nFourth, the fundamental power struggle: Is papal supremacy absolute? Or are councils superior to popes? This question threatens the very structure of Church governance.\"\n\nÁlvaro returns to face you directly. \"Now, how does this affect Your Majesty and Granada?\n\nThe papal bull authorizing your crusade comes from Pope Martin V and has been confirmed by Eugenius IV. But if the council succeeds in asserting supremacy over the Pope, could they... modify it? Revoke it? Redirect resources? The legal foundation of your entire campaign depends on papal authority remaining strong.\n\nCompeting priorities: Every moment the Church spends negotiating with Hussites or arguing about governance is time not spent supporting Granada. Cardinal Cesarini, who should be championing crusades, is now embroiled in council politics.\n\nThe Hussite precedent: If the council successfully negotiates peace with heretics who defeated five crusades, what message does that send? That military failure forces the Church to compromise? That heretics can win through arms what they cannot through theology? Some might wonder whether Granada, if it proves too difficult, might also be subject to... negotiation rather than conquest.\n\nChurch revenues: The council wants to slash papal income. But papal income funds crusade infrastructure—diplomatic networks, indulgence collections, coordination of international efforts. A weakened papacy means less support for distant crusades.\n\nFractured authority: Right now, Christendom is watching the Pope and a council locked in battle, each claiming divine authority. This creates confusion about who speaks for the Church. When you need papal support—say, for additional bulls, for settling disputes with Military Orders, for pressuring reluctant nobles—will that authority be respected if half of Europe thinks councils are supreme?\"\n\nHe sits back down. \"Your Majesty, you've built your entire strategy on papal legitimacy. You carry the Pope's banner. You wield the True Cross. Your authority to command the Military Orders comes from papal bulls. But we're entering a period where that very authority is being contested at the highest levels of the Church.\"\n\n\"The optimistic view? The council might be so focused on Hussites and reform that they leave Granada crusades alone, especially since you have strong papal backing already. The pessimistic view? The entire edifice of papal crusading authority could be weakened just as you need it most.\"\n\nHe meets your eyes. \"I recommend we watch Basel very, very carefully. And perhaps... cultivate relationships with both sides of this dispute. Because whichever wins—Pope or council—we'll need their continued support for Granada.\"\n\nWhat are your thoughts on this situation?"
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_1431_00151",
      "book": 1,
      "chapter": "1.25",
      "date": "1431-10-15",
      "end_date": null,
      "type": "council",
      "summary": "Juan decides Castile must send representation to the Council of Basel but keeps Fray Hernando close rather than sending him. Instead, he orders a theological council convened in Toledo to develop Castile's official position on the Basel disputes before choosing delegates. Juan expresses nuanced views on papal authority -- seeing popes as divinely inspired but human. Alvaro advises careful framing: the council will be issued under Archbishop Garcia's authority, positioned as faithful inquiry rather than rebellion. Deliberations expected to take two to three weeks, with delegates departing for Basel by late November.",
      "characters": [
        "juan_ii",
        "alvaro_de_luna",
        "fray_hernando",
        "archbishop_cerezuela"
      ],
      "factions_affected": [
        "royal_court"
      ],
      "location": "Toledo",
      "tags": [
        "council_of_basel",
        "theology",
        "papal_authority",
        "church_reform",
        "delegation"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "It is now october 1431. When exactly is this council being held and should we not send someone to represent our interest? This does affect us and I have sworn to wield a blade against infidels and heretics. I have even discussed taking the sword to heretics like those in Bohemia with the pope himself. Do we have time to send a representative?"
        },
        {
          "role": "gm",
          "text": "Álvaro's face colors slightly—a rare sight. He stands abruptly and moves to his documents.\n\n\"Your Majesty... you are absolutely correct. And I confess this oversight.\" He shuffles through papers. \"The council opened on July 23rd—nearly three months ago. It is meeting right now, as we speak. Cardinal Cesarini has been presiding since September.\"\n\nHe turns back to you, looking genuinely chagrined. \"With the chaos of the Council of Seville, the princess's arrival, the Infantes' situation, the Aragonese complications... we failed to consider Basel. But you're right—this directly affects us, and we should have representation there.\"\n\nHe begins calculating on his fingers. \"Basel is in Switzerland, near the borders of the Empire and France. From Seville... a fast diplomatic party with proper escort could reach there in five to six weeks if they travel hard. Less if they take ship to Barcelona and then overland through Aragon and southern France, though given the current... temperature with Alfonso, that route might be problematic.\"\n\n\"The council shows every sign of continuing for months, possibly years. The Hussite negotiations alone will take considerable time—the delegation from Bohemia hasn't even arrived yet. They were only invited on October 15th, just two weeks ago.\"\n\nÁlvaro's tactical mind engages fully. \"Your Majesty should absolutely send representation. Here's why:\n\nFirst, you are conducting a papal crusade. You carry papal authority. The council is discussing crusades, heresy, and church reform—all directly relevant to Granada. If decisions are made about crusade funding, indulgences, or priorities, you need a voice at that table.\n\nSecond, your commitment to fight heretics as well as infidels—which you discussed with Pope Martin himself—makes your presence at a council dealing with the Hussite heresy both appropriate and expected. You've proven you can succeed where others failed. That carries weight.\n\nThird, the political reality: Right now the council and Pope Eugenius are headed toward confrontation. You have strong papal support, but the council has the support of many bishops and princes. If you cultivate relationships with both sides, you protect your crusade regardless of who wins this power struggle.\n\nFourth, Cardinal Cesarini himself is there. He just led the failed crusade against Hussites. You are leading a successful papal crusade. The contrast is... notable. A well-chosen representative could build a relationship with him, perhaps offering lessons learned, demonstrating that papal crusades can work when properly conducted.\"\n\nHe paces, thinking aloud. \"Who to send? This requires delicacy. We need someone with:\n\nTheological credibility to discuss heresy and crusade theology\n\nDiplomatic skill to navigate between Pope and council factions\n\nAuthority to speak for Your Majesty\n\nUnderstanding of crusade logistics and military matters\n\nEnough status to be taken seriously by cardinals and bishops\n\nArchbishop García would be ideal but he's too valuable here, managing the crusade preparations. Bishop Sancho of Ávila perhaps? Or...\" he pauses, \"what about Fray Hernando de Talavera? He has theological depth, diplomatic experience, and—crucially—he examined the Infantes. He understands heresy firsthand. He could speak with authority about both crusading and dealing with those who stray from orthodoxy.\"\n\nÁlvaro looks at you directly. \"But this is Your Majesty's decision. Who would you wish to represent Castile and the Granada crusade at Basel? And what should their instructions be?\"\n\nHe adds quickly, \"If we dispatch them within the week, they could arrive by late November or early December—still early in the council's proceedings. We haven't missed the opportunity, Your Majesty, though we should have thought of this sooner.\"\n\nWhat are your thoughts? Who should represent you at Basel, and with what instructions?"
        },
        {
          "role": "player",
          "text": "I do not want to send my own confessor away, I need him here.\n\n\nBut I do want to summon my own theological council here to Toledo. I want to discuss the impact this might have on our own church relations.\n\n\nI have seen popes Alvaro. Holy they mey be, but they are still humans with flaws and sins like every man. I do feel like sometimes the vatican feels a bit too much like they are speaking with Gods's authority when they may instead be divinely inspired, like I am. I would never claim to speak on behalf of God."
        },
        {
          "role": "gm",
          "text": "\"Your Majesty...\" He sits down slowly. \"What you've just said is both profoundly wise and profoundly dangerous. And I mean that with the utmost respect.\"\n\nHe leans forward, speaking quietly despite being alone. \"You are correct, of course. Popes are men. I've worked with them, negotiated with them, watched them make decisions based on Italian politics rather than divine guidance. Pope Martin—God rest his soul—was a shrewd politician as much as a holy father. Pope Eugenius is a Venetian with Venetian interests. They are divinely inspired, as you say, but they are not God's mouthpiece in the way some claim.\"\n\nHe pauses, choosing his next words carefully. \"But Your Majesty, this distinction—between divine inspiration and divine authority—is precisely what the Council of Basel is fighting about. And it's tearing the Church apart. Many at Basel would agree with you completely. Cardinal Cesarini himself might agree. But to say such things publicly, to organize a theological council in Toledo to discuss these matters...\"\n\nHe spreads his hands. \"It positions Castile in the middle of the greatest ecclesiastical crisis since the Great Schism. Which might be exactly where we need to be, but we must be careful.\"\n\nÁlvaro stands and begins pacing. \"A theological council in Toledo is an excellent idea. But we must frame it carefully. Not as 'questioning papal authority' but as 'seeking to understand how Castile can best serve the Church during this time of confusion.' Not rebellion, but faithful inquiry.\"\n\n\"Who to invite? This requires thought:\n\nArchbishop García of Toledo must preside—it's his see, his authority.\n\nThe other bishops—Sancho of Ávila, Diego of León, perhaps others from major sees. Get a range of perspectives.\n\nDoctors of theology from Salamanca and other universities. Men who understand canon law, church history, the writings of the Church Fathers.\n\nRepresentatives of the Military Orders—they answer to the Pope but operate in Castile. They need to understand where we stand.\n\nFray Hernando must attend, of course, even if not as your personal representative. His theological depth is essential.\n\nPerhaps representatives from major monasteries—Dominicans, Franciscans, Cistercians. Different orders have different perspectives on papal authority.\"\n\nHe turns back to you. \"The questions for this council to address—and Your Majesty, these must be framed carefully:\n\nOne: How should Castile respond to the dispute between Basel and Pope Eugenius? Do we support the Pope? The council? Remain neutral?\n\nTwo: What is the proper relationship between royal authority and papal authority in Castile? The Pope issued your crusade bull, but you wield the sword. Where does spiritual authority end and temporal begin?\n\nThree: If the Council of Basel makes decrees about crusades, church revenues, or ecclesiastical appointments—and Pope Eugenius rejects them—which does Castile follow?\n\nFour: How do we protect the Granada crusade's papal legitimacy while the very concept of papal legitimacy is being contested?\n\nFive: What theological principles should guide our understanding of church authority? Where do councils, popes, Scripture, and tradition stand in relation to each other?\"\n\nÁlvaro's expression becomes very serious. \"Your Majesty, I must warn you: this could be seen as extremely bold. Some might call it presumptuous for a king to convene a theological council. Others might see it as an act of faithful stewardship during uncertain times. The difference depends entirely on how we present it and what conclusions it reaches.\"\n\nHe meets your eyes. \"But here's the strategic value: if we convene this council, study these questions seriously, and arrive at carefully reasoned conclusions, then we can send a delegation to Basel representing not just Your Majesty personally, but Castile's considered theological position. That carries far more weight than a single envoy.\"\n\n\"The delegation could include several members of your Toledo council—perhaps a bishop, a doctor of theology, and a representative of the Military Orders. They could speak with authority about how these decisions affect not just Castile, but the entire crusading enterprise.\"\n\nHe pauses. \"There's also this to consider: France has already begun positioning itself. They have representatives at Basel. If Castile remains absent while France, Germany, and the Italian states are all present and arguing about the Church's future... we lose influence over decisions that directly affect us.\"\n\nÁlvaro returns to his seat. \"When should this Toledo council convene? How long should it deliberate? And what should its public purpose be—remembering that everyone in Europe will be watching what Castile does in response to Basel?\"\n\nHe adds quietly, \"And Your Majesty... regarding what you said about divine inspiration versus divine authority. You're not alone in thinking this. Many faithful, intelligent Catholics share your view. But be very careful who you say it to. Even thoughtful questioning of papal claims can be twisted into accusations of heresy by enemies. The Hussites began with similar questions, and now they've been fighting crusades for sixteen years.\"\n\nWhat are your instructions for this theological council?"
        },
        {
          "role": "player",
          "text": "Summon the council. I want to talk and discuss the matters facing our realm at this time and develop a position and choose delegates to send to Basel. That sounds very moderate right?"
        },
        {
          "role": "gm",
          "text": "\"Your Majesty, that is exceptionally moderate. In fact, it's exactly what a prudent, pious king should do.\" He nods approvingly. \"You're not rushing to pick sides in a church dispute. You're not making unilateral declarations. You're consulting with your own clergy, developing a considered theological position, and then engaging with Basel from a place of wisdom rather than impulse. It's the very model of responsible Christian kingship.\"\n\nHe begins making notes. \"This also sends exactly the right message to everyone watching: Castile takes matters of faith seriously. The king leading a papal crusade naturally wants to understand how ecclesiastical disputes might affect his sacred mission. You're seeking guidance from learned men before acting—the opposite of presumption.\"\n\n\"Practical arrangements: Toledo is the natural location—it's the primatial see of Hispania, gives proper ecclesiastical weight. We'll need two to three weeks to summon the participants from across Castile. Then perhaps two to three weeks of deliberation, depending on how complex the discussions become. That means...\" he calculates, \"delegates could depart for Basel by late November or early December. Still early enough to have real influence.\"\n\nHe looks up. \"Should we issue the summons under your royal authority, or should Archbishop García issue it at your request? The latter might seem more properly ecclesiastical, though everyone will know it comes from you.\"\n\n\"And one more thing, Your Majesty—this actually strengthens your crusade credentials. You're demonstrating that the king conducting a holy war thinks deeply about theological matters. That's the kind of seriousness that impresses both Rome and Basel.\"\n\nWhat title or framing should the summons use for this council?"
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_1431_00152",
      "book": 1,
      "chapter": "1.25",
      "date": "1431-10-15",
      "end_date": null,
      "type": "council",
      "summary": "Alvaro presents four reports requiring royal attention, drawn from d100 rolls (12, 35, 40, 78). A popular crusade ballad called 'The Young King's Sword' is boosting recruitment across Castile. Granada's Sultan Muhammad IX has executed three frontier commanders, suggesting desperation. Several clergy are making exaggerated indulgence promises including future sin forgiveness and guaranteed paradise. Finally, talented officer Don Rodrigo de Perea has received a lucrative offer from Alfonso V to serve in the Neapolitan campaigns, suggesting Aragon is actively competing for Castilian military talent.",
      "characters": [
        "juan_ii",
        "alvaro_de_luna",
        "muhammad_ix",
        "rodrigo_de_perea",
        "alfonso_v"
      ],
      "factions_affected": [
        "royal_court"
      ],
      "location": "Toledo",
      "tags": [
        "reports",
        "crusade_recruitment",
        "granada",
        "indulgences",
        "aragon",
        "morale"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "Let the archbishop issue the request.\n\n\nNow, finally ALvaro, when I summoned yuo for this meeting, you said there were also some other new issues and reports coming in. What other issues are there for us to discuss?\n\n\nDraft a d100 table of what this could be. These could positive or negative random events based on our timeline, what has happened or just realistic historical events based on precedent."
        },
        {
          "role": "gm",
          "text": "The table should have a mix of:\n- Minor positive events (1-30)\n- Neutral/mixed events (31-60)\n- Minor negative events (61-85)\n- Serious negative events (86-95)\n- Crisis events (96-100)\n\nLet me create a balanced table that reflects the current situation in late October 1431.\n\nÁlvaro nods approvingly at your decision about the Archbishop, then pulls out several sealed documents from his leather case.\n\n\"Your Majesty, I've been holding these reports until we finished the more pressing matters. Some require decisions, others are simply for your awareness.\" He spreads them on the table. \"Let me organize what we're dealing with...\"\n\nHe pauses, looking at the various seals and messengers' marks. \"Actually, Your Majesty, rather than overwhelm you with everything at once, perhaps you should choose which matter to address first. I've categorized the reports, but their importance varies considerably.\"\n\nÁlvaro arranges his papers and begins listing possibilities:\n\nD100 Table: Reports and Issues for Royal Attention (Late October 1431)\n\n1-15: VERY POSITIVE DEVELOPMENTS\n\nMajor Granadan commander secretly offers to defect with 500 troops and knowledge of frontier defenses\n\nWealthy converso merchant guild offers to provision entire crusade army for first campaign season at cost\n\nVenetian trading house proposes lucrative partnership for post-conquest Mediterranean trade routes\n\nReports that Sultan Muhammad IX is seriously ill; succession crisis brewing in Granada\n\nTalented military engineer from Italy arrives offering services; brings new siege weapon designs\n\nLarge deposit of iron ore discovered near Jaén; could supply armor and weapons locally\n\nThree minor Granadan frontier fortresses send feelers about possible peaceful surrender\n\nUnexpected bumper harvest across Castile; grain prices falling, treasury food costs reduced\n\nYoung military prodigy from minor nobility demonstrates exceptional tactical skill in tournament\n\nPortuguese King sends additional gift of artillery pieces and gunpowder for crusade\n\nGenoese offer to transport crusade supplies by sea at favorable rates\n\nPopular ballad about the crusade spreading rapidly; recruiting benefits significantly\n\nWealthy widow donates large estate specifically to fund crusader pensions\n\nReports of discord between Granadan Sultan and Marinid allies in North Africa\n\nSkilled cartographer completes detailed maps of Granada frontier approaches\n\n16-35: POSITIVE DEVELOPMENTS\n16. New group of 30 crusader volunteers from León, well-equipped minor nobility\n17. Successful raid by frontier forces captures Granadan supply convoy\n18. Letter from Duke of Burgundy expressing interest in crusade; may send observers\n19. Talented young clerk proves exceptional at logistics planning; Álvaro recommends promotion\n20. Local monastery completes production of 200 copies of inspirational crusade prayer book\n21. Merchants report Granadan economy strained by military preparations\n22. Exceptionally talented blacksmith willing to relocate to crusade staging areas\n23. Reports that morale in Granadan frontier garrisons is low\n24. Weather forecasts predict favorable conditions for spring campaign\n25. Minor noble house resolves internal dispute; will now fully support crusade\n26. Successful diplomacy: Navarre agrees to allow crusader recruitment in border regions\n27. University of Salamanca offers to send scholars to document crusade for posterity\n28. Frontier scouts report successful mapping of three mountain passes into Granada\n29. Popular preacher's crusade sermons drawing large crowds in northern cities\n30. Arsenal reports ahead of schedule on weapon production\n31. Jewish community requests permission to contribute financially to crusade (complex implications)\n32. Reports of good discipline among crusaders in Seville; few incidents\n33. Merchant guild offers interest-free loan for crusade expenses\n34. Talented physician volunteers to serve with crusade army\n35. Reports that Granada executing commanders who failed in border skirmishes (desperation?)\n\n36-60: NEUTRAL OR MIXED DEVELOPMENTS\n36. Delegation from Genoa and Venice simultaneously arrive; both want exclusive trade rights post-conquest\n37. Military Order requests clarification on command structure for campaign\n38. French observer arrives uninvited to \"learn from Castile's crusading methods\"\n39. Dispute between two crusader nobles over precedence; requires royal judgment\n40. Report that some clergy preaching crusade are making exaggerated promises about indulgences\n41. Question arises: should conversos be allowed to join crusade as full crusaders?\n42. Talented but arrogant young commander causes friction with other officers\n43. Request from several nobles: can family members join campaign as observers?\n44. Debate among clergy: how to handle Granadan civilians after conquest?\n45. Some northern nobles express concern about extended absence from their estates\n46. Reports of miracle at shrine near Jaén; pilgrims flocking there (good for morale but causing congestion)\n47. Merchants want clarity on who gets trading rights in conquered territories\n48. Question of what to do with Infantes' confiscated properties; several nobles requesting grants\n49. Princess Isabel asks about role for Portuguese ladies in supporting crusade (delicate)\n50. Debate: should crusade target weakest Granadan positions first or make bold strike?\n51. Some crusaders becoming impatient with delay; want to fight immediately\n52. Request to establish formal crusade treasury separate from crown finances\n53. Granadan ambassador requests audience (what do they want to negotiate?)\n54. Reports of Granadan scouts probing Castilian frontier defenses\n55. Question arises about pay rates for different types of troops\n56. Several noble families want their house colors incorporated in crusade heraldry\n57. Dispute over billeting arrangements for crusaders in Seville\n58. Request for clarification: can crusaders bring personal retainers beyond agreed numbers?\n59. Reports that some clergy collecting crusade funds may be skimming donations\n60. Question about protocol: do Infantes commanders have precedence over other nobles?\n\n61-80: NEGATIVE DEVELOPMENTS\n61. Reports of banditry increasing on roads to Seville; merchants nervous about crusade supply lines\n62. Smallpox outbreak in village near Jaén staging area; quarantine required\n63. One of the promised crusader contingents reports they'll be two months late\n64. Dispute between Military Orders over who controls which frontier castles post-conquest\n65. Fire in Seville warehouse destroys significant quantity of stored grain\n66. Reports that some frontier nobles conducting unauthorized raids into Granada (could provoke early war)\n67. Talented crusader commander seriously injured in training accident\n68. Unexpected shortfall in projected tax revenues; budget may be tighter than planned\n69. Some clergy beginning to question whether crusade should wait for more preparation\n70. Reports of desertion: several crusaders having second thoughts and leaving Seville\n71. Dispute over artillery allocation; multiple commanders want same limited guns\n72. Noble family feud threatens to disrupt crusader unit cohesion\n73. Report that Granadan Sultan offering bounties for Castilian heads; raids intensifying\n74. Quality control issue: some weapons from contractors prove substandard\n75. Friction between crusaders and Seville residents; some incidents of violence\n76. Reports that some recruitment promises may have been overly generous; can't afford to honor all\n77. Weather damage to road that's critical for supply transport\n78. Talented officer receives better offer from Aragon; considering leaving\n79. Reports of dissension among Taborites could inspire similar radicalism among Castilian lower clergy\n80. Some nobles privately expressing doubt about spring timeline being realistic\n\n81-92: SERIOUS NEGATIVE DEVELOPMENTS\n81. Major Granadan raid penetrates deep into Castilian territory; several villages burned\n82. Serious illness strikes crusader camp; dozens sick, some deaths\n83. Key bridge on supply route collapses; major detour required\n84. Reports that Marinid reinforcements heading to Granada from North Africa\n85. Assassination attempt on prominent crusade supporter (failed, but alarming)\n86. Major noble announces he must withdraw from crusade due to urgent family crisis\n87. Scandal: senior clergy member caught embezzling crusade funds\n88. Reports that Aragon actively trying to recruit some of your crusaders for their own purposes\n89. Serious breakdown in discipline among one crusader unit; requires harsh punishment\n90. Intelligence suggests Granada knows detailed information about crusade plans (spy?)\n91. Unexpected diplomatic crisis with Portugal over commercial dispute (threatens alliance)\n92. Major ammunition stockpile explosion; significant casualties and material loss\n\n93-97: CRISIS DEVELOPMENTS\n93. Rebellion in northern province; noble house refuses to send promised troops, claims you're neglecting kingdom for crusade\n94. Reports that Pope Eugenius considering recalling or modifying crusade authorization due to Basel dispute\n95. Major Granadan preemptive strike: large army invading Castilian frontier\n96. One of the Infantes vanishes from Seville; possible flight or kidnapping\n97. Sudden death of Archbishop García; succession crisis at worst possible moment\n\n98-100: CATASTROPHIC DEVELOPMENTS\n98. Multiple simultaneous crises: rebellion in north + Granadan invasion + crusader mutiny\n99. Intelligence reports massive Marinid invasion force preparing to reinforce Granada; far larger than expected\n100. King Alfonso of Aragon declares formal opposition to crusade; threatens to interfere actively\n\nÁlvaro looks up from his papers. \"Your Majesty, which category of matter shall we address first? Or would you prefer I simply present the most urgent issue?\"\n\nHe adds quietly, \"I should note that some of these reports are preliminary and require investigation before we can act. Others demand immediate attention.\"\n\nWhat would you like to roll for, or shall Álvaro present matters in order of his assessment of urgency?"
        },
        {
          "role": "player",
          "text": "I rolled 40, 12, 35 and 78.\n\n\nUse these four outcomes and incorporate them in the story.\n\n\nWhat reports does Alvaro present?"
        },
        {
          "role": "gm",
          "text": "\"Your Majesty, let me present these in order—starting with encouraging news and moving to matters that require more... consideration.\" He picks up the first document, and his expression is genuinely pleased.\n\n\"First, something remarkable:\" He unfolds a piece of parchment with musical notation and verse written on it. \"A popular ballad about the crusade has begun spreading through the taverns and markets of Castile. It's called 'The Young King's Sword' or sometimes 'The Banner of the True Cross.' Listen to the refrain:\n\n'Juan the Just with heaven's might,\nBears the Cross into the fight,\nGranada's moon shall fade to black,\nWhen Spain's true king comes marching back.'\n\nIt's quite rousing, actually—catchy melody, memorable words. Reports from Burgos, Valladolid, Toledo, even Barcelona say people are singing it. More importantly...\" he taps another report, \"our recruitment officers say the ballad is having a tangible effect. Young men are arriving in Seville humming it, saying they heard it in their villages and felt called to join the crusade. One officer estimated it's worth an additional twenty to thirty volunteers in the past two weeks alone.\"\n\nHe smiles slightly. \"The people are turning your crusade into legend before it's even begun, Your Majesty. That's powerful. Though I'll note the lyrics do set rather... high expectations for success.\"\n\nHe sets that aside and picks up the second document, his expression becoming more serious.\n\n\"Second, intelligence from the Granada frontier:\" \"Our agents report something interesting—and potentially significant—from within Granada. Sultan Muhammad IX has apparently executed at least three commanders in the past month. The charges were 'cowardice and failure' after losing skirmishes on the frontier.\"\n\nÁlvaro looks up. \"Now, this could mean several things. On one hand, it suggests the Sultan is taking the threat of our crusade very seriously—he's not tolerating any weakness. On the other hand, executing your own commanders is often a sign of desperation or poor judgment. It creates fear rather than loyalty. Several Granadan officers have reportedly requested transfers away from frontier commands, and morale among their garrison troops is said to be declining.\"\n\nHe taps the document. \"The question is whether this represents Granada steeling itself for determined resistance, or whether it indicates the Sultan is already rattled—perhaps fearful that Allah has withdrawn favor after the Council of Seville's spiritual display. Our intelligence suggests it may be the latter. The executions seem... excessive. Panic disguised as strength.\"\n\n\"We should watch this carefully. A desperate Sultan makes different decisions than a confident one.\"\n\nHe picks up the third document, and his expression becomes disapproving.\n\n\"Third, a matter requiring Your Majesty's attention:\" \"We have reports from multiple cities—Burgos, León, Salamanca—that certain clergy members preaching the crusade are making... shall we say, exaggerated promises about indulgences.\"\n\nHe reads from the report: \"'Any man who takes the cross will have ALL sins forgiven, including future sins, and is guaranteed entry to Paradise regardless of his deeds.' Another preacher in Ávila reportedly said: 'A crusader can commit no sin while fighting the Moors, for any act in service of Christ is sanctified.' And one particularly enthusiastic friar in Burgos claimed: 'One day fighting in Granada earns more merit than a lifetime of prayer.'\"\n\nÁlvaro sets down the document with clear distaste. \"Your Majesty, these are not the terms of Pope Martin's bull. The indulgences granted are substantial, yes—remission of temporal punishment for confessed sins. But these preachers are promising things the Church cannot deliver. This is theologically problematic and, frankly, borders on the kind of indulgence abuse that Jan Hus condemned—the very heresy we're supposed to oppose.\"\n\nHe meets your eyes. \"The practical effect is double-edged. On one hand, it's attracting recruits—men who believe they've purchased salvation with their swords. On the other hand, it sets false expectations. What happens when these men commit sins in camp and realize they're not actually immune to guilt? What happens if they survive the crusade and confess to priests who tell them the promises were false?\"\n\n\"Moreover, if this reaches Basel—and it will—it gives ammunition to those who say papal crusading authority is corrupt and abused. Cardinal Cesarini himself might use this as evidence that crusade preaching needs reform.\"\n\nHe spreads his hands. \"We should probably issue some guidance to the clergy about accurate presentation of indulgence terms. But I leave that to Your Majesty's judgment. Do we risk dampening enthusiasm by correcting the exaggerations, or do we risk worse problems by letting them continue?\"\n\nFinally, he picks up the fourth document, and his expression is genuinely troubled.\n\n\"Fourth, a concerning development:\" \"Your Majesty, do you remember Don Rodrigo de Perea? The young commander who distinguished himself at the tournament last month—excellent tactical mind, trained in military engineering, one of our more promising officer recruits?\"\n\nHe pauses. \"We've received word that King Alfonso of Aragon has extended him an offer. A significant offer—command of a company in the Neapolitan campaigns, generous pay, a grant of land in Sicily upon successful conclusion of the Italian wars. And...\" Álvaro's jaw tightens, \"the offer was apparently delivered by one of the Aragonese courtiers who attended your Council of Seville. They've been watching our preparations closely.\"\n\n\"Don Rodrigo hasn't accepted yet—he sent word to Álvaro asking for counsel. But Your Majesty, this is troubling on multiple levels. First, we're losing talented officers we can ill afford to lose. Second, it suggests Alfonso is not merely withdrawing support for our crusade but actively competing with us for military talent. Third, if this becomes a pattern—if Aragon begins offering better terms to our crusaders—it could undermine our entire recruitment effort.\"\n\nHe sets down the document. \"The immediate question is what to do about Don Rodrigo specifically. Do we match the offer? Do we appeal to his honor and faith? Do we let him go and accept that some men will choose Italian adventure over holy war? And the larger question: how do we counter Aragon's interference without escalating tensions with Alfonso?\"\n\nÁlvaro sits back, having presented all four matters. \"Your Majesty, these are the reports requiring attention. The ballad is simply good news to celebrate. The Granadan executions we should monitor. But the indulgence preaching and the Aragonese recruitment both require decisions.\"\n\nHe looks at you expectantly. \"Which would you like to address first? Or do you have thoughts on all of them?\""
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_1431_00153",
      "book": 1,
      "chapter": "1.25",
      "date": "1431-10-15",
      "end_date": null,
      "type": "legal",
      "summary": "Juan orders immediate guidance issued to clergy correcting exaggerated indulgence preaching, emphasizing the crusade is not license for pillage or sin. Letters will also go to Seville and Malaga warning that new recruits may have false impressions. On the officer situation, Juan takes a principled stance: men who have not sworn crusade vows are free to leave with the crown's blessing, while those who have taken vows before the True Cross are bound to complete the Granada campaign first. In a private moment, Juan confides to Alvaro his growing distinction between Christianity as faith and the Vatican as institution -- a dangerous but intellectually honest theological reflection that Alvaro shares but urges be kept absolutely secret.",
      "characters": [
        "juan_ii",
        "alvaro_de_luna",
        "rodrigo_de_perea"
      ],
      "factions_affected": [
        "royal_court"
      ],
      "location": "Toledo",
      "tags": [
        "indulgences",
        "crusade_discipline",
        "papal_authority",
        "theology",
        "free_will",
        "secrecy"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "I am most concerned about these overly positive and zealous recruitments for our crusade. We must issue guidance immediately that this is not what the crusade is about. We will also write Seville and the army in Malaga that new recruits may have the wrong impressions. I want to make it absolutely clear that these acts are not to be tolerated in the crusade, we are not pillaging in the name of the lord. If we act now, we prevent this becoming a real disaster I think.\n\n\nAnd concerning our officers; if they are free to leave, then they are free to leave and we send them to Aragon with our blessing. But everyone who has sworn crusade before the cross is not free to leave and do something else. We are all committed to first complete the Grenada crusade, recieve our worldly reward and thenm seek other goals. So it really depends if this young officer is allowed to leave both because of his crusader vows and according to his feudal contract. The crown will not intervene, in fact if he chooses to leave, we send him on his way with our blessing. Men are free to choose what they will."
        },
        {
          "role": "gm",
          "text": "This is still the same meeting in October 1431, so we're wrapping up this discussion session.\n\nÁlvaro's expression shifts immediately to one of profound relief and approval.\n\n\"Your Majesty, that is exactly the right decision on the preaching.\" He stands, energized. \"This is precisely the kind of judgment that will distinguish your crusade from the disasters we've seen elsewhere. You're thinking not just about recruitment numbers, but about the soul of this enterprise.\"\n\nHe begins making notes rapidly. \"I'll draft the guidance immediately. We'll send it under the authority of Archbishop García—more appropriate coming from ecclesiastical authority—but making clear it reflects your will as Supreme Commander. The key points:\n\nTo the clergy: The indulgences granted by the papal bull are substantial and genuine, but they require genuine contrition, confession, and amendment of life. They do not create immunity from sin or guarantee salvation regardless of conduct. Any preacher who claims otherwise is misrepresenting Church teaching and undermining the crusade's spiritual legitimacy.\n\nTo the army: Every crusader remains accountable to God and to military discipline. The crusade is a holy war, yes, but holiness requires righteousness in conduct. Pillaging, rape, unnecessary cruelty—these are sins whether committed against Christians or Moors. We fight to bring Christian rule to Granada, not to indulge our basest impulses.\"\n\nHe looks up. \"This will disappoint some who joined expecting license to behave badly. We may lose a few recruits. But Your Majesty, those are precisely the men we don't want. Better to have fewer crusaders of good character than more who think they carry a divine permission slip for sin.\"\n\nHe sets down his pen. \"And frankly, this protects us at Basel. If Cardinal Cesarini or others criticize crusade preaching, we can point to your directive as evidence that Castile takes these concerns seriously. It's good theology, good policy, and good politics all at once.\"\n\nRegarding Don Rodrigo, Álvaro flips through some documents.\n\n\"Let me check his status...\" He scans a roster. \"Ah. Don Rodrigo attended the Council of Seville and expressed interest in joining the crusade. He participated in training exercises and accepted a provisional officer's commission. But...\" Álvaro looks up, \"he has not yet appeared before Fray Hernando for examination, and he has not taken formal crusader vows before the True Cross.\"\n\nHe sets down the document. \"So by your principle, Your Majesty, he is free to leave. He made no sacred oath. His feudal obligations to his lord—the Count of Osuna—are a matter between them, not the Crown's concern.\"\n\nÁlvaro pauses, considering. \"Your Majesty's position is remarkably principled. 'Men are free to choose what they will.' In an age where kings press men into service and bind them with increasingly complex obligations, you're... respecting their agency. It's unusual. And possibly expensive in the short term.\"\n\nHe begins pacing slowly. \"The practical implications: If word spreads that officers can leave for better opportunities, we may lose more talented men to Aragon, Burgundy, or Italian campaigns. On the other hand, those who stay will be here because they genuinely want to be—they believe in the crusade, not just the pay. That creates a different kind of army.\"\n\nHe turns back to you. \"And the signal it sends to Alfonso is interesting. You're not competing with him for men's loyalty. You're not getting into a bidding war. You're simply... offering a holy cause, and trusting men to choose correctly. It's either profoundly confident or...\" he smiles slightly, \"perhaps it's both wisdom and faith combined.\"\n\n\"Should I send word to Don Rodrigo? Something to the effect of: 'His Majesty thanks you for your service in training and preparations. As you have not taken sacred crusader vows, you remain free in conscience and law to pursue whatever opportunities you deem best. If you choose Aragon's offer, you go with the Crown's blessing. If you choose to stay and take crusader vows, you will be welcome and honored. The choice is yours alone.'\"\n\nÁlvaro raises an eyebrow. \"That should thoroughly confuse the Aragonese agents who expected us to panic and make counter-offers.\"\n\nHe returns to his seat. \"Are there any other instructions regarding these matters, Your Majesty? Or shall I begin drafting the guidance on indulgence preaching immediately?\""
        },
        {
          "role": "player",
          "text": "Draft these letters according to your suggestions Alvaro.\n\n\nThis council of Basel is interesting to me. Never really doubted papal authority, but maybe it's good to have limits on the power any mortal man wields.\n\n\nI am also questioning now the difference between christianity anmd the vatican. Yesterday they seemed one and the same, but now... I dont know. But we will keep this between us Alvaro."
        },
        {
          "role": "gm",
          "text": "Álvaro freezes in the act of gathering his papers. For a long moment, he doesn't move. Then, very deliberately, he sets everything down, walks to the door, and checks that it's firmly closed. He returns and sits, his expression more serious than you've ever seen it.\n\n\"Your Majesty,\" he says quietly, \"what you just said... I need you to understand how dangerous those words are.\"\n\nHe leans forward, speaking barely above a whisper despite the empty room. \"I'm going to say something I've never said to anyone, not even my confessor. I've had the same thought. The exact same thought. And it terrified me.\"\n\nHe glances at the door again, then continues. \"I've worked with popes, Your Majesty. I've negotiated with cardinals, managed papal diplomacy, watched the machinery of the Vatican operate up close. And I've seen... men. Ambitious men, political men, sometimes holy men, but always men. Men who make mistakes, who have favorites, who sometimes confuse their political interests with God's will.\"\n\nHe spreads his hands. \"And yet we're taught that this institution is the Church, that to question Rome is to question Christianity itself, that the Pope speaks with divine authority. But if that were absolutely true...\" he pauses, choosing words carefully, \"then how do we explain the Great Schism? Three popes simultaneously, each claiming divine authority, each excommunicating the others. Which one was truly speaking for God? All of them? None of them?\"\n\nÁlvaro stands and paces to the window, keeping his voice low. \"What you're realizing, Your Majesty, is the difference between the faith—Christianity, the teachings of Christ, the salvation of souls—and the institution that administers it. They're not identical. They should be aligned, and often are, but they're not the same thing.\"\n\nHe turns back. \"The Vatican is a human institution, created to serve Christianity. But like all human institutions, it has... drift. Politics. Self-interest. The question is whether that drift has become so severe that the institution sometimes works against the faith it's supposed to serve.\"\n\nHis expression becomes very grave. \"But Your Majesty, here's why I checked the door and why we must never speak of this outside this room: Jan Hus had similar thoughts. He looked at the corruption in the Church, the sale of indulgences, the political machinations, and said 'This institution has strayed from true Christianity.' And they burned him for it. Sixteen years of war have followed.\"\n\n\"The Council of Basel is having this same debate, though they frame it more carefully—they speak of 'reform in head and members,' of councils having authority to correct popes, of returning to early Church practices. They're trying to find a way to criticize the institution without being accused of denying the faith. It's a razor's edge.\"\n\nÁlvaro returns to his seat, speaking with quiet intensity. \"Your Majesty, you can hold these thoughts privately. You can act on them carefully—like convening the Toledo council to think through these questions with learned men. But you must never express them publicly, not even to bishops you trust completely. Why? Because once you've questioned whether the Vatican equals Christianity, someone will ask: 'Then where does your crusade's authority come from? If the Pope is just a man, why does his bull matter?'\"\n\nHe meets your eyes. \"The answer, of course, is that the crusade's authority comes from God, from the righteousness of the cause, from the faith of the crusaders. But most people can't think that abstractly. They need the Pope to be special, the Vatican to be sacred, or else the whole edifice of religious authority crumbles in their minds.\"\n\nÁlvaro's voice becomes even quieter. \"I'll tell you what I've concluded, after years of wrestling with this. The Church—capital C, the universal body of Christian believers—is holy and guided by the Holy Spirit. The Vatican—the human institution—is flawed and needs constant reform. The Pope is divinely inspired when teaching faith and morals, but he's still a man who can make political mistakes. And our duty is to serve the Church while working to reform the institution, without ever admitting publicly that we see a difference.\"\n\nHe pauses. \"It's exhausting. It requires constant mental gymnastics. But it's the only way to be both intellectually honest and politically safe.\"\n\n\"The Toledo council will help, Your Majesty. We can explore these questions in theological terms, with learned men who understand the nuances. We can develop a sophisticated Castilian position that respects papal authority while also asserting appropriate limits. But we must frame it all very, very carefully.\"\n\nÁlvaro stands. \"I'll draft the letters as we discussed. And Your Majesty? Thank you for trusting me with your thoughts. The fact that you're thinking about these things—really thinking, not just accepting what you're told—that's what makes you a good king. But please, for both our sakes, keep these questions between us until we have the theological council to explore them properly.\"\n\nHe gathers his papers. \"Is there anything else you need before I begin the drafting?\""
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_1431_00154",
      "book": 1,
      "chapter": "1.25",
      "date": "1431-10-15",
      "end_date": null,
      "type": "council",
      "summary": "Chapter concludes with a comprehensive summary of the session's events: budget review, Aragonese succession analysis, Bohemian situation and Council of Basel, decision to convene a Toledo theological council, random event resolutions, and Juan's private theological awakening about the distinction between faith and institutional church authority.",
      "characters": [
        "juan_ii"
      ],
      "factions_affected": [],
      "location": "Toledo",
      "tags": [
        "chapter_end",
        "summary"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "Lets wrap up the chapter here.\n\n\nCreate a new document and put a summary of all events of this chat in it. Name it \"Chapter 25\""
        },
        {
          "role": "gm",
          "text": "1. Juan II and Álvaro de Luna discussed the budget and treasury situation - operating on a deficit but managing for now\n2. Discussion of Aragonese succession - who are the heirs now that the Infantes have been disinherited\n3. Extended discussion about the situation in Bohemia and the Hussite Wars\n4. Detailed explanation of the Council of Basel (1431) - its purposes, conflicts with Pope Eugenius IV, implications\n5. Juan decided to convene a theological council in Toledo to develop Castile's position\n6. Random events rolled: 40 (exaggerated indulgence preaching), 12 (popular crusade ballad), 35 (Granadan executions showing desperation), 78 (officer considering leaving for Aragon)\n7. Juan's decisions on these matters - issuing guidance against false indulgence claims, allowing officers to leave if not sworn\n8. Private conversation about papal authority vs. Christianity - very sensitive discussion\n\nI'll create a comprehensive chapter summary document.\n\nCreate File: Creating Chapter 25 summary document covering the discussion of budget, Aragonese succession, Council of Basel, theological questions, and various reports requiring royal attention\n\nGood! I've created the comprehensive chapter summary. Now I should provide the user with a link to view it and give them a brief wrap-up message to close out the chapter.\n\nPerfect! I've created a comprehensive summary of Chapter 25.\n\nView Chapter 25 Summary\n\nThis chapter covered significant ground—from the Aragonese succession question and the Hussite Wars, to the Council of Basel and its implications for your crusade. Most importantly, it captured Juan's profound theological awakening: the distinction between Christianity as faith and the Vatican as institution, and the dangerous but necessary questions about authority that emerged from witnessing the Basel crisis.\n\nThe chapter ends with several critical decisions made:\n\nIssuing guidance against exaggerated indulgence preaching to maintain the crusade's spiritual integrity\n\nRespecting free will in officer retention rather than competing with Aragon\n\nConvening the Toledo theological council to develop Castile's considered position\n\nAnd that remarkable private conversation with Álvaro about the limits of papal authority\n\nThe stage is now set for Chapter 26, which will likely focus on the Toledo council's deliberations and the selection of delegates to represent Castile at Basel—all while crusade preparations continue and the theological questions you've raised begin to find their answers.\n\nExcellent roleplay! The way Juan is grappling with these complex questions shows real character development and sets up fascinating tensions for the future."
        }
      ],
      "roll": null
    }
  ]
}
