{
  "chapter": "1.24",
  "book": 1,
  "event_count": 8,
  "date_range": "1431-10-17 / 1431-10-18",
  "events": [
    {
      "event_id": "evt_1431_00141",
      "book": 1,
      "chapter": "1.24",
      "date": "1431-10-17",
      "end_date": null,
      "type": "personal",
      "summary": "Juan reunites with Isabel in their private chambers at the Toledo Alcazar after arriving from the Ronda campaign. He tells her about declaring Islam finished in Ronda, the proud widow who chose exile over life under Christian rule, and the safe passage offered to those who left. Isabel processes the complexity of Muslim subjects living under Christian governance. They pray together in Isabel's Portuguese chapel corner, where Juan's heartfelt prayer reveals the depth of his love, moving Isabel to tears. They retire to bed together.",
      "characters": [
        "juan_ii",
        "isabel_of_portugal"
      ],
      "factions_affected": [],
      "location": "Toledo",
      "tags": [
        "reunion",
        "prayer",
        "marriage",
        "ronda",
        "faith",
        "intimate"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "HI,\n\n\nI am with Isabel just after arriving in Toledo and just enjoy her company."
        },
        {
          "role": "gm",
          "text": "Perfect! I have the context. Chapter 23 ended with Juan arriving in Toledo on the evening of October 17, 1431, after a seven-day journey from Ronda. He reunited with Isabel, who is now six months pregnant. They went to their private chambers together, and the chapter ended with them beginning to talk and reconnect.\n\nNow for Chapter 24, the player says they want to enjoy Isabel's company. This is a perfect intimate moment to narrate. I need to:\n\n1. Keep it SHORT - we're in an active scene with dialogue potential\n2. NOT write Juan's dialogue or actions\n3. Describe the atmosphere and Isabel's state/reactions\n4. Stop after presenting a natural point for Juan to respond or act\n5. Be historically authentic and emotionally genuine\n\nSince they just arrived and are in private chambers, I should narrate the quiet, intimate atmosphere of their reunion. Isabel is six months pregnant, has been terribly worried, and they haven't seen each other for two months since their parting at Jaén in August.\n\nKey facts to remember:\n- Isabel is 6 months pregnant (due January/February 1432)\n- They last saw each other in late August when she left Jaén\n- She's been deeply worried about his safety\n- They have a prayer routine together (evening prayers)\n- The Portuguese chapel corner is important to her\n- She's been brave but the worry has been hard\n- Juan took Ronda through negotiation rather than siege\n- The campaign has been going well overall\n\nI should create a warm, intimate scene but stop before writing Juan's words or actions.\n\nChapter 24: In Toledo's Embrace\n\nPART I: THE QUIET HOURS (October 17, Evening)\n\nTheir chambers in the Alcázar feel impossibly peaceful after months of campaign camps and fortress walls. The evening light filtering through the high windows is soft, golden—so different from the harsh Andalusian sun.\n\nIsabel sits in the chair by the Portuguese chapel corner, one hand resting on her swollen belly, watching you with an expression caught between contentment and lingering disbelief. The carved Virgin Mary you gave her in August stands in its place of honor, surrounded by fresh flowers and well-used prayer cushions.\n\n\"I kept thinking,\" she says quietly, \"that you wouldn't really come back. That something would happen—some battle, some treachery. Every messenger who arrived at the gates, my heart would stop.\" She touches the Virgin Mary's base. \"I must have prayed the rosary a thousand times these past two months.\"\n\nThe baby moves visibly beneath her gown—a rolling motion, a stretching limb. Isabel's face softens with wonder, the way it always does when it happens. \"The physicians say everything is progressing well. The baby's strong. Active. They think...\" She pauses, almost shy. \"They think it might be a boy, from how I'm carrying. But they're not certain.\"\n\nOutside, the city of Toledo settles into evening routines. Distant sounds of vendors closing their stalls, church bells marking vespers, the general hum of a city that doesn't know war is still raging three hundred miles south.\n\nIsabel looks at you, really looks at you—studying your face the way she couldn't in the courtyard with everyone watching. \"You're different,\" she observes. \"Not the armor or the dust. Something in your eyes. What happened at Ronda?\""
        },
        {
          "role": "player",
          "text": "I tell her about Ronda and how I declared Islam finished there. I tell her about the widow who stormed off furiously instead of staying in the new situation."
        },
        {
          "role": "gm",
          "text": "Isabel listens intently, her hands going still on her belly. When you finish, she's quiet for a long moment, processing what you've told her.\n\n\"Islam... finished,\" she repeats softly, testing the words. Her brow furrows—not in anger, but in that thoughtful way she has when wrestling with something difficult. \"An entire city. Thousands of souls, all baptized in a single decree.\"\n\nShe shifts in her chair, wincing slightly as the baby kicks. \"I should be joyful. I am joyful that they've accepted baptism, that they can be saved now. But Juan...\" She looks at you directly, her plain face earnest. \"The woman who left—the widow. She chose exile over Christ. How many others stayed only because they had nowhere to go? Because the alternative was losing everything?\"\n\nA pause. She touches the Virgin Mary statue again, as if drawing strength from it. \"I pray every night for the conversion of the infidel. I've prayed for your crusade's success, for Granada to fall. But I always imagined... I don't know. Willing converts. Hearts genuinely turned. Not thousands baptized because a king commanded it.\"\n\nShe's not accusing—her tone is gentle, questioning. \"Tell me you truly believe they can become good Christians. That this wasn't just... military necessity dressed in holy purpose.\"\n\nHer eyes search yours, needing reassurance from her husband even as her faith troubles over the method."
        },
        {
          "role": "player",
          "text": "You misunderstood Isabel. They did not convert, in fact the papal bull prohibits forced conversion. They stay muslim, those who could not live as a muslim under christian rule left."
        },
        {
          "role": "gm",
          "text": "Oh, I made a significant error. Let me reread what the user said:\n\n\"I tell her about Ronda and how I declared Islam finished there.\"\n\nI interpreted this as forced conversion, but the user is now clarifying that:\n1. The papal bull prohibits forced conversion\n2. They remain Muslim\n3. Those who couldn't accept living as Muslims under Christian rule left (like the widow)\n\nSo \"Islam finished there\" must mean something different - perhaps the end of Islamic *rule* or *political power* there, not the end of Islam as a religion. The Muslims remain Muslim but are now subjects under Christian governance.\n\nThis is a very different situation. Isabel misunderstood (because I had her misunderstand), and now the user is correcting both Isabel and me.\n\nLet me correct this naturally through dialogue.\n\nIsabel blinks, clearly surprised. \"They... they're still Muslim?\"\n\nShe sits forward slightly, confusion crossing her face. \"I'm sorry, I misunderstood. I thought when you said Islam was finished—\" She stops herself, recalibrating. \"So they remain in their faith, but under your rule? As subjects of Castile?\"\n\nHer hand moves unconsciously to her prayer beads, fingers working through them as she processes this. The confusion deepens into something more complex—not quite relief, but not quite comfort either.\n\n\"Forgive me, but I don't understand. How is Islam 'finished' if they still practice it? If they still have their mosques and their prayers?\" She's genuinely trying to grasp what you're describing. \"And the widow who left—she left because she couldn't accept being Muslim under Christian rule? Not because you forced her to convert?\"\n\nShe looks down at her belly, then back to you. \"I've been taught that Muslims are enemies of Christ. That they hold lands that rightfully belong to Christians. But if they're now your subjects, living in your cities, paying your taxes...\"\n\nShe trails off, clearly wrestling with categories that don't quite fit together in her worldview. \"What does it mean for them? What does it mean for us? For the kingdom?\""
        },
        {
          "role": "player",
          "text": "The muslims are proud Isabel. You will understand when you meet some. Many will convert in time to christianity, some never will. We cannot move men's hearts, only God can.\n\n\nDid you expect Grenada to convert willingly the moment I conquered them?"
        },
        {
          "role": "gm",
          "text": "\"No,\" she admits quietly. \"I suppose I didn't think it through properly. In my prayers, I always imagined... victory. The cross raised over Granada. But I never truly considered what came after. The people still there, still living their lives, still believing what they've always believed.\"\n\nShe's silent for a moment, thinking. \"You're right that I haven't met them. Any of them. I've lived my whole life in palaces and courts where everyone was Christian. Everyone I've ever known has been Christian.\" A rueful smile touches her lips. \"I must seem terribly foolish to you.\"\n\nThe baby kicks again and she winces, adjusting her position. \"Proud, you say. I can understand pride. The Portuguese are proud too—sometimes to our detriment.\" She considers this. \"So they'll live as Muslims in a Christian kingdom. Pay taxes, obey laws, but keep their faith. And some, in time, may choose Christ of their own will.\"\n\nShe looks at you more carefully. \"Is that why the widow left? Because her pride wouldn't allow her to live under our rule, even though you weren't forcing conversion?\"\n\nThere's less confusion now, more genuine curiosity. She's trying to understand the reality of what you're building, not just the idealized version she'd imagined."
        },
        {
          "role": "player",
          "text": "Last year, she was the wife of the governor, a high position in society and her three boys had it good. Today, she is a single mother with no station. She has lost her position in society which relied solely on her husband and the position he had. Not only did he die, I took over the position as well. I offered her to stay, but it would be very hard. She refused, the loss too much to bear. I had hoped differently, but I do understand her. She was furious and hurt."
        },
        {
          "role": "gm",
          "text": "Isabel's face softens with understanding, and something like pain crosses it. Her hand goes to her belly protectively—an instinctive gesture.\n\n\"Three sons,\" she says quietly. \"And she lost everything in one battle. Her husband, her home, her place in the world.\" She's silent for a moment. \"Of course she was furious. What else could she be?\"\n\nShe looks at you with new comprehension. \"This is what you carry, isn't it? Not just the battles and the strategy, but... all of them. The widow and her sons. The people who stay because they have no choice. The ones who convert out of hope or fear or genuine faith, and you'll never know which.\"\n\nA tear slips down her cheek unexpectedly. She brushes it away, almost annoyed with herself. \"I'm sorry. The pregnancy makes me weep at everything. But I'm thinking of her—traveling somewhere with three children, no husband, no position. Starting over completely.\"\n\nShe reaches for your hand. \"You did what you could. You offered her the chance to stay. But grief and pride and loss... those don't follow reason.\" Her voice is gentle. \"Did you at least give her safe passage? Money for the journey?\"\n\nThe question isn't accusatory—she trusts you did. But she needs to know this small mercy was shown."
        },
        {
          "role": "player",
          "text": "I offered safe passage to everyone who wanted to leave. In fact, I am glad they left. Those who remained will not rebel and will live in peace.\n\n\nCan we just pray together now Isabel? I want to rest and hold you afterwards."
        },
        {
          "role": "gm",
          "text": "Isabel's face transforms—relief and joy replacing the pensive worry. \"Yes. Of course. I've been longing to pray with you again.\"\n\nShe rises from her chair with some effort, one hand supporting her belly, and moves to the chapel corner. She kneels carefully on one of the well-worn prayer cushions, then looks back at you with such open affection that it's almost startling to see on her usually reserved face.\n\n\"I've prayed alone every evening since you left,\" she says softly. \"But it's not the same. This—\" she gestures to the space beside her, \"—this is what I've missed most.\"\n\nShe waits for you to join her, her hand already reaching for her rosary beads, her eyes already beginning to close in that peaceful way she has when preparing for prayer."
        },
        {
          "role": "player",
          "text": "I sit beside her and lay my hand on her back for a moment.\n\n\nThen I let her start the prayer."
        },
        {
          "role": "gm",
          "text": "Isabel's eyes close, and her voice—quiet, steady, intimate—begins the Ave Maria. You can feel the tension leaving her body under your hand as she settles into the familiar rhythm of prayer.\n\nShe leads through the evening prayers with practiced ease, her Portuguese accent softening the Latin. When she reaches the personal petitions, her voice becomes even quieter, more private:\n\n\"Blessed Mother, thank you for bringing him home safely. Watch over him still—the war is not finished. Protect him when he returns to it.\" A pause, her hand moving to her belly. \"And this child... let it be healthy. Let me be strong enough for the birth. Let us be a family as you were with Joseph and our Lord.\"\n\nHer voice catches slightly. \"For all those in Ronda—Christian and Muslim alike—grant them peace. For the widow with three sons, wherever she goes... be her comfort.\"\n\nShe continues in silence for a time, lips moving soundlessly, fingers working through her rosary beads. The room fills with the peaceful quiet of shared prayer, the dying light through the windows painting everything in warm gold.\n\nFinally, she crosses herself and opens her eyes, turning to look at you with such contentment that six months of marriage seem to dissolve into this single moment.\n\n\"Thank you,\" she whispers simply."
        },
        {
          "role": "player",
          "text": "Narrate the following action. Include everything I say in your narration:\n\n\nI turn to prayer myself.\n\n\nO merciful God, I am like a blind sheep following your call. I know there is danger everywhere, but I know you lead me through ity all, that as long as I follow your voice, no harm can befall me. That as long as I am in your service, you will not abandon me.\n\n\nBe with Isabel when I am away and she fears for my safety. Show her through her faith that I am your faithful servant and under your protection. Grant her comfort in that.\n\n\nYou know my heart o lord. You know that being your soldier comes easy now. I know what is expected of me and I know what to do. I cannot also be here with Isabel at the same time. You know how hard I find that. I always knew I would be tested as your servant, but I never expected that being away from the person I love would be my hardest test.\n\n\nGrant me and my wife strength o lord. So that together we may make your kingdom on earth real.\n\n\nIn Jesus name,\n\n\nAmen."
        },
        {
          "role": "gm",
          "text": "You turn to your own prayers, bowing your head beside her. Your voice is quiet but steady in the dim chamber:\n\n\"O merciful God, I am like a blind sheep following your call. I know there is danger everywhere, but I know you lead me through it all, that as long as I follow your voice, no harm can befall me. That as long as I am in your service, you will not abandon me.\n\n\"Be with Isabel when I am away and she fears for my safety. Show her through her faith that I am your faithful servant and under your protection. Grant her comfort in that.\n\n\"You know my heart, O Lord. You know that being your soldier comes easy now. I know what is expected of me and I know what to do. I cannot also be here with Isabel at the same time. You know how hard I find that. I always knew I would be tested as your servant, but I never expected that being away from the person I love would be my hardest test.\n\n\"Grant me and my wife strength, O Lord. So that together we may make your kingdom on earth real.\n\n\"In Jesus' name, Amen.\"\n\nWhen you open your eyes, Isabel is looking at you. Tears stream down her face—not sad tears, but something deeper. Her hand finds yours and grips it tightly.\n\n\"Juan,\" she whispers, her voice thick with emotion. \"I didn't know... I thought perhaps you saw me only as duty. As the alliance with Portugal. But you love me.\"\n\nShe's trembling slightly, overwhelmed. \"And it hurts you to be away. You've been carrying that, and I never knew.\""
        },
        {
          "role": "player",
          "text": "I carefully lift her up and carry her to bed.\n\n\nSometimes I feel like I will never understand you at all, Isabel. Is this what I hear other men say about women being irrational? I have told you that I love you so many times. I would not have said it if I did not mean it. Surely you only now find that out do you?"
        },
        {
          "role": "gm",
          "text": "You lift her carefully—she's heavier with the pregnancy, but you manage—and carry her to the bed. She clings to you, still crying, half-laughing through her tears at your words.\n\n\"You have told me,\" she admits as you set her down gently on the bedding. \"Many times. And I believed you. I did.\" She wipes at her eyes, frustrated with herself. \"But Juan, there's a difference between telling me you love me, and telling God that being apart from me is your hardest test.\"\n\nShe catches your hand before you can move away. \"When you speak to me, you're a king speaking to his queen. You're considerate, you're kind, you say what a good husband should say. But just now...\" Her voice breaks slightly. \"You weren't performing duty. You weren't being the king. You were speaking from your heart to God, and you said—\" She can't finish, overcome again.\n\n\"You said loving me was harder than the war,\" she whispers. \"That you find it easy to be God's soldier, but hard to be away from me. Do you understand what that means? That I matter that much?\"\n\nShe pulls you down to sit beside her. \"I'm not being irrational. I'm just... I'm understanding the depth of it for the first time. And it makes everything—the waiting, the fear, all of it—it makes it bearable. Because we're carrying it together.\"\n\nShe reaches up to touch your face. \"I love you too. So very much.\""
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_1431_00142",
      "book": 1,
      "chapter": "1.24",
      "date": "1431-10-18",
      "end_date": null,
      "type": "council",
      "summary": "Juan meets with Alvaro de Luna the morning after his arrival to discuss his strategic agenda: a vision of unified Iberia through multi-generational marriage alliances, the upcoming Cortes tax reform with the 7-8% base rate and service credits system, establishing a naval and trade policy to capitalize on captured Mediterranean ports, and the Perpetual Crusade Fund concept. Alvaro outlines a four-day Cortes strategy beginning with celebrating victories, distributing Granada lands, then presenting reform proposals.",
      "characters": [
        "juan_ii",
        "alvaro_de_luna"
      ],
      "factions_affected": [
        "royal_court"
      ],
      "location": "Toledo",
      "tags": [
        "strategy",
        "cortes",
        "taxation",
        "naval_policy",
        "unified_iberia",
        "planning"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "We sleep and rest and tomorrow I set up a meeting with Alvaro de Luna."
        },
        {
          "role": "gm",
          "text": "You wake to pale morning light and the sound of church bells marking prime. Isabel is still asleep beside you, one hand resting protectively on her belly even in sleep. The lines of worry that have marked her face these past months seem softer now.\n\nYou let her rest and dress quietly, servants moving efficiently to prepare you for the day. The armor and travel-stained clothes from yesterday have been cleaned and stored; today you're dressed as a king in his capital, not a crusader fresh from campaign.\n\nWord is sent to Don Álvaro de Luna: the king requests his presence in the council chamber at his earliest convenience.\n\nThe response comes within the hour. The Constable will attend you immediately.\n\nWhen Álvaro arrives, he looks remarkably well-rested for a man managing a kingdom. His dark eyes are sharp, assessing you quickly—noting, no doubt, that you look better than you did upon arrival last night. He bows formally.\n\n\"Your Majesty. I trust you and the Queen had a peaceful evening?\" There's the faintest hint of knowing warmth in his voice—he genuinely approves of your marriage to Isabel, you've learned. \"Welcome home. Toledo has felt your absence keenly these past two months.\"\n\nHe settles into the chair across from you, already pulling out several documents from the leather case he carries. \"I have much to report—the Cortes preparations, correspondence from the armies, financial matters, and several... complications that have arisen. But perhaps you'd prefer to begin with your own news from Ronda? The reports that arrived were spectacular, but I'd value hearing the details directly.\"\n\nHe waits attentively, ready to discuss whatever you wish to prioritize."
        },
        {
          "role": "player",
          "text": "I tell him everything that has happened so he is fully informed. I trust him implicitly.\n\n\nThen, I set out what I want to discuss.\n\n\nI have a vision of a unified Iberia. I want to discuss how I can unite all crowns. \nAt the upcoming Cortes, I want to set up a system that will allow the nobles to continue to support conquest overseas. \nI also want to reform the tax code, like we discussed earlier. 8% tax on revenue for nobles where the proceeds go into an eternal crusade (or conquest treasury), and we use that money to fund future expansions against heathens and heretics. \nI want to discuss how we develop Castille's naval and trade policies now that we have taken most of the ports. This means more taxes and more control for me as well. \nI want to discuss how the letters to other christian nations are developping and if we have had any more foreign aid. \nI want to discuss the painting of my marriage that we have commissioned. Have we found a renaissance painter yet?"
        },
        {
          "role": "gm",
          "text": "The unified Iberian vision requires careful diplomatic maneuvering. Marriage alliances could be key - particularly with the Infantes de Aragón situation and Navarre's position. I'll propose strategic connections that gradually consolidate power without creating immediate political backlash.\n\nFor the Cortes and conquest mechanism, we need a compelling framework that incentivizes nobles. The land distribution in Granada provides an excellent initial carrot, but we'll need a longer-term strategy that makes overseas conquest financially attractive. The proposed 8% tax could fund this, creating a perpetual conquest fund that gives nobles both risk and reward.\n\nThe tax reform is politically delicate. Nobles have historically been exempt, so this 8% will face resistance. I'll recommend a phased approach - perhaps starting lower, with clear benefits like first access to conquered lands, trading rights, and potential noble titles in new territories.\n\nOur naval and trade policy must capitalize on our newly captured Mediterranean ports. We'll need significant infrastructure investment, but these ports offer unprecedented trade opportunities. I'll suggest detailed plans for customs, ship construction, and potential trade agreements with emerging maritime powers.\n\nForeign aid letters require a nuanced approach. We'll draft carefully worded missives that highlight our strategic importance and potential mutual benefits, without appearing desperate or weak.\n\nThe Renaissance painter commission is a subtle but important diplomatic and cultural move. I'll recommend seeking a painter who can capture not just images, but the emerging spirit of our expanding kingdom.\n\nÁlvaro listens intently as you recount everything—Ronda's negotiated surrender, Muhammad ibn Hariz's baptism, the widow's departure, Don Rodrigo's continuing operations. He takes notes occasionally, nodding at key points, his expression thoughtful.\n\nWhen you lay out your agenda, he sets down his quill and looks at you for a long moment. Then he smiles—not his usual political smile, but something genuine and almost wondering.\n\n\"Your Majesty, when you left for Santiago two years ago, you were an eighteen-year-old idealist with a papal bull and a dream. Now you return speaking of unified Iberia, perpetual conquest treasuries, and Mediterranean trade policy.\" He shakes his head slightly. \"The crusade has forged you into something remarkable. Very well. Let us address each matter systematically.\"\n\nHe pulls out a fresh sheet of parchment. \"Unified Iberia. The most ambitious goal, and the longest timeline. Let me assess each crown honestly:\"\n\n\"Aragon: The Infantes de Aragón situation is... complicated. King Alfonso V is your cousin, childless so far, focused on Mediterranean expansion toward Naples. The Infantes—Juan and Enrique—are his brothers but also your enemies from their rebellion. Paradoxically, if Alfonso dies without heir, Juan of Aragón inherits. Your enemy becomes king of Aragon.\" He pauses. \"But there's another path: your children. If you have a daughter, she could be betrothed to Alfonso or his heir. If you have a son, he might marry an Aragonese princess. Two generations, perhaps three, but achievable through marriage.\"\n\n\"Portugal: You're already married to King João's daughter. If João has no male heir—and he has only daughters so far—Isabel or her sisters inherit. Your son could claim Portugal through his mother. But Juan,\" Álvaro's voice becomes careful, \"Isabel will struggle with this. Portugal fought hard for independence from Castile. Proposing reunification, even gently, could damage your marriage. Tread carefully.\"\n\n\"Navarre: Small, weak, caught between France and Iberia. Conquerable militarily, but France would object. Better through marriage alliance. They're always looking for protection. Patient diplomacy, another generation or two.\"\n\nHe looks up. \"Summary: Unified Iberia is a multi-generational project. You lay groundwork through marriages, alliances, and your children's betrothals. You won't see it completed, but your grandchildren might. Is that acceptable?\"\n\n\"The Cortes and Overseas Conquest System.\" Álvaro taps his quill thoughtfully. \"This is brilliant, actually. The nobles have tasted conquest—they've seen the land grants, the wealth, the glory. If you can institutionalize their desire for more, you create a self-perpetuating expansion mechanism.\"\n\n\"Here's what I propose: At the Cortes, after distributing Granada lands, you announce a new royal policy. Any future conquests—whether in Africa, the Atlantic islands, or elsewhere—will follow the same model. Nobles who contribute troops and funds receive proportional land grants in conquered territories. But—and this is key—participation is voluntary. No feudal obligations, just opportunity.\"\n\n\"Pair this with your tax reform. The 8% revenue tax funds a 'Royal Conquest Treasury.' Nobles pay into it, but they also benefit from it through land grants when conquests succeed. It's an investment scheme dressed in crusading rhetoric.\" He grins. \"Some will hate it. But the ambitious ones—the Mendozas, the younger sons looking for estates—they'll love it.\"\n\n\"The challenge is the first part: getting them to accept the 8% tax at all.\"\n\n\"Tax Reform.\" Álvaro's expression becomes serious. \"This is your biggest fight at the Cortes. Currently, nobles pay almost nothing—they're exempt from most taxation. You're proposing an 8% revenue tax. That's... substantial.\"\n\n\"Your advantages: First, you're distributing massive Granada land grants simultaneously. Carrot and stick together. Second, you frame it as crusade taxation, not general revenue. Third, you've just won the greatest military victory in a century—your prestige is at its peak. Fourth, the papal bull explicitly authorizes crusade taxation.\"\n\n\"Your disadvantages: Nobles will resist any new taxes instinctively. Some will argue they've already paid in blood—their knights died in Granada. Others will claim economic hardship. The traditional privileges of nobility include tax exemption.\"\n\n\"My recommendation: Present it as a limited, temporary measure initially—say, ten years to fund 'completion of the Reconquista and expansion into Africa.' Make it sound finite even though you intend it to be permanent. Get them used to paying it. Then, when renewal comes in 1441, it's already established practice.\" He smiles wryly. \"It's easier to continue a tax than to create one.\"\n\n\"Also, consider graduated rates. The greatest nobles—dukes, counts—pay 8%. Lesser nobles pay less, say 5-6%. It reduces resistance from the minor nobility who have less to give.\"\n\n\"Expect a fight. Budget three, maybe four days of intense Cortes debate on this alone.\"\n\n\"Naval and Trade Policy.\" Álvaro becomes animated—this clearly excites him. \"We've captured most of Granada's Mediterranean coast. Málaga is a superb port—one of the finest in Iberia. Vélez-Málaga, Marbella, the others—all functional harbors. This changes everything.\"\n\n\"Currently, Castilian maritime trade is minimal. We're a land power. But now we can develop a Mediterranean fleet for both war and commerce. I propose several measures:\"\n\n\"First: Establish a Royal Maritime Office based in Málaga. Customs duties on all goods passing through our captured ports—say, 10% on imports, 5% on exports. This generates substantial revenue and gives you control over trade flows.\"\n\n\"Second: Encourage shipbuilding. Offer tax incentives to merchants who build ships in Castilian ports. We need a merchant fleet, not just warships.\"\n\n\"Third: Recruit experienced sailors and navigators. Málaga had a significant maritime population—many stayed after your terms. Use them. Also recruit from Genoa, Venice, Portugal. Your marriage to Isabel gives you Portuguese contacts.\"\n\n\"Fourth: Consider Atlantic exploration. The Portuguese are already pushing down the African coast—Henry the Navigator's project. If we develop naval capacity, we could sponsor similar expeditions. The Canary Islands, the Azores, perhaps beyond. But that's years away—focus on Mediterranean consolidation first.\"\n\nHe pulls out a document. \"I've been corresponding with Genoese merchants. They're very interested in access to our new ports, especially if you guarantee security and reasonable customs rates. They could bring capital, expertise, ships. But they'll want privileges—tax breaks, legal protections. Worth negotiating?\"\n\n\"Foreign Aid and Recruitment.\" Álvaro's expression becomes more reserved. \"The letters have had... mixed results. The responses so far:\"\n\n\"Portugal: King João sent polite congratulations on Ronda. No offer of troops or funds, but warm diplomatic language. He's pleased you're married to Isabel and that the crusade succeeds. He hints that if you need Portuguese naval assistance in the Mediterranean, he'd consider it—for appropriate compensation.\"\n\n\"Aragon: King Alfonso sent a terse acknowledgment. He congratulates your victory but makes no offer of aid. The subtext is clear: he's focused on Naples, not Granada. Also, the Infantes situation makes him wary of helping you.\"\n\n\"France: No response yet. Frankly, I don't expect one. They're embroiled in the Hundred Years' War with England. They have no attention to spare for Iberian matters.\"\n\n\"England: Also no response. Same reason as France—they're fighting each other.\"\n\n\"German principalities: I sent letters to several. One response so far, from the Duke of Bavaria. He sends 'spiritual support and prayers' but no material aid. He suggests we appeal to the Holy Roman Emperor, but Emperor Sigismund is elderly and distracted by Hussite heretics in Bohemia.\"\n\n\"Italian states: Mixed. Venice sends congratulations and trade proposals—they're merchants first. Genoa likewise. Milan's Duke Filippo Maria Visconti sends a personal letter praising your 'strategic brilliance' at Ronda and offers to send military advisors if you want them—Milanese condottieri captains who could teach modern Italian tactics. That might actually be valuable.\"\n\nHe sets down the papers. \"The hard truth, Your Majesty: Foreign aid is minimal because everyone is busy with their own wars. But trade opportunities are substantial—Italian merchants want access to your ports, Portuguese want cooperation, etc. That's where the real benefit lies.\"\n\n\"The Marriage Painting.\" Álvaro brightens considerably—he's clearly pleased with this. \"Yes. I've found someone exceptional.\"\n\n\"I sent inquiries to Flanders—that's where the finest painters are right now. The Flemish have developed revolutionary techniques with oil paints, incredible detail and realism. And I've secured the services of Jan van Eyck, court painter to Philip the Good, Duke of Burgundy.\"\n\n\"Van Eyck is expensive—500 florins for the commission, plus travel and accommodation costs. But he's worth it. His work is extraordinary—he painted the Duke of Burgundy's wedding portrait recently, and the detail is unlike anything I've seen. Every jewel, every thread of fabric, perfectly rendered. He's a master.\"\n\n\"He'll arrive in Toledo in late November, after the Cortes. He'll need you and Isabel to sit for him—perhaps a dozen sessions over two months. The final painting will be ready by spring 1432, after the baby is born. We could include the child if you wish, or keep it just you and Isabel.\"\n\nÁlvaro smiles. \"It will be a masterpiece, Your Majesty. Something to hang in the Alcázar for centuries. Future generations will see you as you are now—young, victorious, at the height of your power.\"\n\nHe sets aside his documents and looks at you directly. \"That's my assessment of all your proposals. Which do you want to discuss in more depth? The Cortes tax fight will be intense—we should strategize carefully. And the naval policy requires immediate decisions if we want to capitalize on our port captures.\"\n\nWhat draws your attention most urgently?"
        },
        {
          "role": "player",
          "text": "The above response is incorrect. Maybe look at the project files better and search for past chapters.\n\n\nThe infantes situation is very different; I let both infantes abandon all claims and titles, including those of their children. This eliminates a lot of contenders for the Aragonese crown.\n\n\nWe have also already had extensive talks about the taxes we are about to propose. Nothing I mention is new and Alvaro should know this.\n\n\nLook at the project files and re-draft the response. Also, exclude the painter and the foreign aid parts for now, I want to roll on a d100 table later to see how successful we have been in these efforts."
        },
        {
          "role": "gm",
          "text": "Good. Now I have a much better understanding. Let me draft a better response that incorporates what Álvaro already knows from previous discussions:\n\n1. The Infantes have renounced all claims to Aragon for themselves AND their descendants (including Carlos)\n2. Alfonso V's succession is now complicated - his brothers renounced\n3. They've already had extensive discussions about tax reform - 7-8% base rate with service credits\n4. They've discussed the naval/maritime shift\n5. They've discussed the Perpetual Crusade Fund concept\n6. Juan's vision of unified Iberia has been discussed before\n\nSo Álvaro should be recapping what they've already discussed and helping Juan refine the strategy, not hearing these ideas for the first time.\n\nÁlvaro listens intently as you recount everything—Ronda's negotiated surrender, Muhammad ibn Hariz's baptism as Fernando, the widow's departure, Don Rodrigo's continuing operations. He takes notes occasionally, nodding at key points, his expression thoughtful.\n\nWhen you lay out your agenda, he sets down his quill and looks at you for a long moment. Then he leans back, considering.\n\n\"The Cortes will be your moment to implement everything we've discussed over the past year,\" he says. \"Let me walk through each piece and where we stand.\"\n\nUnified Iberia\n\n\"Your long-term vision remains sound, but it's a multi-generational project—you know this already. The situation with Aragon has become more complex after the Infantes' renunciations.\"\n\nHe pulls out a document. \"Alfonso V has no heir after years of marriage to María. His brothers—both Infantes—have renounced all claims to Aragon's throne for themselves and their descendants. That means Carlos is out, too. Alfonso's succession is now... uncertain. He's focused on Naples, but he must be thinking about this constantly.\"\n\n\"Your best path remains patience. Continue supporting his Italian ambitions. Let María work quietly. Build the relationship over decades. If Alfonso designates you or your heir, it should feel like his idea, not your scheme.\"\n\n\"Portugal is already secured through Isabel—your father-in-law is allied to you. If João has no male heir, Isabel or her sisters could inherit. Your children might eventually unite both crowns through their mother's claim. But Juan,\" his voice becomes careful, \"never mention this to Isabel directly. The Portuguese fought hard for independence. Even hinting at reunification will hurt your marriage.\"\n\n\"Navarre is small, weak—easier. But France would object to outright conquest. Better through diplomacy and marriage alliances over time.\"\n\nHe sets the document aside. \"You're laying groundwork. Your grandchildren might see unified Iberia. That's acceptable, yes?\"\n\nThe Cortes Tax Reform\n\nÁlvaro's expression becomes serious. \"This is the fight. Everything we've planned comes to fruition here.\"\n\n\"The framework we developed: 7-8% base rate on actual current revenues, with substantial service credits. Every month of personal military service reduces the tax burden. Every hundred men provided and maintained earns significant credits. Maximum reduction up to half the total tax.\"\n\n\"This accomplishes multiple goals: It's genuinely fair—rewards those who actually fight. It eliminates the corruption where nobles claim service while charging the crown. It incentivizes exactly the warrior culture you want. And politically, it gives nobles a choice: fight and save money, or pay full rate.\"\n\n\"The assessment teams are ready—43 trained assessors. We'll start with the greatest houses to demonstrate the tax falls on those most able to pay: Mendoza, Álvarez de Toledo, Guzmán. Joint authority with ecclesiastical observers to prevent accusations of bias.\"\n\nHe taps the table. \"Your advantages: First, you're distributing massive Granada land grants simultaneously. Carrot and stick together. Second, you frame it as crusade taxation under papal authority—the bull explicitly authorizes it. Third, your prestige is at its peak after Ronda. Fourth, nobles have tasted conquest and want more.\"\n\n\"Your challenge: Nobles will resist instinctively. Some will claim they've already paid in blood. Others will argue economic hardship. Traditional noble privilege includes tax exemption.\"\n\n\"I recommend framing it carefully at the Cortes: This is not a new burden, but a modernization. The old patchwork system—where the Duke of Medina Sidonia pays 1% while some lesser nobles pay 4%—is unjust and inefficient. We're creating equality before the law. Everyone pays the same percentage of actual revenue, with the same opportunity for service credits.\"\n\n\"Also emphasize the Perpetual Crusade Fund framing we discussed. This isn't just taxation—it's investment. Nobles who serve in future conquests earn land grants proportional to their contribution. They're paying into a system that rewards them.\"\n\nHe pauses. \"Expect three, maybe four days of intense debate. Some great houses will resist loudly. But others—particularly ambitious younger sons and military families—will see the opportunity. The new Granada estates you're granting will be taxed at 3-4%, setting a modern standard. That creates pressure on old nobility to accept similar rates.\"\n\nNaval and Trade Policy\n\n\"We've captured most of Granada's Mediterranean coast—this changes everything, just as we discussed. Málaga is a superb port. You can now develop real maritime power.\"\n\n\"I propose establishing a Royal Maritime Office based in Málaga. Customs duties on all goods—say 10% on imports, 5% on exports. This generates substantial revenue and gives you control over trade flows.\"\n\n\"Encourage shipbuilding with tax incentives. Recruit experienced sailors—many stayed in Málaga after your terms. Also recruit from Genoa, Venice, Portugal. Your marriage to Isabel gives you Portuguese contacts, and they're ahead of us in maritime development.\"\n\n\"The strategic shift we discussed is accelerating: Castile is moving from land power to naval power. After Granada falls, you won't need fifty noble armies. You'll need professional fleets and standing forces funded by trade revenue. The nobles don't see this yet—they still think in terms of castles and retinues. But within a generation, real power will flow through ports and ships, not feudal levies.\"\n\nHe grins slightly. \"Which is why locking in their taxation now, while they still feel militarily relevant, is brilliant timing.\"\n\nThe Cortes Strategy\n\nÁlvaro leans forward. \"Here's how I suggest you approach the Cortes:\"\n\n\"Day One: Celebrate the victories. Ronda, the coastal conquests, Alcalá la Real. Remind them of the crusade's success. Let them feel the glory.\"\n\n\"Day Two: Distribute the Granada lands. Make this generous—reward those who fought. Create gratitude. Show that service to the crown brings tangible rewards.\"\n\n\"Day Three: Present the tax reform. Frame it as modernization and equality, paired with the service credit system. Emphasize the Perpetual Crusade Fund—this isn't extraction, it's investment in future conquests where they'll earn more land.\"\n\n\"Day Four (if needed): Negotiate with resistant houses individually. Remind them of their land grants. Point out that new Granada nobility pays 3-4%. Offer minor concessions to save face, but hold the line on the fundamental structure.\"\n\n\"The combination of gratitude from land grants, religious fervor from crusade success, your personal prestige after Ronda, and the service credit system should carry the day. But it will be a fight.\"\n\nHe sets aside his notes and looks at you directly. \"I'll prepare detailed documentation for each proposal. We'll have three days before the Cortes to refine the presentations. And Juan—\" he permits himself a slight smile, \"—what you've accomplished this campaign season is extraordinary. You've conquered half of Granada in eight months, taken Ronda without a siege, and broken their raiding network. You're negotiating from a position of absolute strength.\"\n\n\"The Cortes will be difficult, but you'll prevail. The question is: which proposals do you want to prioritize if we need to make tactical concessions?\"\n\nWhat aspect concerns you most?"
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_1431_00143",
      "book": 1,
      "chapter": "1.24",
      "date": "1431-10-18",
      "end_date": null,
      "type": "diplomacy",
      "summary": "Roll 99 on d100 table for foreign Christian support produces an unprecedented international response to Juan's crusade appeals. Total contributions reach approximately 440,000 florins plus extensive military and trade support. Major contributions include: Pope Martin V's dying legacy of 30,000 florins plus Cardinal Pietro Donato as papal legate and universal indulgences; France sends 40,000 florins and 300 Joan of Arc veterans under Jean de Metz; Burgundy commits 50,000 florins with master craftsmen including cannon founder Jean Hennecart; Italian consortium (Genoa, Venice, Florence) offers 120,000 florins with naval assets and Medici banking; Milan sends 20,000 florins plus condottieri including Francesco Sforza; Hungary sends 25,000 florins and Janos Hunyadi; Portugal adds 40,000 florins with full naval cooperation offer. German principalities contribute 60,000 florins with 150 volunteer knights.",
      "characters": [
        "juan_ii",
        "alvaro_de_luna",
        "pope_martin_v",
        "jean_de_metz",
        "janos_hunyadi"
      ],
      "factions_affected": [
        "royal_court"
      ],
      "location": "Toledo",
      "tags": [
        "foreign_aid",
        "diplomacy",
        "crusade",
        "finances",
        "d100_roll_99",
        "unprecedented"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "Now lets draft a d100 table regarding the foreign support requests I have sent out. We waited to do so until we have had some success in Grenada. Now that we have, we hope that other christian nations will honour the papal bull and support us as well.\n\n\nGiven the letters we sent out earlier, draft a d100 table to find out how the other nations respond."
        },
        {
          "role": "gm",
          "text": "Good! Now I have the information I need. Based on the project knowledge:\n\n1. In August 1431 (Chapter 22), Juan instructed Álvaro to draft letters requesting contributions from Christian kingdoms\n2. The targets were: France, England, Italian states, Holy Roman Empire (at Álvaro's discretion)\n3. The strategic reasoning was to wait until after demonstrating success before requesting aid\n4. Pope Martin V had earlier brought letters to foreign monarchs (France, England, Holy Roman Emperor, Hungary, Poland) announcing the crusade\n5. The decision was made to wait until after the first campaign season to send them\n\nIt's now October 1431, and Juan has had significant success:\n- Ronda taken without siege through negotiation\n- Coastal fortresses captured\n- Battle of Alcalá la Real won\n- Much of Granada conquered\n\nSo the timing makes sense for these letters to have been sent and for responses to be coming in.\n\nNow I need to create a d100 table for foreign support. Let me consider each power:\n\n**France:** Embroiled in Hundred Years' War with England. Charles VII is dealing with aftermath of Joan of Arc's execution (1431). Unlikely to provide significant support, but might send token aid or good wishes.\n\n**England:** Also fighting Hundred Years' War. Henry VI is young. Very unlikely to help.\n\n**Holy Roman Empire:** Emperor Sigismund is dealing with Hussite Wars in Bohemia. Distracted, but might appreciate crusading efforts.\n\n**Italian States:**\n- Venice: Merchants, pragmatic\n- Genoa: Also merchants\n- Milan: Duke Filippo Maria Visconti\n- Florence: Republic\n- Papal States: Already supporting\n\n**Hungary:** Dealing with Ottoman threat directly\n\n**German Principalities:** Various responses possible\n\n**Portugal:** Already allied through marriage, but João I is old\n\n**Aragon:** Complicated due to Infantes situation\n\nThe roll should reflect:\n- Most powers are too busy with their own conflicts\n\n- Some might send token financial support\n- Italian merchants might see trade opportunities\n- A few might send military advisors or small contingents\n- Very low chance of major support\n\nBased on the project knowledge, I can see that in August 1431 you instructed Álvaro to draft letters to France, England, Italian states, and the Holy Roman Empire (plus others at his discretion) requesting contributions. The timing was strategic—after demonstrating success with Ronda, Alcalá la Real, and the coastal conquests.\n\nLet me create a d100 table for the foreign response:\n\nD100 TABLE: FOREIGN CHRISTIAN SUPPORT FOR THE GRANADA CRUSADE\n\nContext\n\nLetters were sent to major Christian powers in August-September 1431, after demonstrating significant crusade success. Responses arrive in October-November. Most European powers are dealing with their own conflicts (Hundred Years' War, Hussite Wars, Ottoman pressures), but your victories might inspire some support.\n\n1-15: DISAPPOINTING RESPONSE - Polite Words, No Substance\n\nWhat Arrives:\n\nFormal letters of congratulation from most courts\n\nFrance: \"Engaged with English threat, prayers for your success\"\n\nEngland: \"Focused on French war, spiritual support only\"\n\nHoly Roman Emperor: \"Dealing with Hussite heretics, cannot spare resources\"\n\nGerman principalities: Various polite refusals\n\nHungary: \"Fighting Ottomans ourselves, understand your struggle\"\n\nTangible Aid: None. Just diplomatic pleasantries.\n\nÁlvaro's Assessment: \"They're busy with their own wars. We're on our own, but that's what we expected.\"\n\n16-35: MINIMAL SUPPORT - Token Gestures\n\nWhat Arrives:\n\nMost courts send congratulations\n\nFrance: 2,000 florins \"as token of support,\" suggestion to send any captured Moorish slaves to French galleys\n\nBurgundy: Duke Philip the Good sends 1,500 florins and offers trade concessions\n\nGerman principalities: 3-4 minor princes send total of 3,000 florins\n\nHungary: Letter from King Sigismund expressing solidarity against infidels, 1,000 florins\n\nTotal Financial Aid: ~7,500 florins\nOther Aid: Trade offers, diplomatic good wishes\n\nÁlvaro's Assessment: \"Better than nothing. The money helps, but nobody's sending troops. They see this as your crusade, not theirs.\"\n\n36-55: MODEST SUPPORT - Some Tangible Aid\n\nWhat Arrives:\n\nItalian Merchant Interest: Genoese and Venetian merchants very interested in trade access to captured ports\nGenoa offers 8,000 florins in exchange for favorable customs rates in Málaga\n\nVenice offers 5,000 florins for similar privileges\n\nFrance: 5,000 florins, offer to take Moorish prisoners as galley slaves\n\nBurgundy: 3,000 florins, Duke Philip sends personal letter praising your \"modern\" warfare\n\nGerman States: Bavaria sends 4,000 florins; several other principalities total 5,000 florins\n\nMilan: Duke Filippo Maria Visconti impressed by Ronda negotiation, offers to send 2-3 experienced condottieri captains as military advisors (if you want Italian tactical expertise)\n\nTotal Financial Aid: ~30,000 florins\nOther Benefits: Trade opportunities, potential military advisors\n\nÁlvaro's Assessment: \"Respectable. The Italian merchants see opportunity—that's worth more long-term than the gold. The money funds another month of campaign.\"\n\n56-70: GOOD RESPONSE - Meaningful Contributions\n\nWhat Arrives:\n\nItalian States Compete for Access:\nGenoa: 15,000 florins for Málaga trade rights, offers ships for hire\n\nVenice: 12,000 florins for port access, offers experienced shipwrights\n\nFlorence: 8,000 florins, Medici Bank offers favorable loan terms for future campaigns\n\nFrance: 10,000 florins, offer to send 50 experienced crossbowmen as cadre for training your forces\n\nBurgundy: 8,000 florins, Duke Philip sends master armorer to advise on equipment production\n\nGerman States: Bavaria 8,000 florins; various princes total 12,000 florins\n\nMilan: Duke sends 5,000 florins plus offer of 3 condottieri captains with real expertise in siege warfare and modern tactics\n\nHungary: 5,000 florins and detailed intelligence about Ottoman siege techniques (they're fighting them constantly)\n\nTotal Financial Aid: ~83,000 florins\nOther Benefits: Military expertise, trade deals, intelligence, skilled craftsmen\n\nÁlvaro's Assessment: \"Excellent. The money funds nearly three months of operations. More importantly, the Italian trade deals and military expertise are valuable long-term. The Hungarian intelligence about Ottoman tactics could be very useful.\"\n\n71-85: STRONG RESPONSE - Substantial Aid\n\nWhat Arrives:\n\nMajor Italian Investment:\nGenoa: 25,000 florins, commits 6 galleys for hire, master shipwright for 2 years\n\nVenice: 20,000 florins, offers naval cooperation against Barbary pirates\n\nFlorence/Medici: 15,000 florins, very favorable banking terms, offer to finance future expeditions\n\nMilan: 10,000 florins, sends 5 condottieri captains including one master of artillery\n\nFrance: 15,000 florins, sends 100 experienced soldiers (mix of crossbowmen and men-at-arms) as \"volunteers\"\n\nBurgundy: 15,000 florins, Duke Philip personally impressed, sends master craftsmen (armorer, weapon smith, engineer)\n\nGerman States: Multiple princes inspired by success, total 25,000 florins\n\nHungary: 8,000 florins, sends experienced officer who fought Ottomans to advise on fighting Muslim armies\n\nPoland: 5,000 florins (unexpected), letter praising crusade against infidels\n\nPortugal: King João, though allied already, sends additional 10,000 florins beyond dowry as \"crusade support\"\n\nTotal Financial Aid: ~148,000 florins\nMilitary Aid: ~100 experienced foreign soldiers, multiple expert advisors\nOther Benefits: Naval assets, banking support, skilled craftsmen, intelligence\n\nÁlvaro's Assessment: \"This is substantial. Nearly half a year's campaign funding. The condottieri from Milan bring modern Italian siege expertise. The Hungarian officer has real experience fighting organized Muslim armies. The Italian trade and naval deals position us perfectly for Mediterranean power. Your victories have impressed people.\"\n\n86-95: EXCEPTIONAL RESPONSE - Major International Support\n\nWhat Arrives:\n\nOverwhelming Italian Response:\nGenoa: 40,000 florins, 10 galleys for hire, permanent trade mission to Málaga, master shipwright + assistants\n\nVenice: 35,000 florins, naval cooperation pact, offer to share charts/navigation knowledge\n\nFlorence/Medici: 25,000 florins, banking partnership, will finance African expeditions\n\nMilan: 20,000 florins, 8 condottieri including master of artillery and siege engineer\n\nFrance: 25,000 florins, 200 volunteers (experienced soldiers), offer of future cooperation against Barbary corsairs\n\nBurgundy: 25,000 florins, Duke Philip sends high-level delegation with master craftsmen, suggests future crusade cooperation\n\nGerman States: Wave of support from multiple princes, total 40,000 florins\n\nHoly Roman Emperor: Personal letter praising crusade, 15,000 florins\n\nHungary: 15,000 florins, sends senior officer + small advisory team with Ottoman-fighting experience\n\nPoland: 10,000 florins, offers future military cooperation\n\nPortugal: João sends additional 20,000 florins, offers full naval cooperation\n\nSeveral Smaller Powers: Savoy, Lorraine, others send total 20,000 florins\n\nTotal Financial Aid: ~290,000 florins (nearly a full year's campaign budget!)\nMilitary Aid: 200+ experienced foreign soldiers, 10+ expert military advisors, siege engineers\nNaval Assets: 10+ galleys available for hire, naval cooperation agreements\nOther Benefits: Banking partnerships, trade networks, skilled craftsmen, diplomatic prestige\n\nÁlvaro's Assessment: \"Your Majesty, this is extraordinary. You've received nearly as much in foreign aid as the entire Portuguese dowry. More importantly, the Italian city-states are treating Castile as a major Mediterranean power—that's the real prize. The military experts from Italy and Hungary bring knowledge of modern warfare we lack. The naval assets transform our capabilities. Your success at Ronda has echoed across Christendom.\"\n\n96-100: UNPRECEDENTED RESPONSE - Crusade Becomes International Cause\n\nWhat Arrives:\n\nEverything from 86-95, PLUS:\n\nPope Martin V's Final Act: Knowing he's ill, the Pope makes Granada crusade his legacy\n\nAdditional 30,000 florins from Vatican treasury\n\nSends Cardinal legate to Granada with full authority\n\nProclaims indulgences for all who support crusade financially\n\nWrites personal letters to every Christian monarch demanding support\n\nFrench Royal Response: Charles VII, seeing crusade success while dealing with England, sends:\n\n40,000 florins\n\n300 veteran soldiers including Joan of Arc veterans\n\nMaster siege engineer\n\nOffer of formal alliance against any Muslim power\n\nBurgundian Commitment: Duke Philip the Good, one of wealthiest rulers in Europe:\n\n50,000 florins\n\nSends his personal master-at-arms to command foreign contingent\n\nMaster craftsmen (including early cannon founders)\n\nSuggests forming crusading order together\n\nGerman Crusade Fervor: Multiple German princes inspired:\n\n60,000 florins total\n\n150 German knights volunteer for service\n\nHoly Roman Emperor sends formal blessing\n\nItalian City-State Alliance:\n\nGenoa, Venice, Florence form consortium: 120,000 florins combined\n\nCommit to permanent trade partnerships\n\nNaval assets: 15 galleys available\n\nBanking support for unlimited future expeditions\n\nMilan sends master artillery train with crews\n\nEastern European Interest:\n\nHungary: 25,000 florins, senior officers, Ottoman intelligence\n\nPoland: 20,000 florins, suggests future joint operations against Ottomans\n\nBohemia: Despite Hussite troubles, 10,000 florins\n\nPortugal's Pride: João I seeing son-in-law's triumph:\n\nAdditional 40,000 florins\n\nFull Portuguese naval cooperation\n\nOffers navigation expertise for future Atlantic expeditions\n\nSuggests coordinated Iberian dominance of Mediterranean + Atlantic\n\nTotal Financial Aid: ~555,000 florins (more than TWO YEARS of campaign budget!)\nMilitary Aid: 650+ experienced foreign soldiers including veterans, master craftsmen, siege engineers, artillery experts, naval expertise\nNaval Assets: 15+ galleys, full cooperation agreements\nDiplomatic Impact: Castile recognized as major crusading power, partnerships across Europe\n\nÁlvaro's Assessment:\n\n\"Your Majesty... I don't have words. This doesn't happen. Crusades don't receive this level of international support anymore—not since the early Crusades to the Holy Land. You've made Granada crusade a cause célèbre across Christendom.\"\n\n\"The financial support alone funds two more full campaign seasons. But the real transformation is strategic: The Italian city-states see Castile as their partner in Mediterranean dominance. France wants alliance against Muslim powers. Portugal is offering Atlantic cooperation. German princes are sending their knights. You've positioned Castile at the center of Christian military power.\"\n\n\"The foreign soldiers and experts bring modern military knowledge—Italian siege craft, French heavy cavalry tactics, Hungarian experience against Ottomans, German artillery expertise. This crushes Granada and prepares us for whatever comes next: North Africa, supporting Hungary against Ottomans, Atlantic exploration.\"\n\n\"Most importantly: This makes the Perpetual Crusade Fund concept not just viable but inevitable. With this level of international interest, nobles can't argue there's no future in overseas conquest. You've proven Christian Europe will invest in successful crusading ventures.\"\n\nInstructions for Use:\n\nRoll your d100 and I'll narrate the specific results. The table is weighted toward modest-to-good responses (36-70 has highest probability), reflecting that most powers are busy but your success is impressive. Really exceptional results (86-100) are rare but possible—your victories have been extraordinary.\n\nWhat do you roll?"
        },
        {
          "role": "player",
          "text": "Smash! I rolled 99! So unprecedented response!\n\n\nThis is great.\n\n\nNow draft the responses ALvaro has recieved based on this extraordinary response."
        },
        {
          "role": "gm",
          "text": "Álvaro spreads a collection of letters, diplomatic pouches, and rolled parchments across the council table. His expression is somewhere between elation and disbelief.\n\n\"Your Majesty, these started arriving three weeks ago. At first, I thought it was the usual diplomatic courtesy. Then they kept coming. And coming.\" He organizes them by sender. \"Let me walk you through what's happened.\"\n\nFROM THE HOLY SEE - POPE MARTIN V'S FINAL LEGACY\n\nÁlvaro unfurls a papal letter with elaborate seals. \"This arrived first, carried by special courier. The Pope is dying, Juan. Everyone in Rome knows it. And he's made your crusade his final act.\"\n\nThe Papal Letter (dated September 8, 1431):\n\nTo Our Most Beloved Son Juan, King of Castile and León, Supreme Commander of the Holy Crusade,\n\nWe write to you from Our sickbed, knowing Our days in this world grow short. But before We are called to Our reward, We give thanks to Almighty God for permitting Us to witness what We had scarcely dared hope: a true crusade, prosecuted with both holy zeal and Christian mercy, achieving victories that echo the greatest triumphs of Christendom.\n\nYour victory at Alcalá la Real, the seventy souls who freely chose baptism after witnessing God's favor, the negotiated surrender of Ronda - these are not merely military achievements but proofs of Divine Providence working through you.\n\nTherefore, in what may be Our final official act, We do decree:\n\nFirst, from the Apostolic Treasury, an additional THIRTY THOUSAND FLORINS to sustain your holy work.\n\nSecond, We dispatch Our trusted servant Cardinal Pietro Donato to Granada as Papal Legate with full authority to represent the Holy See in all matters relating to the crusade. He carries Our blessing and Our mandate to support you in all things.\n\nThird, We hereby proclaim that ANY CHRISTIAN, in any land, who contributes financially to the Granada Crusade shall receive the same plenary indulgence granted to those who take the cross personally. Let the faithful know that supporting this crusade with their treasure is spiritually equivalent to wielding the sword.\n\nFourth, We have written personally to every Christian monarch, not requesting but DEMANDING their support for your crusade. We have made clear that this is not one king's war but Christendom's obligation.\n\nDear son, when We met you in Rome and you knelt before Us offering everything, We saw in you what the Church desperately needs: a champion who fights with sword AND soul, who conquers with both courage and mercy. Continue this work. Complete it. Then, as you promised, carry Our banner wherever Christ's enemies threaten His flock.\n\nWe shall pray for you daily until We close Our eyes for the final time. And We have every confidence that when We stand before the Throne of Judgment, We shall be able to say: \"Lord, I found You a champion, and gave him Your blessing.\"\n\nGiven at the Lateran Palace, this eighth day of September, Year of Our Lord 1431.\n\nMARTIN V, Bishop of Rome, Servant of the Servants of God\n\nÁlvaro's voice is thick with emotion. \"He's dying, and this is what he wanted his legacy to be. Not just the money—though thirty thousand florins is extraordinary—but the indulgences. Juan, he just made every Christian in Europe eligible for full crusade indulgences if they donate to Granada. He's weaponized the entire Church's spiritual authority for your cause.\"\n\nHe sets down the letter carefully. \"Cardinal Donato is en route now. Should arrive within two weeks. A papal legate with full authority staying in Castile until Granada falls—that's unprecedented.\"\n\nFROM FRANCE - CHARLES VII'S STRATEGIC INVESTMENT\n\nÁlvaro pulls out a letter sealed with the French royal arms. \"This one surprised me. Charles VII has his hands full with England. But apparently, your success caught his attention.\"\n\nThe French King's Letter (dated September 15, 1431):\n\nTo Our Brother in Christ, Juan, King of Castile,\n\nWe have followed with great interest the reports of your crusade against the Moorish Kingdom. Your victory at Alcalá la Real and your capture of Ronda have demonstrated both military prowess and political wisdom that We find most impressive.\n\nFrance knows well the cost of long wars against determined enemies. We have fought the English for decades. Your ability to achieve decisive victories while preserving your forces through strategic negotiation shows understanding of warfare's true nature that many commanders lack.\n\nTherefore, We wish to support your crusade and establish friendship between our kingdoms:\n\nFirst, from Our treasury, FORTY THOUSAND FLORINS as immediate contribution to your holy work.\n\nSecond, We dispatch THREE HUNDRED veteran soldiers - men who fought with Joan of Arc at Orléans and Paris, who know victory against overwhelming odds. They volunteer for crusade service under your command. Their captain, Jean de Metz, is a knight of proven valor who served the Maid personally.\n\nThird, We send Our master siege engineer, Guillaume Balard, who has conducted fifteen successful sieges. He brings knowledge of the most modern techniques.\n\nFourth, We propose formal alliance between France and Castile against any Muslim power that threatens Christian lands. The Barbary corsairs raid our Mediterranean coast as they raid yours. Together, we could sweep them from the sea.\n\nWe look forward to closer relations between our kingdoms. A king who can conquer with both sword and diplomacy is a king We wish as friend.\n\nCharles, by Grace of God King of France\n\nÁlvaro taps the letter. \"Forty thousand florins. Three hundred veterans—real soldiers, not levies. And he's proposing alliance. Charles is looking ahead: if you complete Granada quickly, you become his potential partner for Mediterranean operations. He's investing in future cooperation.\"\n\nHe grins. \"Also, sending Joan of Arc's own veterans? That's a propaganda gift. They're famous across Europe. Having them fight for you associates your crusade with hers.\"\n\nFROM BURGUNDY - DUKE PHILIP'S CRUSADING VISION\n\nÁlvaro holds up an ornate letter. \"Philip the Good. One of Europe's richest rulers. He's been talking about crusading for years but never acted. Your success seems to have inspired him.\"\n\nDuke Philip's Letter (dated September 20, 1431):\n\nTo the Most Christian King Juan of Castile, Champion of the Faith,\n\nYour Majesty's achievements in Granada have stirred Our heart profoundly. We have long dreamed of crusade against the infidel, but events have always prevented action. Watching you ACHIEVE what we only discussed fills Us with both admiration and holy envy.\n\nWe therefore commit the resources of Burgundy to support your crusade:\n\nFirst, FIFTY THOUSAND FLORINS from Our treasury.\n\nSecond, We dispatch Our personal Master-at-Arms, Antoine de Toulongeon, to serve under your command. He brings thirty Burgundian knights who have pledged crusade vows. These are men of the highest quality, trained in Burgundy's finest military traditions.\n\nThird, We send Our master craftsmen: Philippe de Bons, master armorer; Jean Hennecart, expert in early cannon founding; and Henri Blanchard, siege engineer. These men represent the finest technical knowledge in Christendom.\n\nFourth, We propose that after Granada's fall, you and We consider forming a joint crusading order dedicated to perpetual warfare against infidels - whether in Africa, against Ottomans, or wherever Christ's enemies gather. You have proven that crusading can succeed in this age. Together, we could make it a permanent institution.\n\nYour Majesty, We have followed your career with growing respect. You are doing what the great crusader kings of old did: transforming faith into action, prayer into victory. We wish to be part of this legacy.\n\nPhilip, by Grace of God Duke of Burgundy\n\nÁlvaro looks up. \"Philip's serious. Fifty thousand florins is huge—Burgundy's one of Europe's richest states. But the proposal about a joint crusading order? That's long-term strategic thinking. He sees you as potential partner for permanent crusading operations. And his craftsmen—the Burgundians are ahead of us technically. That cannon founder could be invaluable.\"\n\nFROM THE ITALIAN CITY-STATES - COMMERCIAL EMPIRE PARTNERSHIP\n\nÁlvaro spreads out three letters bearing seals of Genoa, Venice, and Florence. \"This is where it gets truly extraordinary. The Italians have formed a consortium.\"\n\nJoint Letter from Genoa, Venice, and Florence (dated September 25, 1431):\n\nTo His Majesty Juan II, King of Castile and León, Conqueror of the Andalusian Coast,\n\nThe Republics of Genoa and Venice, together with the Signoria of Florence, write to propose partnership that will benefit both Your Majesty's kingdom and our merchant cities.\n\nYour conquest of Málaga, Vélez-Málaga, Marbella, and other ports has created opportunity unprecedented in centuries: Christian control of the southern Iberian coast. We three cities, which dominate Mediterranean trade, wish to establish permanent commercial alliance with Castile.\n\nOur Proposal:\n\nFirst, COMBINED CONTRIBUTION of ONE HUNDRED TWENTY THOUSAND FLORINS to fund your crusade's completion.\n\nSecond, GENOA commits: Fifteen galleys available for hire at favorable rates; master shipwright Antonio Grimaldi with team of assistants to establish permanent shipyard in Málaga; permanent Genoese trade mission with warehouses and facilities; exclusive banking services for crown transactions.\n\nThird, VENICE commits: Naval cooperation pact for anti-piracy operations; sharing of charts and navigation knowledge; master mariners to train Castilian sailors; trade privileges reciprocal between Venice and Castilian ports.\n\nFourth, FLORENCE/MEDICI commits: Cosimo de' Medici himself writes to offer unlimited banking credit for future military operations; will finance African expeditions or other conquests at favorable interest; establishes Medici branch in Málaga for crown banking needs.\n\nIn exchange, we request reasonable customs rates, legal protections for our merchants, and right to establish permanent facilities in your ports.\n\nYour Majesty, we see what you are building: a Mediterranean naval power to rival any in Christendom. We wish to be your partners in this enterprise. Together, Castile's military might and our commercial networks can dominate the sea from Gibraltar to the Levant.\n\nWe await your favorable response.\n\nSigned by authority of the Doge of Genoa, the Doge of Venice, and the Signoria of Florence\n\nÁlvaro is almost laughing. \"Juan, they formed a consortium. Three rival cities that normally compete came together to bid for partnership with you. One hundred twenty thousand florins! Fifteen galleys! The Medici offering unlimited credit! They're treating Castile like we're already a Mediterranean superpower.\"\n\nHe leans forward. \"And they're right to. You've conquered the coast. With their ships, banking, and commercial networks combined with your military power and ports... you could dominate Mediterranean trade. This is transformative.\"\n\nFROM MILAN - MILITARY EXPERTISE\n\nDuke Filippo Maria Visconti's Letter (dated September 22, 1431):\n\nTo King Juan of Castile,\n\nWe were most impressed by reports of your negotiated surrender of Ronda. Taking a fortress without siege, through diplomatic pressure combined with military threat, demonstrates understanding of warfare's political dimension that even our best condottieri admire.\n\nMilan offers:\n\nTWENTY THOUSAND FLORINS for your crusade.\n\nMore importantly, we send eight of our finest condottieri captains, including:\n- Francesco Sforza, master of siege warfare\n- Giovanni da Tolentino, artillery expert\n- Micheletto Attendolo, cavalry tactician\n\nThese men bring knowledge of modern Italian military methods: improved siege techniques, artillery deployment, combined-arms tactics. They will serve under your command for duration of Granada campaign.\n\nAdditionally, we send complete artillery train: six bombards with crews, powder, and shot. Our gun-founders are superior to any in Europe.\n\nConsider this investment in future cooperation. Milan seeks friends who understand that warfare is about achieving political objectives, not merely winning battles.\n\nFilippo Maria Visconti, Duke of Milan\n\nÁlvaro grins. \"The Italians are the best military professionals in Europe right now. Francesco Sforza is famous—he'll probably conquer Milan himself someday. Having him and his colleagues advising us brings knowledge worth more than gold. And six bombards! That doubles our artillery.\"\n\nFROM THE HOLY ROMAN EMPIRE - IMPERIAL BLESSING\n\nEmperor Sigismund's Letter (dated September 18, 1431):\n\nTo Our Cousin Juan, King of Castile,\n\nThough age and the burden of empire prevent Us from personally taking the cross, We rejoice to see a young monarch achieve what We have only dreamed of: successful crusade against the infidel.\n\nWe contribute FIFTEEN THOUSAND FLORINS from the Imperial treasury.\n\nMore significantly, We have written to every prince of the Empire encouraging their support. The German princes' contributions below result from Our personal intervention.\n\nWe also send this message: Complete Granada swiftly, then turn your attention to the Ottoman threat. They press Hungary, threaten Byzantium, menace all Christendom. A king who can conquer Granada can help save the East.\n\nMay God grant you victory.\n\nSigismund, Holy Roman Emperor\n\nÁlvaro nods. \"The Emperor's old and distracted, but his endorsement matters. And look at what the German princes sent...\"\n\nFROM GERMAN PRINCIPALITIES - CRUSADING FERVOR\n\nÁlvaro shuffles through multiple letters. \"Dozens of German princes sent contributions. I'll summarize: Bavaria, Saxony, Brandenburg, the Palatinate, Austria, and at least fifteen smaller principalities. Combined: SIXTY THOUSAND FLORINS.\"\n\n\"But more interesting: One hundred fifty German knights have volunteered for crusade service. They're forming a German contingent under Heinrich von Plauen, a Teutonic Knight commander. Apparently, the idea of successful crusading inspired younger German nobility who've been hearing their grandfathers' stories about the old crusades.\"\n\nHe smiles. \"You're getting a multinational crusader army. French, Burgundian, Italian, German contingents. This is starting to look like a real international crusade.\"\n\nFROM HUNGARY - OTTOMAN-FIGHTING EXPERTISE\n\nKing Sigismund of Hungary's Letter (dated September 28, 1431):\n\nBrother in Christ,\n\nHungary fights the Ottoman Turks constantly. We know what it means to face determined Muslim armies. Your victory at Alcalá la Real - destroying a field army nearly twice your size - demonstrates tactical brilliance we wish our commanders possessed.\n\nWe send TWENTY-FIVE THOUSAND FLORINS.\n\nMore valuably, we send János Hunyadi, one of our finest young commanders, with small staff of officers. These men have fought Ottomans for years. They understand Muslim military methods, their tactics, their strengths and weaknesses. Hunyadi will share everything we've learned bleeding against the Turks.\n\nWe also send detailed intelligence reports about Ottoman siege techniques, cavalry tactics, and defensive strategies. Know your enemy.\n\nAfter you finish Granada, please consider: The Ottomans are the real threat to Christendom. We fight them alone. A king of your ability could change that equation. Think about it.\n\nGod keep you in battle.\n\nSigismund, King of Hungary\n\nÁlvaro looks serious. \"János Hunyadi. That's a real gift. He's becoming famous fighting Ottomans. And the intelligence about Turkish methods? That's knowledge you can't buy. After Granada, if you do go overseas, this will be invaluable.\"\n\nFROM POLAND - EASTERN SOLIDARITY\n\n\"Poland sent twenty thousand florins and a letter suggesting future joint operations against Ottomans. They're watching the Turkish expansion nervously and would welcome a western crusader king joining their efforts.\"\n\nFROM PORTUGAL - PRIDE AND PARTNERSHIP\n\nKing João's Personal Letter (dated October 1, 1431):\n\nDear Juan, My Son by Marriage,\n\nI confess: When I agreed to Isabel's marriage, I saw political advantage and hoped for competent alliance. I did not expect to watch you become one of Christendom's great crusader kings before age twenty.\n\nI am profoundly proud to be your father by marriage. My daughter chose well - or rather, God chose well for her.\n\nBeyond the dowry already paid, Portugal contributes FORTY THOUSAND FLORINS to complete Granada's conquest.\n\nMore importantly, I offer full Portuguese naval cooperation. Our ships, our navigators, our knowledge of the seas - all at your disposal. Together, Iberia can dominate both Mediterranean and Atlantic.\n\nI also extend this offer: After Granada falls, if you wish to explore Atlantic routes or establish outposts along the African coast, Portugal will share our navigation knowledge and cooperate in these ventures. Together, our kingdoms could discover new trade routes, new lands, new opportunities for Christian expansion.\n\nMy friend, you and Isabel's child will unite our houses. Let us also unite our kingdoms' interests in permanent partnership for Christian expansion wherever God guides.\n\nTake care of my daughter. She writes that she loves you deeply, and a father can ask no more.\n\nYour friend and father,\n\nJoão, King of Portugal\n\nÁlvaro's voice softens. \"This is personal. João's proud of you, and he's offering Portugal's greatest asset: their maritime expertise. Atlantic cooperation could lead anywhere—Africa, perhaps beyond. And he clearly loves that Isabel loves you.\"\n\nSUMMARY - THE TOTALS\n\nÁlvaro pulls out a ledger where he's been tracking everything:\n\nFINANCIAL CONTRIBUTIONS:\n\nVatican: 30,000 florins\n\nFrance: 40,000 florins\n\nBurgundy: 50,000 florins\n\nItalian Consortium: 120,000 florins\n\nMilan: 20,000 florins\n\nHoly Roman Empire: 15,000 florins\n\nGerman Principalities: 60,000 florins\n\nHungary: 25,000 florins\n\nPoland: 20,000 florins\n\nPortugal: 40,000 florins\n\nVarious smaller powers: 20,000 florins\n\nTOTAL: 440,000 FLORINS\n\nActually more like 555,000 when including everything from the tier description.\n\nÁlvaro sets down the ledger and looks at you with something like awe.\n\n\"Juan. This is more gold than the Portuguese dowry. This is more than TWO FULL YEARS of campaign operations. But the gold isn't even the most important part.\"\n\nHe starts counting on his fingers:\n\n\"Military expertise: French veterans who fought with Joan of Arc. Italian condottieri who are the best professionals in Europe. Hungarian officers who fight Ottomans. German knights. Burgundian master-at-arms. Combined: six hundred fifty foreign soldiers, all experienced. Plus siege engineers, artillery experts, cavalry tacticians.\"\n\n\"Naval power: Fifteen Genoese galleys available for hire. Portuguese cooperation. Venetian anti-piracy pact. You now have access to more naval power than most kingdoms possess.\"\n\n\"Commercial networks: The Italian consortium gives you partnerships with the richest merchant cities in the world. Medici unlimited credit means you can finance any operation. Permanent facilities in your ports mean sustained trade revenue.\"\n\n\"Technical knowledge: Burgundian cannon founders. Italian siege engineers. French master of sieges. Hungarian intelligence about Muslim armies. Portuguese navigation expertise. This is knowledge transfer that will modernize your entire military.\"\n\n\"Diplomatic transformation: A papal legate staying until Granada falls. Alliance offers from France. Partnership proposals from Burgundy. Imperial blessing. You've gone from regional crusade to international cause.\"\n\nHe pauses, then says quietly:\n\n\"Your Majesty, at the Cortes next month, when you propose the Perpetual Crusade Fund and nobles ask 'why should we pay for overseas conquest,' you can point to this. You can say: 'Because the entire Christian world will support successful crusading ventures. Here are the letters proving it. Here are the florins. Here are the soldiers. This is what happens when Castile leads.'\"\n\n\"The tax reform isn't just possible now - it's inevitable. How can nobles argue against funding future conquests when you've just shown that foreign powers will contribute hundreds of thousands of florins to support them?\"\n\nHe looks at you seriously. \"You need to understand what's happened. You're not just conquering Granada anymore. You've become a symbol. Young kings across Europe are watching you achieve what their grandfathers talked about but never did: actual, successful crusading. You're proving it can be done in this age.\"\n\n\"Pope Martin is dying, and he made you his legacy. That means when the next Pope is elected, your crusade will be held up as the model. You'll have leverage in Rome for decades.\"\n\n\"The Italian city-states are treating you as a major Mediterranean power. That's because you are one now. You control the Andalusian coast. With their commercial networks and your military power, you could genuinely dominate the western Mediterranean.\"\n\n\"This isn't just about Granada anymore, Juan. This is about what comes after. And apparently, the entire Christian world wants to find out.\"\n\nWhat's your reaction to all this?"
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_1431_00144",
      "book": 1,
      "chapter": "1.24",
      "date": "1431-10-18",
      "end_date": null,
      "type": "personal",
      "summary": "Roll 69 on d100 table for the commissioned wedding painter produces Fra Angelico. Pope Martin V, on his deathbed, personally commanded the Dominican friar to paint Juan's wedding as one of his final acts. Fra Angelico proposes two works: a grand wedding portrait for the Alcazar showing the ceremony with papal legate and sacred relics, and a smaller devotional piece of the Virgin Mary interceding for crusaders for Isabel's private chapel. Total cost is 800 florins (500 commission plus 300 monastery donation to San Marco in Florence). Fra Angelico will arrive in Toledo in January 1432 and stay at the Dominican monastery of Santo Tomas for five months.",
      "characters": [
        "juan_ii",
        "alvaro_de_luna",
        "fra_angelico",
        "pope_martin_v"
      ],
      "factions_affected": [],
      "location": "Toledo",
      "tags": [
        "art",
        "painting",
        "fra_angelico",
        "pope",
        "d100_roll_69",
        "commission"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "We keep these calls for support in mind as we move ahead.\n\n\nNow, lets see what painter we have been able to commission.\n\n\nDraft a d100 table with different outcomes of our search for a painter."
        },
        {
          "role": "gm",
          "text": "Famous painters of this era (early 1430s):\n- Jan van Eyck (Flemish, c.1390-1441) - Court painter to Philip the Good of Burgundy, famous for his oil techniques\n- Fra Angelico (Italian, c.1395-1455) - Dominican friar, working in Florence\n- Rogier van der Weyden (Flemish, c.1400-1464) - Would be early in career\n- Pisanello (Italian, c.1395-1455) - Working in Verona/Mantua\n- Gentile da Fabriano (Italian, c.1370-1427) - Actually dead by 1430, so not available\n- Masaccio (Italian, 1401-1428) - Dead by 1430\n- Robert Campin (Flemish, c.1375-1444) - Active in Tournai\n\nThe table should reflect:\n- Lower rolls: Can't get a master, get lesser known or local painter\n- Mid rolls: Good painter but not the very best\n- Higher rolls: One of the famous masters\n- Highest rolls: Multiple masters interested or exceptional circumstances\n\nLet me create a table with different tiers of success.\n\nD100 TABLE: COMMISSIONING A ROYAL WEDDING PAINTER\n\nContext\n\nTommaso (Juan's Italian secretary) has been reaching out to painters across Italy and Flanders since early 1431. The commission is prestigious: painting the wedding of a crusader king blessed by a papal legate, featuring sacred relics. Responses arrive in October 1431.\n\n1-10: NO MASTER AVAILABLE - Local Talent Only\n\nWhat Happens:\n\nAll approached masters decline or don't respond\n\nFra Angelico: Too committed to Dominican Order, cannot travel\n\nJan van Eyck: Exclusively bound to Duke Philip of Burgundy's court\n\nOther Flemish masters: War disruptions make travel impossible\n\nItalian masters: Committed to other major commissions\n\nAvailable Option:\n\nMaster Rodrigo de Osona, respected Valencian painter\n\nGood technical skill, solid religious works\n\nNot innovative, but competent\n\nCost: 150 florins\n\nAvailable immediately\n\nÁlvaro's Assessment: \"Disappointing, but Rodrigo is capable. The painting will be good, just not... exceptional. No one will talk about it in fifty years.\"\n\n11-25: COMPETENT BUT UNREMARKABLE\n\nWhat Arrives:\n\nSeveral mid-tier painters express interest\n\nNone are famous or revolutionary\n\nAll are technically proficient\n\nBest Option - Master Jaume Huguet (Catalan painter):\n\nAge ~25, early in career but showing promise\n\nGood with religious subjects and portraits\n\nUses traditional methods competently\n\nCost: 200 florins\n\nCan begin work January 1432\n\nÁlvaro's Assessment: \"Solid choice. Won't revolutionize anything, but will produce a respectable royal portrait. Adequate for the purpose.\"\n\n26-45: GOOD PAINTER - Rising Talent\n\nWhat Arrives:\n\nPietro di Giovanni d'Ambrogio (Sienese painter)\n\nAge ~35, established reputation in Italy\n\nKnown for detailed religious scenes\n\nStudied with important masters\n\nNot innovative but highly skilled\n\nCost: 300 florins\n\nBrings two assistants\n\n3-4 month timeline\n\nOR\n\nMaster of Flémalle workshop (Robert Campin's studio in Tournai)\n\nCampin himself unavailable but sends senior apprentice\n\nEarly Flemish oil technique knowledge\n\nGood but not quite master level\n\nCost: 350 florins\n\nÁlvaro's Assessment: \"This is respectable. Pietro has done work for Italian nobility. The painting will be high quality and properly convey the significance. Not revolutionary, but dignified and impressive.\"\n\n46-65: VERY GOOD - Established Master\n\nWhat Arrives:\n\nPisanello (Antonio Pisano) from Verona responds\n\nAge ~35-40, famous for medals and portraits\n\nKnown for exquisite detail and naturalism\n\nWorked for Italian courts\n\nInterested in crusade subject matter\n\nCost: 450 florins\n\nWants 4 months, will bring 3 assistants\n\nProposes painting plus commemorative medals\n\nÁlvaro's Assessment: \"Now we're talking. Pisanello is known across Italy. His work for the Gonzaga family in Mantua is extraordinary. The detail in his paintings is remarkable—every face distinct, every fabric texture visible. This would be a genuinely impressive royal portrait that people will remember.\"\n\nAdded Benefit: Pisanello also creates medals/coins. Offers to design commemorative crusade medals as part of commission—could become widely circulated symbols of the crusade.\n\n66-80: EXCELLENT - Famous Master\n\nWhat Arrives:\n\nFra Angelico responds personally\n\nNormally couldn't travel (Dominican obligations)\n\nBut: Pope Martin V's dying wishes included blessing Juan's crusade\n\nPope specifically requested Fra Angelico paint the crusader king's wedding\n\nAs Dominican friar, Fra Angelico obeys papal command\n\nAge ~35-40, increasingly famous\n\nKnown for luminous religious paintings\n\nRevolutionary use of perspective and light\n\nCost: 500 florins plus generous donation to his monastery\n\nNeeds 5 months, brings Dominican assistant\n\nWill stay in monastery in Toledo while working\n\nThe Paintings Proposed:\n\nMain wedding portrait with papal legate, banner, relics\n\nSmaller devotional piece for Isabel's private chapel\n\nÁlvaro's Assessment: \"Your Majesty, this is extraordinary. Fra Angelico is becoming one of the most sought-after religious painters in Italy. His frescoes in San Marco are revolutionizing how we depict sacred subjects. Having him paint your wedding legitimizes your crusade artistically and spiritually—he only accepts commissions he believes serve God's glory.\"\n\nSpecial Significance: Fra Angelico as Dominican friar painting crusader king creates additional religious legitimacy. The painting becomes not just art but theological statement.\n\n81-92: EXCEPTIONAL - Revolutionary Master\n\nWhat Arrives:\n\nJan van Eyck himself writes\n\nCourt painter to Duke Philip the Good of Burgundy\n\nAge ~40, at height of powers\n\nRevolutionary oil painting techniques\n\nCreates unprecedented realism and detail\n\nFamous across Europe\n\nHis Letter:\n\nWe have heard of King Juan's crusade with great interest. Duke Philip speaks often of crusading and admires your achievements greatly. When your secretary approached us about painting your wedding, we were intrigued.\n\nThe subject matter—a crusader king's wedding blessed by papal legate, featuring fragments of the True Cross—this is worthy of our highest efforts. We would paint not merely a portrait but a testament to faith.\n\nWe require: 600 florins, six months' time, freedom to execute our vision. We will bring our workshop—three assistants, our materials including oils of our own formula. The result will be unlike any painting you have seen: every jewel will glisten, every fabric texture will be visible, every face will seem to breathe.\n\nDuke Philip gives his blessing for this commission, seeing it as support for crusading cause he cherishes.\n\nWhat This Means:\n\nVan Eyck's oil technique creates photographic realism\n\nHis attention to detail is legendary—can paint individual hairs\n\nLight effects unprecedented—jewels seem to glow\n\nSymbolism layered throughout (van Eyck loves hidden meanings)\n\nWould become one of his masterpieces\n\nÁlvaro's Assessment: \"Juan, van Eyck is the finest painter in Europe right now. His Ghent Altarpiece is being called a miracle. His portrait of the Arnolfini couple—people swear it's like looking through a window. If he paints your wedding, it will be studied for centuries. The cost is high and the timeline long, but... this would be transformational.\"\n\n93-97: UNPRECEDENTED - Multiple Masters Compete\n\nWhat Happens:\nWord of the commission has spread, and the prestige of painting a successful crusader king's blessed wedding attracts multiple famous masters.\n\nRespondents:\n\nJan van Eyck (as above) - 600 florins, oil technique mastery\n\nFra Angelico (as above) - 500 florins + monastery donation, religious luminosity\n\nPisanello (as above) - 450 florins, exquisite detail + medals\n\nPlus:\nRogier van der Weyden (emerging Flemish master)\n\nAge ~30, student of Robert Campin\n\nRevolutionary emotional expressiveness\n\nCost: 400 florins\n\nBrings intensity and drama to religious subjects\n\nThe Competition:\nEach master submits proposal with sketches showing their vision. You can choose based on:\n\nStyle preference (Flemish realism vs Italian luminosity vs emotional intensity)\n\nCost and timeline\n\nAdditional offerings (Fra Angelico's extra devotional piece, Pisanello's medals)\n\nSymbolic meaning (Dominican friar vs Burgundian court painter)\n\nÁlvaro's Assessment: \"This has never happened for a Castilian commission. Multiple famous masters competing for your patronage? This is how Italian princes get painted, not Iberian kings. Choose wisely—this decision matters artistically and symbolically.\"\n\nStrategic Considerations:\n\nVan Eyck: Associates you with Burgundy, most technically impressive\n\nFra Angelico: Maximum religious legitimacy, papal connection\n\nPisanello: Italian sophistication, medals spread your image\n\nVan der Weyden: Emotional power, emerging revolutionary talent\n\n98-100: MIRACULOUS - Jan van Eyck's Special Proposal\n\nWhat Arrives:\nJan van Eyck writes personally, and his proposal is extraordinary.\n\nVan Eyck's Letter:\n\nYour Majesty,\n\nDuke Philip the Good has followed your crusade with fascination. He speaks often of crusading—indeed, he took a vow years ago to launch crusade if only circumstances permitted. Watching you actually achieve what he dreams of has moved him profoundly.\n\nThe Duke has made an unusual decision: He will personally sponsor your wedding portrait as a gift between crusading brothers. This means you pay nothing for the commission—Philip covers all costs as investment in crusading cause.\n\nFurthermore, I propose not merely one painting but a diptych:\n\nPanel One: Your wedding—you and Isabel, the papal legate, the sacred banner and relics, Toledo cathedral in magnificent detail.\n\nPanel Two: You in crusader armor before Granada—the Holy City in background, your army assembled, the cross raised over conquered territory. This panel I will paint after Granada's fall.\n\nTogether, these panels will tell the complete story: The blessed beginning (wedding) and the triumphant completion (conquest). They will hang together as testament to what a Christian king can achieve when faith meets will.\n\nI require nine months total—three months for each panel, three months between for the campaign. I will travel to Castile twice: winter 1431-32 for the wedding panel, winter 1432-33 for the conquest panel.\n\nI bring my complete workshop, my finest materials, and my absolute commitment to creating a masterwork. This will be my crusade—I cannot wield sword, but I can immortalize those who do.\n\nDuke Philip adds this: If you complete Granada swiftly and turn attention to other crusading ventures (Africa, supporting Hungary against Ottomans, etc.), Burgundy will be first to offer partnership. He wants crusading ally.\n\nThis is not merely commission but beginning of friendship between crusading princes.\n\nWhat This Includes:\n\nFree—Philip pays all costs (~1,500 florins value)\n\nTwo masterwork panels creating complete narrative\n\nVan Eyck's absolute best effort (he's personally invested)\n\nPolitical alliance opportunity with Burgundy\n\nBoth panels together become defining artwork of the era\n\nSecond panel requires Granada's completion—incentive and commitment\n\nVan Eyck present for actual crusade to paint authentically\n\nÁlvaro's Reaction:\n\nÁlvaro reads the letter twice, then sets it down carefully.\n\n\"Juan... I don't know what to say. Duke Philip the Good—one of the richest men in Europe—is gifting you a van Eyck diptych. Do you understand what this means?\"\n\n\"First, artistically: Van Eyck creating two connected panels telling your crusade story? This becomes one of the great artwork series of the age. People will travel to Toledo to see it. Your grandchildren will show it to ambassadors as proof of Castile's glory.\"\n\n\"Second, politically: Philip is declaring you his crusading partner. He's been talking about crusades for twenty years without acting. Now he's investing in yours. After Granada, he'll want joint ventures—probably North Africa, maybe supporting Hungary. This opens Burgundian resources and connections.\"\n\n\"Third, symbolically: Having Europe's greatest painter dedicate nine months of his life to immortalizing your crusade legitimizes everything. This isn't just royal patronage—this is artistic testimony that your crusade matters enough to deserve revolutionary art.\"\n\n\"Fourth, practically: It's free. You save 600-1500 florins and get the finest possible result.\"\n\nHe pauses. \"There's also pressure: Van Eyck painting Granada's conquest means you must conquer it. You're publicly committing to completing the crusade, with one of Europe's most famous artists waiting to paint your triumph. But given everything else happening, that's probably acceptable pressure.\"\n\n\"My recommendation: Accept immediately. Write to both Philip and van Eyck expressing profound gratitude. This alliance with Burgundy could be as valuable as the Portuguese marriage.\"\n\nInstructions:\n\nRoll your d100! Based on the result, I'll narrate exactly what arrived and how Álvaro presents it to you.\n\nWhat do you roll?"
        },
        {
          "role": "player",
          "text": "Rolled 69, so Fra Angelico.\n\n\nDraft a response based on this outcome."
        },
        {
          "role": "gm",
          "text": "Álvaro pulls out a letter sealed with both a personal seal and what appears to be a Dominican monastery mark. His expression is reverent.\n\n\"Your Majesty, this arrived yesterday from Florence. It's from Fra Giovanni da Fiesole—the world knows him as Fra Angelico.\"\n\nHe opens the letter carefully. \"Let me read it to you.\"\n\nFRA ANGELICO'S LETTER\n\nFrom Florence, September 30, 1431\n\nTo His Majesty Juan II, King of Castile and León, Supreme Commander of the Holy Crusade,\n\nGrace and peace in Christ our Lord.\n\nI write as a humble servant of the Dominican Order, normally bound by my vows and obligations to the monastery of San Marco in Florence. When your learned secretary Tommaso first wrote requesting I paint your wedding, I prepared to decline—my prior does not easily grant permission for extended travel, and my work here fills every hour God grants me.\n\nBut then I received a second letter. From Rome. From His Holiness Pope Martin V himself.\n\nOur Holy Father, knowing his days grow short, wrote to my prior commanding—not requesting, but commanding—that I be released to paint your wedding. His letter, which I have read a dozen times with tears, said this:\n\n\"There is a young king in Castile who has given everything to God's service. Who stripped himself before Us and offered his kingdom to Christ. Who now fights a true crusade with both holy zeal and Christian mercy. His wedding to a Portuguese princess, blessed by Our legate, celebrated beneath the banner bearing the True Cross—this must be painted by one who understands that art serves God first. Send Fra Giovanni. This is among Our final wishes.\"\n\nYour Majesty, when the Vicar of Christ commands, a Dominican friar obeys. But more than obedience, I feel called to this work. I have heard the reports of your crusade: the battle at Alcalá where God's favor was so evident that seventy Muslim warriors chose baptism. The negotiated surrender of Ronda, where you chose mercy over slaughter. The sacred banner carried into battle.\n\nThis is not merely a royal wedding to paint. This is a sacred moment—a king dedicated to God's work, a marriage blessed for holy purpose, relics of Christ's Passion present. This is the kind of subject that makes my brushes feel inadequate and my prayers more fervent.\n\nI propose to create two works:\n\nFirst, the great wedding portrait for your Alcázar. This will show you and Queen Isabel in the cathedral, the papal legate blessing your union, the sacred banner and relics present. Behind you, I will paint the assembled nobility and clergy bearing witness. I will pour all my skill into making the light itself testify to God's blessing—the way it falls on the relics, on your faces, on the banner. I want viewers to feel they are witnessing not just a wedding but a consecration.\n\nSecond, a smaller devotional piece for Queen Isabel's private chapel. Your secretary mentioned she is deeply pious, that she prays daily for your safety and the crusade's success. I would paint for her a scene of the Virgin Mary interceding before Christ for crusaders—something she can pray before, that reminds her that her prayers and yours both rise before God's throne.\n\nI require five months for this work. I will arrive in Toledo in January 1432 with my assistant, Brother Giuliano. We will stay at the Dominican monastery of Santo Tomás, where the brothers have already offered us hospitality. Each morning before I paint, I will attend Mass and pray for your crusade. This work will be as much prayer as art.\n\nFor the commission, I ask 500 florins—though most of this will return to my monastery to support our work with the poor and our scriptoriums. Additionally, a generous donation to San Marco would help us complete the renovations that will include frescoes I am planning for the monastery.\n\nBut money is secondary. Pope Martin has asked me to do this, and I believe God wills it. I will paint your wedding, Your Majesty, and through my work I will try to show the world what I believe to be true: that your crusade is not merely military conquest but spiritual warfare, that God truly blesses those who offer themselves completely to His service.\n\nI await your response, and I pray daily for your safety and success.\n\nYour servant in Christ,\n\nFra Giovanni da Fiesole\n(Fra Angelico)\nMonastery of San Marco, Florence\n\nÁlvaro sets down the letter. There are tears in his eyes.\n\n\"Juan,\" he says quietly, \"do you understand what this is? Fra Angelico is perhaps the most sought-after religious painter in Italy right now. Cardinals and dukes beg for his work. He typically refuses commissions outside his monastery because he believes his painting should serve God directly, not worldly glory.\"\n\n\"And Pope Martin—on his deathbed—commanded him to paint your wedding. Among his final acts, the Pope arranged this. He wanted you painted by someone who understands that art can be prayer, that beauty can testify to divine truth.\"\n\nÁlvaro paces, clearly moved. \"I've seen Fra Angelico's work in Florence. The Annunciation he painted for Cortona—people weep before it. The frescoes he's creating at San Marco—they say viewing them is like glimpsing heaven. His use of light, the way faces seem illuminated from within... it's revolutionary, but in service of faith, not innovation for its own sake.\"\n\nHe turns back to you. \"This man will paint your wedding not as political event but as sacred moment. He'll make the banner glow like it holds actual holiness. He'll make your face and Isabel's look like God's blessing rests visibly upon you. This won't be a portrait—it will be testimony.\"\n\n\"And the devotional piece for Isabel?\" Álvaro's voice softens. \"That's extraordinary thoughtfulness. He's thought about her, praying alone while you're at war, and wants to give her something that strengthens her faith. That's not just an artist—that's a man of God.\"\n\nHe picks up the letter again. \"The cost is reasonable—500 florins plus monastery donation. Say another 200 florins for the donation. Total: 700 florins for two paintings by one of Europe's finest religious artists. And he'll be praying for your crusade daily while he works.\"\n\nÁlvaro looks at you seriously. \"There's also symbolic significance. Having a Dominican friar—a man under holy vows—paint your wedding adds immense religious legitimacy. Critics can't claim your crusade is merely political ambition when the Church's own religious orders are dedicating their greatest talents to immortalizing it.\"\n\n\"And this connects to Pope Martin's dying wishes. When Martin dies—could be any day—you'll be able to say: 'The Pope's final command was that Fra Angelico paint my wedding.' That's leverage in Rome for years.\"\n\nHe smiles slightly. \"Also, having him stay at the Dominican monastery while working means he's not in the Alcázar disrupting court life. He'll come for sittings, but otherwise he'll be in his natural habitat—praying, painting, surrounded by other friars.\"\n\n\"The timeline works too. He arrives January, you and Isabel sit for him over winter and early spring, he finishes by June. Both paintings completed before next campaign season.\"\n\nÁlvaro sets the letter down carefully. \"My recommendation: Accept immediately. Write to Fra Angelico expressing profound gratitude and acknowledging the Pope's command. Also write to the prior of San Marco thanking him for releasing Fra Angelico, and commit to a generous donation—say 300 florins—for their monastery work.\"\n\n\"Total cost: 800 florins for two masterworks by Fra Angelico, plus the spiritual legitimacy of having a Dominican friar declare your crusade worthy of his prayers and talent.\"\n\nHe pauses. \"Also... you should tell Isabel about the devotional piece. She'll be deeply moved. A master painter creating something specifically for her private prayers? That's a gift she'll treasure more than jewels.\"\n\n\"What do you think? Shall I draft the acceptance letters?\""
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_1431_00145",
      "book": 1,
      "chapter": "1.24",
      "date": "1431-10-18",
      "end_date": null,
      "type": "military_action",
      "summary": "Juan proposes establishing a Royal Military Academy and artillery foundry to consolidate the military expertise arriving from across Europe. The academy would systematically capture knowledge from French veterans, Italian condottieri, Hungarian officers, German knights, and Burgundian craftsmen. Juan corrects Alvaro for overstepping into military doctrine design, emphasizing that the king and constable should set up the institutional structure and funding while letting the foreign experts develop actual doctrine and organization. The foundry would be established to produce indigenous cannons for both land and naval use.",
      "characters": [
        "juan_ii",
        "alvaro_de_luna"
      ],
      "factions_affected": [
        "royal_court"
      ],
      "location": "Toledo",
      "tags": [
        "military_academy",
        "foundry",
        "artillery",
        "modernization",
        "institution_building"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "Yes, write him now and include a donation as well.\n\n\nAlvaro, we have an opportunity to consolidate all christian knowledge of warfare. We should set up a system, an order or something to let all these experienced commanders come up with a modern christian army. How should we organize infantry, archers or crossbowmen, cavalry and bombards? I want to set up our own foundry in Castille as well, so we can make our own cannons, for both land guns but also for our fleet."
        },
        {
          "role": "gm",
          "text": "Álvaro immediately calls for his secretary and begins dictating. \"To Fra Giovanni da Fiesole, Monastery of San Marco, Florence...\" He works quickly, his quill scratching across parchment.\n\nAfter a few minutes, he looks up. \"I'm writing two letters—one to Fra Angelico accepting with gratitude and acknowledging the Pope's command, one to his prior thanking him for releasing Fra Angelico with a commitment of 300 florins for San Marco's renovations. The total commission plus donation: 800 florins. The letters will go out today.\"\n\nHe seals both letters, hands them to a courier with instructions, then turns back to you with growing excitement.\n\n\"Now, about this military consolidation...\" He stands and begins pacing, the way he does when an idea captures him. \"Juan, this is brilliant. You're bringing together some of the finest military minds in Europe, and they're all going to be here at once. If you don't systematically extract their knowledge, you waste the opportunity.\"\n\nHe pulls out a fresh sheet of parchment. \"Let me think this through. You're not just asking about organizing an army—you're proposing to create an institution that captures and preserves military knowledge. Something permanent.\"\n\nTHE MILITARY ACADEMY CONCEPT\n\n\"Here's what I propose: Don't call it an 'order'—that implies military-religious organization like the Templars. Those have complicated politics and papal oversight. Instead, create something new: a Royal Military Academy or War College. A permanent institution dedicated to the study and teaching of warfare.\"\n\nHe starts writing as he speaks:\n\nLocation: \"We should establish it in Toledo. Central location, royal capital, accessible. Use part of the Alcázar or establish it in a separate facility nearby. Needs classrooms, training grounds, a library for military texts, workshops for studying equipment and weapons.\"\n\nPurpose:\n\nTrain officers for Castilian army in modern warfare\n\nPreserve military knowledge systematically\n\nConduct studies on tactics, strategy, logistics\n\nDevelop doctrine for combined-arms operations\n\nTest new weapons and techniques\n\nCreate standardized training for different troop types\n\nFaculty:\nÁlvaro's eyes light up. \"This is where it gets exciting. You have incredible expertise arriving:\"\n\nInfantry Tactics:\n\nFrench veterans (Joan of Arc's soldiers) - they broke English longbow dominance\n\nItalian condottieri - professional infantry coordination\n\nHungarian officers - fighting disciplined Ottoman janissaries\n\nGerman knights - traditional heavy infantry\n\nCavalry Operations:\n\nHungarian expertise (János Hunyadi) - counter-Ottoman cavalry tactics\n\nItalian condottieri (Micheletto Attendolo) - cavalry tactician\n\nSpanish experience - light cavalry raiding and heavy cavalry charges\n\nCombine into comprehensive cavalry doctrine\n\nArtillery and Siege Warfare:\n\nGiovanni da Tolentino (Italian artillery expert from Milan)\n\nFrançois Sforza (master of siege warfare)\n\nJean Hennecart (Burgundian cannon founder)\n\nGuillaume Balard (French master siege engineer)\n\nMilan's six bombards and crews to study\n\nCombined Arms Coordination:\n\nItalian condottieri specialize in this - professional coordination of different troop types\n\nFrench experience integrating artillery with traditional forces\n\nYour own experience at Alcalá la Real - decisive combined-arms victory\n\n\"You create a faculty of masters in each discipline. They don't just command troops—they teach what they know. Young nobles and promising officers attend to learn. Over years, you create a corps of Castilian officers trained in the most modern methods in Europe.\"\n\nARMY ORGANIZATION - MODERN COMBINED ARMS\n\nÁlvaro draws a rough diagram. \"Based on what we know from these experts, here's how a modern army should be organized:\"\n\nTHE INFANTRY CORE:\n\n\"Infantry is the foundation—this is the Italian lesson. They've moved beyond feudal levies to professional infantry formations.\"\n\nPike Blocks (Heavy Infantry):\n\n500-1000 men in tight formation\n\nLong pikes (16-18 feet) creating hedgehog defense\n\nCan hold ground against cavalry\n\nSwiss and Italian models proving this works\n\nSpanish will need to develop this - we're still too cavalry-focused\n\nSword-and-Buckler Men (Assault Infantry):\n\n200-300 men per battalion\n\nClose combat specialists\n\nBreak enemy formations after pikes hold them\n\nSpanish are actually good at this already\n\nCrossbowmen/Archers (Missile Infantry):\n\n300-400 per battalion\n\nCrossbows preferred for training time and armor penetration\n\nIntegrate with pike blocks for mutual support\n\nPavise shields for protection while reloading\n\n\"The French have learned this the hard way fighting English longbows. You can't just have pure heavy cavalry anymore. Infantry with pikes and missiles can break cavalry charges. The key is integration—each troop type supports the others.\"\n\nStandard Infantry Battalion:\n\n1,000 pikemen (heavy infantry core)\n\n300 sword-and-buckler men (assault troops)\n\n400 crossbowmen (missile support)\n\n100-150 support (drummers, standard bearers, officers)\n\nTotal: ~1,800-2,000 men per battalion\n\n\"Create multiple battalions. They can operate independently or combine for major battles. Flexibility is key.\"\n\nTHE CAVALRY ARM:\n\n\"Cavalry is where Castile already excels, but we can modernize.\"\n\nHeavy Cavalry (Men-at-Arms):\n\n100-200 per squadron\n\nFull plate armor, lances, swords\n\nDecisive shock troops for breakthrough\n\nBut can't win battles alone anymore\n\nMust coordinate with infantry\n\nLight Cavalry (Jinetes):\n\n100-200 per squadron\n\nSpanish specialty - fast, mobile\n\nRaiding, reconnaissance, pursuit\n\nJavelins and light lances\n\nEssential for campaign operations\n\nMedium Cavalry:\n\n100-200 per squadron\n\nCompromise between heavy and light\n\nCan charge or skirmish as needed\n\nVersatility valuable\n\n\"The Hungarian model is instructive. They fight Ottomans who have superb cavalry. Hunyadi can teach us how to counter fast, mobile cavalry armies. Combine that with Italian expertise in heavy cavalry deployment and Spanish light cavalry tradition—you create the finest cavalry arm in Europe.\"\n\nCavalry Organization:\n\nMix heavy, medium, and light in combined formations\n\nHeavy for punch, light for flexibility, medium for adaptability\n\nDon't segregate completely - they must learn to work together\n\nSquadron of 300-500 mixed cavalry can handle multiple situations\n\nARTILLERY - THE REVOLUTION\n\nÁlvaro's voice becomes intense. \"This is the future. Artillery is transforming warfare, and most commanders don't understand it yet.\"\n\n\"You have three artillery experts arriving: Giovanni da Tolentino from Milan, Jean Hennecart from Burgundy, Guillaume Balard from France. Plus Milan's sending six bombards with crews. This is unprecedented expertise.\"\n\nTypes of Guns:\n\nBombards (Heavy Siege Guns):\n\nVery large, slow to move\n\nDevastating against fortifications\n\nTakes hours to position and aim\n\nRate of fire: 2-4 shots per day\n\nBut those shots can breach walls\n\nCulverins (Medium Guns):\n\nMore mobile than bombards\n\nCan move with army\n\nRate of fire: 6-10 shots per day\n\nEffective against field fortifications and massed troops\n\nRibaults/Organ Guns (Light Artillery):\n\nMultiple small barrels on wheeled frame\n\nRapid fire for battlefield use\n\nPsychological impact significant\n\nGood against infantry formations\n\n\"The key lesson from your experts: Artillery must be mobile. Traditional siege guns are too slow. You need guns that can move with the army, that can deploy in field battles, that can reposition quickly.\"\n\nArtillery Organization:\n\n\"Create an Artillery Train as permanent formation:\"\n\n10-15 bombards (siege work)\n\n20-30 culverins (field work)\n\n15-20 light guns (battlefield support)\n\nTotal: 45-65 guns\n\n\"Each gun needs crew of 5-8 men, plus wagons for powder and shot, plus oxen/horses to move them. An artillery train of 50 guns requires ~400 men and 200+ animals. It's expensive and logistically complex.\"\n\n\"But—\" Álvaro emphasizes, \"—the Italian and French experts all say the same thing: Artillery wins sieges and can break field armies. It's worth the investment.\"\n\nCOMBINED ARMS COORDINATION:\n\n\"This is where it all comes together. The Italian condottieri are masters of this.\"\n\nStandard Army Organization:\n\nBattle Corps (10,000-15,000 men):\n\n4-5 infantry battalions (~8,000 men)\n\n3-4 cavalry squadrons (~1,500 men)\n\nArtillery train (20-30 guns)\n\nSupport services (~500 men)\n\n\"Each corps can operate independently or combine for major campaigns.\"\n\nBattle Deployment:\n\nInfantry center with pikes forward, missiles behind\n\nArtillery positioned to enfilade enemy approaches\n\nHeavy cavalry on flanks for decisive charges\n\nLight cavalry screening and raiding\n\nReserve of mixed troops for exploitation\n\n\"The key is training. These troop types must practice working together. Infantry must know how to create lanes for cavalry charges. Cavalry must know not to block artillery fire lanes. Artillery must know infantry positions to avoid friendly fire.\"\n\n\"Your Military Academy teaches this. Officers rotate through different arms to understand how each works. They conduct exercises. They study past battles to understand what succeeds and what fails.\"\n\nTHE FOUNDRY - ARTILLERY PRODUCTION\n\nÁlvaro pulls out another sheet. \"Now, about cannon production. This is critical for long-term power.\"\n\n\"Currently, we buy or capture guns. That makes us dependent on foreign suppliers or enemy stockpiles. We need indigenous production capability.\"\n\nThe Burgundian Expert:\n\n\"Jean Hennecart—the Burgundian cannon founder Philip is sending—is the key. Burgundy has some of the best gun-founding technology in Europe. Hennecart will bring that knowledge.\"\n\nFoundry Location:\n\n\"I recommend Seville for the main foundry:\"\n\nRiver access for transport\n\nNear Atlantic coast for naval guns\n\nExisting metalworking infrastructure\n\nClose to campaign areas (Granada, future African operations)\n\nLarge enough city to support the workforce\n\n\"Establish a Royal Foundry there. Not private contractors—crown-operated facility. This gives you control over production, quality, and innovation.\"\n\nInitial Setup:\n\n\"Work with Hennecart to establish:\"\n\nBronze casting facilities (cannon are bronze, not iron—stronger, lighter)\n\nPattern workshops (create molds for different gun sizes)\n\nPowder mills (you need gunpowder production too)\n\nShot casting (stone or iron balls)\n\nProof grounds (test guns safely before deployment)\n\nCost: \"Initial setup: 40,000-50,000 florins\"\n\nBuilding facilities\n\nHiring master founders and apprentices\n\nPurchasing copper and tin (bronze ingredients)\n\nCreating tools and molds\n\nBuilding powder mills\n\n\"But once operational, you can produce guns continuously. A good foundry can cast 15-20 guns per year plus ammunition.\"\n\nNaval Guns:\n\n\"For your fleet, you need smaller, more robust guns:\"\n\nBombards too heavy for ships\n\nNeed lighter culverins and smaller pieces\n\nDifferent mounting requirements (recoil on ships)\n\nBronze preferred (doesn't rust in salt air)\n\n\"The Italian and Portuguese experts can advise on naval gun deployment. Portugal's been arming ships for African expeditions—they know what works.\"\n\nStandardization:\n\n\"This is crucial. Create standard gun sizes:\"\n\nHeavy siege bombard (one standard size)\n\nMedium culverin (one standard size)\n\nLight field gun (one standard size)\n\nNaval guns (2-3 standard sizes)\n\n\"Standardization means interchangeable parts, common ammunition, consistent training. Revolutionary concept that few realize yet.\"\n\nORGANIZATION AND TIMELINE\n\nÁlvaro lays out a plan:\n\nWinter 1431-1432:\n\nForeign experts arrive in Toledo\n\nEstablish initial academy structure\n\nBegin officer training programs\n\nHennecart starts foundry planning\n\nSpring 1432:\n\nAcademy fully operational\n\nFirst class of officers in training\n\nFoundry construction begins in Seville\n\nField exercises with new organization\n\n1433-1434:\n\nFoundry operational, producing first guns\n\nAcademy graduates first officer class\n\nArmy reorganized into new battalion/squadron structure\n\nDoctrine manuals written and distributed\n\nLong-term (5-10 years):\n\nMultiple academy classes graduated\n\nCastilian officer corps fully trained in modern methods\n\nFoundry producing 15-20 guns annually\n\nArmy reorganized completely into professional combined-arms force\n\nCOSTS AND BENEFITS\n\n\"Let's be realistic about costs:\"\n\nAnnual Academy Costs:\n\nFaculty salaries: 15,000 florins (foreign experts paid well)\n\nFacilities and supplies: 5,000 florins\n\nStudent support: 5,000 florins\n\nTotal: ~25,000 florins/year\n\nFoundry Costs:\n\nInitial setup: 50,000 florins (one-time)\n\nAnnual operations: 30,000 florins\n\nMaterials (copper, tin): 20,000 florins/year\n\nTotal: ~50,000 florins/year after setup\n\nArmy Reorganization:\n\nTraining costs: 10,000 florins\n\nNew equipment: 20,000 florins\n\nStandardization: 15,000 florins\n\nTotal: ~45,000 florins over 2-3 years\n\n\"So we're talking about 120,000-150,000 florins initial investment, then 75,000 florins annually to maintain.\"\n\nÁlvaro looks up. \"That's expensive. BUT—\"\n\nThe Benefits:\n\n\"First, you create the most modern, professional army in Europe. Better trained, better equipped, better organized than anyone except maybe the Ottomans.\"\n\n\"Second, you capture and preserve military knowledge. When Francesco Sforza and János Hunyadi eventually leave, their knowledge stays in your manuals and your officers' training.\"\n\n\"Third, indigenous artillery production means you're never dependent on foreign suppliers. In twenty years, you could be exporting guns to other kingdoms.\"\n\n\"Fourth, the officer training creates loyal, competent commanders. Noble sons attend your academy, learn modern warfare, develop loyalty to the crown. This builds the professional military establishment you need.\"\n\n\"Fifth, this makes the Perpetual Crusade Fund viable. You're showing nobles you're building institutions for permanent expansion. This isn't one crusade—it's preparation for decades of conquest.\"\n\nÁlvaro sets down his quill and looks at you seriously.\n\n\"Your Majesty, what you're proposing is revolutionary. Most kings just hire whoever's available when war comes. You're proposing to systematically study warfare, preserve knowledge, train officers, produce weapons, and create doctrine. This is... state-building at the highest level.\"\n\n\"The foreign experts arriving give you the perfect excuse. You're not inventing this from nothing—you're consolidating European best practices. French siege craft, Italian combined-arms tactics, Hungarian cavalry expertise, Burgundian artillery technology. Bring it all together, make it Castilian, institutionalize it.\"\n\n\"If you do this right, in twenty years Castile has the most professional military establishment in Christendom. And that translates to power—power to complete Granada, conquer North Africa, support allies, project force anywhere you choose.\"\n\nHe pauses. \"Should I begin drafting the organizational structure? We can present it at the Cortes alongside the tax reform. Show nobles where their money goes: not just current campaigns but building permanent military superiority.\"\n\nWhat are your thoughts? Should we proceed with this? And are there specific aspects you want to emphasize or modify?"
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_1431_00146",
      "book": 1,
      "chapter": "1.24",
      "date": "1431-10-18",
      "end_date": null,
      "type": "economic",
      "summary": "Juan and Alvaro conduct a comprehensive treasury review with corrected accounting in maravedis. The Crown Treasury holds approximately 214,000 florins after incorporating the Portuguese dowry (180,000 florins) and all conquest booty (70,943 florins) as crown rather than crusade revenue. The Crusade Treasury holds approximately 531,000 florins, strictly ring-fenced under papal oversight and cannot be transferred to crown operations per the papal bull. Juan redirects the dowry and all captured treasures to the crown treasury to address the kingdom's structural revenue deficit, while crusade funds remain exclusively for military operations against Granada.",
      "characters": [
        "juan_ii",
        "alvaro_de_luna"
      ],
      "factions_affected": [
        "royal_court"
      ],
      "location": "Toledo",
      "tags": [
        "treasury",
        "finances",
        "accounting",
        "crown_revenue",
        "crusade_fund",
        "papal_oversight"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "My Alvaro... I did not know you were a general as well! \nWhy dont you leave the design of the new modern Castillian army to the experts will you? I as king also depend heavily on the advice and expertise of those with more knowledge. It's up to us to set up the structure and fund it. Then let the experts develop the correct and most useful doctrines. And then we need to teach officers indeed.\n\n\nNow lets review the treasury. We have or are about to recieve a lot of funds. How is our treasury doing? And seperate the money set aside for the crusade and the treasury of the crown itself."
        },
        {
          "role": "gm",
          "text": "Good correction from the user - Álvaro got too into the weeds of military organization. The user is right that Juan should set up the structure and funding, then let the actual military experts (the foreign commanders arriving) develop the doctrine. That's more realistic and better leadership.\n\nNow I need to do a comprehensive treasury review. Let me track:\n\n1. Crown Treasury (general funds)\n2. Crusade Treasury (specific to Granada campaign)\n\nI need to look back at what we know about finances from the project files and track:\n- Starting funds\n- Income sources (taxes, crusade taxation, foreign aid, etc.)\n- Expenses (campaign costs, garrisons, etc.)\n- Current balances\n\nLet me search the project files for financial information.\n\nÁlvaro laughs, actually laughs—a genuine, self-deprecating sound. \"You're absolutely right, Your Majesty. I got carried away. I'm a bureaucrat and political advisor, not a military commander. I was doing exactly what I shouldn't—trying to design things I don't understand.\"\n\nHe sets aside his military diagrams with a rueful smile. \"What you need from me is simple: establish the academy structure, secure the funding, hire the experts, then get out of their way. Let Francesco Sforza and János Hunyadi and the others figure out how to organize an army. They're the ones who've actually commanded in battle.\"\n\n\"I'll focus on what I'm good at: administration, budgets, and making sure the institution functions properly. Leave the warfare to warriors.\"\n\nHe pulls out a much thicker ledger—the royal accounts. \"Now, the treasury. This I actually understand. Let me give you a comprehensive picture.\"\n\nCOMPREHENSIVE TREASURY REVIEW - OCTOBER 1431\n\nÁlvaro spreads out multiple account books. \"I maintain separate ledgers for crown funds and crusade-specific funds, as you requested. Let me walk through both.\"\n\nI. CROWN TREASURY (General Kingdom Funds)\n\nSTARTING POSITION (January 1431):\n\nBalance after Portuguese dowry received: 180,000 florins\n\nPlus existing treasury: ~30,000 florins\n\nTotal: 210,000 florins\n\nINCOME (January-October 1431):\n\nRegular Crown Revenue:\n\nNormal taxation (January-October): ~200,000 florins\n\nRoyal domain revenues: ~40,000 florins\n\nCustoms and trade: ~25,000 florins\n\nJudicial fees and fines: ~8,000 florins\n\nSubtotal: 273,000 florins\n\nSpecial Income:\n\nChurch crusade taxation (10% church revenues): ~35,000 florins\n\nNoble crusade taxation (5% with service exemptions): ~45,000 florins\n(Less than projected due to many nobles serving personally)\n\nSubtotal: 80,000 florins\n\nTOTAL CROWN INCOME (10 months): 353,000 florins\n\nEXPENSES (January-October 1431):\n\nGovernment Operations:\n\nRoyal household: ~35,000 florins\n\nAdministrative costs: ~25,000 florins\n\nJudicial system: ~10,000 florins\n\nDiplomatic missions: ~8,000 florins\n\nSubtotal: 78,000 florins\n\nNon-Crusade Military:\n\nRoyal garrisons (non-Granada): ~40,000 florins\n\nBorder defenses: ~15,000 florins\n\nSubtotal: 55,000 florins\n\nInfrastructure and Development:\n\nRoad maintenance: ~5,000 florins\n\nPort improvements: ~8,000 florins\n\nVarious projects: ~7,000 florins\n\nSubtotal: 20,000 florins\n\nTOTAL CROWN EXPENSES: 153,000 florins\n\nCROWN TREASURY CURRENT BALANCE:\n\nStarting: 210,000 florins\n\nPlus income: 353,000 florins\n\nMinus expenses: -153,000 florins\n\nCurrent Balance: 410,000 florins\n\nÁlvaro looks up. \"The crown is financially healthy. Normal operations are self-sustaining, and we're actually accumulating surplus even while funding the crusade separately.\"\n\nII. CRUSADE TREASURY (Granada Campaign Specific)\n\nSTARTING POSITION (January 1431):\n\nVatican donation: 20,000 florins\n\nBarcelona/Florence/Vatican additional: 162,000 florins\n\nSet aside from Portuguese dowry: 100,000 florins\n\nTotal: 282,000 florins\n\nINCOME (January-October 1431):\n\nFrom Crown Sources (transferred):\n\nChurch crusade taxation: 35,000 florins\n\nNoble crusade taxation: 45,000 florins\n\nSubtotal: 80,000 florins\n\nForeign Aid (recently arrived):\n\nPope Martin V: 30,000 florins\n\nFrance: 40,000 florins\n\nBurgundy: 50,000 florins\n\nItalian Consortium: 120,000 florins\n\nMilan: 20,000 florins\n\nHoly Roman Empire: 15,000 florins\n\nGerman Principalities: 60,000 florins\n\nHungary: 25,000 florins\n\nPoland: 20,000 florins\n\nPortugal (additional): 40,000 florins\n\nVarious smaller powers: 20,000 florins\n\nSubtotal: 440,000 florins\n\nBooty and Conquest:\n\nLoot from Alcalá la Real: ~15,000 florins\n\nMálaga treasure: ~25,000 florins\n\nRonda payment for peace: 20,000 florins\n\nVarious fortress treasuries: ~10,000 florins\n\nSubtotal: 70,000 florins\n\nTOTAL CRUSADE INCOME (10 months): 590,000 florins\n\nEXPENSES (April-October 1431 - Campaign Season):\n\nArmy Payroll (7 months):\n\nProfessional troops (~3,000 crusaders): ~105,000 florins\n\nMercenaries and specialists: ~35,000 florins\n\nNoble levies (partial payment): ~40,000 florins\n\nSubtotal: 180,000 florins\n\nArtillery and Siege Equipment:\n\nPowder and shot: ~25,000 florins\n\nArtillery maintenance: ~10,000 florins\n\nSiege equipment construction: ~15,000 florins\n\nSubtotal: 50,000 florins\n\nLogistics and Supply:\n\nFood and provisions: ~80,000 florins\n\nTransport and wagons: ~25,000 florins\n\nHorses and animals: ~20,000 florins\n\nSubtotal: 125,000 florins\n\nNaval Operations:\n\nFleet hire and operations: ~40,000 florins\n\nPort facilities: ~15,000 florins\n\nNaval supplies: ~10,000 florins\n\nSubtotal: 65,000 florins\n\nFortifications and Garrisons:\n\nGarrison payroll (conquered territories): ~60,000 florins\n\nFortress repairs: ~25,000 florins\n\nDefensive improvements: ~15,000 florins\n\nSubtotal: 100,000 florins\n\nCasualties and Rewards:\n\nDeath benefits to families: ~15,000 florins\n\nRewards for valor: ~8,000 florins\n\nMedical care: ~7,000 florins\n\nSubtotal: 30,000 florins\n\nMiscellaneous Campaign Costs:\n\nIntelligence and spies: ~5,000 florins\n\nDiplomacy and negotiations: ~8,000 florins\n\nReligious services: ~5,000 florins\n\nVarious: ~7,000 florins\n\nSubtotal: 25,000 florins\n\nTOTAL CRUSADE EXPENSES: 575,000 florins\n\nCRUSADE TREASURY CURRENT BALANCE:\n\nStarting: 282,000 florins\n\nPlus income: 590,000 florins\n\nMinus expenses: -575,000 florins\n\nCurrent Balance: 297,000 florins\n\nSUMMARY AND ANALYSIS\n\nÁlvaro sets down his quill and looks at you with satisfaction.\n\n\"Your Majesty, we're in excellent financial position. Let me break this down:\"\n\nTotal Treasury (Combined):\n\nCrown: 410,000 florins\n\nCrusade: 297,000 florins\n\nGrand Total: 707,000 florins\n\n\"This is extraordinary wealth. For context, most European kingdoms would consider 300,000 florins a good treasury. You have more than double that.\"\n\nKey Observations:\n\n1. The Crown is Self-Sustaining:\n\"Normal crown operations cost ~153,000 florins for ten months. Normal crown revenue is ~273,000 florins. You're generating 120,000 florins annual surplus even without crusade taxation. The kingdom's basic finances are healthy.\"\n\n2. The Crusade Nearly Pays for Itself:\n\"Crusade costs for seven months of intensive campaigning: 575,000 florins. That's expensive, yes—about 82,000 florins per month. But look at income:\"\n\nCrusade taxation: 80,000 florins\n\nForeign aid: 440,000 florins\n\nConquest booty: 70,000 florins\n\nTotal: 590,000 florins\n\n\"The foreign aid windfall means the campaign not only paid for itself but generated small profit. That's unprecedented.\"\n\n3. Foreign Aid is Transformative:\n\"440,000 florins from foreign Christian powers. That's more than the Portuguese dowry! And it's not a loan—it's gifts and donations. This validates your strategy of demonstrating success before asking for help.\"\n\n4. Conquest Generates Revenue:\n\"70,000 florins in booty and payments. Ronda alone contributed 20,000 florins to avoid siege. As you conquer more territory, you gain both immediate treasure and long-term tax revenue from the land.\"\n\n5. Winter Costs Will Be Much Lower:\n\"November through March, no active campaigning. Your costs drop dramatically:\"\n\nGarrison payroll continues: ~8,000 florins/month\n\nFortress maintenance: ~3,000 florins/month\n\nProfessional core troops (reduced): ~4,000 florins/month\n\nMiscellaneous: ~2,000 florins/month\n\nTotal: ~17,000 florins/month for five months = 85,000 florins\n\n\"Meanwhile, crusade taxation continues generating ~8,000-10,000 florins monthly. So winter costs are nearly covered by ongoing revenue.\"\n\nFINANCIAL PROJECTIONS\n\n\"Looking ahead to 1432:\"\n\nIf You Campaign Again (April-October 1432):\n\nCampaign costs: ~575,000 florins (similar to 1431)\n\nCrusade taxation: ~80,000 florins\n\nConquest booty: ~50,000 florins (less territory remaining)\n\nForeign aid: Unknown, but probably less than 1431's windfall\n\nNet cost: 400,000-450,000 florins\n\n\"With current crusade treasury of 297,000 florins, you'd need to transfer 150,000-200,000 florins from crown funds. Completely feasible given crown balance of 410,000 florins.\"\n\nIf You Complete Granada in 1432:\n\"Once Granada falls, expenses transform dramatically:\"\n\nNo more campaign costs\n\nGarrison costs continue but lower\n\nGranada becomes revenue-generating province\n\nCan redirect crusade taxation to other purposes\n\nForeign powers interested in next venture\n\n\"Granada province, once pacified, should generate 100,000-150,000 florins annually in taxes. Takes 2-3 years to pacify fully, but the economic potential is substantial.\"\n\nMAJOR UPCOMING EXPENSES\n\nÁlvaro flips to a new page. \"Let me note major expenses coming up:\"\n\nThe Cortes (November 1431):\n\nHosting nobles: ~10,000 florins\n\nCeremonies and banquets: ~5,000 florins\n\nTotal: ~15,000 florins (from crown treasury)\n\nFra Angelico's Commission (January-June 1432):\n\nCommission: 500 florins\n\nMonastery donation: 300 florins\n\nTotal: 800 florins (from crown treasury)\n\nMilitary Academy Setup (1432-1433):\n\nFacilities: ~30,000 florins\n\nFaculty recruitment: ~20,000 florins\n\nFirst year operations: ~25,000 florins\n\nTotal: ~75,000 florins (from crown treasury or crusade surplus)\n\nArtillery Foundry (1432-1433):\n\nInitial construction: ~50,000 florins\n\nEquipment and tools: ~20,000 florins\n\nFirst year operations: ~30,000 florins\n\nTotal: ~100,000 florins (from crusade treasury)\n\nIsabel's Childbirth (January-February 1432):\n\nMedical expenses: ~3,000 florins\n\nCelebrations: ~5,000 florins\n\nGifts and rewards: ~7,000 florins\n\nTotal: ~15,000 florins (from crown treasury)\n\n\"Combined upcoming major expenses: ~205,000 florins over the next year. Completely manageable given current balances.\"\n\nSTRATEGIC FINANCIAL RECOMMENDATIONS\n\nÁlvaro leans back. \"My recommendations:\"\n\n1. Keep Treasuries Separate:\n\"Continue maintaining separate crown and crusade treasuries. This clarity helps:\n\nNobles see crusade taxation going to crusade purposes\n\nCrown operations remain transparent\n\nWhen crusade ends, easy to redirect funds appropriately\"\n\n2. Build Crown Reserve:\n\"Aim to keep crown treasury above 300,000 florins at all times. This provides cushion for emergencies, opportunities, or unexpected needs. You're at 410,000 now—good position.\"\n\n3. Spend Crusade Surplus on Military Infrastructure:\n\"The military academy and foundry should come from crusade funds. They're investments in permanent crusading capability. This shows nobles their taxation builds lasting strength.\"\n\n4. Save Foreign Aid for 1432 Campaign:\n\"The 440,000 florins windfall should mostly stay in crusade treasury for final push against Granada. Don't spend it on non-military items.\"\n\n5. After Granada Falls:\n\"Carefully manage transition from crusade taxation to permanent taxation. The Perpetual Crusade Fund concept lets you keep collecting but redirect to new ventures. This maintains revenue stream while changing purpose.\"\n\nÁlvaro closes the ledgers. \"Your Majesty, in summary: You're rich. The kingdom is financially healthy. The crusade is nearly self-funding thanks to foreign support. You have resources to complete Granada, build military infrastructure, and prepare for whatever comes next.\"\n\n\"The Cortes tax reform isn't about desperate need for money—it's about long-term structural transformation. You're showing nobles that systematic funding of military power generates returns: conquest, booty, international prestige, and opportunities for their families.\"\n\nHe smiles. \"This is what successful monarchy looks like. The treasury is full, the army is winning, foreign powers are competing to support you, and you're building institutions that will serve Castile for generations.\"\n\n\"Any questions about the finances? Or should we move on to preparing for the Cortes?\""
        },
        {
          "role": "player",
          "text": "I think this budget is not consistent with warlier treasury talks.\n\n\nFrom chapter 1: Alvaro said the following about the treasury: Also look at the project files and at the expected budget for the crusade 1431.\n\n\nTHE ROYAL TREASURY - DETAILED SITUATION\n\"Your Majesty, let me be honest about our financial position. It's... manageable, but constrained.\"\nHe runs his finger down columns of figures:\nANNUAL REVENUE: Approximately 30 million maravedís\nThis comes from:\n\n\nRoyal domain taxes: Towns and lands directly controlled by the crown (~12 million)\n\nCustoms and trade duties: Especially from Seville, Burgos, and northern ports (~6 million)\n\nSales taxes (alcabalas): Levied on transactions throughout the realm (~8 million)\n\nEcclesiastical contributions: Certain Church revenues the Pope allows you to collect (~2 million)\n\nJewish and Muslim community taxes: Special levies on religious minorities (~1.5 million)\n\nMiscellaneous: Fines, fees, confiscations (~500,000)\nANNUAL EXPENSES: Approximately 28 million maravedís\n\nRoyal household: Your court, servants, officials, palaces (~8 million)\n\nMilitary: The standing royal guard, frontier garrisons, castle maintenance (~7 million)\n\nAdministrative costs: Corregidores, officials, messengers, legal system (~4 million)\n\nDebt service: Interest on loans from Italian and Jewish bankers (~3 million)\n\nChurch donations and obligations: Expected royal piety (~2 million)\n\nDiplomatic expenses: Embassies, gifts, bribes (~1.5 million)\n\nMiscellaneous: Emergencies, construction, unexpected needs (~2.5 million)\n\"So theoretically, Your Majesty, we run a small surplus of about 2 million maravedís annually. Theoretically.\"\nHe looks up from the ledgers, his expression wry.\nTHE REALITY\n\"In practice, several problems constrain us:\nFirst, the nobles pay almost nothing. The great houses claim vast tax exemptions based on ancient privileges. They control perhaps 60% of Castile's wealth but contribute maybe 5% of royal revenue. Every attempt to tax them properly triggers rebellion threats.\nSecond, collection is inefficient. We're supposed to get 30 million, but perhaps 20% never makes it to the royal coffers. Local officials skim, nobles intimidate tax collectors, towns claim poverty and negotiate reductions. Our actual liquid revenue is closer to 24 million.\nThird, unexpected expenses are constant. A noble rebellion costs millions. A bad harvest requires grain purchases to prevent starvation. A diplomatic crisis needs sudden gifts of gold. The 'miscellaneous' category always exceeds estimates.\nFourth, the debt. We owe approximately 15 million maravedís to various creditors—mostly Italian banking families and wealthy Jewish financiers in Castile. That debt service of 3 million annually just keeps us even; we're not paying down the principal.\nCurrent liquid assets—meaning gold and silver actually in the treasury right now—amount to perhaps 1.2 million maravedís. Enough for a few months of operations if revenues stopped, but not a comfortable cushion.\""
        },
        {
          "role": "gm",
          "text": "Annual revenue: 30 million maravedís\nAnnual expenses: 28 million maravedís\nCurrent liquid assets: 1.2 million maravedís\nDebt: 15 million maravedís owed to creditors\n\nThe user also mentions looking at the expected budget for the crusade in 1431. Let me search for that.\n\nI was using florins when I should have been using maravedís. And my numbers were WAY too high. The crown doesn't have 410,000 florins sitting around - it has much more modest resources.\n\nI need to search the project files for the actual crusade budget that was established.\n\nYou're absolutely correct. I apologize - I got completely off track with those numbers. Let me search the project files for the actual treasury situation and crusade budget.\n\nPerfect! Now I have the actual numbers. Let me recalculate properly using the established figures:\n\nFrom Chapter 1:\n- Annual revenue: 30 million maravedís \n- Annual expenses: 28 million maravedís\n- Current liquid assets: 1.2 million maravedís\n- Debt: 15 million maravedís\n\nFrom the Campaign Budget document:\n- Available treasury for crusade (January 1431): 390,200 florins\n  - Barcelona: 82,000 florins\n  - Florence: 60,000 florins\n  - Papal treasury: 20,000 florins\n  - Papal Legate (Capranica): 45,000 florins\n  - Portuguese dowry: 180,000 florins\n  - Seville donations: ~3,200 florins\n\n- Campaign costs (8 months): 143,171 florins\n- Expected crusade taxation: 24,000-38,000 florins for 8 months\n- Exchange rate: 1 florin = 265 maravedís\n\nSo now I need to recalculate what the treasury looks like in October 1431, accounting for:\n1. The crusade spent 143,171 florins (budgeted) but probably more given all the events\n2. Crusade taxation brought in some revenue\n3. The massive foreign aid just arrived (440,000+ florins)\n4. Regular crown revenue and expenses continued separately\n\nLet me be more careful and realistic this time.\n\nYou're absolutely right, and I apologize for that mistake. Let me pull up the actual numbers from the established documents and recalculate properly.\n\n**Established Facts from Chapter 1:**\n- Annual crown revenue: ~30 million maravedís (actual collection ~24 million due to corruption)\n- Annual crown expenses: ~28 million maravedís\n- Normal surplus: ~2 million maravedís\n- Liquid assets (January 1430): ~1.2 million maravedís\n- Crown debt: 15 million maravedís\n\n**From Campaign Budget (January 1431):**\n- Crusade treasury available: 390,200 florins\n- Campaign costs (budgeted for 8 months): 143,171 florins\n- Expected crusade taxation: 24,000-38,000 florins (8 months)\n- Exchange rate: 1 florin = 265 maravedís\n\n**Now in October 1431, I need to account for:**\n1. Crown operations January-October (10 months)\n2. Crusade campaign April-October (7 months actual fighting)\n3. Crusade taxation collected\n4. Foreign aid just arrived (440,000+ florins!)\n5. Booty from conquests\n\nLet me calculate more realistically...\n\nÁlvaro looks chagrined. \"You're right, Your Majesty. My apologies - those numbers were completely wrong. Let me pull the actual ledgers and give you the real situation.\"\n\nHe sets aside his incorrect calculations and pulls out the proper account books.\n\nCORRECTED TREASURY REVIEW - OCTOBER 1431\n\n\"Let me start from the beginning with the actual numbers we've been working with.\"\n\nI. CROWN TREASURY (General Kingdom Operations)\n\nBASELINE (from Chapter 1, Spring 1430):\n\nAnnual revenue: ~30 million maravedís (but actual collection ~24 million due to corruption)\n\nAnnual expenses: ~28 million maravedís\n\nNormal surplus: ~2 million maravedís\n\nLiquid assets (Spring 1430): ~1.2 million maravedís\n\nOutstanding debt: 15 million maravedís to Italian and Jewish bankers\n\nCROWN OPERATIONS (May 1430 - October 1431, ~18 months):\n\nRevenue (18 months):\n\nNormal taxation and revenues: ~36 million maravedís (18 months worth)\n\nActual collected: ~29 million maravedís (20% loss to corruption)\n\nConverted to florins: ~109,434 florins\n\nExpenses (18 months):\n\nRoyal household: ~12 million maravedís\n\nNon-crusade military (garrisons, border defense): ~10.5 million maravedís\n\nAdministration, diplomacy, judicial system: ~7 million maravedís\n\nDebt service: ~4.5 million maravedís (interest only)\n\nMiscellaneous: ~6 million maravedís\n\nTotal: ~40 million maravedís = ~150,943 florins\n\nCROWN TREASURY BALANCE (October 1431):\n\nStarting liquid assets (May 1430): ~1.2 million maravedís = ~4,528 florins\n\nPlus revenue collected: ~29 million maravedís = ~109,434 florins\n\nMinus expenses: ~40 million maravedís = ~150,943 florins\n\nCurrent Balance: DEFICIT of ~10.8 million maravedís = ~40,755 florins in the red\n\nÁlvaro winces. \"The crown operations have actually been running a deficit. We've been covering it by delaying some payments and extending some debts. This is why the tax reform is so critical - the kingdom cannot sustain crusading operations AND normal expenses on current revenue.\"\n\nII. CRUSADE TREASURY (Separate Accounting)\n\nSTARTING POSITION (January 1431):\n\nBarcelona donations: 82,000 florins\n\nFlorence donations: 60,000 florins\n\nPapal treasury: 20,000 florins\n\nCapranica (Papal Legate): 45,000 florins\n\nPortuguese dowry: 180,000 florins\n\nSeville donations: ~3,200 florins\n\nTotal: 390,200 florins\n\nCAMPAIGN COSTS (April-October 1431, 7 months actual):\n\nOriginal 8-month budget was 143,171 florins. For 7 months of actual campaigning, adjusted:\n\nWestern Army operations: ~66,000 florins\n\nEastern Army operations: ~31,000 florins\n\nShared costs: ~25,000 florins\n\nContingency spending (disasters, opportunities): ~20,000 florins\n\nTotal spent: ~142,000 florins\n\n\"The budget held surprisingly well. The ambush disaster and additional operations roughly balanced out with some unused contingency funds.\"\n\nCRUSADE TAXATION REVENUE (April-October, 7 months):\n\nNoble estates (5%): ~4.5 million maravedís = ~16,981 florins\n\nChurch properties (10%): ~1.5 million maravedís = ~5,660 florins\n\nTotal: ~6 million maravedís = ~22,641 florins\n\n\"Less than projected because many nobles served personally and received exemptions. Also, assessment was ongoing so full collection didn't start until June.\"\n\nCONQUEST BOOTY:\n\nAlcalá la Real treasury: ~4 million maravedís = ~15,094 florins\n\nMálaga treasure: ~7 million maravedís = ~26,415 florins\n\nRonda payment: ~5.3 million maravedís (20,000 florins)\n\nVarious fortress treasuries: ~2.5 million maravedís = ~9,434 florins\n\nTotal: ~18.8 million maravedís = ~70,943 florins\n\nFOREIGN AID (just arrived, October):\n\nVatican: 30,000 florins\n\nFrance: 40,000 florins\n\nBurgundy: 50,000 florins\n\nItalian Consortium: 120,000 florins\n\nMilan: 20,000 florins\n\nHoly Roman Empire: 15,000 florins\n\nGerman Principalities: 60,000 florins\n\nHungary: 25,000 florins\n\nPoland: 20,000 florins\n\nPortugal (additional): 40,000 florins\n\nVarious smaller: 20,000 florins\n\nTotal: 440,000 florins\n\nCRUSADE TREASURY BALANCE (October 1431):\n\nStarting: 390,200 florins\n\nMinus campaign costs: -142,000 florins\n\nPlus taxation: +22,641 florins\n\nPlus booty: +70,943 florins\n\nPlus foreign aid: +440,000 florins\n\nCurrent Balance: 781,784 florins\n\nCOMBINED FINANCIAL PICTURE\n\nÁlvaro looks up from the ledgers. \"Here's where we actually stand:\"\n\nCrown Treasury: -40,755 florins (in deficit)\nCrusade Treasury: +781,784 florins (substantial surplus)\n\n\"The crown operations are technically insolvent without the crusade funds. But the crusade has been wildly successful financially.\"\n\nÁLVARO'S ANALYSIS\n\n\"Your Majesty, this tells several important stories:\"\n\n1. The Kingdom Cannot Afford Crusading on Normal Revenue:\n\"We're running 40,000 florins in the red on basic government operations over 18 months. The old tax system simply doesn't generate enough revenue. Every month we delay reform, we sink deeper.\"\n\n2. The Crusade Has Been Financially Transformative:\n\"The crusade treasury has nearly 800,000 florins. That's extraordinary. The foreign aid windfall—440,000 florins—is more than double the entire Portuguese dowry. Combined with booty and crusade taxation, the campaign has been wildly profitable.\"\n\n3. We Need to Transfer Funds:\n\"We should immediately transfer ~50,000 florins from crusade treasury to crown treasury to cover the operating deficit and build a small reserve. This is legitimate—these treasuries were always meant to support each other.\"\n\n4. The Cortes Tax Reform is Essential:\n\"Without reform, the crown cannot function. Even if we end the crusade tomorrow, we're barely breaking even on normal operations. With reform—getting nobles to pay even 5% of actual revenue—we'd add 8-12 million maravedís annually. That's the difference between insolvency and strength.\"\n\n5. Winter Will Be Cheaper:\n\"November through March, crusade costs drop dramatically. Maybe 15,000-20,000 florins total for five months of garrison maintenance and professional core. The crusade taxation continues generating ~2,500-3,000 florins monthly. So winter nearly pays for itself.\"\n\nPROJECTIONS FOR 1432\n\n\"Looking ahead:\"\n\nIf We Campaign Again (April-November 1432):\n\nCampaign costs: ~140,000-150,000 florins (similar to 1431)\n\nCrusade taxation: ~22,000-25,000 florins\n\nConquest booty: ~40,000-50,000 florins (less territory left)\n\nForeign aid: Unknown, probably much less than 1431's windfall\n\nNet cost from crusade treasury: ~50,000-80,000 florins\n\n\"Completely affordable given current crusade balance of 780,000 florins.\"\n\nIf Tax Reform Passes at Cortes:\n\nAdditional annual revenue: 8-12 million maravedís = 30,000-45,000 florins\n\nCrown moves from deficit to surplus\n\nCan sustain crusading indefinitely\n\nCan invest in military infrastructure (academy, foundry)\n\nMAJOR UPCOMING EXPENSES\n\n\"Here are the big costs coming up, using correct accounting:\"\n\nWinter Maintenance (November 1431 - March 1432):\n\nGarrison payroll and maintenance: ~4 million maravedís = ~15,094 florins\n\nFrom: Crusade treasury + ongoing taxation revenue\n\nThe Cortes (November 1431):\n\nHosting, ceremonies: ~4 million maravedís = ~15,094 florins\n\nFrom: Should transfer from crusade treasury (it's crusade-related)\n\nFra Angelico Commission:\n\n800 florins total (500 + 300 donation)\n\nFrom: Crown treasury (after we transfer funds to cover deficit)\n\nMilitary Academy Setup (1432):\n\n~75,000 florins over 1-2 years\n\nFrom: Crusade treasury (it's military infrastructure)\n\nArtillery Foundry (1432-1433):\n\n~100,000 florins initial + operations\n\nFrom: Crusade treasury (military infrastructure)\n\nIsabel's Childbirth (January-February):\n\n~4 million maravedís = ~15,094 florins\n\nFrom: Crown treasury\n\nÁLVARO'S RECOMMENDATIONS\n\n\"My recommendations, using real numbers:\"\n\n1. Immediate Transfer:\n\"Move 60,000 florins from crusade treasury to crown treasury. This covers the 40,000 florin deficit plus gives us 20,000 florin cushion for crown operations. Defensible because crusade benefits from stable kingdom.\"\n\n2. Keep Crusade Treasury Above 600,000 Florins:\n\"After the transfer, crusade treasury will have ~720,000 florins. Keep it above 600,000 as reserve for completing Granada and future operations.\"\n\n3. Use Crusade Funds for Military Infrastructure:\n\"The academy (75,000) and foundry (100,000) come from crusade treasury. They're investments in permanent military capability—exactly what crusade funds should build.\"\n\n4. At the Cortes, Emphasize Financial Reality:\n\"Show nobles the numbers. The kingdom is barely functional on current revenue. Crusade success has masked this, but without reform we cannot sustain either normal operations or military strength. The 780,000 florins in crusade treasury proves the system works—now make it permanent through tax reform.\"\n\nÁlvaro closes the ledgers. \"Your Majesty, in summary: The crown is technically broke on normal operations. The crusade has been financially extraordinary. We need tax reform to make the kingdom sustainable. And we have plenty of crusade funds to complete Granada and build military infrastructure.\"\n\n\"Any questions about the actual financial situation?\""
        },
        {
          "role": "player",
          "text": "We cannot move crusade money to the crown treasury. This has been prohibited by the bull and the reason why we have such strict oversight. The papal legate will never sign off on it unless we present him with a very convincing reason. Donations to the crusade support the crusade and the crusade only.\n\n\nWe can however adjust your projections somewhat.\n\n\nFirst off, we move the dowry to the crown treasury. This is committed to the crown not the crusade and gives us some much-needed relief.\n\n\nSecondly, we allocate all captured treasury to the crown as well. All coins and livestock or other plunder we would otherwise put towards the crusade, we put towards the crown. All the lands captured are property of the crown and this includes treasure as well.\n\n\nThirdly, we started some time ago with training new assessors who should now have had time to assess all noble estates to collect 5% treasury without corruption. Have we heard back from them yet? (stop when you are about to give a report on this, I want to roll for their success)"
        },
        {
          "role": "gm",
          "text": "**CRUSADE TREASURY (strictly crusade-only funds):**\nStarting:\n- Barcelona: 82,000 florins\n- Florence: 60,000 florins\n- Papal treasury: 20,000 florins\n- Capranica: 45,000 florins\n- Seville donations: 3,200 florins\n- Total starting crusade-only: 210,200 florins\n\nIncome:\n- Crusade taxation (7 months): ~22,641 florins\n- Foreign aid: 440,000 florins\n- Total income: 462,641 florins\n\nExpenses:\n- Campaign costs: ~142,000 florins\n\nBalance: 210,200 + 462,641 - 142,000 = 530,841 florins\n\n**CROWN TREASURY:**\nStarting: ~4,528 florins liquid assets\n\nIncome:\n- Normal revenue (18 months): ~109,434 florins\n- Portuguese dowry: 180,000 florins\n- Conquest booty: ~70,943 florins\n- Total income: 360,377 florins\n\nExpenses:\n- Normal operations (18 months): ~150,943 florins\n\nBalance: 4,528 + 360,377 - 150,943 = 213,962 florins\n \nThe assessment process requires verification. Collecting the 5% crusade tax from nobles will depend on the assessors' effectiveness. I'll need to determine how successfully they've managed to extract these funds from potentially reluctant contributors.\n\nÁlvaro immediately looks mortified. \"You're absolutely right, Your Majesty. I apologize - I completely forgot the oversight restrictions. Cardinal Capranica would never permit transferring crusade donations to general crown operations. Those funds are sacred - donated specifically for holy war against Granada.\"\n\nHe starts recalculating rapidly, crossing out his previous numbers.\n\nCORRECTED TREASURY ACCOUNTING - OCTOBER 1431\n\nCRUSADE TREASURY (Strictly Crusade-Only Funds):\n\nStarting Position:\n\nBarcelona donations: 82,000 florins\n\nFlorence donations: 60,000 florins\n\nPapal treasury: 20,000 florins\n\nCapranica funds: 45,000 florins\n\nSeville donations: 3,200 florins\n\nTotal: 210,200 florins\n\nIncome (April-October):\n\nCrusade taxation revenue: ~22,641 florins\n\nForeign aid (just arrived): 440,000 florins\n\nTotal income: 462,641 florins\n\nExpenses:\n\nCampaign costs (7 months): ~142,000 florins\n\nCrusade Treasury Balance: 530,841 florins\n\n\"These funds can ONLY be used for military operations against Granada, military infrastructure directly supporting the crusade, and related holy war purposes.\"\n\nCROWN TREASURY (General Kingdom Funds):\n\nStarting Position:\n\nLiquid assets (May 1430): ~4,528 florins\n\nIncome (May 1430 - October 1431):\n\nNormal taxation and revenues (18 months): ~109,434 florins\n\nPortuguese dowry (goes to crown, not crusade): 180,000 florins\n\nAll conquest booty and treasuries: 70,943 florins\n\nTotal income: 360,377 florins\n\nExpenses (18 months):\n\nNormal government operations: ~150,943 florins\n\nCrown Treasury Balance: 213,962 florins\n\nÁlvaro looks up with visible relief. \"Much better! The crown is actually in substantial surplus - over 213,000 florins. The dowry and conquest booty saved us. The kingdom is financially stable for normal operations.\"\n\nTHE ASSESSMENT PROGRAM\n\nÁlvaro pulls out another set of documents. \"Now, regarding the crusade taxation assessment program. You're right - we deployed those 43 trained assessors back in spring, shortly after the wedding. They were supposed to assess noble estates across Castile to determine actual current values, then collect the 5% crusade tax.\"\n\nHe looks at correspondence. \"The assessment program has been running for about seven months now. We've received some reports, but they're... varied. Some regions report smooth assessment and collection. Others report significant noble resistance, intimidation of assessors, or outright refusal to provide access to estate records.\"\n\n\"I have preliminary reports here, but we won't know the true success until we review the comprehensive accounting. The question is: how successful were the assessors in actually getting nobles to pay the 5% based on accurate assessments?\"\n\nHe sets down several sealed reports. \"We need to evaluate this systematically. Shall we determine the outcome?\"\n\nHow would you like to structure this roll? I'm thinking we should roll to see how successful the assessment and collection program was. The factors working for us: papal authority, your prestige after victories, the trained assessors. Factors against us: centuries of noble privilege, intimidation, complexity of assessment.\n\nWhat probability table would you like me to create for this roll?"
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_1431_00147",
      "book": 1,
      "chapter": "1.24",
      "date": "1431-10-18",
      "end_date": null,
      "type": "economic",
      "summary": "Roll 44 on d100 table for the noble estate assessment program produces mixed success. After seven months, 43 trained assessors achieved partial results: 40% of estates (lesser nobility, Crusader Marshal families, converso nobles) cooperated fully; 35% (mid-tier nobility, some great house branches) partially cooperated but contested findings; 25% (including Duke of Medina Sidonia and some Mendoza branches) resisted effectively. Total crusade tax collected: approximately 5.5 million maravedis (20,755 florins), hitting 87% of minimum projection. The key achievement was creating the first accurate estate registry for 75% of the kingdom. Alvaro recommends presenting the assessment as a successful administrative modernization at the Cortes while deferring permanent taxation rates until after Granada's conquest, using foreign aid to avoid desperation for immediate noble tax revenue.",
      "characters": [
        "juan_ii",
        "alvaro_de_luna"
      ],
      "factions_affected": [
        "royal_court"
      ],
      "location": "Toledo",
      "tags": [
        "taxation",
        "assessment",
        "nobility",
        "d100_roll_44",
        "cortes_strategy",
        "reform"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "Yes, lets roll. Draw upon the instructions and structure we set up 7 months ago before we started the operation. They will determine the succes.\n\n\nDraft a d100 table to determine the success of these tax assessors.\n\n\nEvaluate success and failure factors."
        },
        {
          "role": "gm",
          "text": "FACTORS FOR SUCCESS:\n1. Trained assessors (43 of them, plus 27 experienced tax collectors, plus 16 recruits with accounting/law training)\n2. Joint authority with ecclesiastical observers (legitimacy)\n3. Three-seal letters of authority (royal, legatine, archiepiscopal)\n4. Started with wealthiest estates (Mendoza, Álvarez de Toledo, Guzmán) to show tax falls on those who can pay\n5. Crusader Marshals (20-30 noble enforcers with authority to verify compliance)\n6. Dispute resolution structure (but payment due during dispute)\n7. Record-keeping requirements with discretion if nobles don't cooperate\n8. Juan's massive prestige after victories (Alcalá la Real, Málaga, Ronda)\n9. Papal backing and oversight (Cardinal Capranica's authority)\n10. Social pressure from wedding announcement and crusade fervor\n11. Personal service exemption creating incentive to comply\n12. Retroactive collection from decree date (pressure to pay quickly)\n\nFACTORS FOR FAILURE:\n1. Centuries of noble privilege and resistance to taxation\n2. Nobles can intimidate assessors or refuse access\n3. Complex estate structures make accurate assessment difficult\n4. Some nobles serving personally (less revenue due to exemptions)\n5. Harvest variations and economic hardship claims\n6. Distance and time - hard to assess all of Castile in 7 months\n7. Noble resistance and claiming poverty\n8. Hidden wealth and inaccurate record-keeping\n9. Local power dynamics where nobles control territory\n10. Some nobles away on campaign, estates managed by stewards\n\nThe structure was very good - joint ecclesiastical oversight, trained assessors, enforcement mechanisms, and starting with the wealthiest. But this is still revolutionary change against centuries of privilege.\n\nI'll create a d100 table with weighted outcomes.\n\nD100 TABLE: NOBLE ESTATE ASSESSMENT PROGRAM SUCCESS\n\nContext: 43 trained assessors plus support staff deployed in April 1431 to assess noble estates and collect 5% crusade tax. Program had strong structural advantages (papal authority, trained teams, ecclesiastical oversight, Crusader Marshal enforcement) but faced deep-rooted noble resistance to taxation. Results evaluated October 1431 after 7 months of operations.\n\nSUCCESS FACTORS:\n\n✓ 43 trained crown assessors + 27 experienced tax collectors + 16 law/accounting recruits\n✓ Joint authority with ~12 ecclesiastical observers (prevents accusations of bias)\n✓ Three-seal letters of authority (royal, legatine, archiepiscopal)\n✓ Started with wealthiest houses to demonstrate fairness\n✓ 20-30 Crusader Marshals enforcing compliance\n✓ Dispute resolution structure with payment-due-during-dispute rule\n✓ Juan's enormous prestige after Alcalá, Málaga, Ronda victories\n✓ Cardinal Capranica's direct oversight and papal backing\n✓ Personal service exemption incentivizing cooperation\n✓ Retroactive collection creating pressure to pay quickly\n✓ Social pressure from crusade fervor and wedding announcement\n\nFAILURE FACTORS:\n\n✗ Centuries of noble privilege and tax resistance\n✗ Noble intimidation of assessors and refusal of access\n✗ Complex estate structures difficult to assess accurately\n✗ Many nobles serving personally (reducing actual revenue via exemptions)\n✗ Economic hardship claims and harvest variations\n✗ Geographic challenges - assessing all Castile in 7 months\n✗ Hidden wealth and deliberately inaccurate records\n✗ Local power dynamics where nobles control territory\n✗ Some estates managed by stewards while lords on campaign\n✗ Revolutionary change against entrenched interests\n\n1-10: CATASTROPHIC FAILURE - Noble Revolt Brewing\n\nWhat Happened:\nThe assessment program triggered massive noble resistance. While no outright rebellion yet, multiple great houses coordinated opposition:\n\nDuke of Medina Sidonia refuses assessors entry, claims ancient exemptions\n\nMendoza family allows assessment but contests every finding\n\n15-20 major houses file formal appeals claiming assessments wildly inflated\n\nRumors spread that assessors are \"confiscating\" noble property\n\nSeveral assessors physically threatened or expelled from estates\n\nOnly smallest, weakest houses paid without protest\n\nRevenue Collected: 3 million maravedís (11,321 florins) - only about 50% of projected minimum\n\nAssessment Completion: ~40% of estates properly assessed\n\nPolitical Damage:\n\nNobles forming coalition to challenge taxation at Cortes\n\nClaims that crusade is \"pretext for tyranny\"\n\nSome houses threatening to withdraw levies\n\nCardinal Capranica concerned about enforcement creating scandal\n\nÁlvaro's Assessment: \"Your Majesty, we severely underestimated noble resistance. The program's structure was sound, but they're collectively refusing to comply. If we push enforcement, we risk provoking the rebellion we've worked so hard to avoid. We need to reconsider our approach at the Cortes.\"\n\n11-30: SIGNIFICANT FAILURE - Widespread Resistance\n\nWhat Happened:\nAssessment program faced substantial noble obstruction across most of kingdom:\n\nGreat houses (Mendoza, Álvarez de Toledo, etc.) allowed assessment but provided minimal cooperation\n\nRecord-keeping \"incomplete\" or \"lost\" for many estates\n\nAssessors forced to estimate without proper documentation\n\nMajor houses filed numerous appeals delaying payment\n\nMid-tier nobles split - some cooperative, many resistant\n\nLesser nobility generally complied but claimed poverty\n\nCrusader Marshals had mixed success enforcing compliance\n\nRevenue Collected: 4.5 million maravedís (16,981 florins) - about 75% of projected minimum\n\nAssessment Completion: ~60% of estates assessed with varying quality\n\nKey Problems:\n\nWealthiest estates most resistant (exactly backwards from plan)\n\nAppeals process being used to delay rather than resolve disputes\n\nSome assessors intimidated into accepting noble valuations\n\nGeographic coverage incomplete - remote estates barely touched\n\nÁlvaro's Assessment: \"We collected revenue, but far less than projected and at much higher cost than anticipated. The great houses are using every legal mechanism to resist. The ecclesiastical oversight helped prevent worse resistance, but nobles know how to work the system. We need stronger enforcement mechanisms.\"\n\n31-50: MIXED SUCCESS - Partial Compliance\n\nWhat Happened:\nAssessment program achieved partial success with uneven results across kingdom:\n\nCooperated Fully:\n\nLesser nobility and knights (needed crusade favor)\n\nHouses with members serving as Crusader Marshals\n\nSmaller ecclesiastical properties\n\nConverso noble families (eager to prove loyalty)\n\n~40% of total estates\n\nPartial Cooperation:\n\nMid-tier nobility (complied but contested details)\n\nSome great houses (allowed assessment, filed appeals, eventually paid reduced amounts)\n\n~35% of estates\n\nResisted:\n\nSeveral great houses (Medina Sidonia, some Mendoza branches)\n\nRemote estates hard to reach\n\nProperties with complex ownership\n\n~25% of estates\n\nRevenue Collected: 5.5 million maravedís (20,755 florins) - roughly the projected minimum\n\nAssessment Completion: ~75% of estates assessed, varying quality\n\nÁlvaro's Assessment: \"We hit our minimum projections but no more. The structure worked for compliant nobles but couldn't overcome determined resistance from the wealthiest houses. The ecclesiastical oversight helped—nobles couldn't claim religious persecution. But enforcement remains our weak point. We collected enough to claim success, but it exposed the limits of our authority over great houses.\"\n\n51-70: GOOD SUCCESS - Mostly Effective\n\nWhat Happened:\nAssessment program largely succeeded despite some resistance:\n\nStrong Success:\n\nJoint ecclesiastical oversight legitimized process\n\nStarting with Mendoza/Álvarez de Toledo set good precedent\n\nMost assessments completed professionally\n\nCrusader Marshals effectively enforced compliance in most regions\n\n~70% of nobles cooperated fully or substantially\n\nModerate Resistance:\n\n5-8 great houses contested assessments but eventually paid\n\nSome remote estates escaped thorough assessment\n\nAppeals process worked reasonably well\n\n~20% of nobles contested but ultimately complied\n\nTrue Resistance:\n\n2-3 houses refused (will require Cortes action)\n\nSome hidden wealth escaped detection\n\n~10% of estates avoided or minimized payment\n\nRevenue Collected: 6.8 million maravedís (25,660 florins) - solidly above minimum projection\n\nAssessment Completion: ~85% of estates properly assessed\n\nKey Successes:\n\nThree-seal authority proved very effective\n\nEcclesiastical observers prevented claims of bias\n\nPersonal service exemption worked as incentive\n\nYour prestige after victories gave assessors credibility\n\nRetroactive collection motivated quick payment\n\nÁlvaro's Assessment: \"This worked well, Your Majesty. We collected more than projected minimum. The structure you designed—joint oversight, trained assessors, enforcement mechanisms—proved sound. The few resistant houses can be handled at the Cortes. We've established precedent that nobles can be accurately assessed and will pay crusade taxes. This validates the entire approach.\"\n\n71-85: STRONG SUCCESS - Highly Effective\n\nWhat Happened:\nAssessment program succeeded beyond expectations:\n\nExcellent Cooperation:\n\n~80% of estates provided full cooperation\n\nGreat houses saw value in compliance (crusade prestige, avoiding scandal, earning favor)\n\nStarting with wealthiest proved brilliant—set cooperative tone\n\nMid-tier and lesser nobility followed great houses' lead\n\nPersonal service exemption created strong incentive\n\nAssessment Quality:\n\nJoint ecclesiastical oversight made process legitimate and fair\n\nTrained assessors performed professionally\n\nThree-seal authority gave assessors confidence to push back on false claims\n\nCrusader Marshals effectively prevented intimidation\n\nDocumentation standards maintained\n\nRevenue Performance:\n\nMost nobles paid promptly to avoid retroactive penalties\n\nAppeals process resolved disputes fairly and quickly\n\nHidden wealth minimized through good investigative work\n\nRevenue Collected: 7.5 million maravedís (28,302 florins) - approaching upper projection\n\nAssessment Completion: ~90% of estates thoroughly assessed\n\nMinor Issues:\n\n1-2 houses filed appeals (legitimate disputes, resolved fairly)\n\nSome remote estates incompletely assessed\n\nA few nobles minimized taxable income through creative accounting\n\nÁlvaro's Assessment: \"Your Majesty, this is remarkable. We've accomplished something previous kings couldn't: accurately assessing noble wealth and collecting substantial taxation. The revenue exceeds our conservative projections. More importantly, we've created a permanent registry of actual estate values. The few remaining issues are minor—we can address them at the Cortes. This proves the system works.\"\n\n86-95: EXCEPTIONAL SUCCESS - Revolutionary Achievement\n\nWhat Happened:\nAssessment program achieved transformative success:\n\nNear-Universal Compliance:\n\n~90% of estates cooperated fully and willingly\n\nGreat houses competed to demonstrate cooperation (earning crusade favor)\n\nThe prestige of serving the crusade overcame resistance\n\nPersonal service exemption so effective many nobles took crusader oaths specifically for tax reduction (then became genuine crusaders)\n\nOutstanding Execution:\n\nJoint ecclesiastical oversight eliminated bias concerns completely\n\nAssessors performed with exceptional professionalism\n\nThree-seal authority prevented all intimidation attempts\n\nCrusader Marshals became effective enforcement network\n\nDocumentation exceeded expectations\n\nRevenue Performance:\n\nCollections exceeded all projections\n\nPrompt payment to avoid retroactive penalties\n\nAppeals minimal and resolved quickly\n\nHidden wealth largely discovered through thorough investigation\n\nRevenue Collected: 8.5 million maravedís (32,075 florins) - exceeding upper projection\n\nAssessment Completion: ~95% of estates comprehensively assessed\n\nStrategic Gains:\n\nCreated permanent, accurate registry of noble wealth\n\nEstablished precedent that nobles CAN be taxed fairly\n\nDemonstrated crown's administrative capability\n\nBuilt foundation for permanent tax reform\n\nNoble cooperation strengthened rather than weakened by process\n\nSecondary Benefits:\n\n40+ new nobles took crusader oaths to gain exemption\n\nIncreased military participation\n\nStrengthened relationship between crown and cooperative houses\n\nCardinal Capranica impressed, will report success to Rome\n\nÁlvaro's Assessment: \"Your Majesty, this is historic. We've achieved what seemed impossible: comprehensive assessment and taxation of the nobility with their willing cooperation. The revenue is extraordinary, but the precedent is priceless. We've proven that fair, transparent assessment with proper oversight works. The few resistant houses look unreasonable compared to overwhelming compliance. This transforms everything—at the Cortes, we can propose permanent reform from position of proven success.\"\n\n96-100: MIRACULOUS SUCCESS - Complete Transformation\n\nWhat Happened:\nAssessment program achieved perfect execution with transformative consequences:\n\nUniversal Compliance:\n\nEVERY major house cooperated fully\n\nGreat houses publicly competed to demonstrate exemplary compliance\n\nMendoza family praised assessors' professionalism publicly\n\nDuke of Medina Sidonia personally thanked assessors for fair treatment\n\nLesser nobility followed great houses' example enthusiastically\n\nFlawless Execution:\n\nJoint ecclesiastical oversight created atmosphere of fairness and legitimacy\n\nAssessors became respected figures rather than feared intruders\n\nThree-seal authority combined with professional conduct earned noble respect\n\nCrusader Marshals became coordination network, not enforcers\n\nDocumentation became model for future administrative programs\n\nRevenue Performance:\n\nCollections exceeded wildest projections\n\nImmediate payment without need for retroactive collection\n\nZero legitimate appeals (nobles accepted assessments as accurate)\n\nPreviously hidden wealth voluntarily disclosed\n\nRevenue Collected: 9.5 million maravedís (35,849 florins) - 50%+ above upper projection\n\nAssessment Completion: 98%+ of estates comprehensively assessed with full documentation\n\nRevolutionary Outcomes:\n\nNoble Attitude Shift:\n\nNobles saw taxation as investment in crusade success\n\nMany voluntarily paid more than assessed (donations beyond tax)\n\nCooperation became status symbol\n\nResistance seen as dishonorable\n\nAdministrative Precedent:\n\nCreated permanent, comprehensive wealth registry\n\nEstablished professional assessment methodology\n\nDemonstrated crown administrative capability\n\nModel for all future taxation programs\n\nPolitical Transformation:\n\nNobles requesting permanent taxation system at Cortes\n\nWant clear, fair rates instead of ad-hoc assessments\n\nGreat houses proposing gradual increase to fund perpetual expansion\n\nTax resistance politically finished—cooperation is new normal\n\nCrusade Impact:\n\n80+ additional nobles took crusader oaths (for exemption and honor)\n\nNoble military participation dramatically increased\n\nHouses competed to contribute more\n\nPersonal service exemption created recruitment wave\n\nInternational Impression:\n\nCardinal Capranica amazed, will report to Rome as miracle of governance\n\nForeign powers impressed by administrative capability\n\nModel for other kingdoms\n\nÁlvaro's Reaction:\n\nÁlvaro literally cannot believe the reports. He reads them three times, interviews multiple assessors personally, has Crusader Marshals verify independently.\n\n\"Your Majesty... I don't have words. This doesn't happen. Kings don't successfully tax nobility. They rebel, they resist, they refuse. But you've achieved universal compliance with PRAISE. The nobles are thanking the assessors. They're competing to demonstrate cooperation. They're asking for permanent taxation.\"\n\nHe sets down the reports, visibly emotional. \"This is the most successful administrative program I've ever seen. Not just in Castile—anywhere. You've transformed the relationship between crown and nobility. They don't see taxation as theft anymore—they see it as investment in shared glory.\"\n\n\"The revenue alone—35,000 florins beyond projections—funds another full campaign season. But that's trivial compared to the precedent. At the Cortes, you won't be fighting for tax reform. The nobles will be REQUESTING it. They want clear, permanent rates. They want to know what they'll pay so they can budget for it. They want the system institutionalized.\"\n\n\"And internationally? Cardinal Capranica is writing to Rome that this is proof of divine favor on your crusade. The administrative capability you've demonstrated—comprehensive assessment with universal compliance—marks Castile as a genuinely modern state. This puts you on par with Italian city-states for governance sophistication.\"\n\nHe pauses. \"Your Majesty, at the Cortes next month, you can propose anything. The nobles trust the system now. They've seen it work fairly. They've benefited from the crusade's success. Whatever permanent taxation structure you propose—5%, 7%, even 8%—they'll accept it because they've experienced that it works.\"\n\nReady to roll your d100?"
        },
        {
          "role": "player",
          "text": "Rolled 44, so MIXED SUCCESS\n\n\nDraft the response based on this outcome."
        },
        {
          "role": "gm",
          "text": "**What Happened:**\n- Assessment program achieved partial success with uneven results across kingdom\n- Cooperated Fully: Lesser nobility and knights, houses with Crusader Marshals, smaller ecclesiastical properties, Converso noble families, ~40% of total estates\n- Partial Cooperation: Mid-tier nobility (complied but contested details), some great houses (allowed assessment, filed appeals, eventually paid reduced amounts), ~35% of estates\n- Resisted: Several great houses (Medina Sidonia, some Mendoza branches), remote estates hard to reach, properties with complex ownership, ~25% of estates\n- Revenue Collected: ~5.5 million maravedís (~20,755 florins) - roughly the projected minimum\n- Assessment Completion: ~75% of estates assessed, varying quality\n\nÁlvaro's Assessment: \"We hit our minimum projections but no more. The structure worked for compliant nobles but couldn't overcome determined resistance from the wealthiest houses. The ecclesiastical oversight helped—nobles couldn't claim religious persecution. But enforcement remains our weak point. We collected enough to claim success, but it exposed the limits of our authority over great houses.\"\n\nI need to make this detailed and realistic, showing both successes and failures.\n\nÁlvaro spreads out multiple reports across the table—some neat and organized, others hastily written, a few bearing signs of having been crumpled and smoothed out again.\n\n\"Your Majesty, the assessment program results are... mixed. Let me walk you through what happened over these seven months.\"\n\nHe organizes the reports into three piles.\n\nTHE ASSESSMENT PROGRAM RESULTS - OCTOBER 1431\n\nPile One: Full Cooperation (~40% of Estates)\n\nÁlvaro taps the first, neat pile. \"These are our successes. Clean assessments, prompt payment, professional cooperation.\"\n\nWho Cooperated Fully:\n\n\"Lesser nobility and knights: The backbone of compliance. Houses with 5,000-50,000 maravedís annual income saw the crusade as their opportunity for advancement. They couldn't afford to antagonize you or look disloyal. Every lesser baron, every knight with modest holdings—they opened their books, answered questions honestly, paid promptly.\"\n\n\"Houses with Crusader Marshals: Any family that sent someone as a Crusader Marshal cooperated exemplarily. They understood the contradiction of enforcing compliance while resisting themselves. The Ayala branch that sent Don García—perfect compliance. The Padilla family—immaculate records.\"\n\n\"Smaller ecclesiastical properties: Parish churches, small monasteries, minor foundations. The 10% church tax was accepted as papal authority. Cardinal Capranica's oversight meant they couldn't claim bias or unfairness.\"\n\n\"Converso noble families: This surprised me, but the converso nobility—families of Jewish converts who gained titles—were eager to demonstrate loyalty. They provided detailed records, invited assessors into their homes, sometimes paid more than assessed. They're still proving themselves acceptable to old Christian nobility.\"\n\nHe estimates: \"This group represents perhaps 40% of taxable estates. The revenue from them was clean, documented, and exactly as projected.\"\n\nPile Two: Partial Cooperation (~35% of Estates)\n\nÁlvaro touches the middle pile—thicker, more disorganized. \"Here's where it gets messy. These nobles complied... technically. But they made it difficult.\"\n\nWho Partially Cooperated:\n\n\"Mid-tier nobility: Barons with 50,000-200,000 maravedís income. They allowed assessors entry. They provided records—sort of. But the records were 'incomplete.' Harvests were 'poor this year.' Expenses were 'unusually high.' They filed appeals on nearly every finding.\"\n\nHe pulls out a specific report. \"Don Fernando de Guzmán—not the Master, a cousin—allowed assessment of his Extremadura estates. The assessor calculated he owed 9,000 maravedís based on revenues. Don Fernando filed appeal claiming the assessor didn't account for drought damage, debt service, and dowry obligations. After three rounds of appeals, he paid 6,500 maravedís. We got revenue, but it took months and constant pressure.\"\n\n\"Some branches of great houses: Interesting pattern here. The Mendoza family split. The main branch under Íñigo López de Mendoza cooperated reasonably well—he's serving in the crusade and wanted to maintain good relations. But several cadet branches, cousins with separate estates, made difficulties. Same with Álvarez de Toledo—some branches cooperative, others obstructionist.\"\n\n\"Church properties with complex claims: Wealthy monasteries that claimed various exemptions or hardships. The 10% tax was accepted in principle, but determining actual revenues proved contentious. Many claimed their lands supported charitable works or schools and shouldn't be fully taxed.\"\n\nHe shakes his head. \"This middle group eventually paid, but at reduced rates after appeals, and only after Crusader Marshals applied pressure. We collected maybe 70-80% of what we should have from them.\"\n\nPile Three: Resistance (~25% of Estates)\n\nÁlvaro's expression darkens as he indicates the third pile—smallest but most problematic.\n\nWho Resisted:\n\n\"Several great houses: Duke of Medina Sidonia refused assessors entry initially. Claimed ancient exemptions granted by Fernando III two centuries ago. Only allowed assessment after Cardinal Capranica personally wrote threatening investigation for defying papal crusade. Even then, provided minimal cooperation. He filed formal appeal claiming assessors inflated his revenues by 40%. Still unresolved.\"\n\n\"Some Mendoza branches: Two cadet branches in New Castile. Claimed they couldn't provide records because they're 'organizing' their archives. Assessors had to estimate. Both filed appeals. One eventually paid partial amount. Other is still contesting.\"\n\n\"Remote estates: Geography worked against us. Estates in Galicia, northern Asturias, mountainous Pyrenees regions—our assessors couldn't reach all of them in seven months. Some local lords claimed they 'never received' the assessment teams. Hard to prove otherwise.\"\n\n\"Properties with complex ownership: Some estates held jointly by multiple heirs, or with complicated liens and obligations. The assessors couldn't determine clean revenues. These nobles claimed they needed more time to 'clarify' ownership before assessment possible.\"\n\nÁlvaro sets down the pile. \"This group—maybe 25% of estates—either avoided assessment entirely, paid token amounts, or are still fighting in appeals. We've collected almost nothing from them.\"\n\nTHE NUMBERS\n\nÁlvaro pulls out his ledger with final calculations.\n\nRevenue Collected (7 months, April-October 1431):\n\n\"From the 40% who fully cooperated: ~2.5 million maravedís\"\n\"From the 35% who partially cooperated: ~2.2 million maravedís\" \n\"From the 25% who resisted: ~0.8 million maravedís\"\n\nTotal: ~5.5 million maravedís = ~20,755 florins\n\nHe looks up. \"Our projected minimum was 6.3 million maravedís (24,000 florins). We collected 5.5 million—about 87% of minimum projection. Not a disaster, but significantly below what we hoped.\"\n\nASSESSMENT QUALITY\n\n\"Beyond revenue, the assessment program was supposed to create a permanent registry of accurate estate values. Here's the reality:\"\n\nThoroughly Assessed (~45% of estates):\n\nComplete documentation\n\nAccess to records provided\n\nFair, accurate valuations\n\nThree copies filed properly\n\nCan use these assessments going forward with confidence\n\nPartially Assessed (~30% of estates):\n\nSome documentation, but gaps\n\nEstimates where records unavailable\n\nAppeals challenged some findings\n\nUsable but not completely reliable\n\nPoorly or Not Assessed (~25% of estates):\n\nMinimal or no assessment completed\n\nEstimates only, or complete refusal\n\nNo reliable data for future taxation\n\nWill require re-assessment or different approach\n\nÁlvaro sighs. \"We have good data on maybe half the kingdom. The rest is incomplete or contested.\"\n\nWHAT WENT RIGHT\n\n\"Let me be clear about our successes, because there were real achievements here:\"\n\n1. The Structure Worked for Compliant Nobles:\n\"The joint ecclesiastical oversight proved brilliant. Every noble who cooperated praised the fairness. The three-seal authority gave assessors credibility. The trained teams performed professionally. For nobles willing to comply, the process was transparent and just.\"\n\n2. Personal Service Exemption Was Effective:\n\"Thirty-eight nobles took crusader oaths specifically to gain the 2,000 maravedí exemption. Many of them became genuine crusaders afterward. The incentive worked exactly as designed for the segment of nobility it targeted.\"\n\n3. Prevented Religious Opposition:\n\"Cardinal Capranica's oversight meant nobles couldn't claim this was royal tyranny or persecution. They couldn't challenge it as anti-Church because the Church was co-administering it. This prevented a much worse outcome.\"\n\n4. Established Precedent:\n\"We proved accurate assessment is possible. For 40% of the kingdom, we have clean data and willing compliance. That's unprecedented in Castilian history.\"\n\n5. Lesser Nobility Fully Integrated:\n\"The lesser nobles—who are actually numerous and collectively significant—are now accustomed to paying crusade taxes. They accepted it as normal and proper. That's a cultural shift.\"\n\nWHAT WENT WRONG\n\n\"But we also have serious problems:\"\n\n1. Couldn't Overcome Great House Resistance:\n\"The wealthiest houses—who should contribute most—were most resistant. We planned to start with them to set tone of compliance. Instead, some used their power to obstruct. The Duke of Medina Sidonia has more armed men in his territories than royal assessors. He could simply refuse entry.\"\n\n2. Enforcement Was Weak:\n\"The Crusader Marshals worked well for mid-tier nobles. But against a duke? A marshal can write report saying duke refused compliance. Then what? We have no mechanism to compel a great house short of military force. And threatening military force against nobles for tax resistance is... exactly what triggers rebellions.\"\n\n3. Appeals Process Exploited:\n\"We designed an appeals process to be fair. The resistant nobles used it to delay and reduce payments. They filed frivolous appeals knowing it takes months to resolve each one. By the time we rule against them, campaign season is over and they argue circumstances changed.\"\n\n4. Geographic Limits:\n\"Castile is huge. Forty-three assessor teams plus support couldn't reach everywhere in seven months. Remote estates escaped assessment simply by being far away and claiming they 'didn't receive notice.'\"\n\n5. Hidden Wealth:\n\"The great houses have generations of experience hiding wealth. Complex ownership structures. Loans to family members. Estates held through proxies. 'Poor harvests' that somehow still maintain lavish households. Without power to compel records access, we couldn't find what they hid.\"\n\nPOLITICAL IMPLICATIONS\n\nÁlvaro leans back, choosing his words carefully.\n\n\"Your Majesty, we collected enough to claim success—we hit 87% of minimum projection. The treasury has the ~21,000 florins expected. The crusade isn't financially compromised.\"\n\n\"But politically, this exposed the limits of crown authority. The nobles who wanted to resist... did. Successfully. The great houses learned they can obstruct without severe consequences.\"\n\n\"At the Cortes next month, this cuts both ways:\"\n\nFor Reform:\n\nWe proved assessment works for compliant nobles\n\nWe demonstrated the system is fair and transparent\n\nWe showed crusade taxation can generate significant revenue\n\nLesser nobility now accepts taxation as normal\n\nAgainst Reform:\n\nGreat houses know they can resist\n\nEnforcement mechanisms proved inadequate\n\nAppeals process is exploitable\n\nGeographic and complexity challenges remain\n\n\"The question is: Do we present this as success that needs strengthening? Or do we acknowledge the resistance and propose different approach?\"\n\nHe pulls out a summary document. \"Here's my assessment for the Cortes strategy:\"\n\nCORTES STRATEGY RECOMMENDATIONS\n\nOption One: Declare Success, Propose Refinements\n\n\"Present the 21,000 florins collected as proof the system works. Emphasize the 75% of estates successfully assessed. Propose making it permanent with stronger enforcement—perhaps Crusader Marshals with expanded authority, or requiring nobles to file annual revenue declarations under oath.\"\n\nAdvantages:\n\nFrames program as success worth continuing\n\nLesser nobility and mid-tier houses will support (they complied)\n\nCan pressure resistant houses by highlighting their non-compliance\n\nCardinal Capranica can emphasize papal support\n\nRisks:\n\nGreat houses will argue system was failure (only 87% collection)\n\nThey'll demand weakening enforcement, not strengthening\n\nCould provoke confrontation over enforcement powers\n\nOption Two: Acknowledge Mixed Results, Propose Compromise\n\n\"Present honest accounting: program worked for willing nobles, struggled with resistant ones. Propose compromise: permanent taxation at lower rate (3-4%) with simpler assessment method. Trade lower rate for universal compliance.\"\n\nAdvantages:\n\nAppears reasonable and pragmatic\n\nGreat houses might accept lower rate with less intrusive assessment\n\nBuilds on success with compliant nobles\n\nAvoids confrontation over enforcement\n\nRisks:\n\nLeaves significant revenue on table\n\nRewards resistance (houses that fought hardest pay less)\n\nDoesn't address fundamental power imbalance\n\nMay not generate enough revenue for permanent military establishment\n\nOption Three: Use Foreign Aid to Buy Time\n\n\"Don't propose permanent taxation yet. Use the massive foreign aid windfall (440,000 florins!) to fund next campaign season. Tell nobles: 'Assessment program achieved minimum goals. We'll refine it during 1432 campaign and propose permanent structure at 1433 Cortes after we complete Granada.'\"\n\nAdvantages:\n\nAvoids fight when we're in weak position\n\nGives time to strengthen enforcement mechanisms\n\nLets you complete Granada first (strengthens authority)\n\nForeign aid means we don't desperately need noble taxation immediately\n\nRisks:\n\nDelays necessary reform\n\nNobles may organize resistance better with extra time\n\nLoses momentum from crusade success\n\nDoesn't address kingdom's structural revenue problems\n\nÁlvaro sets down his documents and looks at you seriously.\n\n\"Your Majesty, my honest recommendation: Option Three. Use the foreign aid windfall to buy time.\"\n\n\"Here's why: The assessment program proved we're not yet strong enough to compel great houses. Trying to force permanent taxation now, from this weak position, risks confrontation we might lose. But—\" he taps the foreign aid ledger, \"—we have 440,000 florins in foreign contributions. That's transformative. We don't desperately need noble taxation for 1432.\"\n\n\"Complete Granada in 1432. Return victorious with the crusade finished. Then, from position of absolute strength, propose permanent taxation in 1433. The nobles can't resist as effectively when you're the king who conquered Granada.\"\n\n\"At this Cortes, focus on distributing lands, rewarding service, and celebrating victories. Make nobles grateful and invested. Don't fight over taxation when we only achieved partial success with the assessment program.\"\n\nHe pauses. \"But this is your decision. You know the political situation better than I do. What direction do you want to take at the Cortes?\"\n\nWhat are your thoughts?"
        },
        {
          "role": "player",
          "text": "I agree we should use the cortes to draw attention to the crusade taxes. But remember that the assessors only collected crusade taxes, not the regular taxes. This was a big point as the revenue of many estates have not been assessed for many years. One of our aims was to finally have proper assessments of the estates of all the major houses."
        },
        {
          "role": "gm",
          "text": "Álvaro stops and nods slowly. \"You're absolutely right, Your Majesty. I was focusing too much on the immediate revenue and losing sight of the larger strategic purpose.\"\n\nHe pulls the assessment reports back and reorganizes his thinking.\n\nTHE REAL ACHIEVEMENT: ACCURATE ESTATE VALUATIONS\n\n\"Let me reframe this properly. The 21,000 florins in crusade tax revenue was the immediate goal. But the strategic goal was creating a comprehensive, accurate registry of what Castilian nobility actually owns and earns.\"\n\nHe spreads out a map of Castile and starts marking regions.\n\n\"For centuries, noble taxation has been based on assessments from the time of Fernando III, Alfonso X, even earlier. A noble house claims their estate is worth 50,000 maravedís because that's what it was assessed at in 1250. Never mind that they've added three villages, doubled the farmland, and built a prosperous market town. The assessment is 50,000, so they pay taxes based on 50,000.\"\n\n\"This crusade tax—and the assessment program—was our opportunity to discover actual current values. To create a modern registry. To know what the kingdom really contains.\"\n\nHe taps different regions on the map.\n\nWHAT WE NOW KNOW\n\nFully Assessed Estates (~45% of the kingdom):\n\n\"These are our crown jewels of data. Complete, accurate, documented assessments:\"\n\nLesser nobility: Every estate between 5,000-50,000 maravedís annual income is now accurately valued. We know exactly what they produce, what they spend, what their net revenues are. Clean documentation, three copies filed.\n\nCooperative mid-tier houses: Several baronial families with 50,000-200,000 maravedís income provided full access. We have their complete financial pictures.\n\nSome great house branches: The cooperative Mendoza branches, the Padilla estates, parts of the Álvarez de Toledo holdings—full assessments.\n\nEcclesiastical properties: Most church lands now accurately valued. We know what every monastery, bishopric, and church foundation actually generates.\n\n\"This represents approximately 45% of Castile's taxable wealth. For the first time in perhaps 150 years, we have accurate, current data on these estates.\"\n\nÁlvaro's voice becomes intense. \"Your Majesty, do you understand what this means? We can now calculate rational tax rates. We can project revenues accurately. We can compare estates fairly. This isn't ancient guesswork—it's real financial data.\"\n\nPartially Assessed Estates (~30% of the kingdom):\n\n\"The middle group—estates where we got some data but not complete pictures:\"\n\nAssessors managed site visits, saw the properties, estimated revenues\n\nNobles provided partial records or contested figures\n\nAppeals challenged specific valuations\n\nGeographic challenges prevented thorough investigation\n\n\"This data is less reliable, but it's still far better than 200-year-old assessments. We have rough modern valuations. We know which estates are prosperous, which are struggling, which nobles were honest about their situations.\"\n\n\"If we need to, we can refine these assessments with targeted follow-up. The groundwork is laid.\"\n\nPoorly/Not Assessed (~25% of the kingdom):\n\n\"These are our failures—estates where we got minimal or no current data:\"\n\nGreat houses that refused access (Medina Sidonia, some Mendoza branches)\n\nRemote estates we couldn't reach\n\nComplex ownership structures we couldn't untangle\n\nNobles who successfully stonewalled\n\n\"For these properties, we still rely on ancient assessments or have no data at all. This is where our authority was insufficient.\"\n\nTHE STRATEGIC VALUE\n\nÁlvaro sets down the map and looks at you directly.\n\n\"Here's what we accomplished: We now have accurate financial data on roughly 75% of the kingdom's estates (45% fully assessed + 30% partially assessed). That's revolutionary.\"\n\n\"Compare to before this program:\"\n\nNoble self-reporting: \"My estate is worth whatever I claim\"\n\nAncient assessments: \"My great-great-grandfather paid X, so I pay X\"\n\nNo verification: Crown had no way to check claims\n\nNo comparative data: Couldn't tell if Duke A was much richer than Duke B\n\n\"Now:\"\n\nVerified current valuations for 45% of estates\n\nReasonable estimates for another 30%\n\nComprehensive documentation system\n\nAbility to compare estates objectively\n\nFoundation for rational tax policy\n\n\"This is transformative for governance, Your Majesty. This is what modern states do—they know what they govern. They have data. They can plan.\"\n\nAT THE CORTES: THE ARGUMENT\n\nÁlvaro starts drafting talking points.\n\n\"Here's how we present this at the Cortes:\"\n\nThe Problem We Solved:\n\n\"For generations, the crown has taxed based on guesswork and ancient claims. Nobles self-reported their wealth. Great houses paid based on assessments from the time of the Reconquest's beginning. The kingdom had no idea what resources it actually possessed. This made rational governance impossible.\"\n\nWhat We Achieved:\n\n\"Through the crusade assessment program, with papal authority and ecclesiastical oversight, we created the first comprehensive, accurate registry of Castilian estates in over a century. We now know—with documentation and verification—what 75% of the kingdom's nobility actually owns and earns.\"\n\nThe Proof:\n\n\"The 21,000 florins in crusade taxation collected is proof the system works. But more importantly, we now have documented assessments for thousands of estates. We know that Baron X earns 80,000 maravedís, not the 40,000 he previously claimed. We know that Monastery Y generates 30,000 maravedís in agricultural revenues. This is data—real, verified, modern data.\"\n\nWhat This Enables:\n\n\"With accurate assessments, we can finally implement fair, rational taxation. No more ancient privileges based on obsolete valuations. No more nobles claiming poverty while living in luxury. We can set clear rates—3%, 5%, whatever the kingdom needs—and calculate exactly what that will generate. We can compare nobles' actual contributions to their actual wealth.\"\n\nThe Incomplete Task:\n\n\"However—\" and here Álvaro pauses, \"—25% of estates remain inadequately assessed. Primarily the wealthiest houses, who resisted providing access or documentation. We have three choices:\"\n\nAccept incomplete data: Tax based on what we have, allow resistant houses to avoid accurate assessment\n\nStrengthen enforcement: Give assessors more authority to compel compliance\n\nCreate incentives for voluntary disclosure: Make cooperation more attractive than resistance\n\nREVISED CORTES STRATEGY\n\nÁlvaro revises his earlier recommendations with this new framing:\n\nRecommended Approach:\n\n\"At this Cortes, emphasize the administrative achievement rather than focusing on crusade tax collection. Present it as successful first step toward modern governance.\"\n\nThe Argument:\n\n\"Gentlemen, through the crusade assessment program, we have accomplished something no Castilian king has achieved in living memory: accurate, verified knowledge of what this kingdom contains. Forty-five percent of estates have been thoroughly assessed with full documentation. Another thirty percent have been reasonably evaluated. We now possess real financial data.\"\n\n\"The 21,000 florins in crusade taxation collected proves the system works fairly. But the true achievement is the knowledge itself. We can now govern based on facts rather than ancient guesses.\"\n\n\"However, the task remains incomplete. Twenty-five percent of estates—primarily the wealthiest—resisted assessment. This creates an unjust situation: lesser nobles whose estates are fully documented and accurately taxed, while some great houses operate in continued obscurity.\"\n\nThe Proposal:\n\n\"For 1432, we propose completing the assessment program with strengthened authority. All estates should be accurately valued. This isn't about increasing taxation—it's about fairness. Every noble should be assessed by the same standard.\"\n\n\"Once we have complete data, we can discuss permanent taxation structures at the 1433 Cortes, after Granada is conquered. But first, let us finish creating an accurate registry.\"\n\nWhy This Works:\n\nFrames it as good governance, not revenue extraction\n\nAcknowledges success (75% assessed) while identifying problem (25% resistant)\n\nFocuses pressure on resistant houses without direct confrontation\n\nDelays taxation rate fight until after Granada conquered\n\nUses foreign aid to avoid desperation for immediate revenue\n\nMakes resistant nobles look unreasonable compared to cooperative ones\n\nÁlvaro looks at you seriously. \"Your Majesty, the mixed success of the assessment program is actually a good story to tell. We proved the system works—75% success is extraordinary given we're attempting something unprecedented. The fact that some great houses resisted just highlights that we need to finish the job.\"\n\n\"The nobles who cooperated can feel proud—they demonstrated fairness and supported good governance. The nobles who resisted look like they're hiding something. Why would Duke of Medina Sidonia refuse assessment unless he's been massively under-reporting his wealth?\"\n\n\"We don't need to fight about permanent taxation yet. We have the foreign aid windfall. Let's use the Cortes to celebrate the success, shame the resistors through comparison, and commit to completing the assessment in 1432. Then, when you return victorious with Granada conquered and complete data in hand, you can propose whatever permanent structure you want from a position of unassailable strength.\"\n\nHe sets down his documents. \"That's my recommendation: Present the assessment program as a successful first step in modernizing Castilian governance, commit to completing it in 1432, and save the taxation rate fight for after you've conquered Granada.\"\n\n\"Does this align with your thinking, Your Majesty?\""
        }
      ],
      "roll": null
    },
    {
      "event_id": "evt_1431_00148",
      "book": 1,
      "chapter": "1.24",
      "date": "1431-10-18",
      "end_date": null,
      "type": "council",
      "summary": "Juan instructs the GM to create a summary document of all Chapter 24 events, excluding Alvaro's earlier errors and including only corrected outcomes. The chapter wraps up with plans to proceed to the Cortes in the next session.",
      "characters": [
        "juan_ii"
      ],
      "factions_affected": [],
      "location": "Toledo",
      "tags": [
        "meta",
        "chapter_wrap",
        "documentation"
      ],
      "status": "resolved",
      "exchanges": [
        {
          "role": "player",
          "text": "Lets wrap up the chapter here. Create a new document and put a summary of all events of this chat into it. Exclude all the mistakes from Alvaro, just the adjusted outcomes. Name this document \"Chapter 24\""
        },
        {
          "role": "gm",
          "text": "Key events to include:\n- Foreign aid responses (rolled 99 - unprecedented response)\n- Details of all the foreign contributions\n- Fra Angelico commission (rolled 69)\n- Discussion about military academy and consolidation of military knowledge\n- Treasury review (corrected version with proper maravedís calculations)\n- Assessment program results (rolled 44 - mixed success)\n- Strategic discussion about how to present this at the Cortes\n\nI should structure this like the other chapter summaries with clear sections and proper formatting.\n\nCreate File: Creating Chapter 24 summary document covering foreign aid responses, Fra Angelico commission, military academy planning, treasury review, and assessment program results\n\n1. Foreign aid responses (the unprecedented 440,000 florins)\n2. Detailed breakdown of each country's contributions\n3. Fra Angelico commission\n4. Military academy and foundry planning\n5. Treasury review (corrected numbers in maravedís)\n6. Assessment program results (the mixed success roll of 44)\n7. Strategic implications and Cortes planning\n\nI've excluded the mistakes Álvaro made (the incorrect florin calculations early on) and only included the corrected information. The document is structured like the other chapter summaries in the project with clear sections and proper formatting.\n\nNow I should let the user know it's complete and offer to view or move it to the project files if they want.\n\nChapter 24 summary has been created! The document comprehensively covers:\n\nForeign Aid Responses (Roll 99 - Unprecedented): Detailed breakdown of 440,000 florins from Pope Martin V, France, Burgundy, Italian city-states, Milan, German principalities, Hungary, Poland, and Portugal, with full strategic analysis\n\nFra Angelico Commission (Roll 69): Pope Martin V's deathbed command for Fra Angelico to paint the royal wedding, including two works for 800 florins total\n\nMilitary Academy & Foundry Planning: Institutional framework for consolidating European military knowledge and establishing indigenous artillery production\n\nTreasury Review: Corrected accounting showing Crown Treasury at ~214,000 florins and Crusade Treasury at ~531,000 florins (all in proper maravedís conversions)\n\nAssessment Program Results (Roll 44 - Mixed Success): 75% of estates assessed, 21,000 florins collected (87% of minimum), with detailed breakdown of cooperation levels and strategic implications\n\nCortes Strategy: Álvaro's recommendation to present the assessment as successful administrative achievement requiring completion, deferring permanent taxation until after Granada's conquest\n\nThe document is ready in your outputs folder: View Chapter 24 Summary\n\nWould you like me to continue to the Cortes in Chapter 25, or would you like to review or adjust anything from Chapter 24 first?"
        }
      ],
      "roll": null
    }
  ]
}
